{'book': {'publisher': 'HarperOne', 'synopsis': 'From Paulo Coelho, author of the bestselling The Alchemist, comes a poignant, richly poetic story that reflects the depth of love and life.<br/>Rarely does adolescent love reach its full potential, but what happens when two young lovers reunite after eleven years? Time has transformed Pilar into a strong and independent woman, while her devoted childhood friend has grown into a handsome and charismatic spiritual leader. She has learned well how to bury her feelings . . . and he has turned to religion as a refuge from his raging inner conflicts.<br/>Now they are together once again, embarking on a journey fraught with difficulties, as long-buried demons of blame and resentment resurface after more than a decade. But in a small village in the French Pyrenees, by the waters of the River Piedra, a most special relationship will be reexamined in the dazzling light of some of life’s biggest questions.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/20/95/9780061122095.jpg', 'title_long': 'By the River Piedra I Sat Down and Wept: A Novel of Forgiveness', 'edition': 'Translation', 'dimensions': 'Height: 10.9 Inches, Length: 0.47 Inches, Weight: 0.36 Pounds, Width: 7.98 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 0.47}, 'width': {'unit': 'inches', 'value': 7.98}, 'weight': {'unit': 'pounds', 'value': 0.36}, 'height': {'unit': 'inches', 'value': 10.9}}, 'pages': 180, 'date_published': '2021-08-03', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Westerns', 'Coming of Age', "Women's Fiction", 'Contemporary', 'Literary', 'Religion & Spirituality', 'Romance', 'Self Service', 'Custom Stores'], 'authors': ['Paulo Coelho'], 'title': 'By the River Piedra I Sat Down and Wept: A Novel of Forgiveness', 'isbn13': '9780061122095', 'msrp': 13.99, 'binding': 'Paperback', 'isbn': '0061122092', 'isbn10': '0061122092', 'other_isbns': [{'isbn': '9780061859953', 'binding': 'printisbncanonical'}]}}