{'book': {'publisher': 'Pearson', 'synopsis': "A valuable handbook/reference for professionals who need to learn C++ and master its latest updates, this exceptionally organized, #1-rated guide teaches the power and flexibility of the C++ programming language through object-oriented programming applications. Examines the most up-to-date C++ features, including new-style headers, new-style casts, type bool, type string, stringstream classes, namespaces, namespace std., exception handling, run-time type identification, operator new , the template input/output classes, and more. Offers complete coverage on STL (standard template library), including containers, iterators, algorithms, and function objects; the standard input/output library IN DETAIL; and the Microsoft Foundation Classes. Contains an extensive number of well-constructed examples, beautifully fashioned sample applications, interesting and practical programming exercises, boxed figures and vibrant illustrations. A companion web site provides the book's source code, header files, and data files; sample syllabi; transparencies; and an errata list. For professionals in computer science and related fields.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/88/57/9780130158857.jpg', 'title_long': 'Object-Oriented Programming in C++ (2nd Edition)', 'edition': '2', 'dimensions': 'Height: 9.25 Inches, Length: 7.25 Inches, Weight: 2 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 2}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 640, 'date_published': '1999-08-13', 'subjects': ['Computers & Technology', 'Computer Science', 'Systems Analysis & Design', 'Programming', 'Software Design, Testing & Engineering', 'Software', 'Programming Languages', 'C & C++', 'Self Service', 'Custom Stores', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Richard Johnsonbaugh', 'Martin Kalin'], 'title': 'Object-Oriented Programming in C++ (2nd Edition)', 'isbn13': '9780130158857', 'msrp': 127.8, 'binding': 'Paperback', 'isbn': '0130158852', 'isbn10': '0130158852'}}