{'book': {'publisher': 'Penguin Classics', 'synopsis': "The epic tale of Odysseus’s journey home – one of the earliest and greatest works of Western literature<br/><br/>If the Iliad is the world's greatest war epic, the Odyssey is literature's grandest evocation of an everyman's journey through life. Odysseus' reliance on his wit and wiliness for survival in his encounters with divine and natural forces during his ten-year voyage home to Ithaca after the Trojan War is at once a timeless human story and an individual test of moral endurance.<br/><br/>E. V. Rieu’s translation has long been beloved and celebrated by scholars and readers alike, and for this Penguin Classics edition, classicist D. C. H. Rieu has revised the work of his father. This edition also includes an introduction by Peter V. Jones.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/91/12/9780140449112.jpg', 'title_long': 'The Odyssey (Penguin Classics)', 'edition': 'Revised', 'dimensions': 'Height: 0.99 Inches, Length: 7.96 Inches, Weight: 0.66800065386 Pounds, Width: 5.06 inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.96}, 'width': {'unit': 'inches', 'value': 5.06}, 'weight': {'unit': 'pounds', 'value': 0.66800065386}, 'height': {'unit': 'inches', 'value': 0.99}}, 'pages': 416, 'date_published': '2003-04-29', 'subjects': ['Literature & Fiction', 'Classics', 'Genre Fiction', 'Poetry', 'Ancient, Classical & Medieval', 'Themes & Styles', 'Ancient & Medieval Literature', 'Reference', 'Self Service', 'Custom Stores'], 'authors': ['Homer'], 'title': 'The Odyssey (Penguin Classics)', 'isbn13': '9780140449112', 'msrp': 16, 'binding': 'Paperback', 'isbn': '0140449116', 'isbn10': '0140449116'}}