{'book': {'publisher': 'Penguin Classics', 'synopsis': "In the Oresteia Aeschylus addressed the bloody chain of murder and revenge within the royal family of Argos. As they move from darkness to light, from rage to self-governance, from primitive ritual to civilized institution, their spirit of struggle and regeneration becomes an everlasting song of celebration. In Agamemnon, a king's decision to sacrifice his daughter and turn the tide of war inflicts lasting damage on his family, culminating in a terrible act of retribution; The Libation Bearers deals with the aftermath of Clytemnestra's regicide, as her son Orestes sets out to avenge his father's death; and in The Eumenides, Orestes is tormented by supernatural powers that can never be appeased. Forming an elegant and subtle discourse on the emergence of Athenian democracy out of a period of chaos and destruction, The Oresteia is a compelling tragedy of the tensions between our obligations to our families and the laws that bind us together as a society.<br/><br/>The only trilogy in Greek drama that survives from antiquity, Aeschylus' The Oresteia is translated by Robert Fagles with an introduction, notes and glossary written in collaboration with W.B. Stanford in Penguin Classics.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/33/32/9780140443332.jpg', 'title_long': 'The Oresteia: Agamemnon; The Libation Bearers; The Eumenides', 'edition': 'Bilingual', 'dimensions': 'Height: 7.71 Inches, Length: 5.07 Inches, Weight: 0.54233716452 pounds, Width: 0.56 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.11}, 'width': {'unit': 'inches', 'value': 0.6}, 'weight': {'unit': 'pounds', 'value': 0.4850169764}, 'height': {'unit': 'inches', 'value': 7.73}}, 'pages': 336, 'date_published': '1984-02-07', 'subjects': ['Literature & Fiction', 'Classics', 'Dramas & Plays', 'Ancient & Classical', 'History & Criticism', 'Movements & Periods', 'Poetry', 'Themes & Styles', 'Short Stories & Anthologies', 'Anthologies', 'Ancient & Medieval Literature', 'Greek', 'Self Service', 'Custom Stores'], 'authors': ['Aeschylus'], 'title': 'The Oresteia: Agamemnon; The Libation Bearers; The Eumenides', 'isbn13': '9780140443332', 'msrp': 12.98, 'binding': 'Paperback', 'related': {'ePub': '110104263X'}, 'isbn': '0140443339', 'isbn10': '0140443339', 'other_isbns': [{'isbn': '9781101042632', 'binding': 'print'}]}}