{'book': {'publisher': 'Oxford University Press', 'synopsis': "Jane Austen's letters afford a unique insight into the daily life of the novelist: intimate and gossipy, observant and informative--they read much like the novels themselves. They bring alive her family and friends, her surroundings and contemporary events with a freshness unparalleled in modern biographies. Above all we recognize the unmistakable voice of the author of such novels as Pride and Prejudice and Sense and Sensibility. We see the shift in her writing from witty and amusing descriptions of the social life of town and country, to a thoughtful and constructive tone while writing about the business of literary composition.<br/>R.W. Chapman's ground-breaking edition of the collected Letters first appeared in 1932, and a second edition followed twenty years later. Now in this third edition of Jane Austen's Letters, Deirdre Le Faye has added new material that has come to light since 1952, and re-ordered the letters into their correct chronological sequence. She has provided discreet and full annotation to each letter, including its provenance, and information on the watermarks, postmarks, and other physical details of the manuscripts, together with new biographical, topographical, and general indexes. Teachers, students, and fans of Jane Austen, at all levels, will find remarkable insight into one of the most popular novelists ever.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/29/79/9780192832979.jpg', 'title_long': "Jane Austen's Letters", 'edition': '3rd', 'dimensions': 'Height: 8.75 Inches, Length: 5.25 Inches, Weight: 1.8 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 1.8}, 'height': {'unit': 'inches', 'value': 8.75}}, 'pages': 643, 'date_published': '1997-04-03', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Literature & Fiction', 'Essays & Correspondence', 'Letters', 'World Literature', 'European', 'Mystery, Thriller & Suspense', 'Mystery'], 'authors': ['Jane Austen'], 'title': "Jane Austen's Letters", 'isbn13': '9780192832979', 'msrp': 29.99, 'binding': 'Paperback', 'isbn': '0192832972', 'isbn10': '0192832972'}}