{'book': {'publisher': 'Oxford University Press', 'synopsis': 'Widely acknowledged as the greatest of his later works, this story of switched babies and slavery is Twain\'s darkest vision of race in America. It began life as a slapstick comedy about Siamese twins, but as he wrote, something deepened. "The tale kept spreading along, and spreading along, and other people got to intruding themselves and taking up more and more time with their talk and their affairs. It changed from a farce to a tragedy while I was going along with it," Twain wrote in his frank afternote to the novel. In the end, the voice that comes to dominate the tale is Roxana\'s, a light-skinned slave who switches her infant son with her master\'s son to keep him from being sold down the river. Roxana, Twain\'s most complex and fully-realized adult female character, is a compelling and memorable tragic heroine, trapped with her son by the brutal system of slavery and by their own inescapable racial identities. At his best, Twain is the most uniquely American of writers, and it is inevitable that his best work revolves around the issues of race and of slavery embedded in the American psyche. The Tragedy of Pudd\'nhead Wilson is a dark and powerful novel of race in America, written by the American master.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/41/57/9780195114157.jpg', 'title_long': "The Tragedy of Pudd'nhead Wilson and the Comedy Those Extraordinary Twins (1894) (The Oxford Mark Twain)", 'edition': 'First Thus', 'dimensions': 'Height: 9.25 Inches, Length: 7 Inches, Weight: 2 Pounds, Width: 1.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 1.75}, 'weight': {'unit': 'pounds', 'value': 2}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 512, 'date_published': '1997-03-06', 'subjects': ['Literature & Fiction', 'Classics', 'United States'], 'authors': ['Mark Twain'], 'title': "The Tragedy of Pudd'nhead Wilson and the Comedy Those Extraordinary Twins (1894) (The Oxford Mark Twain)", 'isbn13': '9780195114157', 'msrp': 22, 'binding': 'Hardcover', 'isbn': '0195114159', 'isbn10': '0195114159'}}