{'book': {'publisher': 'Oxford University Press', 'synopsis': 'Oedipus, the former ruler of Thebes, has died. Now, when his young daughter Antigone defies her uncle, Kreon, the new ruler, because he has prohibited the burial of her dead brother, she and he enact a primal conflict between young and old, woman and man, individual and ruler, family and state, courageous and self-sacrificing reverence for the gods of the earth and perhaps self-serving allegiance to the gods of the sky.<br/>Echoing through western culture for more than two millennia, Sophocles\' Antigone has been a touchstone of thinking about human conflict and human tragedy, the role of the divine in human life, and the degree to which men and women are the creators of their own destiny. This exciting translation of the play is extremely faithful to the Greek, eminently playable, and poetically powerful.<br/>For readers, actors, students, teachers, and theatrical directors, this affordable paperback edition of one of the greatest plays in the history of the western world provides the best combination of contemporary, powerful language, along with superb background and notes on meaning, interpretation, and ancient beliefs, attitudes, and contexts.<br/><br/>"Sophocles\' text is inexhaustibly actual. It is also, at many points, challenging and remote from us. The Gibbons-Segal translation, with its rich annotations, conveys both the difficulties and the formidable immediacy. The choral odes, so vital to Sophocles\' purpose, have never been rendered with finer energy and insight. Across more than two thousand years, a great dark music sounds for us."<br/>--George Steiner, Churchill College, Cambridge<br/><br/>"Produces a language that is easy to read and easy to speak.... Enthusiastically recommended."--Library Journal [Starred Review]', 'language': 'en', 'image': 'https://images.isbndb.com/covers/37/37/9780195143737.jpg', 'title_long': 'Antigone (Greek Tragedy in New Translations)', 'edition': '1', 'dimensions': 'Height: 5.7 Inches, Length: 8.3 Inches, Weight: 0.91271376468 Pounds, Width: 0.8 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.3}, 'width': {'unit': 'inches', 'value': 0.8}, 'weight': {'unit': 'pounds', 'value': 0.91271376468}, 'height': {'unit': 'inches', 'value': 5.7}}, 'pages': 208, 'date_published': '2003-06-05', 'subjects': ['Arts & Photography', 'Performing Arts', 'Theater', 'Literature & Fiction', 'Classics', 'Dramas & Plays', 'Ancient & Classical', 'History & Criticism', 'Movements & Periods', 'Ancient & Medieval Literature', 'Greek', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Sophocles'], 'title': 'Antigone (Greek Tragedy in New Translations)', 'isbn13': '9780195143737', 'msrp': '0.00', 'binding': 'Hardcover', 'related': {'ePub': '0199840202'}, 'isbn': '0195143736', 'isbn10': '0195143736', 'other_isbns': [{'isbn': '9780199840205', 'binding': 'print'}]}}