{'book': {'publisher': 'University Of Chicago Press', 'synopsis': 'The Grene and Lattimore edition of the Greek tragedies has been among the most widely acclaimed and successful publications of the University of Chicago Press. On the occasion of the Centennial of the University of Chicago and its Press, we take pleasure in reissuing this complete work in a handsome four-volume slipcased edition as well as in redesigned versions of the familiar paperbacks.<br/><br/>For the Centennial Edition two of the original translations have been replaced. In the original publication David Grene translated only one of the three Theban plays, Oedipus the King. Now he has added his own translations of the remaining two, Oedipus at Colonus and Antigone, thus bringing a new unity of tone and style to this group. Grene has also revised his earlier translation of Prometheus Bound and rendered some of the former prose sections in verse. These new translations replace the originals included in the paperback volumes Sophocles I (which contains all three Theban plays), Aeschylus II, Greek Tragedies, Volume I, and Greek Tragedies, Volume III, all of which are now being published in second editions.<br/><br/>All other volumes contain the translations of the tragedies of Aeschylus, Sophocles, and Euripides for the most part from the original versions first published in the 1940s and 1950s. These translations have been the choice of generations of teachers and students, selling in the past forty years over three million copies.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/79/47/9780226307947.jpg', 'title_long': 'Aeschylus II: The Suppliant Maidens and The Persians, Seven against Thebes and Prometheus Bound (The Complete Greek Tragedies)', 'edition': 'Second', 'dimensions': 'Height: 8 Inches, Length: 5.25 Inches, Weight: 0.4 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.4}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 188, 'date_published': '1992-02-01', 'subjects': ['Literature & Fiction', 'Classics', 'Dramas & Plays', 'Ancient & Classical', 'Ancient & Medieval Literature', 'Greek'], 'authors': ['Euripides'], 'title': 'Aeschylus II: The Suppliant Maidens and The Persians, Seven against Thebes and Prometheus Bound (The Complete Greek Tragedies)', 'isbn13': '9780226307947', 'msrp': 12, 'binding': 'Paperback', 'isbn': '0226307948', 'isbn10': '0226307948'}}