{'book': {'publisher': 'Picador', 'synopsis': 'Tom Wolfe, the master social novelist of our time, the spot-on chronicler of all things contemporary and cultural, presents a sensational new novel about life, love, and learning--or the lack of it--amid today\'s American colleges.<br/><br/>Our story unfolds at fictional Dupont University: those Olympian halls of scholarship housing the cream of America\'s youth, the roseate Gothic spires and manicured lawns suffused with tradition . . . Or so it appears to beautiful, brilliant Charlotte Simmons, a sheltered freshman from North Carolina. But Charlotte soon learns, to her mounting dismay, that for the upper-crust coeds of Dupont, sex, cool, and kegs trump academic achievement every time.<br/><br/>As Charlotte encounters the paragons of Dupont\'s privileged elite--her roommate, Beverly, a Groton-educated Brahmin in lusty pursuit of lacrosse players; Jojo Johanssen, the only white starting player on Dupont\'s godlike basketball team, whose position is threatened by a hotshot black freshman from the projects; the Young Turk of Saint Ray fraternity, Hoyt Thorpe, whose heady sense of entitlement and social domination is clinched by his accidental brawl with a bodyguard for the governor of California; and Adam Geller, one of the Millennial Mutants who run the university\'s "independent" newspaper and who consider themselves the last bastion of intellectual endeavor on the sex-crazed, jock-obsessed campus--she is seduced by the heady glamour of acceptance, betraying both her values and upbringing before she grasps the power of being different--and the exotic allure of her own innocence.<br/><br/>With his trademark satirical wit and famously sharp eye for telling detail, Wolfe\'s I Am Charlotte Simmons draws on extensive observations at campuses across the country to immortalize the early-21st-century college-going experience.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/44/42/9780312424442.jpg', 'title_long': 'I Am Charlotte Simmons: A Novel', 'edition': 'Reprint', 'dimensions': 'Height: 8.1999836 Inches, Length: 5.44 Inches, Weight: 1.25 Pounds, Width: 1.3299186 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.44}, 'width': {'unit': 'inches', 'value': 1.3299186}, 'weight': {'unit': 'pounds', 'value': 1.25}, 'height': {'unit': 'inches', 'value': 8.1999836}}, 'pages': 752, 'date_published': '2005-08-30', 'subjects': ['Humor & Entertainment', 'Humor', 'Self-Help & Psychology', 'Literature & Fiction', 'United States', 'Humor & Satire', 'Satire', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors': ['Tom Wolfe'], 'title': 'I Am Charlotte Simmons: A Novel', 'isbn13': '9780312424442', 'msrp': 24, 'binding': 'Paperback', 'isbn': '0312424442', 'isbn10': '0312424442', 'other_isbns': [{'isbn': '9780374706111', 'binding': 'printisbncanonical'}]}}