{'book': {'publisher': 'Picador', 'synopsis': 'National Bestseller<br/><br/>A New York Times Book Review Editors\' Choice<br/><br/>Nathan Glass has come to Brooklyn to die. Divorced, retired, estranged from his only daughter, the former life insurance salesman seeks only solitude and anonymity. Then Glass encounters his long-lost nephew, Tom Wood, who is working in a local bookstore--a far cry from the brilliant academic career Tom had begun when Nathan saw him last. Tom\'s boss is the colorful and charismatic Harry Brightman--a.k.a. Harry Dunkel--once the owner of a Chicago art gallery, whom fate has also brought to the "ancient kingdom of Brooklyn, New York." Through Tom and Harry, Nathan\'s world gradually broadens to include a new circle of acquaintances. He soon finds himself drawn into a scam involving a forged page of The Scarlet Letter, and begins to undertake his own literary venture, The Book of Human Folly, an account of "every blunder, every pratfall, every embarrassment, every idiocy, every foible, and every inane act I have committed during my long and checkered career as a man."<br/><br/>The Brooklyn Follies is Paul Auster\'s warmest, most exuberant novel, a moving, unforgettable hymn to the glories and mysteries of ordinary human life.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/62/31/9780312426231.jpg', 'title_long': 'The Brooklyn Follies: A Novel', 'dimensions': 'Height: 8.25 Inches, Length: 5.25 Inches, Weight: 0.6 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.6}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 320, 'date_published': '2006-10-17', 'subjects': ['Literature & Fiction', 'United States', 'Contemporary', 'Literary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Legal', 'Self Service', 'Custom Stores'], 'authors': ['Paul Auster'], 'title': 'The Brooklyn Follies: A Novel', 'isbn13': '9780312426231', 'msrp': 14, 'binding': 'Paperback', 'isbn': '0312426232', 'isbn10': '0312426232'}}