{'book': {'publisher': "Everyman's Library", 'synopsis': 'Creator of the famous Philip Marlowe, Raymond Chandler elevated the American hard-boiled detective genre to an art form. Chandler’s last four novels, published here in one volume, offer ample opportunity to savor the unique and utterly compelling fictional world that made his works modern classics.<br/><br/>The Lady in the Lake moves Marlowe out of his usual habitat of city streets and into the mountains outside of Los Angeles in his strange search for a missing woman. The Little Sister takes Marlowe to Hollywood, where he tries to find a sweet young thing’s missing brother, uncovering on the way a little blackmail, a lot of drugs, and more than enough murder. In The Long Goodbye, a case involving a war-scarred drunk and his nymphomaniac wife has Marlowe constantly on the move: a psychotic gangster’s on his trail, he’s in trouble with the cops, and more and more corpses keep turning up. Playback features a well-endowed redhead who leads Marlowe to the California coast to solve a tale of big money and, of course, murder.<br/><br/>Throughout these masterpieces, Marlowe’s wry humor and existential sense of his job prove yet again why he has become one of the most recognized and imitated characters in fiction.<br/><br/>Featuring the iconic character that inspired the forthcoming film Marlowe, starring Liam Neeson.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/50/29/9780375415029.jpg', 'title_long': "The Lady in the Lake, The Little Sister, The Long Goodbye, Playback (Everyman's Library)", 'edition': 'First Edition (1st printing)', 'dimensions': 'Height: 8.7 Inches, Length: 5.7 Inches, Weight: 1.9 Pounds, Width: 2.3 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.7}, 'width': {'unit': 'inches', 'value': 2.3}, 'weight': {'unit': 'pounds', 'value': 1.9}, 'height': {'unit': 'inches', 'value': 8.7}}, 'pages': 1016, 'date_published': '2002-10-15', 'subjects': ['Literature & Fiction', 'United States', 'Literary', 'Mystery, Thriller & Suspense', 'Mystery', 'Hard-Boiled', 'Cozy', 'Self Service', 'Custom Stores'], 'authors': ['Raymond Chandler'], 'title': "The Lady in the Lake, The Little Sister, The Long Goodbye, Playback (Everyman's Library)", 'isbn13': '9780375415029', 'msrp': 32, 'binding': 'Hardcover', 'isbn': '0375415025', 'isbn10': '0375415025'}}