{'book': {'publisher': 'Doubleday', 'synopsis': 'In words that might have been ripped from today’s combat dispatches, Steven Pressfield, the bestselling novelist of ancient warfare, returns with a riveting historical novel that re-creates Alexander the Great’s invasion of the Afghan kingdoms in 330 B.C., a campaign that eerily foreshadows the tactics, terrors, and frustrations of contemporary conflicts in Iraq and Afghanistan.<br/><br/>Narrated by Matthias, a young infantryman in Alexander’s army, The Afghan Campaign explores the challenges, both military and moral, that Alexander and his soldiers face as they embark on a new type of war and are forced to adapt to the methods of a ruthless foe that employs terror and insurgent tactics, conceals itself among the civilian populace, and recruits women and boys as combatants. Matthias joins Alexander’s army after it has conquered the Persian empire and is advancing east into Afghanistan on its way to the riches of India. Part of a unit that includes recruits his own age as well as veterans, Matthias chronicles his rapid coming-of-age as a soldier as he enacts Alexander’s scorch-and-burn strategies, experiences the joys and sorrows of a romance with an Afghan girl, and faces the barbarism of the Afghans, his fellow soldiers, and ultimately himself. As Matthias relates the brutal day-to-day encounters between the two sides, he exposes the human cost borne by a company of men whose code is humanist and secular when they seek to impose their will on a people of deep religiosity, insularity, unbending pride, and a passionate readiness to die for their cause.<br/><br/>An edge-of-your-seat adventure that brings to life the confrontation between an invading Western army and fierce Eastern warriors determined at all costs to defend their homeland, The Afghan Campaign once again demonstrates Steven Pressfield’s profound understanding of the hopes and desperation of men in battle and of the historical realities that continue to influence our world.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/64/19/9780385516419.jpg', 'title_long': 'The Afghan Campaign: A Novel', 'dimensions': 'Height: 9.5 Inches, Length: 6.75 Inches, Weight: 1.4 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.75}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.4}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 354, 'date_published': '2006-07-18', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'United States'], 'authors': ['Steven Pressfield'], 'title': 'The Afghan Campaign: A Novel', 'isbn13': '9780385516419', 'msrp': '0.00', 'binding': 'Hardcover', 'related': {'ePub': '0385520085'}, 'isbn': '038551641X', 'isbn10': '038551641X', 'other_isbns': [{'isbn': '9780385520089', 'binding': 'printisbn'}]}}