{'book': {'publisher': 'W. W. Norton & Company', 'synopsis': 'This Norton Critical Edition offers an introduction to Herodotus for students approaching the history of Western Civilization or classical Greece for the first time. It features a new translation and selection of Herodotus’s The Histories by Walter Blanco, supplemented by critical works chosen by Jennifer Roberts. Walter Blanco\'s translation manages both to remain true to the spirit and letter of the original Greek and to be readily understandable to American students.<br/><br/>The selections from The Histories show Herodotus as ethnographer and as narrative historian, including his rich descriptions of Egyptian civilization and its contributions to Greek culture and his dramatic account of the Persian wars<br/><br/>"Backgrounds and Commentaries" provide students with a context for understanding Herodotus’s place at the genesis of the historical narrative tradition. Great classical accounts by Aeschylus, Thucydides, Aristotle, and Plutarch serve as comparative pieces in early historical narrative while critical commentaries by modern scholars―including Hume, Mill, Macaulay, Collingwood, Momigliano, Ferrill, and others―engage students in the debate over Herodotus’s historical authority.<br/><br/>A master Map, Chronology of Events, Glossary of names, places, and terms, and explanatory footnotes facilitate the student’s understanding of this work. A Bibliography directs readers to resources for further study.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/94/68/9780393959468.jpg', 'title_long': 'herodotus', 'edition': '1st', 'dimensions': 'Weight: 0.9590108397 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 0.9590108397}}, 'pages': 464, 'date_published': '1991', 'subjects': ['History', 'Ancient Civilizations', 'Greece', 'Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Movements & Periods', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['herodotus'], 'title': 'herodotus', 'isbn13': '9780393959468', 'msrp': 12.63, 'binding': 'Paperback', 'isbn': '0393959465', 'isbn10': '0393959465'}}