{'book': {'publisher': 'For Dummies', 'synopsis': 'Interested in learning to sail but feel like you’re navigating in murky waters? Sailing for Dummies, Second Edition introduces the basics of sailing, looks at the different types of sailboats and their basic parts, and teaches you everything you need to know before you leave the dock.<br/>In Sailing for Dummies, Second Edition, two U.S. sailing champions show you how to: Find and choose a sailing school Use life jackets correctly Tie ten nautical knots Handle sailing emergencies (such as capsizing and rescuing a man overboard) Launch your boat from a trailer, ramp, or beach Get your boat from point A to point B (and back again) Predict and respond to water and wind conditions Read charts, plot your course, use a compass, and find your position at sea<br/>Sailing for Dummies shows you that getting out on the water is easier than you think. The authors keep the sailor-speak to a minimum where possible, but give you a grasp of the terminology you need to safely and effectively communicate with your crew. A textbook, user’s manual, and reference all in one, this book takes the intimidation out of sailing and gives you the skills and confidence you need to get your feet wet and become the sailing pro you’ve always wanted to be. Anchors away!', 'language': 'en', 'image': 'https://images.isbndb.com/covers/14/30/9780471791430.jpg', 'title_long': 'Sailing For Dummies', 'edition': '2', 'dimensions': 'Height: 8.999982 Inches, Length: 7.299198 Inches, Weight: 1.26545338388 Pounds, Width: 0.999998 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.299198}, 'width': {'unit': 'inches', 'value': 0.999998}, 'weight': {'unit': 'pounds', 'value': 1.26545338388}, 'height': {'unit': 'inches', 'value': 8.999982}}, 'pages': 432, 'date_published': '2006-06-06', 'subjects': ['Sports & Outdoors', 'Water Sports', 'Boating', 'Sailing'], 'authors': ['J. J. Isler', 'Peter Isler'], 'title': 'Sailing For Dummies', 'isbn13': '9780471791430', 'msrp': 12.31, 'binding': 'Paperback', 'related': {'eBook': '1118052919'}, 'isbn': '0471791431', 'isbn10': '0471791431', 'other_isbns': [{'isbn': '9781118052914', 'binding': 'ebook'}]}}