{'book': {'publisher': 'Bantam', 'synopsis': 'The author of the international bestsellers Gates of Fire and Tides of War delivers his most gripping and imaginative novel of the ancient world–a stunning epic of love and war that breathes life into the grand myth of the ferocious female warrior culture of the Amazons.<br/><br/>Steven Pressfield has gained a passionate worldwide following for his magnificent novels of ancient Greece, Gates of Fire and Tides of War. In Last of the Amazons, Pressfield has surpassed himself, re-creating a vanished world in a brilliant novel that will delight his loyal readers and bring legions more to his singular and powerful restoration of the past.<br/><br/>In the time before Homer, the legendary Theseus, King of Athens (an actual historical figure), set sail on a journey that brought him into the land of tal Kyrte, the “free people,” a nation of proud female warriors whom the Greeks called “Amazons.” The Amazons, bound to each other as lovers as well as fighters, distrusted the Greeks, with their boastful talk of “civilization.” So when the great war queen Antiope fell in love with Theseus and fled with the Greeks, the mighty Amazon nation rose up in rage.<br/><br/>Last of the Amazons is not merely a masterful tale of war and revenge. Pressfield has created a cast of extraordinarily vivid characters, from the unforgettable Selene, whose surrender to the Greeks does nothing to tame her; to her lover, Damon, an Athenian warrior who grows to cherish the wild Amazon ways; to the narrator, Bones, a young girl from a noble family who was nursed by Selene from birth and secretly taught the Amazon way; to the great Theseus, the tragic king; and to Antiope, the noble queen who betrayed tal Kyrte for the love of Theseus.<br/><br/>With astounding immediacy and extraordinary attention to military detail, Pressfield transports readers into the heat and terror of war. Equally impressive is his creation of the Amazon nation, its people, its rituals and myths, its greatness and savagery. Last of the Amazons is thrilling on every page, an epic tale of the clash between wildness and civilization, patriotism and love, man and woman.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/20/44/9780553382044.jpg', 'title_long': 'Last of the Amazons: A Novel', 'edition': 'Reprint', 'dimensions': 'Height: 9.3 Inches, Length: 6.1 Inches, Weight: 0.93 Pounds, Width: 0.9 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.1}, 'width': {'unit': 'inches', 'value': 0.9}, 'weight': {'unit': 'pounds', 'value': 0.93}, 'height': {'unit': 'inches', 'value': 9.3}}, 'pages': 416, 'date_published': '2003-07-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'War', 'Contemporary', 'Literary', 'Romance', 'Ancient World', 'Military', 'Self Service', 'Custom Stores'], 'authors': ['Steven Pressfield'], 'title': 'Last of the Amazons: A Novel', 'isbn13': '9780553382044', 'msrp': 17, 'binding': 'Paperback', 'related': {'Kindle Edition': '0553897713', 'ePub': '0553897713'}, 'isbn': '0553382047', 'isbn10': '0553382047', 'other_isbns': [{'isbn': '9780553897715', 'binding': 'printisbn'}]}}