{'book': {'publisher': 'Spectra', 'synopsis': 'With the same unique vision that brought his now classic Mars trilogy to vivid life, bestselling author Kim Stanley Robinson boldly imagines an alternate history of the last seven hundred years. In his grandest work yet, the acclaimed storyteller constructs a world vastly different from the one we know. . . .<br/><br/>“A thoughtful, magisterial alternate history from one of science fiction’s most important writers.”—The New York Times Book Review<br/><br/>It is the fourteenth century and one of the most apocalyptic events in human history is set to occur—the coming of the Black Death. History teaches us that a third of Europe’s population was destroyed. But what if the plague had killed 99 percent of the population instead? How would the world have changed? This is a look at the history that could have been—one that stretches across centuries, sees dynasties and nations rise and crumble, and spans horrible famine and magnificent innovation.<br/><br/>Through the eyes of soldiers and kings, explorers and philosophers, slaves and scholars, Robinson navigates a world where Buddhism and Islam are the most influential and practiced religions, while Christianity is merely a historical footnote. Probing the most profound questions as only he can, Robinson shines his extraordinary light on the place of religion, culture, power—and even love—in this bold New World.<br/><br/>“Exceptional and engrossing.”—New York Post<br/><br/>“Ambitious . . . ingenious.”—Newsday', 'language': 'en', 'image': 'https://images.isbndb.com/covers/00/75/9780553580075.jpg', 'title_long': 'The Years of Rice and Salt: A Novel', 'edition': 'Reprint', 'dimensions': 'Height: 6.87 Inches, Length: 4.21 Inches, Weight: 0.8 Pounds, Width: 1.22 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.21}, 'width': {'unit': 'inches', 'value': 1.22}, 'weight': {'unit': 'pounds', 'value': 0.8}, 'height': {'unit': 'inches', 'value': 6.87}}, 'pages': 784, 'date_published': '2003-06-03', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'United States', 'Science Fiction & Fantasy', 'Science Fiction', 'Adventure', 'Alternate History'], 'authors': ['Kim Stanley Robinson'], 'title': 'The Years of Rice and Salt: A Novel', 'isbn13': '9780553580075', 'msrp': 8.99, 'binding': 'Mass Market Paperback', 'related': {'Kindle Edition': '0553897608', 'ePub': '0553897608'}, 'isbn': '0553580078', 'isbn10': '0553580078', 'other_isbns': [{'isbn': '9780553897609', 'binding': 'printisbn'}]}}