{'book': {'publisher': 'Harper Perennial', 'synopsis': 'New York Times Bestseller<br/>A Best Book of the Year: Chicago Tribune, Christian Science Monitor, Rocky Mountain News<br/>"The Cubs against the Cardinals in the heat of August and of a pennant race—this is baseball at it\'s best." —George F. Will, author of Men at Work: The Craft of Baseball<br/>A thrilling deep dive into the strategic and emotional complexities of baseball from the acclaimed author of Friday Night Lights<br/>Three Nights in August captures baseball in its quintessential form: the three-game series. As the St. Louis Cardinals battle their archrival Chicago Cubs, we see the dugout through the eyes of legendary manager Tony La Russa, considered by many to be the shrewdest mind in the game today. In his twenty-seven years of managing, La Russa has been named Manager of the Year a record-making five times and now stands as the third-winningest baseball manager of all time. A great leader, he\'s built his success on the conviction that ball games are won not only by the numbers but also by the hearts and minds of those who play.<br/>Drawing on unprecedented access to a major league manager and his team, Buzz Bissinger brings a revelatory intimacy to baseball and offers some surprising observations. Bissinger also furthers the debate on major league managerial style and strategy in his provocative afterword.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/05/39/9780618710539.jpg', 'title_long': 'Three Nights In August: Strategy, Heartbreak, and Joy Inside the Mind of a Manager', 'edition': 'Reprint', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.7 Pounds, Width: 0.839 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.839}, 'weight': {'unit': 'pounds', 'value': 0.7}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 320, 'date_published': '2006-04-04', 'subjects': ['Self-Help', 'Success', 'Sports & Outdoors', 'Baseball', 'Coaching'], 'authors': ['Buzz Bissinger'], 'title': 'Three Nights In August: Strategy, Heartbreak, and Joy Inside the Mind of a Manager', 'isbn13': '9780618710539', 'msrp': 15.95, 'binding': 'Paperback', 'related': {'ePub': '0547526717'}, 'isbn': '0618710531', 'isbn10': '0618710531', 'other_isbns': [{'isbn': '9780547526713', 'binding': 'print'}]}}