{'book': {'publisher': 'Houghton Mufflin', 'synopsis': "Note: The font size of the book is 11pt.<br/><br/>Three-volume boxed set edition lavishly illustrated in full color by Alan Lee<br/><br/>One Ring to rule them all, One Ring to find them, One Ring to bring them all and in the darkness bind them<br/><br/>In ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, The Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth still it remained lost to him. After many ages it fell, by chance, into the hands of the hobbit, Bilbo Baggins.<br/><br/>From his fastness in the Dark Tower of Mordor, Sauron's power spread far and wide. He gathered all the Great Rings to him, but ever he searched far and wide for the One Ring that would complete his dominion.<br/><br/>On his eleventy-first birthday, Bilbo dissapeared bequeathing to his young cousin, Frodo, the Ruling Ring, and a perilous quest: to journey across Middle-earth, deep into the shadow of the Dark Lord and destroy the Ring by casting it into the Cracks of Doom.<br/><br/>The Lord of the Rings tells of the great quest undertaken by Frodo and the Fellowship of the Ring: Gandalf the wizard, the hobbits Merry, Pippin and Sam, Gimli the Dwarf, Legolas the Elf, Boromir of Gondor, and a tall, mysterious stranger called Strider.", 'language': 'es', 'image': 'https://images.isbndb.com/covers/05/84/9780618260584.jpg', 'title_long': 'The Lord of the Rings Part One; The Fellowship of the Ring - Part Two - The Two Towers; Part Three - The Return of the King (Complete 3-Volume Set slipcased)', 'edition': 'Three (3) Volume Set', 'dimensions': 'Height: 10.3 Inches, Length: 7.9 Inches, Weight: 10.05 Pounds, Width: 4 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.9}, 'width': {'unit': 'inches', 'value': 4}, 'weight': {'unit': 'pounds', 'value': 10.05}, 'height': {'unit': 'inches', 'value': 10.3}}, 'pages': 1216, 'date_published': '2002', 'subjects': ['Humor & Entertainment', 'Radio', 'General Broadcasting', 'Literature & Fiction', 'Classics', 'Science Fiction & Fantasy', 'Fantasy', 'Epic'], 'authors': ['J. R. R. Tolkien'], 'title': 'The Lord of the Rings Part One; The Fellowship of the Ring - Part Two - The Two Towers; Part Three - The Return of the King (Complete 3-Volume Set slipcased)', 'isbn13': '9780618260584', 'msrp': 100, 'binding': 'Unknown Binding', 'isbn': '0618260587', 'isbn10': '0618260587'}}