{'book': {'publisher': 'Houghton Mifflin Harcourt', 'synopsis': 'Alan Lee, the beloved illustrator of many of Houghton Mifflin’s Tolkien editions, and a talented team of other artists, including the renowned Tolkien illustrator John Howe, have spent more than three years creating the sets, props, creatures, and locations that truly bring Tolkien’s Middle-earth to life. Hobbiton, Rivendell, and Minas Tirith are no longer designations on the map. Literally hundreds of designers and craftspeople have been painstakingly adding authentic cultural details to each of more than 48,000 separate objects shown in The Fellowship of the Ring, from armor to props to architecture. All this and more is shown in Gary Russell’s lavishly illustrated book. Russell spent time on the set in New Zealand, conducting interviews with director Peter Jackson, special effects guru Richard Taylor, art directors Paul Lasainne, Dan Hennah, and Chris Hennah, costumer Ngila Dickson, and Alan Lee and John Howe. Featuring everything from pencil sketches to the finished objects, his book gives detailed descriptions of why and how this groundbreaking film looks as exciting as it does. The millions of fans dazzled by the results will find here everything they want to know about the genesis and evolution of the movie’s incredible look.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/29/03/9780618212903.jpg', 'title_long': 'The Art of The Fellowship of the Ring (The Lord of the Rings)', 'edition': 'First Edition', 'dimensions': 'Height: 11.5 Inches, Length: 9 Inches, Weight: 2.45 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 9}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 2.45}, 'height': {'unit': 'inches', 'value': 11.5}}, 'pages': 192, 'date_published': '2002-06-12', 'subjects': ['Arts & Photography', 'Performing Arts', 'Humor & Entertainment', 'Movies'], 'authors': ['Gary Russell'], 'title': 'The Art of The Fellowship of the Ring (The Lord of the Rings)', 'isbn13': '9780618212903', 'msrp': 35, 'binding': 'Hardcover', 'isbn': '0618212906', 'isbn10': '0618212906'}}