{'book': {'publisher': 'Harvard University Press', 'synopsis': 'The master of Old Comedy.<br/><br/>Aristophanes of Athens, one of the world’s greatest comic dramatists, has been admired since antiquity for his iridescent wit and beguiling fantasy, exuberant language, and brilliant satire of the social, intellectual, and political life of Athens at its height. The Loeb Classical Library edition of his plays is in four volumes.<br/><br/>The Introduction to the edition is in Volume I. Also in the first volume is Acharnians, in which a small landowner, tired of the Peloponnesian War, magically arranges a personal peace treaty; and Knights, perhaps the most biting satire of a political figure (Cleon) ever written.<br/><br/>Three plays are in Volume II. Socrates’ “Thinkery” is at the center of Clouds, which spoofs untraditional techniques for educating young men. Wasps satirizes Athenian enthusiasm for jury service. In Peace, a rollicking attack on war-makers, the hero travels to heaven on a dung beetle to discuss the issues with Zeus.<br/><br/>The enterprising protagonists of Birds create a utopian counter-Athens ruled by birds. Also in Volume III is Lysistrata, in which our first comic heroine organizes a conjugal strike of young wives until their husbands end the war between Athens and Sparta. Women again take center stage in Women at the Thesmophoria, this time to punish Euripides for portraying them as wicked.<br/><br/>Frogs, in Volume IV, features a contest between the traditional Aeschylus and the modern Euripides, yielding both sparkling comedy and insight on ancient literary taste. In Assemblywomen Athenian women plot to save Athens from male misgovernance―with raucously comical results. Here too is Wealth, whose gentle humor and straightforward morality made it the most popular of Aristophanes’ plays from classical times to the Renaissance.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/53/76/9780674995376.jpg', 'title_long': 'aristophanes_a07', 'edition': 'New edition', 'dimensions': 'Height: 6.375 Inches, Length: 4.25 Inches, Weight: 0.96121546232 Pounds, Width: 1.2875 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.25}, 'width': {'unit': 'inches', 'value': 1.2875}, 'weight': {'unit': 'pounds', 'value': 0.96121546232}, 'height': {'unit': 'inches', 'value': 6.375}}, 'pages': 624, 'date_published': '1998', 'subjects': ['Literature & Fiction', 'Dramas & Plays', 'Comedy', 'Ancient & Classical', 'History & Criticism', 'Movements & Periods', 'Reference', 'Writing, Research & Publishing Guides', 'Writing', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['jeffrey-henderson'], 'title': 'aristophanes_a07', 'isbn13': '9780674995376', 'msrp': 28, 'binding': 'Hardcover', 'isbn': '0674995376', 'isbn10': '0674995376'}}