{'book': {'publisher': 'Harvard University Press', 'synopsis': "The poetry of change.<br/><br/>Ovid (Publius Ovidius Naso, 43 BC–AD 17), born at Sulmo, studied rhetoric and law at Rome. Later he did considerable public service there, and otherwise devoted himself to poetry and to society. Famous at first, he offended the emperor Augustus by his Ars amatoria, and was banished because of this work and some other reason unknown to us, and dwelt in the cold and primitive town of Tomis on the Black Sea. He continued writing poetry, a kindly man, leading a temperate life. He died in exile.<br/><br/>Ovid's main surviving works are the Metamorphoses, a source of inspiration to artists and poets including Chaucer and Shakespeare; the Fasti, a poetic treatment of the Roman year of which Ovid finished only half; the Amores, love poems; the Ars amatoria, not moral but clever and in parts beautiful; Heroides, fictitious love letters by legendary women to absent husbands; and the dismal works written in exile: the Tristia, appeals to persons including his wife and also the emperor; and similar Epistulae ex Ponto. Poetry came naturally to Ovid, who at his best is lively, graphic and lucid.<br/><br/>The Loeb Classical Library edition of Ovid is in six volumes.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/04/70/9780674990470.jpg', 'title_long': 'Ovid IV: Metamorphoses, Books IX-XV (Loeb Classical Library, No. 43) (Volume II)', 'edition': '2nd ed.', 'dimensions': 'Height: 6.37498725 Inches, Length: 4.2499915 Inches, Weight: 0.74075320032 Pounds, Width: 1.112497775 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.2499915}, 'width': {'unit': 'inches', 'value': 1.112497775}, 'weight': {'unit': 'pounds', 'value': 0.74075320032}, 'height': {'unit': 'inches', 'value': 6.37498725}}, 'pages': 512, 'date_published': '1916-01-01', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Movements & Periods', 'Poetry', 'Regional & Cultural', 'Themes & Styles', 'Self Service', 'Custom Stores'], 'authors': ['Ovid'], 'title': 'Ovid IV: Metamorphoses, Books IX-XV (Loeb Classical Library, No. 43) (Volume II)', 'isbn13': '9780674990470', 'msrp': 28, 'binding': 'Hardcover', 'isbn': '0674990471', 'isbn10': '0674990471'}}