{'book': {'publisher': 'Simon & Schuster', 'synopsis': "One of the most influential books of the past fifty years, Team of Rivals is Pulitzer Prize–winning author and esteemed presidential historian Doris Kearns Goodwin’s modern classic about the political genius of Abraham Lincoln, his unlikely presidency, and his cabinet of former political foes.<br/><br/>Winner of the prestigious Lincoln Prize and the inspiration for the Oscar Award winning–film Lincoln, starring Daniel Day-Lewis, directed by Steven Spielberg, and written by Tony Kushner.<br/><br/>On May 18, 1860, William H. Seward, Salmon P. Chase, Edward Bates, and Abraham Lincoln waited in their hometowns for the results from the Republican National Convention in Chicago. When Lincoln emerged as the victor, his rivals were dismayed and angry.<br/><br/>Throughout the turbulent 1850s, each had energetically sought the presidency as the conflict over slavery was leading inexorably to secession and civil war. That Lincoln succeeded, Goodwin demonstrates, was the result of a character that had been forged by experiences that raised him above his more privileged and accomplished rivals. He won because he possessed an extraordinary ability to put himself in the place of other men, to experience what they were feeling, to understand their motives and desires.<br/><br/>It was this capacity that enabled Lincoln as president to bring his disgruntled opponents together, create the most unusual cabinet in history, and marshal their talents to the task of preserving the Union and winning the war.<br/><br/>We view the long, horrifying struggle from the vantage of the White House as Lincoln copes with incompetent generals, hostile congressmen, and his raucous cabinet. He overcomes these obstacles by winning the respect of his former competitors, and in the case of Seward, finds a loyal and crucial friend to see him through.<br/><br/>This brilliant multiple biography is centered on Lincoln's mastery of men and how it shaped the most significant presidency in the nation's history.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/07/55/9780743270755.jpg', 'title_long': 'Team of Rivals: The Political Genius of Abraham Lincoln', 'edition': 'Reprint', 'dimensions': 'Height: 9.25 Inches, Length: 6.125 Inches, Weight: 2.7006627095 Pounds, Width: 1.7 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.125}, 'width': {'unit': 'inches', 'value': 1.7}, 'weight': {'unit': 'pounds', 'value': 2.7006627095}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 944, 'date_published': '2006-09-26', 'subjects': ['Biographies & Memoirs', 'Historical', 'United States', 'Leaders & Notable People', 'Military', 'Political', 'Presidents & Heads of State', 'History', 'Americas', 'Politics & Social Sciences', 'Politics & Government', 'Elections & Political Process', 'Self Service', 'Custom Stores'], 'authors': ['Doris Kearns Goodwin'], 'title': 'Team of Rivals: The Political Genius of Abraham Lincoln', 'isbn13': '9780743270755', 'msrp': 22, 'binding': 'Paperback', 'isbn': '0743270754', 'isbn10': '0743270754', 'other_isbns': [{'isbn': '9781416549833', 'binding': 'print'}]}}