{'book': {'publisher': 'Scribner', 'synopsis': 'Over half a million copies sold!<br/><br/>From the author of the highly acclaimed heavy metal memoir, Fargo Rock City, comes another hilarious and discerning take on massively popular culture—set in Chuck Klosterman’s den and your own—covering everything from the effect of John Cusack flicks to the crucial role of breakfast cereal to the awesome power of the Dixie Chicks.<br/><br/>Countless writers and artists have spoken for a generation, but no one has done it quite like Chuck Klosterman. With an exhaustive knowledge of popular culture and an almost effortless ability to spin brilliant prose out of unlikely subject matter, Klosterman attacks the entire spectrum of postmodern America: reality TV, Internet porn, Pamela Anderson, literary Jesus freaks, and the real difference between apples and oranges (of which there is none). And don’t even get him started on his love life and the whole Harry-Met-Sally situation.<br/><br/>Whether deconstructing Saved by the Bell episodes or the artistic legacy of Billy Joel, the symbolic importance of The Empire Strikes Back or the Celtics/Lakers rivalry, Chuck will make you think, he’ll make you laugh, and he’ll drive you insane—usually all at once. Sex, Drugs, and Cocoa Puffs is ostensibly about art, entertainment, infotainment, sports, politics, and kittens, but—really—it’s about us. All of us. As Klosterman realizes late at night, in the moment before he falls asleep, “In and of itself, nothing really matters. What matters is that nothing is ever ‘in and of itself.’” Read to believe.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/60/10/9780743236010.jpg', 'title_long': 'Sex, Drugs, and Cocoa Puffs: A Low Culture Manifesto', 'edition': 'Reprint', 'dimensions': 'Height: 8.4375 Inches, Length: 5.5 Inches, Weight: 0.55776952286 Pounds, Width: 0.68 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.68}, 'weight': {'unit': 'pounds', 'value': 0.55776952286}, 'height': {'unit': 'inches', 'value': 8.4375}}, 'pages': 272, 'date_published': '2004-07-02', 'subjects': ['Humor & Entertainment', 'Humor', 'Literature & Fiction', 'Essays & Correspondence', 'Essays', 'Reference', 'Politics & Social Sciences', 'Social Sciences', 'Popular Culture', 'Anthropology', 'Cultural'], 'authors': ['Chuck Klosterman'], 'title': 'Sex, Drugs, and Cocoa Puffs: A Low Culture Manifesto', 'isbn13': '9780743236010', 'msrp': '0.00', 'binding': 'Paperback', 'related': {'Kindle Edition': '074325824X', 'ePub': '074325824X'}, 'isbn': '0743236017', 'isbn10': '0743236017', 'other_isbns': [{'isbn': '9780743258241', 'binding': 'print'}]}}