{'book': {'publisher': 'Touchstone Books by Simon & Schuster', 'synopsis': 'Once we bowled in leagues, usually after work—but no longer. This seemingly small phenomenon symbolizes a significant social change that Robert Putnam has identified in this brilliant volume, which The Economist hailed as “a prodigious achievement.”<br/><br/>Drawing on vast new data that reveal Americans’ changing behavior, Putnam shows how we have become increasingly disconnected from one another and how social structures—whether they be PTA, church, or political parties—have disintegrated. Until the publication of this groundbreaking work, no one had so deftly diagnosed the harm that these broken bonds have wreaked on our physical and civic health, nor had anyone exalted their fundamental power in creating a society that is happy, healthy, and safe.<br/><br/>Like defining works from the past, such as The Lonely Crowd and The Affluent Society, and like the works of C. Wright Mills and Betty Friedan, Putnam’s Bowling Alone has identified a central crisis at the heart of our society and suggests what we can do.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/30/43/9780743203043.jpg', 'title_long': 'Bowling Alone: The Collapse and Revival of American Community', 'edition': 'First Edition', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 1.1 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.1}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 544, 'date_published': '2001-08-07', 'subjects': ['History', 'Americas', 'United States', 'Historical Study & Educational Resources', 'Reference', 'Politics & Social Sciences', 'Social Sciences', 'Anthropology', 'Cultural', 'Sociology', 'Class', 'Politics & Government', 'Public Affairs & Policy'], 'authors': ['Robert D. Putnam'], 'title': 'Bowling Alone: The Collapse and Revival of American Community', 'isbn13': '9780743203043', 'msrp': 18, 'binding': 'Paperback', 'isbn': '0743203046', 'isbn10': '0743203046', 'other_isbns': [{'isbn': '9780743219037', 'binding': 'print'}]}}