{'book': {'publisher': 'Scribner', 'synopsis': "Every sixth human being in the world today is an Indian, and every sixth Indian is an untouchable. For thousands of years the untouchables, or Dalits, the people at the bottom of the Hindu caste system, have been treated as subhuman. Their story has rarely been told. This remarkable book achieves something altogether unprecedented: it gives voice to India's voiceless.<br/>In Untouchables, Narendra Jadhav tells the awe-inspiring story of his family's struggle for equality and justice in India. While most Dalits had accepted their lowly position as fate, Jadhav's father rebelled against the oppressive caste system and fought against all odds to forge for his children a destiny that was never ordained.<br/>Based on his father's diaries and family stories, Jadhav has written the triumphant story of his parents -- their great love, unwavering courage, and eventual victory in the struggle to free themselves and their children from the caste system. Jadhav vividly brings his parents' world to light and unflinchingly documents the life of untouchables -- the hunger, the cruel humiliations, the perpetual fear and brutal abuse.<br/>Compelling and deeply compassionate, Untouchables is a son's tribute to his parents, an illuminating chronicle of one of the most important moments in Indian history, and an eye-opening work of nonfiction that gives readers access and insight into the lives of India's 165 million Dalits, whose struggle for equality continues even today.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/07/93/9780743270793.jpg', 'title_long': "Untouchables: My Family's Triumphant Journey Out of the Caste System in Modern India", 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.39111687322 Pounds, Width: 1.2 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.2}, 'weight': {'unit': 'pounds', 'value': 1.39111687322}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 320, 'date_published': '2005-10-11', 'subjects': ['Biographies & Memoirs', 'Historical', 'Asia', 'Memoirs', 'History', 'India', 'Politics & Social Sciences', 'Sociology', 'Race Relations', 'Class'], 'authors': ['Narendra Jadhav'], 'title': "Untouchables: My Family's Triumphant Journey Out of the Caste System in Modern India", 'isbn13': '9780743270793', 'msrp': 50.9, 'binding': 'Hardcover', 'related': {'ePub': '0743281810'}, 'isbn': '0743270797', 'isbn10': '0743270797', 'other_isbns': [{'isbn': '9780743281812', 'binding': 'print'}]}}