{'book': {'publisher': 'For Dummies', 'synopsis': 'Want to pick up extra cash? Explore opening an eBay store? Unload your dusty disco albums or the collection of antlers in the basement? Hey, those poor, dead deer could lead to a rich, lively career. Whether you want to build an eBay business from scratch or just want to make sure you’re up on eBay’s policy changes and taking advantage of new automation tools, this guide will have you selling successfully on eBay faster than you can say, “going…going…”Starting an eBay Business For Dummies 2nd Edition gets you organized and in virtual business fast with step-by-step guidance on: Setting up basic auctions Pricing items or setting minimums strategically Using the About Me page to begin creating a professional identity Finding sources of merchandise (once you exhaust your basement, attic, and relatives) Managing your business with online auction management services and software, including a list of 16 popular sites with their prices Writing tempting descriptions and taking good photographs of merchandise Selecting payment systems (and why shipping C.O.D. is a no-no) Handling inventory and keeping records<br/>Written by Marsha Collier, author of eBay For Dummies and eBay Bargain Shopping For Dummies, an eBay PowerSeller, columnist, and teacher at eBay University, this book is packed with time-saving, money-saving tips plus secret eBay hints to help you compete with the pros from the get go. It gives you inside information on: eBay motors, real estate, and other unusual areas Dutch auctions, reserve price auctions, and private auctions Using an eBay fee calculator to check your final value fees Shipping and insuring merchandise efficiently and economically Printing shipping labels and postage<br/>Complete with a glossary and index, Starting an eBay Business For Dummies 2nd Edition is just what you need to get started selling on eBay, to graduate from occasional seller to PowerSeller, or to become a genuine eBay entrepreneur like the ten whose success stories are featured in this book!', 'language': 'en', 'image': 'https://images.isbndb.com/covers/92/41/9780764569241.jpg', 'title_long': 'Starting an eBay Business for Dummies, Second Edition', 'edition': '2', 'dimensions': 'Height: 9.25 Inches, Length: 7.5 Inches, Weight: 1.35 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.5}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 1.35}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 408, 'date_published': '2004-09-17', 'subjects': ['Business & Money', 'Business Development & Entrepreneurship', 'Starting a Business', 'Small Business', 'Processes & Infrastructure', 'E-Commerce', 'Computers & Technology', 'Networking & Cloud Computing', 'Internet, Groupware, & Telecommunications', 'Internet & Social Media', 'Self Service', 'Custom Stores', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Marsha Collier'], 'title': 'Starting an eBay Business for Dummies, Second Edition', 'isbn13': '9780764569241', 'msrp': 24.99, 'binding': 'Paperback', 'isbn': '0764569244', 'isbn10': '0764569244'}}