{'book': {'publisher': 'Crown', 'synopsis': 'Every time Bill Bryson walks out the door, memorable travel literature threatens to break out. This time in Australia.<br/><br/>His previous excursion along the Appalachian Trail resulted in the sublime national bestseller A Walk in the Woods. In A Sunburned Country is his report on what he found in an entirely different place: Australia, the country that doubles as a continent, and a place with the friendliest inhabitants, the hottest, driest weather, and the most peculiar and lethal wildlife to be found on the planet. The result is a deliciously funny, fact-filled, and adventurous performance by a writer who combines humor, wonder, and unflagging curiousity.<br/><br/>Despite the fact that Australia harbors more things that can kill you in extremely nasty ways than anywhere else, including sharks, crocodiles, snakes, even riptides and deserts, Bill Bryson adores the place, and he takes his readers on a rollicking ride far beyond that beaten tourist path. Wherever he goes he finds Australians who are cheerful, extroverted, and unfailingly obliging, and these beaming products of land with clean, safe cities, cold beer, and constant sunshine fill the pages of this wonderful book.<br/><br/>Australia is an immense and fortunate land, and it has found in Bill Bryson its perfect guide.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/38/68/9780767903868.jpg', 'title_long': 'In a Sunburned Country', 'edition': '1ST BROADW', 'dimensions': 'Height: 7.98 Inches, Length: 5.15 Inches, Weight: 0.67 Pounds, Width: 0.92 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.15}, 'width': {'unit': 'inches', 'value': 0.92}, 'weight': {'unit': 'pounds', 'value': 0.67}, 'height': {'unit': 'inches', 'value': 7.98}}, 'pages': 352, 'date_published': '2001-05-15', 'subjects': ['Biographies & Memoirs', 'Memoirs', 'Travelers & Explorers', 'True Crime', 'Hoaxes & Deceptions', 'Humor & Entertainment', 'Humor', 'Essays', 'Lawyers & Criminals', 'Reference', 'Writing, Research & Publishing Guides', 'Writing', 'Travel', 'Australia & South Pacific', 'General', 'United States', 'Travel Writing'], 'authors': ['Bill Bryson'], 'title': 'In a Sunburned Country', 'isbn13': '9780767903868', 'msrp': 16.99, 'binding': 'Paperback', 'related': {'Kindle Edition': '0767907663', 'ePub': '0767907663'}, 'isbn': '0767903862', 'isbn10': '0767903862', 'other_isbns': [{'isbn': '9780767907668', 'binding': 'print'}]}}