{'book': {'publisher': 'Moody Publishers', 'synopsis': 'Product Description      <br/>For years The Five Love Languages has been enriching, strengthening, and saving marriages. A person gives and receives love in five basic ways. If you aren\'t speaking your partner\'s love language, he or she likely isn\'t feeling loved. Never fear! You CAN learn a new language! In addition, now the Five Love Languages Journal will assist you in journaling your heartfelt feelings and sticking to those best intentions. The leather-look cover is stately enough to take with you anywhere, anytime. Each section of the journal corresponds to a chapter in the best-selling book by Gary Chapman, followed by an inspiring quote, thought-provoking questions, and plenty of space to record your thoughts.<br/>      Amazon.com Review      <br/>Unhappiness in marriage often has a simple root cause: we speak different love languages, believes Dr. Gary Chapman. While working as a marriage counselor for more than 30 years, he identified five love languages: Words of Affirmation, Quality Time, Receiving Gifts, Acts of Service, and Physical Touch. In a friendly, often humorous style, he unpacks each one. Some husbands or wives may crave focused attention; another needs regular praise. Gifts are highly important to one spouse, while another sees fixing a leaky faucet, ironing a shirt, or cooking a meal as filling their "love tank." Some partners might find physical touch makes them feel valued: holding hands, giving back rubs, and sexual contact. Chapman illustrates each love language with real-life examples from his counseling practice.<br/> How do you discover your spouse\x92s \x96 and your own \x96 love language? Chapman\x92s short questionnaires are one of several ways to find out. Throughout the book, he also includes application questions that can be answered more extensively in the beautifully detailed companion leather journal (an exclusive Amazon.com bonus). Each section of the journal corresponds with a chapter from the book, offering opportunities for deeper reflection on your marriage. <br/> Although some readers may find choosing to love a spouse that they no longer even like \x96hoping the feelings of affection will follow later\x96 a difficult concept to swallow, Chapman promises that the results will be worth the effort. "Love is a choice," says Chapman. "And either partner can start the process today." --Cindy Crosby<br/>      About the Author      <br/><br/>GARY CHAPMAN, PhD, is the author of the #1 New York Times bestselling The 5 Love Languages. With over 30 years of counseling experience, he has the uncanny ability to hold a mirror up to human behavior, showing readers not just where they go wrong, but also how to grow and move forward. Dr. Chapman holds BA and MA degrees in anthropology from Wheaton College and Wake Forest University, respectively, MRE and PhD degrees from Southwestern Baptist Theological Seminary, and has completed postgraduate work at the University of North Carolina and Duke University. For more information visit his website at www.5lovelanguages.com.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/53/18/9780802415318.jpg', 'title_long': 'The Five Love Languages Faux Leather Bound Journal and Paperback Book Set (Amazon.com Exclusive)', 'edition': 'Amazon.com Exclusive', 'dimensions': 'height: 229 mm, length: 152 mm, width: 27 mm', 'dimensions_structured': {'length': {'unit': 'mm', 'value': 152}, 'width': {'unit': 'mm', 'value': 27}, 'height': {'unit': 'mm', 'value': 229}}, 'date_published': '2005-01', 'subjects': ['Self-Help', 'Relationships', 'Marriage'], 'authors': ['Gary D. Chapman', 'Gary Chapman'], 'title': 'The Five Love Languages Faux Leather Bound Journal and Paperback Book Set (Amazon.com Exclusive)', 'isbn13': '9780802415318', 'msrp': 21.97, 'binding': 'Paperback', 'isbn': '0802415318', 'isbn10': '0802415318'}}