{'book': {'publisher': 'Owl Books', 'synopsis': 'Based on William Pollack\'s groundbreaking research at Harvard Medical School over two decades, Real Boys explores this generation\'s "silent crisis": why many boys are sad, lonely, and confused although they may appear tough, cheerful, and confident. Pollack challenges conventional expectations about manhood and masculinity that encourage parents to treat boys as little men, raising them through a toughening process that drives their true emotions underground. Only when we understand what boys are really like, says Pollack, can we help them develop more self-confidence and the emotional savvy they need to deal with issues such as depression, love and sexuality, drugs and alcohol, divorce, and violence.<br/>“Just as Reviving Ophelia opened our eyes to the challenges faced by adolescent girls, Real Boys helps us hear and respond to the needs of growing boys.” ―Judith Jordan, Ph.D., Harvard Medical School<br/>Featuring a new preface by the author on how parents can make a difference.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/18/33/9780805061833.jpg', 'title_long': 'Real Boys: Rescuing Our Sons from the Myths of Boyhood', 'edition': '1', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.95 Pounds, Width: 1.2 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.2}, 'weight': {'unit': 'pounds', 'value': 0.95}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 480, 'date_published': '1999-04', 'subjects': ['Health, Fitness & Dieting', 'Mental Health', 'Parenting & Relationships', 'Parenting', 'Early Childhood', 'Parenting Boys', 'Politics & Social Sciences', 'Sociology'], 'authors': ['William Pollack'], 'title': 'Real Boys: Rescuing Our Sons from the Myths of Boyhood', 'isbn13': '9780805061833', 'msrp': 12.86, 'binding': 'Paperback', 'isbn': '0805061835', 'isbn10': '0805061835', 'other_isbns': [{'isbn': '9781429935036', 'binding': 'printisbncanonical'}]}}