{'book': {'publisher': 'University of Oklahoma Press', 'synopsis': 'One of the most influential and popular works in all literature, Ovid’s Metamorphoses is a weaving-together of classical myths, extending in time from the creation of the world to the death of Julius Caesar. This volume provides the Latin text of the first five books of the poem and the most detailed commentary available in English for these books.<br/>In his introduction to the volume, editor William S. Anderson provides essential background information, discussing Ovid’s life, the reception of the Metamorphoses during Ovid’s day and after, and the poem’s central issues. The Latin text of the five books is Anderson’s own edition, based on years of study of the surviving manuscripts. In the extensive notes that follow the text, Anderson offers both useful summaries of the stories and detailed line-by-line comments.<br/>Unlike other epic poems, which concern wars and heroism, the Metamorphoses centers on ordinary human beings, women as well as men, who live in a world of continuous change. The first five books, which include such well-known stories as Apollo and Daphane, Diana and Actaeon, and Narcissus and Echo, deal especially with the relationship between human beings and the gods. Arrogant and lustful, but all-powerful, the gods of Ovid’s universe selfishly pursue their own pleasures, frequently at the expense of their human targets. Yet these gods escape unscathed, while the humans, unjustly, are punished. Helpless to defend themselves, they are changed into animal or nonhuman forms.<br/>A resource for students and scholars of Latin, this volume enhances understanding and enjoyment of Ovid’s changeable poem about our changeable existence.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/89/48/9780806128948.jpg', 'title_long': "Ovid's Metamorphoses Books 1-5", 'edition': 'Revised', 'dimensions': 'Height: 7.5 Inches, Length: 4.75 Inches, Weight: 1.17506385646 Pounds, Width: 1.19 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.75}, 'width': {'unit': 'inches', 'value': 1.19}, 'weight': {'unit': 'pounds', 'value': 1.17506385646}, 'height': {'unit': 'inches', 'value': 7.5}}, 'pages': 584, 'date_published': '1998-01-15', 'subjects': ['Literature & Fiction', 'Dramas & Plays', 'Ancient & Classical', 'History & Criticism', 'Movements & Periods', 'Poetry', 'Ancient, Classical & Medieval'], 'authors': ['Ovid'], 'title': "Ovid's Metamorphoses Books 1-5", 'isbn13': '9780806128948', 'msrp': 27.74, 'binding': 'Paperback', 'isbn': '0806128941', 'isbn10': '0806128941'}}