{'book': {'publisher': "Barron's Educational Series", 'synopsis': 'Begun soon after 1386 and written during several years that followed, Geoffrey Chaucer’s great narrative poem The Canterbury Tales presents a richly detailed, highly entertaining, and sometimes bawdy picture of English society in the fourteenth century. Rich with humorous insights into the many foibles of humanity, this poem is considered by most literary critics and scholars to be the first great example of literary art written in vernacular English. Its narrative opens as a party of 30 men and women from various walks of life gather at the Tabard Inn in London, from where they set out on a holy pilgrimage to Canterbury and its shrine dedicated to Thomas Ã Becket. As they travel, each person has a story to tell.<br/><br/>The most famous and beloved of Chaucer’s stories are presented in interlinear form this intensely readable volume. Alternating each of Chaucer’s original lines with its translation into modern English, this book encourages readers to savor the genius of Chaucer’s original poetry while following each line with an easy-to-understand modern translation of his Southeast Midlands dialect of Middle English. This scholarly yet truly approachable translation of Chaucer’s original poem is the work of Vincent F. Hopper, a longtime professor of English literature at New York University. He opens with the famous Prologue—<br/><br/>Whan that Aprille with his shoures sote<br/>When April with his showers sweet<br/>The droghte of Marche hath perced to the rote,<br/>The drought of March has pierced to the root<br/><br/>—and then goes on to present<br/>The Miller’s Tale The Reeve’s Tale The Prioress’s Tale The Nun’s Priest’s Tale The Pardoner’s Tale The Wife of Bath’s Tale The Franklin’s Tale . . . and more.<br/>This fine volume also includes an enlightening introductory essay on Chaucer’s art, with Professor Hopper’s commentary on England as it existed in the fourteenth century. He concludes with a short list of recommended reading on Chaucer’s time and his art.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/03/99/9780812000399.jpg', 'title_long': "Chaucer's Canterbury Tales (Selected): An Interlinear Translation", 'edition': 'Revised', 'dimensions': 'Height: 7.75 Inches, Length: 5.25 Inches, Weight: 1.19931470528 Pounds, Width: 1.0625 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 1.0625}, 'weight': {'unit': 'pounds', 'value': 1.19931470528}, 'height': {'unit': 'inches', 'value': 7.75}}, 'pages': 530, 'date_published': '1977-12-31', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Movements & Periods', 'Regional & Cultural', 'World Literature', 'European', 'British & Irish', 'Reference'], 'authors': ['Geoffrey Chaucer', 'Vincent F. Hopper (translation)'], 'title': "Chaucer's Canterbury Tales (Selected): An Interlinear Translation", 'isbn13': '9780812000399', 'msrp': 14.99, 'binding': 'Paperback', 'isbn': '0812000390', 'isbn10': '0812000390'}}