{'book': {'publisher': 'Duke University Press Books', 'synopsis': 'In Immigrant Acts, Lisa Lowe argues that understanding Asian immigration to the United States is fundamental to understanding the racialized economic and political foundations of the nation. Lowe discusses the contradictions whereby Asians have been included in the workplaces and markets of the U.S. nation-state, yet, through exclusion laws and bars from citizenship, have been distanced from the terrain of national culture.<br/>Lowe argues that a national memory haunts the conception of Asian American, persisting beyond the repeal of individual laws and sustained by U.S. wars in Asia, in which the Asian is seen as the perpetual immigrant, as the “foreigner-within.” In Immigrant Acts, she argues that rather than attesting to the absorption of cultural difference into the universality of the national political sphere, the Asian immigrant—at odds with the cultural, racial, and linguistic forms of the nation—displaces the temporality of assimilation. Distance from the American national culture constitutes Asian American culture as an alternative site that produces cultural forms materially and aesthetically in contradiction with the institutions of citizenship and national identity. Rather than a sign of a “failed” integration of Asians into the American cultural sphere, this critique preserves and opens up different possibilities for political practice and coalition across racial and national borders.<br/>In this uniquely interdisciplinary study, Lowe examines the historical, political, cultural, and aesthetic meanings of immigration in relation to Asian Americans. Extending the range of Asian American critique, Immigrant Acts will interest readers concerned with race and ethnicity in the United States, American cultures, immigration, and transnationalism.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/86/44/9780822318644.jpg', 'title_long': 'Immigrant Acts: On Asian American Cultural Politics', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6.25 Inches, Weight: 0.80027801106 Pounds, Width: 0.68 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 0.68}, 'weight': {'unit': 'pounds', 'value': 0.80027801106}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 272, 'date_published': '1996-10-21', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Regional & Cultural', 'Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies', 'Sociology', 'Politics & Government', 'International & World Politics'], 'authors': ['Lisa Lowe'], 'title': 'Immigrant Acts: On Asian American Cultural Politics', 'isbn13': '9780822318644', 'msrp': 49.95, 'binding': 'Paperback', 'related': {'eBook': '0822379015'}, 'isbn': '0822318644', 'isbn10': '0822318644', 'other_isbns': [{'isbn': '9780822379010', 'binding': 'ebook'}]}}