{'book': {'publisher': 'Wisdom Publications', 'synopsis': 'Upasika Kee was a uniquely powerful spiritual teacher. Evocative of the great Ajahn Chah, her teachings are earthy, refreshingly direct, and hard-hitting. In the twentieth century, she grew to become one of the most famous teachers in Thailand--male or female--all the more remarkable because, rarer still, she was not a monastic but a layperson. Her relentless honesty, along with her encouraging voice, is one reason so many contemporary Buddhist teachers recall Upasika Kee so fondly, and so often. With this book, readers seeking something reminiscent of the classic Mindfulness in Plain English can receive instruction on meditation practice as they become acquainted with the legacy of a renowned Buddhist figure. Pure and Simple, the first widely-available collection of her writings, will be gratefully received not only by those who knew Upasika Kee, but by anyone who encounters her for the first time in its pages.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/49/26/9780861714926.jpg', 'title_long': 'Pure and Simple: The Extraordinary Teachings of a Thai Buddhist Laywoman', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.85 Pounds, Width: 0.8 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.8}, 'weight': {'unit': 'pounds', 'value': 0.85}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 252, 'date_published': '2005-05-15', 'subjects': ['Christian Books & Bibles', 'Worship & Devotion', 'Meditations', 'Health, Fitness & Dieting', 'Alternative Medicine', 'Meditation', 'Religion & Spirituality', 'Buddhism', 'Rituals & Practice', 'Theravada'], 'authors': ['Upasika Kee Nanayon'], 'title': 'Pure and Simple: The Extraordinary Teachings of a Thai Buddhist Laywoman', 'isbn13': '9780861714926', 'msrp': 11.44, 'binding': 'Paperback', 'related': {'ePub': '0861717511'}, 'isbn': '086171492X', 'isbn10': '086171492X', 'other_isbns': [{'isbn': '9780861717514', 'binding': 'print'}]}}