{'book': {'publisher': 'Pragmatic Bookshelf', 'synopsis': 'Ruby is an increasingly popular, fully object-oriented dynamic programming language, hailed by many practitioners as the finest and most useful language available today. When Ruby first burst onto the scene in the Western world, the Pragmatic Programmers were there with the definitive reference manual, Programming Ruby: The Pragmatic Programmer\'s Guide.<br/><br/>Now in its second edition, author Dave Thomas has expanded the famous Pickaxe book with over 200 pages of new content, covering all the improved language features of Ruby 1.8 and standard library modules. The Pickaxe contains four major sections: An acclaimed tutorial on using Ruby. The definitive reference to the language. Complete documentation on all built-in classes, modules, and methods Complete descriptions of all 98 standard libraries.<br/><br/>If you enjoyed the First Edition, you\'ll appreciate the expanded content, including enhanced coverage of installation, packaging, documenting Ruby source code, threading and synchronization, and enhancing Ruby\'s capabilities using C-language extensions. Programming for the World Wide Web is easy in Ruby, with new chapters on XML/RPC, SOAP, distributed Ruby, templating systems, and other web services. There\'s even a new chapter on unit testing.<br/><br/>This is the definitive reference manual for Ruby, including a description of all the standard library modules, a complete reference to all built-in classes and modules (including more than 250 significant changes since the First Edition). Coverage of other features has grown tremendously, including details on how to harness the sophisticated capabilities of irb, so you can dynamically examine and experiment with your running code. "Ruby is a wonderfully powerful and useful language, and whenever I\'m working with it this book is at my side" --Martin Fowler, Chief Scientist, ThoughtWorks', 'language': 'en', 'image': 'https://images.isbndb.com/covers/40/55/9780974514055.jpg', 'title_long': "Programming Ruby: The Pragmatic Programmers' Guide, Second Edition", 'edition': '2nd', 'dimensions': 'Height: 9.25 Inches, Length: 7.38 Inches, Weight: 2.7998707274 Pounds, Width: 1.56 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.38}, 'width': {'unit': 'inches', 'value': 1.56}, 'weight': {'unit': 'pounds', 'value': 2.7998707274}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 829, 'date_published': '2004-11-09', 'subjects': ['Computers & Technology', 'Programming', 'Software Design, Testing & Engineering', 'Microsoft Programming', 'Software', 'Web Development & Design', 'Programming Languages', 'Ruby', 'Self Service', 'Custom Stores', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Dave Thomas', 'Chad Fowler', 'Andy Hunt'], 'title': "Programming Ruby: The Pragmatic Programmers' Guide, Second Edition", 'isbn13': '9780974514055', 'msrp': 44.95, 'binding': 'Paperback', 'isbn': '0974514055', 'isbn10': '0974514055'}}