{'book': {'publisher': 'Vintage Espanol', 'synopsis': 'Un hombre regresa al pueblo donde ocurrió un asesinato desconcertante 27 años atrás, con la determinación de descubrir la verdad.<br/><br/>Todos parecen estar de acuerdo en que Bayardo San Román, sólo unas horas después de su matrimonio con la bella Angela Vicario, la devuelve por deshonrada a la casa paterna. La atribulada familia fuerza a la novia a revelar el nombre de su primer amante; y los hermanos gemelos de ella anuncian su intención de matar a Santiago Nasar por haber deshonrado a su hermana.<br/><br/>Sin embargo, si todos sabían que se iba a cometer un asesinato, ¿por qué nadie trató de impedirlo? Cuanto más se sabe de este asunto, menos se comprende, y cuando la historia al fin se precipita a su inesperada conclusión, una sociedad entera —no sólo un par de asesinos— está siendo enjuiciada.<br/><br/>ENGLISH DESCRIPTION<br/><br/>A man returns to the town where a baffling murder took place 27 years earlier, determined to get to the bottom of the story.<br/><br/>Just hours after marrying the beautiful Angela Vicario, everyone agrees, Bayardo San Roman returned his bride in disgrace to her parents. Her distraught family forced her to name her first lover; and her twin brothers announced their intention to murder Santiago Nasar for dishonoring their sister.<br/><br/>Yet if everyone knew the murder was going to happen, why did no one intervene to stop it? The more that is learned, the less is understood, and as the story races to its inexplicable conclusion, an entire society--not just a pair of murderers—is put on trial.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/49/56/9781400034956.jpg', 'title_long': 'Crónica de una muerte anunciada / Chronicle of a Death Foretold (Spanish Edition)', 'edition': 'First Thus', 'dimensions': 'Height: 8 Inches, Length: 5.14 Inches, Weight: 0.3 Pounds, Width: 0.29 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.14}, 'width': {'unit': 'inches', 'value': 0.29}, 'weight': {'unit': 'pounds', 'value': 0.3}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 128, 'date_published': '2003-10-14', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Literary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Crime', 'Science Fiction & Fantasy', 'Fantasy', 'Magical Realism', 'Self Service', 'Custom Stores'], 'authors': ['Gabriel García Márquez'], 'title': 'Crónica de una muerte anunciada / Chronicle of a Death Foretold (Spanish Edition)', 'isbn13': '9781400034956', 'msrp': '0.00', 'binding': 'Paperback', 'related': {'ePub': '1101911018'}, 'isbn': '1400034957', 'isbn10': '1400034957', 'other_isbns': [{'isbn': '9781101911013', 'binding': 'print'}]}}