{'book': {'publisher': 'Tantor Audio', 'synopsis': 'Product Description      Two half brothers look so similar as infants that no one can tell them apart. One, the legitimate son of a rich man, is destined for a life of comfort, while the other is condemned to be a slave as he is part black. The mother of the would be slave is also the nurse of the other; to give her son the best life possible she switches the two. Soon the boy who is given every advantage becomes spoiled and cruel. He takes sadistic pleasure in tormenting his half brother. As they grow older, the townspeople no longer notice that the boys look similar, and they readily accept that each is born to his station. A local lawyer, David Wilson has had a similar experience. On his first day in the village he made an odd remark about a dog, and the towns people gave him the condescending name of "Pudd\'nhead". Although he was a young intelligent lawyer, he is unable to live down this name and toils in obscurity for over twenty years. Finally he is presented with a complex murder trial and is given the chance to prove himself to the townspeople and shake this unjust label. This complex murder mystery is a psychological study that explores how perceptions shape character. Twain combines biting satire, with his trademark scenes of farce and levity.      About the Author      Mark Twain is the pseudonym of Samuel Langhorne Clemens (1835-1910), American writer and humorist, whose best work is characterized by broad, often irreverent humor or biting social satire. Twain\'s writing is also known for realism of place and language, memorable characters, and hatred of hypocrisy and oppression.Michael Prichard has recorded well over five hundred audiobooks and was named one of SmartMoney magazine\'s Top Ten Golden Voices. His numerous awards and accolades include an Audie Award and several AudioFile Earphones Awards.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/06/87/9781400150687.jpg', 'title_long': "The Tragedy of Pudd'nhead Wilson", 'edition': 'Unabridged', 'dimensions': 'Height: 7.4 Inches, Length: 5.3 Inches, Weight: 0.15873282864 Pounds, Width: 0.6 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.3}, 'width': {'unit': 'inches', 'value': 0.6}, 'weight': {'unit': 'pounds', 'value': 0.15873282864}, 'height': {'unit': 'inches', 'value': 7.4}}, 'date_published': '2003', 'subjects': ['Literature & Fiction', 'Classics', 'Genre Fiction', 'Psychological', 'United States', 'Humor & Satire', 'Humorous', 'Mystery, Thriller & Suspense', 'Mystery', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Mark Twain'], 'title': "The Tragedy of Pudd'nhead Wilson", 'isbn13': '9781400150687', 'msrp': '0.00', 'binding': 'MP3 CD', 'isbn': '140015068X', 'isbn10': '140015068X'}}