{'book': {'publisher': 'Barnes & Noble Classics', 'synopsis': "Pride and Prejudice, by Jane Austen, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics: New introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriate All editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences\x97biographical, historical, and literary\x97to enrich each reader's understanding of these enduring works. 'It is a truth universally acknowledged, that a single man in possession of a good fortune must be in want of a wife.' Thus memorably begins Jane Austen's Pride and Prejudice, one of the world's most popular novels. Pride and Prejudice\x97Austen's own 'darling child'\x97tells the story of fiercely independent Elizabeth Bennet, one of five sisters who must marry rich, as she confounds the arrogant, wealthy Mr. Darcy. What ensues is one of the most delightful and engrossingly readable courtships known to literature, written by a precocious Austen when she was just twenty-one years old.<br/><br/>Humorous and profound, and filled with highly entertaining dialogue, this witty comedy of manners dips and turns through drawing-rooms and plots to reach an immensely satisfying finale. In the words of Eudora Welty, Pride and Prejudice is as 'irresistible and as nearly flawless as any fiction could be.'<br/><br/>Carol Howard, educated at SUNY Purchase and Columbia University, where she received her Ph.D. in 1999, chairs the English Department and teaches in the Theater Department at Warren Wilson College in Asheville, North Carolina. She has published essays on early British and contemporary African-American women writers and has coedited two books on British writers (1996, 1997). Her primary scholarly interest is the literature of seventeenth- and eighteenth-century England.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/32/43/9781593083243.jpg', 'title_long': 'Pride and Prejudice (Barnes & Noble Classics)', 'edition': '7th Print', 'dimensions': 'Height: 8.69 Inches, Length: 5.88 Inches, Weight: 1.31 Pounds, Width: 1.44 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.88}, 'width': {'unit': 'inches', 'value': 1.44}, 'weight': {'unit': 'pounds', 'value': 1.31}, 'height': {'unit': 'inches', 'value': 8.69}}, 'pages': 432, 'date_published': '2004-09-20', 'subjects': ['Literature & Fiction', 'Classics', 'Romance', 'Historical', 'Regency'], 'authors': ['Jane Austen'], 'title': 'Pride and Prejudice (Barnes & Noble Classics)', 'isbn13': '9781593083243', 'msrp': 7.95, 'binding': 'Hardcover', 'isbn': '1593083246', 'isbn10': '1593083246'}}