{'book': {'publisher': 'Library of America', 'synopsis': 'With humor, along with an unerring sense of dialogue and the telling details of dress and behavior, Raymond Chandler created a distinctive fictional universe out of the dark side of sunlit Los Angeles. In the process, he transformed both crime writing and the American language.<br/><br/>Written during the war, The Lady in the Lake (1943) takes Philip Marlowe out of the seamy L.A. streets to the deceptive tranquility of the surrounding mountains, as the search for a businessman’s missing wife expands into an elegy of loneliness and loss. The darker tone typical of Chandler’s later fiction is evident in The Little Sister (1949), in which an ambitious starlet, a blackmailer, and a seemingly naïve young woman from Manhattan, Kansas, are the key players in a plot that provides fuel for a bitter indictment of Hollywood and Chandler’s most savage portrayal of his adopted city.<br/><br/>The Long Goodbye (1953), his most ambitious and self-revealing novel, uncovers a more anguished resonance in the Marlowe character, in a plot that hinges on the betrayal of friendship and the compromises of middle age. Playback (1958), written originally as a screenplay, is Chandler’s seventh and last novel.<br/><br/>A special feature of this volume is Chandler’s long-unavailable screenplay for the film noir classic, Double Indemnity (1944), adapted from James M. Cain’s novel. Written with director Billy Wilder, it is one of the best screenplays in American cinema, masterful in construction and dialogue. Supplementing the volume, and providing a more personal glimpse of Chandler’s personality, is a selection of letters and essays—including “The Simple Art of Murder,” in which Chandler muses on his pulp roots and on the special qualities of his hero and style.<br/><br/>LIBRARY OF AMERICA is an independent nonprofit cultural organization founded in 1979 to preserve our nation’s literary heritage by publishing, and keeping permanently in print, America’s best and most significant writing. The Library of America series includes more than 300 volumes to date, authoritative editions that average 1,000 pages in length, feature cloth covers, sewn bindings, and ribbon markers, and are printed on premium acid-free paper that will last for centuries.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/10/86/9781883011086.jpg', 'title_long': 'Raymond Chandler: Later Novels and Other Writings: The Lady in the Lake / The Little Sister / The Long Goodbye / Playback /Double Indemnity / Selected Essays and Letters (Library of America)', 'dimensions': 'Height: 8.15 Inches, Length: 5.27 Inches, Weight: 1.4991433816 Pounds, Width: 1.31 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.27}, 'width': {'unit': 'inches', 'value': 1.31}, 'weight': {'unit': 'pounds', 'value': 1.4991433816}, 'height': {'unit': 'inches', 'value': 8.15}}, 'pages': 1088, 'date_published': '1995-10-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Short Stories & Anthologies', 'Anthologies', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Hard-Boiled', 'Self Service', 'Custom Stores'], 'authors': ['Raymond Chandler'], 'title': 'Raymond Chandler: Later Novels and Other Writings: The Lady in the Lake / The Little Sister / The Long Goodbye / Playback /Double Indemnity / Selected Essays and Letters (Library of America)', 'isbn13': '9781883011086', 'msrp': 50, 'binding': 'Hardcover', 'isbn': '1883011086', 'isbn10': '1883011086'}}