{'book': {'publisher': 'Library of America', 'synopsis': "Library of America presents the second volume in a landmark two-volume collector's edition of the incomparable stories of an American master.<br/><br/>Born into an upper-class New York family, Edith Wharton broke with convention and became a professional writer, earning an enduring place as the grande dame of American letters. This Library of America collection (along with its companion volume, Collected Stories: 1891–1910) presents the finest of Wharton's achievement in short fiction, drawn from the more than eighty stories she published over the course of her career.<br/><br/>In this volume, Wharton’s humor is abundantly evident in sly and subtle stories like “Xingu” (in which a ladies’ reading group is led to express its enthusiasm for an occult philosophy) and “Charm Incorporated” (about a mild-mannered Wall Street executive overwhelmed by his émigré wife’s needy but wonderful relatives). As always, Wharton’s is a provocative voice on the subject of sexuality and women’s roles. In “The Day of the Funeral,” “Joy in the House,” and “Atrophy,” love and desire confront the demands of polite society; in “Roman Fever,” a formal tour de force, two middle-aged women on holiday with their modern daughters revisit the fierce competitiveness of their own youth.<br/><br/>Of particular interest are Wharton’s stories of the uncanny and the supernatural, like the grisly “A Bottle of Perrier,” set in the North African desert, and the chilling “All Souls’,” written just before her death. An unacknowledged master of American horror fiction, Wharton’s lucid prose makes all the more powerful her exploration of the irrational forces underlying ordinary life.<br/><br/>Also included in this edition are a chronology of Wharton’s life, explanatory notes, and an essay on the texts.<br/><br/>LIBRARY OF AMERICA is an independent nonprofit cultural organization founded in 1979 to preserve our nation’s literary heritage by publishing, and keeping permanently in print, America’s best and most significant writing. The Library of America series includes more than 300 volumes to date, authoritative editions that average 1,000 pages in length, feature cloth covers, sewn bindings, and ribbon markers, and are printed on premium acid-free paper that will last for centuries.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/19/49/9781883011949.jpg', 'title_long': 'Collected Stories 1911-1937', 'dimensions': 'Height: 8.17 Inches, Length: 5.18 Inches, Weight: 1.25 Pounds, Width: 1.04 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.18}, 'width': {'unit': 'inches', 'value': 1.04}, 'weight': {'unit': 'pounds', 'value': 1.25}, 'height': {'unit': 'inches', 'value': 8.17}}, 'pages': 848, 'date_published': '2001-01-29', 'subjects': ['Literature & Fiction', 'Short Stories & Anthologies', 'Anthologies', 'Short Stories', 'United States', 'Humor & Satire', 'Satire', 'Literary', 'Self Service', 'Custom Stores'], 'authors': ['Edith Wharton'], 'title': 'Collected Stories 1911-1937', 'isbn13': '9781883011949', 'msrp': 40, 'binding': 'Hardcover', 'isbn': '1883011949', 'isbn10': '1883011949'}}