{'book': {'publisher': 'Library of America', 'synopsis': 'The beloved March family trilogy—presented in one “single, beautifully crafted volume” featuring original illustrations (John Matteson, Pulitzer Prize–winning author)<br/><br/>From the incidents of her own remarkable childhood, Louisa May Alcott fashioned a trilogy of novels that catapulted her to fame and fortune and that remain among the most beloved works in all of American literature. Here, in an authoritative single-volume edition restoring Alcott’s original text as well as her sister May (the original of Amy)’s illustrations, is the complete series.<br/><br/>Set in a small New England town during the Civil War and Reconstruction, Little Women introduces Alcott’s remarkable heroines, the March sisters—above all, her alter ego Jo March, with her literary ambition and independent spirit. The follow-up, Little Men, follows Jo into adulthood and marriage as she finds herself the caretaker of a houseful of rambunctious children at Plumfield School. Jo’s Boys returns to Plumfield a decade later; now grown, Jo’s children recount adventures of their own.<br/><br/>At once heartwarming and true to life, Alcott’s novels will continue to win over readers both young and old, as they have for generations.<br/><br/>LIBRARY OF AMERICA is an independent nonprofit cultural organization founded in 1979 to preserve our nation’s literary heritage by publishing, and keeping permanently in print, America’s best and most significant writing. The Library of America series includes more than 300 volumes to date, authoritative editions that average 1,000 pages in length, feature cloth covers, sewn bindings, and ribbon markers, and are printed on premium acid-free paper that will last for centuries.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/27/30/9781931082730.jpg', 'title_long': "Little Women, Little Men, Jo's Boys", 'edition': 1, 'dimensions': 'Height: 8.09 Inches, Length: 5.1 Inches, Weight: 1.54984970186 Pounds, Width: 1.37 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.1}, 'width': {'unit': 'inches', 'value': 1.37}, 'weight': {'unit': 'pounds', 'value': 1.54984970186}, 'height': {'unit': 'inches', 'value': 8.09}}, 'pages': 1045, 'date_published': '2005-02-17', 'subjects': ['Literature & Fiction', 'Classics', 'Genre Fiction', 'Coming of Age', 'Family Life', 'Short Stories & Anthologies', 'Anthologies', 'Short Stories', 'United States', 'Teen & Young Adult', 'Self Service', 'Custom Stores'], 'authors': ['Louisa May Alcott'], 'title': "Little Women, Little Men, Jo's Boys", 'isbn13': '9781931082730', 'msrp': 40, 'binding': 'Hardcover', 'related': {'Kindle Edition': '1598533843', 'Page Fidelity': '1598533851', 'eBook': '1598533851', 'ePub': '1598533843'}, 'isbn': '1931082731', 'isbn10': '1931082731', 'other_isbns': [{'isbn': '9781598533842', 'binding': 'printisbn'}, {'isbn': '9781598533859', 'binding': 'print'}]}}