{'book': {'publisher': 'Suma de letras, Punto de Lectura', 'synopsis': 'Lincoln Rhyme, one of the main forensic criminalists of the world, is paralyzed, and lives tied to his bed. As he is ready to commit suicide, he receives a call: buried in a train track of New York the hand of a taxi passenger has been found, the driver was non other than "The Bone Collector." Only Rhyme can decipher the tracks that this intelligent psychopath leaves behind. Official Amelia Sachs will be his arms and his legs in this exhilarating race to stop the horror. This novel was made into a film The Bone Collector, starting Denzel Washington and Angelina Jolie. "A breakneck thrill-ride." -Wall Street Journal<br/>Description in Spanish: Lincoln Rhyme, uno de los principales criminales forenses del mundo, está paralítico en cuello para abajo, por lo que vive atado a su cama. Cuando planea suicidarse recibe la llamada de un antiguo compañero: enterrada en una vía de tren del West Side neoyorquino se ha encontrado la mano de un hombre que cogió un taxi del que nunca saldría... su conductor era "&el coleccionista de huesos"&.Sólo Rhyme puede descifrar las pistas que va dejando este inteligentísimo psicópata. La oficial de policía Amelia Sachs será sus brazos y sus piernas en una frenética y apasionante carrera para detener el horror. Esta novela inspiró al realizador Phillip Noyce para su película El coleccionista de huesos, protagonizada por Denzel Washington y Angelina Jolie.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/51/36/9788466305136.jpg', 'title_long': 'El coleccionista de huesos (The Bone Collector) (Spanish Edition)', 'edition': 'Spanish Edition', 'dimensions': 'Height: 6.75 Inches, Length: 4.25 Inches, Weight: 0.75 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.25}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 0.75}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 640, 'date_published': '2001-11', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'TV, Movie, Video Game Adaptations', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Psychological Thrillers'], 'authors': ['Jeffery Deaver'], 'title': 'El coleccionista de huesos (The Bone Collector) (Spanish Edition)', 'isbn13': '9788466305136', 'msrp': 8.99, 'binding': 'Mass Market Paperback', 'isbn': '8466305130', 'isbn10': '8466305130'}}