{"book": {"publisher": "Avon", "synopsis": "In this delightful and witty third book in our wonderful series created by veteran dog trainer Lee Charles Kelley, a clever kennel owner, his lady love, and his loyal canines must solve their most sinister mystery yet!<br/>One of Maine kennel owner Jack Field"s favourite pastimes is spending quality time with a fun-loving pooch--which is why he"s playing fetch with a Corgi named Tipper instead of mingling at a July 4th shindig. But when Tipper returns with a bloodstained boating cap in his teeth, the ex-New York cop decides to investigate...and finds an anonymous dead body clutching the tennis ball Jack tossed away moments before. The local law think Jack"s the killer, since he had the opportunity and, as it turns out, a motive. Even his loyal and lovely fiancée, sometime medical examiner Dr. Jamie Cutter, is troubled by evidence that contradicts Jack's tale. Someone's going to great lengths to frame Jack Field, and he's determined to find out why--even though everyone, from a powerful tycoon to a Miami drug lord to a whole passel of professional killers, is equally determined to see him doggoned dead!', 'language": "en", "image": "https: //images.isbndb.com/covers/49/51/9780060524951.jpg", "title_long": "To Collar a Killer", "edition": "First Edition", "dimensions": "Height: 6.75 Inches, Length: 4.1875 Inches, Weight: 0.35 Pounds, Width: 0.76 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.1875}, "width": {"unit": "inches", "value": 0.76}, "weight": {"unit": "pounds", "value": 0.35}, "height": {"unit": "inches", "value": 6.75}}, "pages": 304, "date_published": "2004-11-30", "subjects": ["Literature & Fiction', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Self Service', 'Custom Stores'], 'authors": ["Lee Charles Kelley'], 'title": "To Collar a Killer", "isbn13": "9780060524951", "msrp": 6.99, "binding": "Mass Market Paperback", "related": {"ePub": "0061754161"}, "isbn": "0060524952", "isbn10": "0060524952", "other_isbns": [{'isbn": "9780061754166", "binding": "print"}]}}