{"book": {"publisher": "Harper Perennial", "synopsis": "“One of the finest novels I’ve read . . . .a fiercely intelligent look at childhood, marriage, families, the 1960s, the Cold War and the fear and isolation that are part of the human condition…. it is not only beautifully written…. it is equally beautiful in its conception, its compassion, its wisdom, even in its anger and pain. Don’t miss it.” — Patrick Anderson, Washington Post Book World<br/>The optimism of the early sixties, infused with the excitement of the space race and the menace of the Cold War, is filtered through the rich imagination of high-spirited, eight-year-old Madeleine, who welcomes her family"s posting to a quiet Air Force base near the Canadian border. Secure in the love of her beautiful mother, she is unaware that her father, Jack, is caught up in a web of secrets. When a local murder intersects with global forces, Jack must decide where his loyalties lie, and Madeleine will be forced to learn a lesson about the ambiguity of human morality -- one she will only begin to understand when she carries her quest for the truth, and the killer, into adulthood twenty years later.", "language": "en", "image": "https: //images.isbndb.com/covers/63/79/9780060586379.jpg", "title_long": "The Way the Crow Flies: A Novel (P.S.)", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 1.33 Pounds, Width: 1.36 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 1.36}, "weight": {"unit": "pounds", "value": 1.33}, "height": {"unit": "inches", "value": 8}}, "pages": 848, "date_published": "2004-08-31", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Family Saga', 'Historical', 'United States', 'Literary', 'Mystery, Thriller & Suspense', 'Mystery', 'Self Service', 'Custom Stores'], 'authors": ["Ann-Marie MacDonald'], 'title": "The Way the Crow Flies: A Novel (P.S.)", "isbn13": "9780060586379", "msrp": 17.99, "binding": "Paperback", "isbn": "0060586370", "isbn10": "0060586370", "other_isbns": [{'isbn": "9780061840999", "binding": "print"}]}}