{"book": {"publisher": "William Morrow", "synopsis": "David Payne has been hailed as "the most gifted American novelist of his generation" (Boston Globe) and has been likened to "Pat Conroy or perhaps a Southern John Irving' (Winston-Salem Journal). Now, in his new novel, Payne introduces us to Ransom Hill, lead singer of a legendary-but-now-defunct indie rock group who has come to South Carolina to turn over a new leaf. A bighearted artist and a bit of a wild man, Ran knows that his wife Claire\'s patience with him hangs by a frayed thread. After a five-month separation, he\'s come south from New York City to rejoin her and their two young children at Wando Passo, Claire\'s inherited family estate, determined to save his marriage, his family, and himself.<br/>Back at Wando Passo, though, things don\'t proceed according to plan. Claire has taken a job teaching at the local music conservatory, where the dean of the faculty, Marcel Jones, is one of Claire\'s oldest friends. It\'s unclear -- to Ran, at least -- whether Claire and Marcel\'s relationship remains platonic or has evolved, in his absence, in a disturbing new direction. Matters are complicated further when Ran discovers a mysterious black pot of apparent slave manufacture buried on the grounds of Wando Passo. The unearthing of this relic transports Ransom -- and the reader -- back one hundred fifty years into the story of another love triangle at Wando Passo at the height of the Civil War . . .<br/>. . . May 1861. Claire\'s great-great-great grand-mother, Adelaide DeLay, a beautiful thirty-three-year-old 'spinster' from a top-drawer Charleston family, arrives at Wando Passo by boat, having made a marriage of convenience to the plantation\'s future master, Harlan DeLay. As Addie comes down the gangway, she catches the eye of the plantation\'s steward, Jarry, Harlan\'s black half brother. Trans-fixed, she sees something in Jarry\'s eyes 'like a question that, once posed, you cannot rest until you have the answer to.'<br/>In the present, when two eroded skeletons turn up buried in shallow graves, Ransom becomes obsessed with the identities of the bodies and what happened to them. Did the past triangle -- involving Addie, Harlan, and Jarry -- culminate in murder? As his marriage to Claire continues to unravel, Ran begins to wonder whether disturbing echoes of the past are leading him, Marcel, and Claire toward a similar, tragic outcome in the present.<br/>A fast-paced adventure story filled with lyrical writing, wicked humor, and unforgettable characters, Back to Wando Passo propels the two love stories, linked by place through time, to a simultaneous crescendo of betrayal, revenge, and redemption, and asks whether the present is doomed to ceaselessly repeat the past -- or if it can sometimes change and redeem it.', 'language": "en", "image": "https: //images.isbndb.com/covers/18/97/9780060851897.jpg", "title_long": "Back to Wando Passo: A Novel", "edition": "First Edition", "dimensions": "Height: 9 Inches, Length: 6.25 Inches, Weight: 1.7 Pounds, Width: 1.25 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.25}, "width": {"unit": "inches", "value": 1.25}, "weight": {"unit": "pounds", "value": 1.7}, "height": {"unit": "inches", "value": 9}}, "pages": 448, "date_published": "2006-05-23", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Psychological', 'United States'], 'authors": ["David Payne'], 'title": "Back to Wando Passo: A Novel", "isbn13": "9780060851897", "msrp": 24.95, 'binding": "Hardcover", "isbn": "0060851899", "isbn10": "0060851899"}}