{"book": {"publisher": "William Morrow", "synopsis": ""You bitch, you killed me. You suck!"<br/>Being dead sucks. Make that being undead sucks.<br/>Literally. Just ask Thomas C. Flood. Waking up after a fantastic night unlike anything he\"s ever experienced, he discovers that his girlfriend, Jody—the woman of his dreams—is a vampire. And surprise! Now he\'s one, too.<br/>For some couples, the whole biting-and-blood thing would have been a deal breaker. But Tommy and Jody are in love, and they vow to work through their issues. Like how much Jody should teach Tommy about his new superpowers (and how much he needs to learn on his own). Plus there\'s Tommy\'s cute new minion, sixteen-year-old goth girl Abby Normal. (Well, someone has to run errands during daylight hours!)<br/>Making the relationship work, however, is the least of Jody and Tommy\'s problems. Word has it that the vampire who nibbled on Jody wasn\'t supposed to be recruiting any new members into the club. Even worse, Tommy\'s erstwhile turkey-bowling pals are out to get him, at the urging of a blue-dyed Las Vegas call girl named (duh) Blue.<br/>And that really sucks.', 'language": "en", "image": "https: //images.isbndb.com/covers/02/91/9780060590291.jpg", "title_long": "You Suck: A Love Story", "edition": "1", "dimensions": "Height: 7.5 Inches, Length: 5 Inches, Weight: 1 Pounds, Width: 1.09 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 1.09}, "weight": {"unit": "pounds", "value": 1}, "height": {"unit": "inches", "value": 7.5}}, "pages": 336, "date_published": "2007-01-16", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Feel-Good', 'United States', 'Humor', 'Humor & Satire', 'Humorous', 'Contemporary', 'Romance', 'Vampires', 'Romantic Comedy', 'Science Fiction & Fantasy', 'Fantasy', 'Romantic', 'Science Fiction', 'Self Service', 'Custom Stores'], 'authors": ['Christopher Moore'], 'title": "You Suck: A Love Story", "isbn13": "9780060590291", "msrp": "0.00", "binding": "Hardcover", "isbn": "0060590297", "isbn10": "0060590297"}}