{"book": {"publisher": "William Morrow", "synopsis": "The Bush Agenda is the first book to expose the Bush Administration\"s radical economic agenda for global domination, a plan more extreme, unilateral and audacious than any of his predecessors, a plan that has created the greatest level of violent opposition to America and Americans in recent history.<br/>The Bush Agenda: Invading the World, One Economy at a Time explores the Bush Administration\"s plan to invade the world through a corporate globalization agenda, first in Iraq, then the Middle East with the proposed U.S.-Middle East Free Trade Area, and ultimately as a cornerstone to the global Bush Doctrine of Pax Americana. What is Bush\"s 'free trade?' It\'s an economic model that argues that by removing restrictions on multinational corporations, these companies will be freed to become engines of economic growth in countries around the world, but in fact bring vast wealth of a small number of global elites while entire populations suffer dislocation, poverty and violence, creating a perfect Petri dish for breeding terrorists. The instruments for this takeover include such corporations as Bechtel, Lockheed Martin, ChevronTexaco, Halliburton, and many others.<br/>This book addresses the history of U.S. economic relations throughout the world over the past 25 years, the key role of U.S. corporations, and the larger Bush economic agenda and what the potential impact of this agenda will be on the United States and the world. It concludes with specific alternatives to guide the U.S. on a more peaceful and sustainable course in the future. Using Naomi Klein\'s No Logo and Eric Schlosser\'s Fast Food Nation as models, The Bush Agenda is based on hard analytic fact and presented so that it will not only be persuasive, but highly engaging and entertaining to a broad audience.', 'language": "en", "image": "https: //images.isbndb.com/covers/68/79/9780060846879.jpg", "title_long": "The Bush Agenda: Invading the World, One Economy at a Time", "edition": "First Edition", "dimensions": "Height: 9 Inches, Length: 6.25 Inches, Weight: 1.4 Pounds, Width: 1.25 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.25}, "width": {"unit": "inches", "value": 1.25}, "weight": {"unit": "pounds", "value": 1.4}, "height": {"unit": "inches", "value": 9}}, "pages": 400, "date_published": "2006-04-25", "subjects": ["Business & Money', 'Economics', 'Economic Policy & Development', 'Politics & Social Sciences', 'Politics & Government', 'International & World Politics', 'Public Affairs & Policy'], 'authors": ["Antonia Juhasz'], 'title": "The Bush Agenda: Invading the World, One Economy at a Time", "isbn13": "9780060846879", "msrp": 26.95, 'binding": "Hardcover", "isbn": "0060846879", "isbn10": "0060846879"}}