{"book": {"publisher": "William Morrow", "synopsis": "The New York Times bestselling author and master of the modern mystery returns with a fierce and poignant new novel featuring his acclaimed killer-for-hire, Keller<br/>John Keller is everyone\"s favorite hit man: a new kind of hero for a new, uncertain age. He\"s cool. Reliable. A real pro: the hit man\"s hit man. The inconvenient wife, the aging sports star, the business partner, the retiree with a substantial legacy. He\'s taken care of them all, quietly and efficiently.<br/>Keller\'s got a code of honor, though he\'d never call it that. And he keeps the job strictly business. 'What happens is you wind up thinking of each subject not as a person to be killed but as a problem to be solved. Now there are guys doing this who cope with it by making it personal. They find a reason to hate the guy they have to kill. I don\'t know what\'s a sin and what isn\'t, or if one person deserves to go on living and another deserves to have his life ended. Sometimes I think about stuff like that, but as far as working it all out in my mind, well, I never seem to get anywhere.'<br/>But while Keller might be a pragmatic and crack assassin, he\'s also prone to doubts and loneliness just like everybody else. There was a psychotherapist once. A dog. Even a woman. And though he\'s got Dot, his wisecracking contact and sometimes confidante, and his precious stamp collection, these days, it doesn\'t seem to be enough.<br/>Keller\'s been at this business a long while. Just maybe it\'s time to pack it in and find a nice little house in the desert. Only problem is, retirement takes money. And to get money, he\'s got to go to work. . . .<br/>Hit Parade, the third novel featuring the fascinating Keller, displays the hallmarks that distinguish Lawrence Block\'s award-winning fiction: the intelligence, the clever plotting, the humor, the tricky twists and ironic turns, the darkness and emotional complexity -- and, above all else, the humanity.', 'language": "en", "image": "https: //images.isbndb.com/covers/08/84/9780060840884.jpg", "title_long": "Hit Parade", "edition": "First Edition", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 1.25 Pounds, Width: 1.01 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1.01}, "weight": {"unit": "pounds", "value": 1.25}, "height": {"unit": "inches", "value": 9}}, "pages": 304, "date_published": "2006-07-03", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Short Stories & Anthologies', 'Short Stories', 'Contemporary', 'Mystery, Thriller & Suspense', 'Mystery', 'Supernatural', 'Thrillers & Suspense', 'Spies & Politics', 'Suspense', 'Crime'], 'authors": ["Lawrence Block'], 'title": "Hit Parade", "isbn13": "9780060840884", "msrp": 24.95, 'binding": "Hardcover", "isbn": "0060840889", "isbn10": "0060840889"}}