{"book": {"publisher": "Harper Perennial", "synopsis": "“A riveting memoir. . . an important, moving work that those who have suffered cannot afford to forget and those who have been spared cannot afford to ignore.” — San Francisco Chronicle<br/>From a childhood survivor of the Cambodian genocide under the regime of Pol Pot, this is a riveting narrative of war crimes and desperate actions, the unnerving strength of a small girl and her family, and their triumph of spirit.<br/>One of seven children of a high-ranking government official, Loung Ung lived a privileged life in the Cambodian capital of Phnom Penh until the age of five. Then, in April 1975, Pol Pot"s Khmer Rouge army stormed into the city, forcing Ung"s family to flee and, eventually, to disperse. Loung was trained as a child soldier in a work camp for orphans, her siblings were sent to labor camps, and those who survived the horrors would not be reunited until the Khmer Rouge was destroyed.<br/>Harrowing yet hopeful, Loung"s powerful story is an unforgettable account of a family shaken and shattered, yet miraculously sustained by courage and love in the face of unspeakable brutality.', 'language": "en", "image": "https: //images.isbndb.com/covers/62/67/9780060856267.jpg", "title_long": "First They Killed My Father: A Daughter of Cambodia Remembers", "edition": "2006", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 0.5 Pounds, Width: 0.65 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 0.65}, "weight": {"unit": "pounds", "value": 0.5}, "height": {"unit": "inches", "value": 8}}, "pages": 238, "date_published": "2006-04-04", "subjects": ["Biographies & Memoirs', 'Community & Culture', 'Women', 'Historical', 'Asia', 'Leaders & Notable People', 'Military', 'Memoirs', 'History', 'Southeast Asia', 'World', 'Women in History', 'Reference', 'Self Service', 'Custom Stores'], 'authors": ["Loung Ung'], 'title": "First They Killed My Father: A Daughter of Cambodia Remembers", "isbn13": "9780060856267", "msrp": 10.99, "binding": "Paperback", "isbn": "0060856262", "isbn10": "0060856262", "other_isbns": [{'isbn": "9780062036544", "binding": "print"}]}}