{"book": {"publisher": "William Morrow Paperbacks", "synopsis": "Former pop star Heather Wells has settled nicely into her new life as assistant dorm director at New York College—a career that does not require her to drape her size 12 body in embarrassingly skimpy outfits. She can even cope (sort of) with her rocker ex-boyfriend"s upcoming nuptials, which the press has dubbed The Celebrity Wedding of the Decade. But she"s definitely having a hard time dealing with the situation in the dormitory kitchen—where a cheerleader has lost her head on the first day of the semester. (Actually, her head is accounted for—it"s her torso that's AWOL.)<br/>Surrounded by hysterical students—with her ex-con father on her doorstep and her ex-love bombarding her with unwanted phone calls—Heather welcomes the opportunity to play detective . . . again. If it gets her mind off her personal problems—and teams her up again with the gorgeous P.I. who owns the brownstone where she lives—it's all good. But the murder trail is leading the average-sized amateur investigator into a shadowy world. And if she doesn't watch her step, Heather will soon be singing her swan song!', 'language": "en", "image": "https: //images.isbndb.com/covers/51/25/9780060525125.jpg", "title_long": "Size 14 Is Not Fat Either (Heather Wells Mysteries, 2)", "edition": "First Edition", "dimensions": "Height: 0.86 Inches, Length: 8 Inches, Weight: 0.6 Pounds, Width: 6.34 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8}, "width": {"unit": "inches", "value": 6.34}, "weight": {"unit": "pounds", "value": 0.6}, "height": {"unit": "inches", "value": 0.86}}, "pages": 344, "date_published": "2006-11-28", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Women's Fiction', 'Friendship', 'Contemporary', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Cozy', 'International Mystery & Crime', 'Thrillers & Suspense', 'Crime', 'Self Service', 'Custom Stores'], 'authors": ["Meg Cabot'], 'title": "Size 14 Is Not Fat Either (Heather Wells Mysteries, 2)", "isbn13": "9780060525125", "msrp": 14.99, "binding": "Paperback", "related": {"ePub": "0061752193"}, "isbn": "0060525126", "isbn10": "0060525126", "other_isbns": [{'isbn": "9780061752193", "binding": "print"}]}}