{"book": {"publisher": "William Morrow", "synopsis": "The New York Times bestselling author takes a riveting new direction with this richly textured, multi-layered novel of friendship, murder, revenge, and class conflict set in an upper-crust English school―as enthralling and haunting as Ian McKewan’s Atonement and Patricia Highsmith’s The Talented Mr. Ripley<br/><br/>Audere, agere, auferre.<br/>To dare, to strive, to conquer.<br/>For generations, elite young men have attended St. Oswald’s School for Boys, groomed for success by the likes of Roy Straitley, the eccentric classics teacher who has been a revered fixture for more than 30 years. But this year, things are different. Suits, paperwork, and Information Technology rule the world, and Straitley is reluctantly contemplating retirement. He is joined in this, his 99th, term by five new faculty members, including one who―unknown to Straitley and everyone else―holds intimate and dangerous knowledge of St. Ozzie’s ways and secrets, it’s comforts and conceits. Harboring dark ties to the school’s past, this young teacher has arrived with one terrible goal: Destroy St. Oswald’s.<br/>As the new term gets underway, a number of incidents befall students and faculty alike. Beginning as small annoyances―a lost pen, a misplaced coffee mug―they soon escalate to the life threatening. With the school unraveling, only Straitley stands in the way of St. Ozzie’s ruin. But the old man faces a formidable opponent―a master player with a strategy that has been meticulously planned to the final move.<br/>A harrowing tale of cat and mouse told in alternating voices, this riveting, hypnotically atmospheric novel showcases Joanne Harris’s astonishing storytelling talent as never before.", "language": "en", "image": "https: //images.isbndb.com/covers/91/44/9780060559144.jpg", "title_long": "Gentlemen and Players: A Novel", "edition": "First Edition", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 1.6 Pounds, Width: 1.33 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1.33}, "weight": {"unit": "pounds", "value": 1.6}, "height": {"unit": "inches", "value": 9}}, "pages": 432, "date_published": "2006-01-03", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Mystery, Thriller & Suspense', 'Mystery', 'Traditional Detectives', 'Women Sleuths', 'Thrillers & Suspense', 'Suspense', 'Crime'], 'authors": ["Joanne Harris'], 'title": "Gentlemen and Players: A Novel", "isbn13": "9780060559144", "msrp": 24.95, 'binding": "Hardcover", "isbn": "0060559144", "isbn10": "0060559144"}}