{"book": {"publisher": "Harper Perennial Modern Classics", "synopsis": "From the internationally bestselling author of Love"s Executioner and When Nietzsche Wept, comes a novel of group therapy with a cast of memorably wounded characters struggling to heal pain and change lives<br/>Suddenly confronted with his own mortality after a routine checkup, eminent psychotherapist Julius Hertzfeld is forced to reexamine his life and work -- and seeks out Philip Slate, a sex addict whom he failed to help some twenty years earlier. Yet Philip claims to be cured -- miraculously transformed by the pessimistic teachings of German philosopher Arthur Schopenhauer -- and is, himself, a philosophical counselor in training.<br/>Philip"s dour, misanthropic stance compels Julius to invite Philip to join his intensive therapy group in exchange for tutoring on Schopenhauer. But with mere months left, life may be far too short to help Philip or to compete with him for the hearts and minds of the group members. And then again, it might be just long enough.", 'language": "en", "image": "https: //images.isbndb.com/covers/81/09/9780060938109.jpg", "title_long": "The Schopenhauer Cure: A Novel", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 0.62 pounds, Width: 0.86 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 0.86}, "weight": {"unit": "pounds", "value": 0.62}, "height": {"unit": "inches", "value": 8}}, "pages": 384, "date_published": "2020-11-10", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Metaphysical & Visionary', 'Psychological', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Irvin Yalom'], 'title": "The Schopenhauer Cure: A Novel", "isbn13": "9780060938109", "msrp": 16.99, "binding": "Paperback", "related": {"Kindle Edition": "0061840882", "ePub": "0061840882"}, "isbn": "0060938102", "isbn10": "0060938102", "other_isbns": [{'isbn": "9780061840883", "binding": "print"}]}}