{"book": {"publisher": "HarperOne", "synopsis": "Celebrity, author, yoga instructor, and wellness enthusiast Mariel Hemingway offers a 30-day plan for total mind and body health<br/><br/>Mariel Hemingway’s Living in Balance is not another one-size-fits-all program with rigid rules and baffling instructions. Rather, the simple steps in this practical program to all-over wellness springs from four fundamental areas of life: food, exercise, silense, and environment. Hemingway, a longtime yoga devotee and one of the leading voices for holistic living, discusses what our bodies and minds need, how to make the best decisions for our daily lives, and why in just 30 days we can all look great, feel great, and find peace of mind. Readers learn:<br/>• How what we eat and drink affects how we feel every day.<br/>• That exercise not only helps us stay in shape, but connects us to ourselves<br/>• How bringing silent reflection into our lives helps us learn to observe, and can positively alter our habits and behaviors.<br/>• Why our homes echo the clutter and chaos of the outside world, and how they can be transformed into havens for the balanced life we seek.", "language": "en", "image": "https: //images.isbndb.com/covers/03/91/9780060890391.jpg", "title_long": "Mariel Hemingway"s Healthy Living from the Inside Out: Every Woman"s Guide to Real Beauty, Renewed Energy, and a Radiant Life", 'edition": "1", "dimensions": "Height: 9.125 Inches, Length: 7.375 Inches, Weight: 2.1 Pounds, Width: 0.97 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.375}, "width": {"unit": "inches", "value": 0.97}, "weight": {"unit": "pounds", "value": 2.1}, "height": {"unit": "inches", "value": 9.125}}, "pages": 288, "date_published": "2006-12-26", "subjects": ["Self-Help', 'Personal Transformation', 'Spiritual', 'Health, Fitness & Dieting'], 'authors": ["Mariel Hemingway'], 'title": "Mariel Hemingway"s Healthy Living from the Inside Out: Every Woman"s Guide to Real Beauty, Renewed Energy, and a Radiant Life', 'isbn13": "9780060890391", "msrp": 26.95, 'binding": "Hardcover", "isbn": "0060890398", "isbn10": "0060890398"}}