{"book": {"publisher": "HCP US (PG UK)", "synopsis": "Now a Netflix original movie starring Machine Gun Kelly, Daniel Webber, Douglas Booth, and Iwan Rheon, directed by Jeff Tremaine.<br/><br/>“Without a doubt, it is the most detailed account of the awesome pleasures and perils of rock & roll stardom I have ever read. It is completely compelling, and utterly revolting, full of blood, leather, eyeliner, heroin, and, oh yes, the glam metal that made the Eighties...the Eighties.”—Joe Levy, Rolling Stone<br/>Celebrate thirty years of the world\"s most notorious rock band with the deluxe collectors\" edition of The Dirt—the outrageous, legendary, no-holds-barred autobiography of Mötley Crüe.<br/>Fans have gotten glimpses into the band\"s crazy world of backstage scandals, celebrity love affairs, rollercoaster drug addictions, and immortal music in Mötley Crüe books like Tommyland and The Heroin Diaries, but now the full spectrum of sin and success by Tommy Lee, Nikki Sixx, Vince Neil, and Mick Mars is an open book in The Dirt. Even fans already familiar with earlier editions of the bestselling exposé will treasure this gorgeous deluxe edition. Joe Levy at Rolling Stone calls The Dirt 'without a doubt . . . the most detailed account of the awesome pleasures and perils of rock & roll stardom I have ever read. It is completely compelling and utterly revolting.'', 'language": "en", "image": "https: //images.isbndb.com/covers/91/56/9780060989156.jpg", "title_long": "DIRT PB", "edition": "Reprint", "dimensions": "Height: 5.91 Inches, Length: 1.02 Inches, Width: 9.06 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 1.02}, "width": {"unit": "inches", "value": 9.06}, "height": {"unit": "inches", "value": 5.91}}, "pages": 448, "date_published": "2002", "subjects": ["Arts & Photography', 'Music', 'History & Criticism', 'Musical Genres', 'Biographies & Memoirs', 'Arts & Literature', 'Composers & Musicians', 'Television Performers', 'Humor & Entertainment'], 'authors": ["LEE TOMMY'], 'title": "DIRT PB", "isbn13": "9780060989156", "msrp": 10.7, "binding": "Paperback", "related": {"Kindle Edition": "0062209817", "ePub": "0062209817"}, "isbn": "0060989157", "isbn10": "0060989157", "other_isbns": [{'isbn": "9780062209818", "binding": "print"}]}}