{"book": {"publisher": "Harper Perennial Modern Classics", "synopsis": "“The most impressive contribution to books by Mark Twain since The Mysterious Stranger of 1916...The attitude is that of Swift, the intellectual contempt is that of Voltaire, and the imagination is that of one of the great masters of American writing.”—New York Times Book Review<br/>Virtually none of the material in Letters from the Earth was published in Twain’s lifetime and the manuscript was only approved by his executors in 1962. This is vintage Twain—sharp, witty, imaginative, wildly funny. His voice is as vigorous and blistering as ever, capable of surprising truth and provoking laughter in the most unlikely places.<br/>In this collection, he presents himself as the Father of History, reviewing and interpreting events from the garden of Eden through the Fall and the Flood, translating the papers of Adam and his descendants down through the generations. There are comments on James Fenimore Cooper, English architecture, and the civilization of the French, as well as proposals for a simplified alphabet and a parody of books on etiquette. Letters from the Earth an exuberantly eclectic collection.", "language": "en", "image": "https: //images.isbndb.com/covers/86/53/9780060518653.jpg", "title_long": "Letters from the Earth: Uncensored Writings (Perennial Classics)", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 0.58 Pounds, Width: 0.76 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 0.76}, "weight": {"unit": "pounds", "value": 0.58}, "height": {"unit": "inches", "value": 8}}, "pages": 336, "date_published": "2004-02-17", "subjects": ["Humor & Entertainment', 'Humor', 'Religion', 'Literature & Fiction', 'Classics', 'Genre Fiction', 'History & Criticism', 'Criticism & Theory', 'Genres & Styles', 'Regional & Cultural', 'Short Stories & Anthologies', 'Short Stories', 'United States', 'Religion & Spirituality', 'Science & Math', 'Nature & Ecology', 'Nature Writing & Essays'], 'authors": ["Mark Twain'], 'title": "Letters from the Earth: Uncensored Writings (Perennial Classics)", "isbn13": "9780060518653", "msrp": 16.99, "binding": "Paperback", "related": {"eBook": "0062287265", "ePub": "0062287265"}, "isbn": "0060518650", "isbn10": "0060518650", "other_isbns": [{'isbn": "9780062287267", "binding": "ebook"}]}}