{"book": {"publisher": "Clarion Books", "synopsis": "“An astonishing novel. Were Terry Pratchett not demonstratively a master craftsman already, The Amazing Maurice might be considered his masterpiece.” —Neil Gaiman<br/>The Amazing Maurice runs the perfect Pied Piper scam. This streetwise alley cat knows the value of cold, hard cash and can talk his way into and out of anything. But when Maurice and his cohorts decide to con the town of Bad Blinitz, it will take more than fast talking to survive the danger that awaits.<br/>For this is a town where food is scarce and rats are hated, where cellars are lined with deadly traps, and where a terrifying evil lurks beneath the hunger-stricken streets....<br/>Set in bestselling author Sir Terry Pratchett"s beloved Discworld, this masterfully crafted, gripping read is both compelling and funny. When one of the world"s most acclaimed fantasy writers turns a classic fairy tale on its head, no one will ever look at the Pied Piper—or rats—the same way again!<br/>This book’s feline hero was first mentioned in the Discworld novel Reaper Man and stars in the movie version of his adventure, The Amazing Maurice, featuring David Tenant, Emma Clarke, Hamish Patel, and Hugh Laurie. Fans of Maurice will relish the adventures of Tiffany Aching, starting with The Wee Free Men and A Hat Full of Sky!<br/>Carnegie Medal Winner * ALA Best Fiction for Young Adults * New York Public Library Books for the Teen Age * VOYA Best Science Fiction, Fantasy, and Horror * Book Sense Pick", 'language": "en", "image": "https: //images.isbndb.com/covers/23/42/9780060012342.jpg", "title_long": "The Amazing Maurice and His Educated Rodents (Discworld)", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 1.115 Pounds, Width: 0.89 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 0.89}, "weight": {"unit": "pounds", "value": 1.115}, "height": {"unit": "inches", "value": 9}}, "pages": 256, "date_published": "2001-11-06", "subjects": ["Literature & Fiction', 'Humor & Satire', 'Satire', 'Teen & Young Adult', 'Humorous', 'Science Fiction & Fantasy', 'Fantasy', 'Social Issues'], 'authors": ['Terry Pratchett'], 'title": "The Amazing Maurice and His Educated Rodents (Discworld)", "isbn13": "9780060012342", "msrp": "0.00", "binding": "Library Binding", "isbn": "006001234X", "isbn10": "006001234X"}}