{"book": {"publisher": "Harper", "synopsis": "Illustrated classics for adults! Here, Collins Design"s WISP series pairs two legendary creators–writer Ray Bradbury and artist Dave McKean–to create an irresistible package perfect for Halloween and all year "round.<br/>The WISP series (Wonderfully Illustrated Short Pieces) represents an ingenious marriage of two creative forces: the artistry of today"s foremost illustrators and the literary legacy of beloved authors of popular short works for adults. The resulting offspring of this union are captivating, full–color illustrated editions of timeless classics that readers will want to savor and collect.<br/>For the first time ever, the series makes selected popular short works previously offered only in collections available in a unique, stand–alone format. Also for the first time, WISPs harness the talents of top illustrators for the benefit and delight of a new, older audience.<br/>This WISP presents Ray Bradbury's The Homecoming, a little boy's tale of his family reunion of vampires. This story was initially published in 1946 and later refashioned into further stories. Bringing this story to life are the wondrous illustrations of Dave McKean, whose delightful artwork perfectly matches the tale.<br/>These one–of–a–kind, attractively priced and invitingly formatted illustrated editions will make a great impulse buy and appeal to a broad audience.', 'language": "en", "image": "https: //images.isbndb.com/covers/96/26/9780060859626.jpg", "title_long": "The Homecoming (Wonderfully Illustrated Short Pieces, 2)", "dimensions": "Height: 8 Inches, Length: 7 Inches, Weight: 0.6 Pounds, Width: 0.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7}, "width": {"unit": "inches", "value": 0.5}, "weight": {"unit": "pounds", "value": 0.6}, "height": {"unit": "inches", "value": 8}}, "pages": 56, "date_published": "2006-08-22", "subjects": ["Arts & Photography', 'Individual Artists', 'Literature & Fiction', 'Classics', 'Genre Fiction', 'Horror', 'Poetry', 'Women Authors', 'Short Stories & Anthologies', 'Short Stories', 'United States', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Ray Bradbury'], 'title": "The Homecoming (Wonderfully Illustrated Short Pieces, 2)", "isbn13": "9780060859626", "msrp": 11.43, 'binding": "Hardcover", "isbn": "0060859628", "isbn10": "0060859628"}}