{"book": {"publisher": "Harper Voyager", "synopsis": "The prestigious King"s Cavalla of Gernia has been ravaged by the Speck plague. The deadly disease has decimated the ranks of both cadets and instructors, and the few survivors remain weak and frail. Many have been forced to relinquish their military ambitions and will return to their families to face lives of dependency and disappointment.<br/>As the academy infirmary empties, cadet Nevare Burvelle also prepares to journey home. But far from being a broken man, Nevare has made an astonishingly robust recovery from the Speck plague. Furthermore, while in the grip of the plague, he defeated his Speck nemesis, freeing himself, he believes, from the Speck magic that infected him. As he begins the journey to his ancestral home of Widevale, he is in high spirits, expecting a jubilant homecoming, a tender reunion with his beautiful fiancée, Carsina, and a bright future as a commissioned officer.<br/>Yet back in the shelter of his family, Nevare finds his nights still haunted by visions of his Speck self betraying everything he holds dear in his waking life, and his days tormented by a rare side effect of the Speck plague that shames his family—and repulses Carsina. Though he expected to slip back into his family fold effortlessly, Nevare finds himself instead caught between the sensual, enchanting realm of the Specks and his own ancestry, the world he has always known.<br/>And then the magic in Nevare"s blood—magic that he thought he had destroyed—roars to life, and he realizes that his most dangerous enemy, an enemy that seeks to destroy all he loves, might dwell within him. . . .", 'language": "en", "image": "https: //images.isbndb.com/covers/76/32/9780060757632.jpg", "title_long": "Forest Mage (The Soldier Son Trilogy, Book 2)", "edition": "First Edition", "dimensions": "Height: 9.25 Inches, Length: 6.125 Inches, Weight: 2.45 Pounds, Width: 1.60793 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.125}, "width": {"unit": "inches", "value": 1.60793}, "weight": {"unit": "pounds", "value": 2.45}, "height": {"unit": "inches", "value": 9.25}}, "pages": 736, "date_published": "2006-08-29", "subjects": ["Literature & Fiction', 'Contemporary', 'Science Fiction & Fantasy', 'Fantasy'], 'authors": ['Robin Hobb'], 'title": "Forest Mage (The Soldier Son Trilogy, Book 2)", "isbn13": "9780060757632", "msrp": "0.00", "binding": "Hardcover", "isbn": "0060757639", "isbn10": "0060757639"}}