{"book": {"publisher": "William Morrow Paperbacks", "synopsis": "Before the sweet delight of Chocolat, before the heady concoction that is Blackberry Wine, and before the tart pleasures of Five Quarters of the Orange, bestselling author Joanne Harris wrote Sleep, Pale Sister -- a gothic tourde-force that recalls the powerfully dark sensibility of her novel Holy Fools.<br/>Originally published in 1994 -- and never before available in the United States -- Sleep, Pale Sister is a hypnotically atmospheric story set in nineteenth century London. When puritanical artist Henry Chester sees delicate child beauty Effie, he makes her his favorite model and, before long, his bride. But Henry, volatile and repressed, is in love with an ideal. Passive, docile, and asexual, the woman he projects onto Effie is far from the woman she really is. And when Effie begins to discover the murderous depths of Henry"s hypocrisy, her latent passion will rise to the surface.<br/>Sleep, Pale Sister combines the ethereal beauty of a Pre-Raphaelite painting with a chilling high gothic tale and is a testament to Harris"s brimming cornucopia of talents.<br/>This P.S. edition features an extra 16 pages of insights into the book, including author interviews, recommended reading, and more.", 'language": "en", "image": "https: //images.isbndb.com/covers/71/10/9780060787110.jpg", "title_long": "Sleep, Pale Sister", "edition": "Pre-publication 1st Edition", "dimensions": "Height: 8 Inches, Length: 5.3125 Inches, Weight: 0.67 Pounds, Width: 1.03 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.3125}, "width": {"unit": "inches", "value": 1.03}, "weight": {"unit": "pounds", "value": 0.67}, "height": {"unit": "inches", "value": 8}}, "pages": 410, "date_published": "2005-08-30", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense', 'Crime', 'Supernatural', 'Romance', '20th Century', 'Self Service', 'Custom Stores'], 'authors": ["Joanne Harris'], 'title": "Sleep, Pale Sister", "isbn13": "9780060787110", "msrp": 14.99, "binding": "Paperback", "related": {"ePub": "0061843180"}, "isbn": "0060787112", "isbn10": "0060787112", "other_isbns": [{'isbn": "9780061843181", "binding": "print"}]}}