{"book": {"publisher": "William Morrow Paperbacks", "synopsis": "The Great Depression has bound a nation in despair -- and only a privileged few have risen above it: the exorbitantly wealthy ... and the hucksters who feed upon them. Diego, a seventeen-year-old illegal Mexican immigrant, owes his salvation to master grifter Thomas Schell. Together with Schell\"s gruff and powerful partner, they sail comfortably through hard times, scamming New York\"s grieving rich with elaborate, ingeniously staged séances -- until an impossible occurrence changes everything.<br/>While "communing with spirits,' Schell sees an image of a young girl in a pane of glass, silently entreating the con man for help. Though well aware that his otherworldly 'powers' are a sham, Schell inexplicably offers his services to help find the lost child -- drawing Diego along with him into a tangled maze of deadly secrets and terrible experimentation.<br/>At once a hypnotically compelling mystery and a stunningly evocative portrait of Depression-era New York, The Girl in the Glass is a masterly literary adventure from a writer of exemplary vision and skill.', 'language": "en", "image": "https: //images.isbndb.com/covers/61/98/9780060936198.jpg", "title_long": "The Girl in the Glass: An Edgar Award Winner", "edition": "First Edition", "dimensions": "Height: 7.75 Inches, Length: 5.25 Inches, Weight: 0.5 Pounds, Width: 0.75 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.25}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 0.5}, "height": {"unit": "inches", "value": 7.75}}, "pages": 286, "date_published": "2005-08-16", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'United States', 'Contemporary', 'Literary', 'Science Fiction & Fantasy', 'Fantasy', 'Myths & Legends', 'Self Service', 'Custom Stores'], 'authors": ["Jeffrey Ford'], 'title": "The Girl in the Glass: An Edgar Award Winner", "isbn13": "9780060936198", "msrp": 13.99, "binding": "Paperback", "related": {"ePub": "0061976903"}, "isbn": "0060936193", "isbn10": "0060936193", "other_isbns": [{'isbn": "9780061976902", "binding": "print"}]}}