{"book": {"publisher": "William Morrow", "synopsis": "A blazing narrative history that boldly captures the end of England\"s most despotic ruler and his court -- a time of murderous conspiracies, terrifying betrayals, and sordid intrigue<br/>Henry VIII\"s crimes against his wives are well documented and have become historical lore. But much less attention has been paid to his monarchy, especially the closing years of his reign.<br/>Rich with information including details from new archival material and written with the nail-biting suspense of a modern thriller, The Last Days of Henry VIII offers a superb fresh look at this fascinating figure and new insight into an intriguing chapter in history.<br/>Robert Hutchinson paints a brilliant portrait of this egotistical tyrant who governed with a ruthlessness that rivals that of modern dictators; a monarch who had "no respect or fear of anyone in this world,' according to the Spanish ambassador to his court. Henry VIII pioneered the modern 'show trial": cynical propaganda exercises in which the victims were condemned before the proceedings even opened, proving the most powerful men in the land could be brought down overnight.<br/>After thirty-five years in power, Henry was a bloated, hideously obese, black-humored old recluse. And despite his having had six wives, the Tudor dynasty rested on the slight shoulders of his only male heir, the nine-year-old Prince Edward -- a situation that spurred rival factions into a deadly conflict to control the throne.<br/>The Last Days of Henry VIII is a gripping and compelling history as fascinating and remarkable as its subject.", 'language": "en", "image": "https: //images.isbndb.com/covers/73/34/9780060837334.jpg", "title_long": "The Last Days of Henry VIII: Conspiracies, Treason and Heresy at the Court of the Dying Tyrant", "edition": "1", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 1.411875 Pounds, Width: 1.17 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1.17}, "weight": {"unit": "pounds", "value": 1.411875}, "height": {"unit": "inches", "value": 9}}, "pages": 368, "date_published": "2005-09-20", "subjects": ["Biographies & Memoirs', 'Historical', 'Europe', 'Leaders & Notable People', 'Royalty', 'History', 'Great Britain'], 'authors": ["Robert Hutchinson'], 'title": "The Last Days of Henry VIII: Conspiracies, Treason and Heresy at the Court of the Dying Tyrant", "isbn13": "9780060837334", "msrp": 25.95, 'binding": "Hardcover", "isbn": "0060837330", "isbn10": "0060837330"}}