{"book": {"publisher": "Harper Perennial", "synopsis": ""Carlos Castaneda was one of the most profound and influential thinkers of this century. His insights paved the way for the future evolution of human consciousness. We are all deeply indebted to him." — Deepak Chopra<br/><br/>In this book written immediately before his death, anthropologist and shaman Carlos Castaneda gives us his most autobiographical and intimately revealing work ever, the fruit of a lifetime of experience and perhaps the most moving volume in his oeuvre.<br/>"Ordinarily, events that change our path are impersonal affairs, and yet extremely personal. My teacher, don Juan Matsus, said this in guiding me as his apprentice to collect what I considered to be the memorable events of my life…. Don Juan described the total goal of the shamanistic knowledge that he handled as the preparation for facing the definitive journey: the journey that every human being has to take at the end of his life. He said that what modern man referred to vaguely as life after death was, for those shamans, a concrete region filled to capacity with practical affairs of a different order than the practical affairs of daily life, yet bearing a similar functional practicality. Don Juan considered that to collect the memorable events in their lives was, for shamans, the preparation for their entrance into that concrete region, which they called the active side of infinity.'', 'language": "en", "image": "https: //images.isbndb.com/covers/96/02/9780060929602.jpg", "title_long": "The Active Side of Infinity", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 0.48 Pounds, Width: 0.65 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 0.65}, "weight": {"unit": "pounds", "value": 0.48}, "height": {"unit": "inches", "value": 8}}, "pages": 288, "date_published": "1999-12-22", "subjects": ["Religion & Spirituality', 'New Age & Spirituality', 'Shamanism', 'Mysticism', 'Reincarnation', 'Occult & Paranormal', 'Parapsychology', 'Other Religions, Practices & Sacred Texts', 'Tribal, Indigenous & Folk', 'Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies'], 'authors": ["Carlos Castaneda'], 'title": "The Active Side of Infinity", "isbn13": "9780060929602", "msrp": 1.99, 'binding": "Paperback", "isbn": "006092960X", "isbn10": "006092960X"}}