{"book": {"publisher": "Harper Perennial", "synopsis": "National Bestseller<br/>“A blend of breathtaking artistry, encyclopedic knowledge of the natural world. . . and ardent commitment to the supremacy of nature.” — San Francisco Chronicle<br/>In this beautiful novel, Barbara Kingsolver, New York Times bestselling author of Demon Copperhead and The Poisonwood Bible, weaves together three stories of human love within a larger tapestry of lives inhabiting the forested mountains and struggling small farms of southern Appalachia.<br/>Over the course of one humid summer, as the urge to procreate overtakes the lush countryside, this novel"s intriguing protagonists—a reclusive wildlife biologist, a young farmer"s wife marooned far from home, and a pair of elderly, feuding neighbors—face disparate predicaments but find connections to one another and to the flora and fauna with whom they necessarily share a place. Their discoveries are embedded inside countless intimate lessons of biology, the realities of small farming, and the final, urgent truth that humans are only one piece of life on earth.", 'language": "en", "image": "https: //images.isbndb.com/covers/90/36/9780060959036.jpg", "title_long": "Prodigal Summer: A Novel", "edition": "Reprint", "dimensions": "Height: 1.09 Inches, Length: 7.96 Inches, Weight: 0.75 Pounds, Width: 5.38 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.96}, "width": {"unit": "inches", "value": 5.38}, "weight": {"unit": "pounds", "value": 0.75}, "height": {"unit": "inches", "value": 1.09}}, "pages": 464, "date_published": "2001-10-16", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Political', 'Small Town & Rural', 'United States', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Barbara Kingsolver'], 'title": "Prodigal Summer: A Novel", "isbn13": "9780060959036", "msrp": 16.99, "binding": "Paperback", "related": {"ePub": "0061839922"}, "isbn": "0060959037", "isbn10": "0060959037", "other_isbns": [{'isbn": "9780061839924", "binding": "print"}]}}