{"book": {"publisher": "Avon", "synopsis": "In her dazzling romantic suspense debut, USA Today bestselling author Suzanne Enoch brings us a thrilling tale about a thief who needs to prove she"s no murderer and the millionaire who loves her.<br/>Samantha Jellicoe is a thief and proud of it. Raised to appreciate the finer things in life, Sam has no trouble divesting the wealthy of their treasures. This all changed, however, the night she attempts to steal a valuable item from a Palm Beach estate. Before she knew what hit her, a bomb goes off, a guard is killed, and Sam ends up saving millionaire Richard Addison. She"s a good thief and will own up to her jobs, but if anyone thinks to tie her to murder, they better think again.<br/>On any other night, having a one hundred plus pounds of female fling herself at you is a good thing. But on this particular night, Richard Addison is mad as hell. Not only did he just have his gallery blown up-with him about to enter it-but the woman who rescued him didn"t stick around to offer any explanations. When the dust settles, Rick knows the only person with answers to his questions is the mystery woman. And if she thinks she can hide from him, she better think again.', 'language": "en", "image": "https: //images.isbndb.com/covers/36/36/9780060593636.jpg", "title_long": "Flirting With Danger", "dimensions": "Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.41 Pounds, Width: 0.96 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.19}, "width": {"unit": "inches", "value": 0.96}, "weight": {"unit": "pounds", "value": 0.41}, "height": {"unit": "inches", "value": 6.75}}, "pages": 384, "date_published": "2005-03-01", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense', 'Crime', 'Romance', 'Contemporary', 'Historical', 'Romantic Suspense'], 'authors": ["Suzanne Enoch'], 'title": "Flirting With Danger", "isbn13": "9780060593636", "msrp": 6.99, "binding": "Mass Market Paperback", "related": {"ePub": "0061743712"}, "isbn": "0060593636", "isbn10": "0060593636", "other_isbns": [{'isbn": "9780061743719", "binding": "print"}]}}