{"book": {"publisher": "Ecco", "synopsis": "If, as Matt Ridley suggests, science is simply the search for new forms of ignorance, then perhaps it follows that with science\"s advances come new questions. Will human genetic engineering become commonplace? Will human cloning ever be safe? Are there many universes? How much will the climate change during the coming century?<br/>The Best American Science Writing 2002 gathers top writers and scientists covering the latest developments in the fastest-changing, farthest-reaching scientific fields, such as medicine, genetics, computer technology, evolutionary psychology, cutting-edge physics, and the environment. Among this year\"s selections: In "The Made-to-Order Savior,' Lisa Belkin spotlights two desperate families seeking an unprecedented cure by a medically and ethically unprecedented means -- creating a genetically matched child. Margaret Talbot\'s 'A Desire to Duplicate' reveals that the first human clone may very likely come from an entirely unexpected source, and sooner than we think. Michael Specter reports on the shock waves rippling through the field of neuroscience following the revolutionary discovery that adult brain cells might in fact regenerate ('Rethinking the Brain'). Christopher Dickey\'s 'I Love My Glow Bunny' recounts with sly humor a peculiar episode in which genetic engineering and artistic culture collide. Natalie Angier draws an insightful contrast between suicide terrorists and rescue workers who risk their lives, and finds that sympathy and altruism have a definite place in the evolution of human nature, David Berlinski\'s 'What Brings a World into Being?' ponders the idea of biology and physics as essentially digital technologies, exploring the mysteries encoded in the universe\'s smallest units, be they cells or quanta. Nicholas Wade shows how one of the most controversial books of the year, The Skeptical Environmentalist, by former Greenpeace member and self-described leftist Bjorn Lomborg, debunks some of the most cherished tenets of the environmental movement, suggesting that things are perhaps not as bad as we\'ve been led to believe. And as a counterpoint, Darcy Frey\'s profile of George Divoky reveals a dedicated researcher whose love of birds and mystery leads to some sobering discoveries about global warming and forcefully reminds us of the unsung heroes of science: those who put in long hours, fill in small details, and take great trouble.<br/>In the end, the unanswered questions are what sustain scientific inquiry, open new frontiers of knowledge, and lead to new technologies and medical treatments. The Best American Science Writing 2002 is a series of exciting reports from science\'s front lines, where what we don\'t know is every bit as important as what we know.', 'language": "en", "image": "https: //images.isbndb.com/covers/65/01/9780060936501.jpg", "title_long": "The Best American Science Writing 2002 (Best American Science Writing)", "edition": "2002 ed.", "dimensions": "Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.2 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.25}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 1.2}, "height": {"unit": "inches", "value": 9.25}}, "pages": 352, "date_published": "2002-09-03", "subjects": ["Science & Math', 'Essays & Commentary', 'History & Philosophy'], 'authors": ["Matt Ridley', 'Alan Lightman'], 'title": "The Best American Science Writing 2002 (Best American Science Writing)", "isbn13": "9780060936501", "msrp": 13.95, 'binding": "Paperback", "isbn": "0060936509", "isbn10": "0060936509"}}