{"book": {"publisher": "William Morrow Paperbacks", "synopsis": "Heather Wells Rocks!<br/>Or, at least, she did. That was before she left the pop-idol life behind after she gained a dress size or two -- and lost a boyfriend, a recording contract, and her life savings (when Mom took the money and ran off to Argentina). Now that the glamour and glory days of endless mall appearances are in the past, Heather"s perfectly happy with her new size 12 shape (the average for the American woman!) and her new job as an assistant dorm director at one of New York"s top colleges. That is, until the dead body of a female student from Heather"s residence hall is discovered at the bottom of an elevator shaft.<br/>The cops and the college president are ready to chalk the death off as an accident, the result of reckless youthful mischief. But Heather knows teenage girls . . . and girls do not elevator surf. Yet no one wants to listen -- not the police, her colleagues, or the P.I. who owns the brownstone where she lives -- even when more students start turning up dead in equally ordinary and subtly sinister ways. So Heather makes the decision to take on yet another new career: as spunky girl detective!<br/>But her new job comes with few benefits, no cheering crowds, and lots of liabilities, some of them potentially fatal. And nothing ticks off a killer more than a portly ex-pop star who's sticking her nose where it doesn't belong . . .', 'language": "en", "image": "https: //images.isbndb.com/covers/51/18/9780060525118.jpg", "title_long": "Size 12 Is Not Fat: A Heather Wells Mystery (Heather Wells Mysteries, 1)", "edition": "First Edition", "dimensions": "Height: 1.1 Inches, Length: 7.9 Inches, Weight: 0.75 Pounds, Width: 5.2 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.9}, "width": {"unit": "inches", "value": 5.2}, "weight": {"unit": "pounds", "value": 0.75}, "height": {"unit": "inches", "value": 1.1}}, "pages": 345, "date_published": "2005-12-27", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Women's Fiction', 'Friendship', 'Contemporary', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Cozy', 'International Mystery & Crime', 'Amateur Sleuths', 'Romance', 'Romantic Suspense', 'New Adult & College', 'Sports', 'Self Service', 'Custom Stores'], 'authors": ["Meg Cabot'], 'title": "Size 12 Is Not Fat: A Heather Wells Mystery (Heather Wells Mysteries, 1)", "isbn13": "9780060525118", "msrp": 8.99, "binding": "Paperback", "related": {"ePub": "0061752185"}, "isbn": "0060525118", "isbn10": "0060525118", "other_isbns": [{'isbn": "9780061752186", "binding": "print"}]}}