{"book": {"publisher": "HarperAudio", "synopsis": "Two great Patricia Cornwell audio titles for the price of one. All that Remains and Cruel and Unusual.<br/>All that Remains:<br/>A serial killer is loose in Richmond, specializing in attractive young couples whose bodies are invariably found in the woods months later –– minus their shoes and socks. Chief Medical Officer Dr. Kay Scarpetta finds herself tracking a killer who scrupulously eliminates every clue, rendering all her<br/>forensic skills useless. This time it"s her courage and intuition on the line in a race against time.<br/>Cruel and Unusual:<br/>When convicted killer Ronnie Joe Waddell is executed in Virginia"s electric chair, he becomes what should be a routine case for Chief Medical Examiner Kay Scarpetta. But after Waddell"s execution, everyone connected to him begins to die – including a member of Scarpetta's staff. When crucial records disappear from her files, Scarpetta comes under fire for incomeptence. Caught in a web of political intrigue, she must fight to free herself from murderous insinuations and threats to her own life. She soon finds herself retracing Waddell's bloody footprints, following a trail that might lead to long–hidden secrets deep within the state government. Either the truth will set her free – or unleash upon her a punishment both cruel and unusual.', 'language": "en", "image": "https: //images.isbndb.com/covers/12/16/9780060791216.jpg", "title_long": "The Patricia Cornwell CD Audio Treasury Low Price: Contains All That Remains and Cruel and Unusual (Kay Scarpetta Series, 22)", "edition": "Abridged", "dimensions": "Height: 5.8 Inches, Length: 5.36 Inches, Weight: 0.35 Pounds, Width: 0.8 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.36}, "width": {"unit": "inches", "value": 0.8}, "weight": {"unit": "pounds", "value": 0.35}, "height": {"unit": "inches", "value": 5.8}}, "pages": 5, "date_published": "2005-07-26", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Medical', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Cozy', 'Thrillers & Suspense', 'Suspense', 'Crime', 'Self Service', 'Custom Stores'], 'authors": ["Patricia Cornwell'], 'title": "The Patricia Cornwell CD Audio Treasury Low Price: Contains All That Remains and Cruel and Unusual (Kay Scarpetta Series, 22)", "isbn13": "9780060791216", "msrp": 14.99, 'binding": "Audio CD", "isbn": "0060791217", "isbn10": "0060791217"}}