{"book": {"publisher": "Harper", "synopsis": "In this powerful and far-reaching indictment of George W. Bush\"s White House, Robert F. Kennedy, Jr., the country\'s most prominent environmental attorney, charges that this administration has taken corporate cronyism to such unprecedented heights that it now threatens our health, our national security, and democracy as we know it. In a headlong pursuit of private profit and personal power, Kennedy writes, George Bush and his administration have eviscerated the laws that have protected our nation\'s air, water, public lands, and wildlife for the past thirty years, enriching the president\'s political contributors while lowering the quality of life for the rest of us. Kennedy lifts the veil on how the administration has orchestrated these rollbacks almost entirely outside of public scrutiny -- and in tandem with the very industries that our laws are meant to regulate, the country\'s most notorious polluters. He writes of how it has deceived the public by manipulating and suppressing scientific data, intimidated enforcement officials and other civil servants, and masked its agenda with Orwellian doublespeak. He reports on how the White House doles out lavish subsidies and tax breaks to the energy barons while excusing industry from providing adequate security at the more than 15,
        000 chemical and nuclear facilities that are prime targets for terrorist attacks. Kennedy reveals an administration whose policies have 'squandered our Treasury, entangled us in foreign wars, diminished our international prestige, made us a target for terrorist attacks, and increased our reliance on petty Middle Eastern dictators who despise democracy and are hated by their own people.' Crimes Against Natureis ultimately about the corrosive effect of corporate corruption on our core American values -- free-market capitalism and democracy. It is about an administration, the author argues, that has sacrificed respect for the law, public health, scientific integrity, and long-term economic vitality on the altar of corporate greed. It is a book for both Democrats and Republicans, people like the traditionally conservative farmers and fishermen Kennedy represents in lawsuits against polluters. 'Without exception,' he writes,
        "these people see the current administration as the greatest threat not just to their livelihoods but to their values, their sense of community, and their idea of what it means to be American."', 'language": "en", "image": "https: //images.isbndb.com/covers/68/72/9780060746872.jpg", "title_long": "Crimes Against Nature: How George W. Bush and His Corporate Pals Are Plundering the Country and Hijacking Our Democracy", "edition": "First ed; Third Printing", "dimensions": "Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.69 Pounds, Width: 0.89 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.89}, "weight": {"unit": "pounds", "value": 0.69}, "height": {"unit": "inches", "value": 8.25}}, "pages": 244, "date_published": "2004-08-03", "subjects": ["Science & Math', 'Nature & Ecology', 'Conservation', 'Environment', 'Environmentalism', 'Politics & Social Sciences', 'Social Sciences', 'Communication & Media Studies', 'Politics & Government', 'Ideologies & Doctrines', 'United States'], 'authors": ["Robert F. Kennedy Jr.'], 'title": "Crimes Against Nature: How George W. Bush and His Corporate Pals Are Plundering the Country and Hijacking Our Democracy", "isbn13": "9780060746872", "msrp": 21.95, 'binding": "Hardcover", "isbn": "0060746874", "isbn10": "0060746874"}}