{"book": {"publisher": "Harper Perennial Modern Classics", "synopsis": "“Huxley’s final word about the human condition and the possibility of the good society. . . . Island is a welcome and in many ways unique addition to the select company of books—from Plato to now—that have presented, in imaginary terms, a coherent view of what society is not but might be.” — New York Times Book Review<br/>The final novel from Aldous Huxley, Island is a provocative counterpoint to his worldwide classic Brave New World, in which a flourishing, ideal society located on a remote Pacific island attracts the envy of the outside world.<br/>In the novel Huxley considered his most important, he transports us to the remote Pacific island of Pala, where an ideal society has flourished for 120 years. Inevitably, this island of bliss attracts the envy and enmity of the surrounding world. A conspiracy is underway to take over Pala, and events are set in motion when an agent of the conspirators, a newspaperman named Faranby, is shipwrecked there. What Faranby doesn"t expect is how his time with the people of Pala will revolutionize all his values and—to his amazement—give him hope.", "language": "en", "image": "https: //images.isbndb.com/covers/54/90/9780060085490.jpg", "title_long": "Island (Perennial Classics)", "edition": "Later Printing Used", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 0.6 Pounds, Width: 0.86 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 0.86}, "weight": {"unit": "pounds", "value": 0.6}, "height": {"unit": "inches", "value": 8}}, "pages": 384, "date_published": "2002-07-30", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'United States', 'Literary', 'Science Fiction & Fantasy', 'Science Fiction', 'Dystopian'], 'authors": ['Aldous Huxley'], 'title": "Island (Perennial Classics)", "isbn13": "9780060085490", "msrp": "0.00", "binding": "Paperback", "isbn": "0060085495", "isbn10": "0060085495"}}