{"book": {"publisher": "Avon", "synopsis": "For years, the Ohio–class submarine served as one of the frontline weapons in America"s nuclear Navy. But with the collapse of the USSR, America needs to modernize its arsenal to take into account its new enemies. With that goal, the Navy begins a controversial conversion of the USS Ohio to take America into the future of naval warfare.<br/>The Ohio"s ballistic missiles have been replaced, the tubes now capable of a two–pronged attack. What had been used to house ICBMs now can contain SEALs or a new prototype of underwater submarine, a revolutionary undersea fighter that flies through the water, striking targets at will.<br/>Both barrels will be brought to bear against America"s newest enemy, Iran. The zealots in power have unleased a terrible two–pronged plan, hoping to attack oil rich nations Oman and the UAE, while at the same time lauching a devasting attack on the American Fifth Fleet in the Gulf. Only one group of sailors and commandos can stop them -- the compliment of the USS Ohio.', 'language": "en", "image": "https: //images.isbndb.com/covers/43/95/9780060524395.jpg", "title_long": "The Silent Service: Ohio Class", "dimensions": "Height: 6.75 Inches, Length: 4.1875 Inches, Weight: 0.48 Pounds, Width: 1.04 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.1875}, "width": {"unit": "inches", "value": 1.04}, "weight": {"unit": "pounds", "value": 0.48}, "height": {"unit": "inches", "value": 6.75}}, "pages": 416, "date_published": "2006-07-25", "subjects": ["Literature & Fiction', 'Genre Fiction', 'War', 'Action & Adventure', 'United States', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Spies & Politics'], 'authors": ["H. Jay Riker'], 'title": "The Silent Service: Ohio Class", "isbn13": "9780060524395", "msrp": 7.99, "binding": "Mass Market Paperback", "related": {"ePub": "0061751928"}, "isbn": "0060524391", "isbn10": "0060524391", "other_isbns": [{'isbn": "9780061751929", "binding": "print"}]}}