{"book": {"publisher": "William Morrow", "synopsis": "Marian Keyes has introduced readers to the lives, loves, and foibles of the five Walsh sisters -- Claire, Maggie, Rachel, Helen, and Anna -- and their crazy mammy. In this funny, heartbreaking, and triumphant new tale set in the Big Apple, it\"s Anna\"s turn in the spotlight.<br/>Life is perfect for Anna Walsh. She has the "Best Job in the World' as a PR exec for a top-selling urban beauty brand, a lovely apartment in New York, and a perfect husband -- the love of her life, Aidan Maddox. Until the morning she wakes up in her mammy\'s living room in Dublin with stitches in her face, a dislocated knee, and completely smashed-up hands -- and no memory of how she got there. While her mammy plays nursemaid (just like all of her favorite nurses on her soaps), and her sister Helen sits in wet hedges doing her private investigator work for Lucky Star PI, Anna tries to get better and keeps wondering why Aidan won\'t return her phone calls or e-mails.<br/>Recuperating from her injuries, a mystified Anna returns to Manhattan. Slowly beginning to remember what happened, she sets off on a search to find Aidan -- a hilarious quest involving lilies (she can\'t stop smelling them), psychics, mediums, and anyone in the city who can promise her a reunion with her beloved. . . .<br/>Written in her classic style, marrying the darker parts of life with humor and wit, Anybody Out There? is Marian Keyes\'s best novel to date, a wonderfully charming look at love here and ever after.', 'language": "en", "image": "https: //images.isbndb.com/covers/13/04/9780060731304.jpg", "title_long": "Anybody Out There?: A Novel", "edition": "1", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 1.665 Pounds, Width: 1.41 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1.41}, "weight": {"unit": "pounds", "value": 1.665}, "height": {"unit": "inches", "value": 9}}, "pages": 464, "date_published": "2006-05-01", "subjects": ["Literature & Fiction', 'Women's Fiction', 'Sisters', 'Contemporary', 'Humor & Satire', 'Humorous'], 'authors": ["Marian Keyes'], 'title": "Anybody Out There?: A Novel", "isbn13": "9780060731304", "msrp": 24.95, 'binding": "Hardcover", "isbn": "0060731303", "isbn10": "0060731303"}}