{"book": {"publisher": "Avon", "synopsis": "In this suspenseful fifth book in our wonderful series created by veteran dog trainer Lee Charles Kelley, a clever kennel owner, his lady love, and his loyal canines must solve their most disturbing mystery yet!<br/>It"s October in Maine and ex–cop/criminologist turned dog trainer Jack Field and his fiancée, Chief State Medical Examiner Dr. Jamie Cutter, are getting married in a few weeks. But fate puts a wrench in their plans when the police find a young woman"s body in a secluded lake. Jamie asks Jack, who"s been appointed her civilian advisor, to come to the scene. Seeing the body sparks a memory of a case Jack studied while taking a seminar at the FBI's Behavioral Science Unit. He suspects the death is the work of a serial killer and as the mystery unfolds, it becomes clear that suspects abound, including a sleazy private detective, a well–respected botanist, recruits in the upper echelons of the FBI, and even the wealthy husband of Jack's ex–girlfriend. Add an adorable Dalmatian named Daisy and a wedding ceremony like no other you've ever seen, and you've got Kelley's most touching, heartbreaking, suspenseful, and downright hilarious book yet!', 'language": "en", "image": "https: //images.isbndb.com/covers/22/95/9780060732295.jpg", "title_long": "Dogged Pursuit (Jack and Jamie)", "dimensions": "Height: 6.75 Inches, Length: 4.1875 Inches, Weight: 0.6 Pounds, Width: 0.8 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.1875}, "width": {"unit": "inches", "value": 0.8}, "weight": {"unit": "pounds", "value": 0.6}, "height": {"unit": "inches", "value": 6.75}}, "pages": 320, "date_published": "2006-06-27", "subjects": ["Literature & Fiction', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Self Service', 'Custom Stores'], 'authors": ["Lee Charles Kelley'], 'title": "Dogged Pursuit (Jack and Jamie)", "isbn13": "9780060732295", "msrp": 6.99, "binding": "Mass Market Paperback", "related": {"ePub": "0061984264"}, "isbn": "0060732296", "isbn10": "0060732296", "other_isbns": [{'isbn": "9780061984266", "binding": "print"}]}}