{"book": {"publisher": "Amistad Press", "synopsis": "In fourteen sweeping and sublime stories, five of which have been published in The New Yorker, the bestselling and Pulitzer Prize-winning author of The Known World shows that his grasp of the human condition is firmer than ever<br/>Returning to the city that inspired his first prizewinning book, Lost in the City, Jones has filled this new collection with people who call Washington, D.C., home. Yet it is not the city\"s power brokers that most concern him but rather its ordinary citizens. All Aunt Hagar\"s Children turns an unflinching eye to the men, women, and children caught between the old ways of the South and the temptations that await them further north, people who in Jones\"s masterful hands, emerge as fully human and morally complex, whether they are country folk used to getting up with the chickens or people with centuries of education behind them.<br/>In the title story, in which Jones employs the first-person rhythms of a classic detective story, a Korean War veteran investigates the death of a family friend whose sorry destiny seems inextricable from his mother\'s own violent Southern childhood. In 'In the Blink of God\'s Eye' and 'Tapestry' newly married couples leave behind the familiarity of rural life to pursue lives of urban promise only to be challenged and disappointed.<br/>With the legacy of slavery just a stone\'s throw away and the future uncertain, Jones\'s cornucopia of characters will haunt readers for years to come.', 'language": "en", "image": "https: //images.isbndb.com/covers/75/60/9780060557560.jpg", "title_long": "All Aunt Hagar"s Children", 'edition": "First Edition", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 1.55 Pounds, Width: 1.29 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1.29}, "weight": {"unit": "pounds", "value": 1.55}, "height": {"unit": "inches", "value": 9}}, "pages": 399, "date_published": "2006-08-29", "subjects": ["Literature & Fiction', 'Essays & Correspondence', 'Essays', 'Genre Fiction', 'Historical', 'Sea Stories', 'Family Life', 'Short Stories & Anthologies', 'Short Stories', 'United States', 'Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies'], 'authors": ["Edward P. Jones'], 'title": "All Aunt Hagar"s Children", 'isbn13": "9780060557560", "msrp": 10.99, 'binding": "Hardcover", "isbn": "0060557567", "isbn10": "0060557567"}}