{"book": {"publisher": "HarperChildrens", "synopsis": "Product Description<br/><br/>LITTLE HOUSE. BIG ADVENTURE: A fresh, photographic repackage of the original Little House books just in time for the series’ 75th anniversary.<br/><br/>From the Back Cover<br/><br/>Laura and Almanzo have married and begin their new life together. But just as they start to feel settled, Laura and Almanzo are challenged by storms, sickness, and providing for their new baby, Rose. Their pioneer lives have trained them well, however, and they’re determined to succeed.<br/><br/>Based on the real adventures of Laura Ingalls Wilder, THE FIRST FOUR YEARS is the 10th and final book in the award-winning Little House series.<br/><br/>About the Author<br/><br/>Laura Ingalls Wilder was born in the Wisconsin woods in 1867. She wrote the Little House books based on her own experiences growing up on the Western frontier. Just like the characters in her stories, Laura and her family traveled by covered wagon across the midwest and experienced many of the same adventures. She finally settled down in Mansfield, Missouri with her husband, Almanzo, where she lived until she was ninety years old.", "language": "en", "image": "https: //images.isbndb.com/covers/54/58/9780060885458.jpg", "title_long": "The First Four Years (Little House-the Laura Years)", "dimensions": "Height: 7.59841 Inches, Length: 5.19684 Inches, Weight: 0.25 Pounds, Width: 0.3937 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.19684}, "width": {"unit": "inches", "value": 0.3937}, "weight": {"unit": "pounds", "value": 0.25}, "height": {"unit": "inches", "value": 7.59841}}, "pages": 160, "date_published": "2007-01-01", "subjects": ["Children's Books', 'Literature & Fiction', 'Historical Fiction', 'Classics', 'Self Service', 'Custom Stores'], 'authors": ["Laura Ingalls Wilder'], 'title": "The First Four Years (Little House-the Laura Years)", "isbn13": "9780060885458", "msrp": 6.99, 'binding": "Paperback", "isbn": "0060885459", "isbn10": "0060885459"}}