{"book": {"publisher": "MorrowPb", "synopsis": 'National Book Award Finalist<br/>From the Pulitzer Prize–winning author of The Overstory and the forthcoming Bewilderment, an exquisitely rendered novel set in the pediatrics ward of a public hospital that examines the power, joy, and anguish of storytelling.<br/>“If you have children or will have children, if you know children or can remember being a child, dare to read Operation Wandering Soul. . . [it
        ] is bedtime reading for the future.” —USA Today<br/>In the pediatrics ward of a public hospital in the heart of Los Angeles, a group of sick children is gathering. Surrogate parents to this band of stray kids, resident Richard Kraft and therapist Linda Espera are charged with keeping the group alive on make-believe alone. Determined to give hope where there is none, the adults spin a desperate anthology of stories that promise restoration and escape. But the inevitable is foreshadowed in the faces they’ve grown to love, and ultimately Richard and Linda must return to forgotten chapters in their own lives in order to make sense of the conclusion drawing near.", "language": "en", "image": "https: //images.isbndb.com/covers/61/18/9780060976118.jpg", "title_long": "OPERATION WANDERING SOUL", "edition": "Harperperennial ed.", "dimensions": "Height: 8 Inches, Length: 5.3125 Inches, Weight: 0.66 Pounds, Width: 0.88 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.3125}, "width": {"unit": "inches", "value": 0.88}, "weight": {"unit": "pounds", "value": 0.66}, "height": {"unit": "inches", "value": 8}}, "pages": 352, "date_published": "1994-04-08", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Women's Fiction', 'Contemporary', 'Literary', 'Romance', 'Time Travel', 'Science Fiction & Fantasy', 'Science Fiction', 'Self Service', 'Custom Stores'], 'authors": ["Richard Powers'], 'title": "OPERATION WANDERING SOUL", "isbn13": "9780060976118", "msrp": 1.99, "binding": "Paperback", "isbn": "006097611X", "isbn10": "006097611X", "other_isbns": [{'isbn": "9780063119437", "binding": "ebook"}]}}