{"book": {"publisher": "Harper Perennial", "synopsis": ""Deeply affecting. . . . Like the best novels of Nadine Gordimer, it makes us appreciate the dynamic between the personal and the political, the public and the private, and the costs and causes of radical belief." — New York Times<br/>A triumph of the imagination and a masterpiece of modern storytelling, Cloudsplitter is narrated by the enigmatic Owen Brown, last surviving son of America\"s most famous and still controversial political terrorist and martyr, John Brown.<br/>Deeply researched, brilliantly plotted, and peopled with a cast of unforgettable characters both historical and wholly invented, Cloudsplitter is dazzling in its re-creation of the political and social landscape of our history during the years before the Civil War, when slavery was tearing the country apart. But within this broader scope, Russell Banks has given us a riveting, suspenseful, heartbreaking narrative filled with intimate scenes of domestic life, of violence and action in battle, of romance and familial life and death that make the reader feel in astonishing ways what it is like to be alive in that time.', 'language": "en", "image": "https: //images.isbndb.com/covers/08/68/9780060930868.jpg", "title_long": "Cloudsplitter", "edition": "First American Edition", "dimensions": "Height: 8 Inches, Length: 5.31 inches, Weight: 1.24 Pounds, Width: 1.73 inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 1.73}, "weight": {"unit": "pounds", "value": 1.24}, "height": {"unit": "inches", "value": 8}}, "pages": 768, "date_published": "1998-12-30", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Russell Banks'], 'title": "Cloudsplitter", "isbn13": "9780060930868", "msrp": 16.99, "binding": "Paperback", "isbn": "0060930861", "isbn10": "0060930861", "other_isbns": [{'isbn": "9780062123183", "binding": "printisbncanonical"}]}}