{"book": {"publisher": "HarperCollins", "synopsis": "This collection of journal entries and letters from Laura Ingalls Wilder’s travels across the country is a fascinating glimpse into life and travel in the early twentieth century.<br/>Laura Ingalls Wilder, author of the beloved Little House series, crossed the country by covered wagon, by train, and by car. Here, Laura"s writings from three of her most memorable journeys have been collected in one special volume.<br/>On the Way Home recounts her 1894 move with her daughter, Rose, and her husband, Almanzo, from South Dakota to Mansfield, Missouri, where Laura would live for the rest of her life. In West From Home, Laura wrote letters to Almanzo about her adventures as she traveled to California in 1915 to visit Rose. Finally, The Road Back tells the story of Laura and Almanzo"s first trip back to DeSmet in 1931, the town where Laura grew up and fell in love with Almanzo. Laura"s candid sense of humor and keen eye for observation shine in this wonderful collection of writings about the many places she called home.', 'language": "en", "image": "https: //images.isbndb.com/covers/49/17/9780060724917.jpg", "title_long": "A Little House Traveler: Writings from Laura Ingalls Wilder"s Journeys Across America (Little House Nonfiction)", 'edition": "First Edition", "dimensions": "Height: 8 Inches, Length: 5.5 Inches, Weight: 0.9 Pounds, Width: 1.13 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 1.13}, "weight": {"unit": "pounds", "value": 0.9}, "height": {"unit": "inches", "value": 8}}, "pages": 352, "date_published": "2006-02-07", "subjects": ["Children's Books', 'History', 'United States', 'Literature & Fiction', 'Biographies', 'Historical', 'Literary', 'Women', 'Self Service', 'Custom Stores'], 'authors": ["Laura Ingalls Wilder'], 'title": "A Little House Traveler: Writings from Laura Ingalls Wilder"s Journeys Across America (Little House Nonfiction)", 'isbn13": "9780060724917", "msrp": 16.99, 'binding": "Hardcover", "isbn": "0060724919", "isbn10": "0060724919"}}