{"book": {"publisher": "Greenwillow Books", "synopsis": "Learn to read with America’s favorite mixed-up housekeeper, Amelia Bedelia! The Amelia Bedelia books have sold more than 35 million copies since Amelia Bedelia was first published more than fifty years ago.<br/>This box set includes three of the most popular and bestselling Amelia Bedelia Level 2 I Can Read stories: Amelia Bedelia, Amelia Bedelia and the Surprise Shower, and Play Ball, Amelia Bedelia.<br/>Amelia Bedelia: From dressing the chicken to drawing the drapes, Amelia Bedelia does exactly what Mr. and Mrs. Rogers tell her to do. If things get a bit mixed up, well, that"s okay. When Amelia Bedelia is involved, everything always turns out perfectly in the end!<br/>Amelia Bedelia and the Surprise Shower: Fun-loving Amelia Bedelia is in charge of a surprise wedding shower. And when she arrives with a garden hose, the entire party is turned into an uproarious mess!<br/>Play Ball, Amelia Bedelia: Guess who"s at bat? The lovable, hilarious Amelia Bedelia is back, filling in for a sick player on the Grizzlies baseball team. Watch out! Because nobody plays ball like Amelia Bedelia.<br/>Amelia Bedelia is all boxed up—literally! The Amelia Bedelia books are great for growing the vocabularies of beginning readers and making learning to read fun. A great gift and a wonderful way to introduce beginning readers to a favorite character!", 'language": "en", "image": "https: //images.isbndb.com/covers/23/82/9780060542382.jpg", "title_long": "Amelia Bedelia 40th Anniversary", "edition": "Slp", "dimensions": "Height: 9.07 Inches, Length: 6.14 Inches, Weight: 0.9 Pounds, Width: 0.87 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.14}, "width": {"unit": "inches", "value": 0.87}, "weight": {"unit": "pounds", "value": 0.9}, "height": {"unit": "inches", "value": 9.07}}, "pages": 96, "date_published": "2012", "subjects": ["Children's Books', 'Literature & Fiction', 'Chapter Books & Readers', 'Humor'], 'authors": ["Peggy Parish'], 'title": "Amelia Bedelia 40th Anniversary", "isbn13": "9780060542382", "msrp": 11.99, 'binding": "Paperback", "isbn": "0060542381", "isbn10": "0060542381"}}