{"book": {"publisher": "Caedmon", "synopsis": "Dubliners - James Joyce"s stories of his native homeland - performed by a cast of 15 different actors originating from Ireland. Unabridged.<br/>The fifteen stories that make up this brilliant audio roam over a human landscape that stretches from the bleakest of despair to the most blinding of epiphanies. First published in 1914, the stories are as lucid and accessible as they are memorable poignant.<br/>As you listen to the cast of internationally famous stage and screen actors perform Dubliners, both the spiritually deadening atmosphere that drove Joyce from his homeland and the irresistible emotional pull it always kept on him to the end of his days become heartbreakingly beautiful.<br/>Dubliners is an audio experience that will only grow in richness with each time you listen.<br/>The stories and performers are: Sisters - Frank McCourt<br/>An Encounter - Patrick McCabe<br/>Araby - Colm Meaney<br/>Eveline - Dearbhla Molloy<br/>After the Race - Dan O"Herlihy<br/>Two Gallants - Malachy McCourt<br/>The Boarding House - Donal Donnelly<br/>A Little Cloud - Brendan Coyle<br/>Counterparts - Jim Norton<br/>Clay - Sorcha Cusack<br/>A Painful Case - Ciaran Hinds<br/>Ivy Day in the Committee Room - T.P. McKenna<br/>A Mother - Fionnula Flanagan<br/>Grace - Charles Keating<br/>The Dead - Stephen Rea", 'language": "en", "image": "https: //images.isbndb.com/covers/95/65/9780060789565.jpg", "title_long": "Dubliners", "edition": "Unabridged", "dimensions": "Height: 5.76 Inches, Length: 5.26 Inches, Weight: 0.46 Pounds, Width: 1.05 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.26}, "width": {"unit": "inches", "value": 1.05}, "weight": {"unit": "pounds", "value": 0.46}, "height": {"unit": "inches", "value": 5.76}}, "pages": 24, "date_published": "2005-05-10", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Political', 'City Life', 'Short Stories & Anthologies', 'Anthologies', 'Short Stories', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["James Joyce', 'Frank McCourt', 'Ciaran Hinds', 'Donal Donnelly', 'Colm Meaney', 'Stephen Rea'], 'title": "Dubliners", "isbn13": "9780060789565", "msrp": 39.95, 'binding": "Audio CD", "isbn": "0060789565", "isbn10": "0060789565"}}