{"book": {"publisher": "William Morrow Paperbacks", "synopsis": "Dreaming is easy. Making it happen is hard. With a fresh perspective, Carol Lloyd motivates the person searching for two things: the creative life and a life of sanity, happiness and financial solvency. Creating a Life Worth Living is for the hundreds of thousands of people who bought Julia Cameron\"s The Artist\"s Way, but who are looking for more down-to-earth solutions and concrete tasks for achieving their goals.<br/>Creating a Life Worth Living helps the reader search memory for inspiration, understand his or her individual artistic profile, explore possible futures, design a daily process and build a structure of support. Each of the 12 chapters, such as "The Drudge We Do For Dollars' and 'Excavating the Future,' contains specific exercises and daily tasks that help readers to clarify their desires and create a tangible plan of action for realizing dreams. The book also provides inspiring anecdotes and interviews with people who have succeeded in their chosen fields, such as performance artist Anna Devere Smith, writer Sally Tisdale and filmmaker R. J. Cutler.<br/>The pursuit of one\'s dreams is one of the great joys in life but also one of the most terrifying. Creating a Life Worth Living is an invaluable road map for this journey, guiding readers as they take the first tentative steps that are necessary before they can fly.', 'language": "en", "image": "https: //images.isbndb.com/covers/24/33/9780060952433.jpg", "title_long": "Creating a Life Worth Living", "edition": "First Edition", "dimensions": "Height: 0.88 Inches, Length: 9.34 Inches, Weight: 0.84216584084 Pounds, Width: 6.02 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 9.34}, "width": {"unit": "inches", "value": 6.02}, "weight": {"unit": "pounds", "value": 0.84216584084}, "height": {"unit": "inches", "value": 0.88}}, "pages": 336, "date_published": "1997-08-02", "subjects": ["Self-Help', 'Creativity', 'Happiness', 'Motivational', 'Personal Transformation', 'Business & Money', 'Business Culture', 'Motivation & Self-Improvement', 'Job Hunting & Careers', 'Guides', 'Management & Leadership', 'Decision-Making & Problem Solving', 'Skills', 'Decision Making'], 'authors": ["Carol Lloyd'], 'title": "Creating a Life Worth Living", "isbn13": "9780060952433", "msrp": 14.99, "binding": "Paperback", "related": {"ePub": "0062262688"}, "isbn": "0060952431", "isbn10": "0060952431", "other_isbns": [{'isbn": "9780062262684", "binding": "print"}]}}