{"book": {"publisher": "Harper Perennial", "synopsis": "NEW YORK TIMES BESTSELLER<br/>“We should aspire to Colapinto\"s stellar journalist example: listening carefully to the circumstances of those who are different rather than demanding that they conform to our own.” —Washington Post<br/><br/>The true story about the "twins case" and a riveting exploration of medical arrogance, misguided science, societal confusion, gender differences, and one man\'s ultimate triumph<br/>In 1967, after a twin baby boy suffered a botched circumcision, his family agreed to a radical treatment that would alter his gender. The case would become one of the most famous in modern medicine—and a total failure. The boy\'s uninjured brother, raised as a boy, provided to the experiment the perfect matched control. As Nature Made Him tells the extraordinary story of David Reimer, who, when finally informed of his medical history, made the decision to live as a male.<br/>Writing with uncommon intelligence, insight, and compassion, John Colapinto sets the historical and medical context for the case, exposing the thirty-year-long scientific feud between Dr. John Money and his fellow sex researcher, Dr. Milton Diamond—a rivalry over the nature/nurture debate whose very bitterness finally brought the truth to light.<br/>A macabre tale of medical arrogance, it is first and foremost a human drama of one man\'s—and one family\'s—amazing survival in the face of terrible odds.', 'language": "en", "image": "https: //images.isbndb.com/covers/95/96/9780060929596.jpg", "title_long": "As Nature Made Him: The Boy Who Was Raised as a Girl", "edition": "1", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 0.615 Pounds, Width: 0.72 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 0.72}, "weight": {"unit": "pounds", "value": 0.615}, "height": {"unit": "inches", "value": 8}}, "pages": 320, "date_published": "2001-02-20", "subjects": ["Biographies & Memoirs', 'Community & Culture', 'People with Disabilities', 'Health, Fitness & Dieting', 'Psychology & Counseling', 'Science & Math', 'Medical Books', 'Basic Sciences', 'Anatomy', 'Psychology', 'General', 'Politics & Social Sciences', 'Social Sciences', 'Gender Studies'], 'authors": ["John Colapinto'], 'title": "As Nature Made Him: The Boy Who Was Raised as a Girl", "isbn13": "9780060929596", "msrp": 14, 'binding": "Paperback", "isbn": "0060929596", "isbn10": "0060929596"}}