{"book": {"publisher": "Greenwillow Books", "synopsis": "Discover and rediscover the world of the Queen\"s Thief, from the acclaimed novel The Thief to the thrilling, twenty-years-in-the-making conclusion, The Return of the Thief. The epic novels set in the world of the Queen’s Thief can be read in any order.<br/>New York Times-bestselling author Megan Whalen Turner’s entrancing and award-winning Queen’s Thief novels bring to life the world of the epics and feature one of the most charismatic and incorrigible characters of fiction, Eugenides the thief. Megan Whalen Turner’s Queen’s Thief novels are rich with political machinations and intrigue, battles lost and won, dangerous journeys, divine intervention, power, passion, revenge, and deception. Perfect for fans of Leigh Bardugo, Marie Lu, Patrick Rothfuss, and George R. R. Martin.<br/>Eugenides, no stranger to desperate circumstances, has gotten himself into difficulties he can’t get out of. Used to being treated with a certain measure of wariness, if not respect, he suffers the pranks, insults, and intrigue of the Attolian court with dwindling patience. As usual, nothing is as it appears when he rescues a hot-headed young soldier in the Palace Guard. The Queen’s Thief novels have been praised by writers, critics, reviewers, and fans and have been honored with glowing reviews, “best of” citations, and numerous awards, including the Los Angeles Times Book Prize, a Newbery Honor, the Andre Norton Award shortlist, and the Mythopoeic Fantasy Award.<br/>School Library Journal Best Book<br/>Horn Book Fanfare<br/>ALA Top 10 Best Book for Young Adults<br/>New York Public Library Books for the Teen Age<br/>“The Queen’s Thief books awe and inspire me. They have the feel of a secret, discovered history of real but forgotten lands. The plot-craft is peerless, the revelations stunning, and the characters flawed, cunning, heartbreaking, exceptional. Megan Whalen Turner’s books have a permanent spot on my favorites shelf, with space waiting for more books to come.”—Laini Taylor, New York Times-bestselling author of the Daughter of Smoke and Bone novels and Strange the Dreamer<br/>"Unforgettable characters, plot twists that will make your head spin, a world rendered in elegant detail—you will fall in love with every page of these stories. Megan Whalen Turner writes vivid, immersive, heartbreaking fantasy that will leave you desperate to return to Attolia again and again."—Leigh Bardugo, New York Times-bestselling author of the The Grisha Trilogy and Six of Crows<br/>“One of the most fascinating and original children’s fantasies to appear in years. . . . Rarely does one see a hero as psychologically knowing and irresistibly attractive as Turner’s Thief.”—The Horn Book (starred review)<br/>“A winner.”—Kirkus Reviews (starred review)<br/>“Eugenides, the former Thief of Eddis, is back and just as clever as ever.”—School Library Journal (starred review)', 'language": "en", "image": "https: //images.isbndb.com/covers/57/74/9780060835774.jpg", "title_long": "The King of Attolia (The Queen"s Thief, Book 3)", 'edition": "First Edition", "dimensions": "Height: 8.25 Inches, Length: 5.5 Inches, Weight: 1.03 Pounds, Width: 1.25 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 1.25}, "weight": {"unit": "pounds", "value": 1.03}, "height": {"unit": "inches", "value": 8.25}}, "pages": 400, "date_published": "2006-01-24", "subjects": ["Teen & Young Adult', 'Literature & Fiction', 'Action & Adventure', 'Science Fiction & Fantasy', 'Fantasy', 'Romance', 'Historical', 'Science Fiction & Dystopian', 'Self Service', 'Custom Stores'], 'authors": ['Megan Whalen Turner'], 'title": "The King of Attolia (The Queen"s Thief, Book 3)", 'isbn13": "9780060835774", "msrp": "0.00", "binding": "Hardcover", "isbn": "006083577X", "isbn10": "006083577X"}}