{"book": {"publisher": "William Morrow Paperbacks", "synopsis": "The New York Times bestseller and basis for the Tony-winning hit musical, soon to be a major motion picture starring Cynthia Erivo and Ariana Grande<br/>With millions of copies in print around the world, Gregory Maguire’s Wicked is established not only as a commentary on our time but as a novel to revisit for years to come. Wicked relishes the inspired inventions of L. Frank Baum’s 1900 novel, The Wonderful Wizard of Oz, while playing sleight of hand with our collective memories of the 1939 MGM film starring Margaret Hamilton (and Judy Garland). In this fast-paced, fantastically real, and supremely entertaining novel, Maguire has populated the largely unknown world of Oz with the power of his own imagination.<br/>Years before Dorothy and her dog crash-land, another little girl makes her presence known in Oz. This girl, Elphaba, is born with emerald-green skin—no easy burden in a land as mean and poor as Oz, where superstition and magic are not strong enough to explain or overcome the natural disasters of flood and famine. Still, Elphaba is smart, and by the time she enters Shiz University, she becomes a member of a charmed circle of Oz’s most promising young citizens.<br/>But Elphaba’s Oz is no utopia. The Wizard’s secret police are everywhere. Animals—those creatures with voices, souls, and minds—are threatened with exile. Young Elphaba, green and wild and misunderstood, is determined to protect the Animals—even if it means combating the mysterious Wizard, even if it means risking her single chance at romance. Ever wiser in guilt and sorrow, she can find herself grateful when the world declares her a witch. And she can even make herself glad for that young girl from Kansas.<br/>Recognized as an iconoclastic tour de force on its initial publication, the novel has inspired the blockbuster musical of the same name—one of the longest-running plays in Broadway history. Popular, indeed. But while the novel’s distant cousins hail from the traditions of magical realism, mythopoeic fantasy, and sprawling nineteenth-century sagas of moral urgency, Maguire’s Wicked is as unique as its green-skinned witch.", "language": "en", "image": "https: //images.isbndb.com/covers/59/05/9780060745905.jpg", "title_long": "Wicked: The Life and Times of the Wicked Witch of the West (Musical Tie-in Edition)", "dimensions": "Height: 1.24 Inches, Length: 9.2 Inches, Weight: 1.1133344231 Pounds, Width: 6.46 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 9.2}, "width": {"unit": "inches", "value": 6.46}, "weight": {"unit": "pounds", "value": 1.1133344231}, "height": {"unit": "inches", "value": 1.24}}, "pages": 409, "date_published": "2004-03-02", "subjects": ["Literature & Fiction', 'Genre Fiction', 'United States', 'Mythology & Folk Tales', 'Folklore', 'Science Fiction & Fantasy', 'Fantasy', 'Epic', 'Paranormal & Urban'], 'authors": ["Gregory Maguire'], 'title": "Wicked: The Life and Times of the Wicked Witch of the West (Musical Tie-in Edition)", "isbn13": "9780060745905", "msrp": 16, 'binding": "Paperback", "isbn": "0060745908", "isbn10": "0060745908"}}