{"book": {"publisher": "HarperOne", "synopsis": "Of the many recent books on the historical Jesus, none has explored what the latest biblical scholarship means for personal faith. Now, in Meeting Jesus Again for the First Time, Marcus Borg addresses the yearnings of those who want a fully contemporary faith that welcomes rather than oppresses our critical intelligence and openness to the best of historical scholarship. Borg shows how a rigorous examination of historical findings can lead to a new faith in Christ, one that is critical and, at the same time, sustaining.<br/>Drawing on his own journey from a naïve, unquestioning belief in Christ through collegiate skepticism to a mature and contemporary Christian faith, Borg illustrates how an understanding of the historical Jesus can actually lead to a more authentic Christian life—one not rooted in creed or dogma, but in a life of spiritual challenge, compassion, and community.<br/>In straightforward, accessible prose, Borg looks at the major findings of modern Jesus scholarship from the perspective of faith, bringing alive the many levels of Jesus"s character: spirit person, teacher of alternative wisdom, social prophet, and movement founder. He also reexamines the major stories of the Old Testament vital to an authentic understanding of Jesus, showing how an enriched understanding of these stories can uncover new truths and new pathways to faith.", "language": "en", "image": "https: //images.isbndb.com/covers/91/77/9780060609177.jpg", "title_long": "Meeting Jesus Again for the First Time: The Historical Jesus and the Heart of Contemporary Faith", "edition": "Reprint", "dimensions": "Height: 0.45 Inches, Length: 8.24 Inches, Weight: 0.330693393 Pounds, Width: 5.52 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.24}, "width": {"unit": "inches", "value": 5.52}, "weight": {"unit": "pounds", "value": 0.330693393}, "height": {"unit": "inches", "value": 0.45}}, "pages": 160, "date_published": "1995-03-03", "subjects": ["Christian Books & Bibles', 'Christian Living', 'Spiritual Growth', 'Bible Study & Reference', 'Bible Study', 'Theology', 'Christology', 'History', 'Religion & Spirituality'], 'authors": ["Marcus J. Borg'], 'title": "Meeting Jesus Again for the First Time: The Historical Jesus and the Heart of Contemporary Faith", "isbn13": "9780060609177", "msrp": 10.99, "binding": "Paperback", "related": {"Kindle Edition": "0061747629", "eBook": "0061747629", "ePub": "0061747629"}, "isbn": "0060609176", "isbn10": "0060609176", "other_isbns": [{'isbn": "9780061747625", "binding": "ebook"}]}}