{"book": {"publisher": "WilliamMr", "synopsis": "Between your full-length mirror and high-school biology class, you probably think you know a lot about the human body. While it"s true that we live in an age when we"re as obsessed with our bodies as we are with celebrity hairstyles, the reality is that most of us know very little about what chugs, churns, and thumps throughout this miraculous, scientific, and artistic system of anatomy. Yes, you"ve owned your skin-covered shell for decades, but you probably know more about your cell-phone plan than you do about your own body. When it comes to your longevity and quality of life, understanding your internal systems gives you the power, authority, and ability to live a healthier, younger, and better life.<br/>You: The Owner's Manual challenges your preconceived notions about how the human body works and ages, then takes you on a tour through all of the highways, back roads, and landmarks inside of you. After taking a quiz that tests your body of knowledge, you'll learn about all of your blood-pumping, food-digesting, and keys-remembering systems and organs.<br/>Just as important, you'll get the facts and advice you need to keep your body running long and strong. You'll find out how diseases start and how they affect your body -- as well as advice on how to prevent and beat conditions that threaten your quality of life. Complete with exercise tips, nutritional guidelines, simple lifestyle changes, and alternative approaches, You: The Owner's Manual gives you an easy, comprehensive, and life-changing how-to plan for fending off the gremlins of aging. To top it off, you'll also get the great-tasting and calorie-saving Owner's Manual Diet -- a thirty-recipe eating plan that's designed with only one goal in mind: to help you live a younger life.<br/>Welcome to your body. Why don't you come on in and take a look around?', 'language": "en", "image": "https: //images.isbndb.com/covers/53/16/9780060765316.jpg", "title_long": "YOU: The Owner"s Manual", 'edition": "1", "dimensions": "Height: 9.5 Inches, Length: 8 Inches, Weight: 2.05 Pounds, Width: 1.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8}, "width": {"unit": "inches", "value": 1.5}, "weight": {"unit": "pounds", "value": 2.05}, "height": {"unit": "inches", "value": 9.5}}, "pages": 417, "date_published": "2005-05-03", "subjects": ["Health, Fitness & Dieting', 'Diets & Weight Loss', 'Weight Loss', 'Other Diets', 'Exercise & Fitness', 'Nutrition', 'Science & Math', 'Biological Sciences', 'Anatomy', 'Medical Books', 'Basic Sciences'], 'authors": ["Michael F. Roizen', 'Mehmet C. Oz'], 'title": "YOU: The Owner"s Manual", 'isbn13": "9780060765316", "msrp": 24.95, 'binding": "Hardcover", "isbn": "0060765313", "isbn10": "0060765313"}}