{"book": {"publisher": "Harper Perennial", "synopsis": "Heather O’Neill’s critically acclaimed debut novel, with a new introduction from the author to celebrate its ten-year anniversary<br/>Baby, all of thirteen years old, is lost in the gangly, coltish moment between childhood and the strange pulls and temptations of the adult world. Her mother is dead; her father, Jules, is scarcely more than a child himself and is always on the lookout for his next score. Baby knows that “chocolate milk” is Jules’ slang for heroin and sees a lot more of that in her house than the real thing. But she takes vivid delight in the scrappy bits of happiness and beauty that find their way to her, and moves through the threat of the streets as if she’s been choreographed in a dance.<br/>Soon, though, a hazard emerges that is bigger than even her hard-won survival skills can handle. Alphonse, the local pimp, has his eye on her for his new girl—and what the johns don’t take he covets for himself. If Baby cannot learn to become her own salvation, his dark world threatens to claim her, body and soul.<br/>Channeling the artlessly affecting voice of her thirteen-year-old heroine with extraordinary accuracy and power, Heather O’Neill’s debut novel blew readers away when it was first published ten years ago. Now it’s sure to capture its next decade of readers as Baby picks her pathway along the edge of the abyss to arrive at a place of redemption, and of love.<br/>Featuring a new introduction from the author<br/>CBC Canada reads winner, Paragraphe Hugh MacLennan Prize for Fiction winner, Orange Prize for Fiction finalist, Governor General’s Literary Award finalist, International Impac Dublin Literary Award finalist<br/>Praise for Lullabies for Little Criminals<br/>“A vivid portrait of life on skid row.”—People<br/>“A nuanced, endearing coming-of-age novel you won’t want to miss.”—Quill And Quire<br/>“Vivid and poignant. . . . A deeply moving and troubling novel.”—The Independent (London)<br/>“O’Neill is a tragicomedienne par excellence. . . . You will not want to miss this tender depiction of some very mean streets.”—Montreal Review of Books", "language": "en", "image": "https: //images.isbndb.com/covers/50/77/9780060875077.jpg", "title_long": "Lullabies for Little Criminals", "edition": "First Edition", "dimensions": "Height: 8 Inches, Length: 5.3125 Inches, Weight: 0.6 Pounds, Width: 0.792793 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.3125}, "width": {"unit": "inches", "value": 0.792793}, "weight": {"unit": "pounds", "value": 0.6}, "height": {"unit": "inches", "value": 8}}, "pages": 330, "date_published": "2006-10-17", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Coming of Age', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Heather O'Neill'], 'title": "Lullabies for Little Criminals", "isbn13": "9780060875077", "msrp": 14.99, 'binding": "Paperback", "isbn": "0060875070", "isbn10": "0060875070"}}