{"book": {"publisher": "Harper Collins", "synopsis": "Seven years in the making, Sacred Games is an epic of exceptional richness and power. Vikram Chandra\"s novel draws the reader deep into the life of Inspector Sartaj Singh—and into the criminal underworld of Ganesh Gaitonde, the most wanted gangster in India.<br/>Sartaj, one of the very few Sikhs on the Mumbai police force, is used to being identified by his turban, beard and the sharp cut of his trousers. But "the silky Sikh" is now past forty, his marriage is over and his career prospects are on the slide. When Sartaj gets an anonymous tip-off as to the secret hide-out of the legendary boss of G-Company, he\'s determined that he\'ll be the one to collect the prize.<br/>Vikram Chandra\'s keenly anticipated new novel is a magnificent story of friendship and betrayal, of terrible violence, of an astonishing modern city and its dark side. Drawing inspiration from the classics of nineteenth-century fiction, mystery novels, Bollywood movies and Chandra\'s own life and research on the streets of Mumbai, Sacred Games evokes with devastating realism the way we live now but resonates with the intelligence and emotional depth of the best of literature.', 'language": "en", "image": "https: //images.isbndb.com/covers/03/59/9780061130359.jpg", "title_long": "Sacred Games", "edition": "1st", "dimensions": "Height: 9.25 Inches, Length: 6.12 Inches, Weight: 2.8 Pounds, Width: 1.97 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.12}, "width": {"unit": "inches", "value": 1.97}, "weight": {"unit": "pounds", "value": 2.8}, "height": {"unit": "inches", "value": 9.25}}, "pages": 916, "date_published": "2006-12-29", "subjects": ["Literature & Fiction', 'Genre Fiction', 'TV, Movie, Video Game Adaptations', 'United States', 'Literary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense', 'Crime', 'Self Service', 'Custom Stores'], 'authors": ["Vikram Chandra'], 'title": "Sacred Games", "isbn13": "9780061130359", "msrp": 27.95, "binding": "Hardcover", "isbn": "0061130354", "isbn10": "0061130354", "other_isbns": [{'isbn": "9780061807268", "binding": "printisbncanonical"}]}}