{"book": {"publisher": "The Business Library", "synopsis": "The widely adopted, now classic book on influence and persuasion—a major national and international bestseller with more than four million copies sold!<br/>In this highly acclaimed New York Times bestseller, Dr. Robert B. Cialdini—the seminal expert in the field of influence and persuasion—explains the psychology of why people say yes and how to apply these principles ethically in business and everyday situations.<br/>You’ll learn the six universal principles of influence and how to use them to become a skilled persuader—and, just as importantly, how to defend yourself against dishonest influence attempts: Reciprocation: The internal pull to repay what another person has provided us. Commitment and Consistency: Once we make a choice or take a stand, we work to behave consistently with that commitment in order to justify our decisions. Social Proof: When we are unsure, we look to similar others to provide us with the correct actions to take. And the more, people undertaking that action, the more we consider that action correct. Liking: The propensity to agree with people we like and, just as important, the propensity for others to agree with us, if we like them. Authority: We are more likely to say “yes” to others who are authorities, who carry greater knowledge, experience or expertise. Scarcity: We want more of what is less available or dwindling in availability.<br/>Understanding and applying the six principles ethically is cost-free and deceptively easy. Backed by Dr. Cialdini’s 35 years of evidence-based, peer-reviewed scientific research—as well as by a three-year field study on what moves people to change behavior—Influence is a comprehensive guide to using these principles effectively to amplify your ability to change the behavior of others.", "language": "en", "image": "https: //images.isbndb.com/covers/18/95/9780061241895.jpg", "title_long": "Influence: the Psychology of Persuasion", "edition": "2", "dimensions": "Weight: 0.63 Pounds", "dimensions_structured": {'weight": {"unit": "pounds", "value": 0.63}}, "pages": 336, "date_published": "1983", "subjects": ["Self-Help', 'Motivational', 'Success', 'Business & Money', 'Marketing & Sales', 'Consumer Behavior'], 'authors": ["PHD Robert B Cialdini'], 'title": "Influence: the Psychology of Persuasion", "isbn13": "9780061241895", "msrp": 18.99, "binding": "Paperback", "related": {"Kindle Edition": "0061899879", "eBook": "0061899879", "ePub": "0061899879"}, "isbn": "006124189X", "isbn10": "006124189X", "other_isbns": [{'isbn": "9780061899874", "binding": "print"}]}}