{"book": {"publisher": "Ecco", "synopsis": "<p>"Great art has dreadful manners," Simon Schama observes wryly at the start of his epic and explosive exploration of the power, and whole point, of art. "The hushed reverence of the gallery can fool you into believing masterpieces are polite things; visions that soothe, charm and beguile, but actually they are thugs. Merciless and wily, the greatest paintings grab you in a headlock, rough up your composure, and then proceed in short order to re-arrange your sense of reality. . . .'</p><br/><p>With the same disarming force, The Power of Art propels us on an eye-opening, breathtaking odyssey, zooming in on eight extraordinary masterpieces, from Caravaggio\'s David and Goliath to Picasso\'s Guernica. Jolting us far from the comfort zone of the hushed art gallery, Schama closes in on intense make-or-break turning points in the lives of eight great artists who, under extreme stress, created something unprecedented, altering the course of art forever.</p><br/><p>The embattled heroes—Caravaggio, Bernini, Rembrandt, David, Turner, Van Gogh, Picasso and Rothko—each in his own resolute way, faced crisis with steadfast defiance, pitting passion and conviction against scorn and short-sightedness. The masterpieces they created challenged convention, shattered complacency, shifted awareness and changed the way we look at the world.</p><br/><p>With vivid storytelling and powerfully evocative descriptive passages, Schama explores the dynamic personalities of the artists and the spirit of the times they lived through, capturing the flamboyant theatre of bourgeois life in Amsterdam, the passion and paranoia of Revolutionary Paris, and the carnage and pathos of Civil War Spain.</p><br/><p>Most compelling of all, The Power of Art traces the extraordinary evolution of eight 'eye-popping' world-class works of art. Created in a bolt of illumination, such works 'tell us something about how the world is, how it is to be inside our skins, that no more prosaic source of wisdom can deliver. And when they do that, they answer, irrefutably and majestically, the nagging question of every reluctant art-conscript . . . \'OK, OK, but what\'s art really for?\''</p>', 'language": "en", "image": "https: //images.isbndb.com/covers/61/04/9780061176104.jpg", "title_long": "The Power of Art", "edition": "1", "dimensions": "Height: 10.25 Inches, Length: 7.75 Inches, Weight: 3.5 Pounds, Width: 1.25 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.75}, "width": {"unit": "inches", "value": 1.25}, "weight": {"unit": "pounds", "value": 3.5}, "height": {"unit": "inches", "value": 10.25}}, "pages": 448, "date_published": "2006", "subjects": ["Arts & Photography', 'History & Criticism', 'Criticism', 'History'], 'authors": ["Simon Schama'], 'title": "The Power of Art", "isbn13": "9780061176104", "msrp": 55, 'binding": "Hardcover", "isbn": "0061176109", "isbn10": "0061176109"}}