{"book": {"publisher": "Zondervan", "synopsis": "Product Description<br/><br/>Prince Caspian is now repackaged in an unjacketed paper-over-board edition with black-and-white Pauline Baynes’ artwork in the interior and the iconic Chris Van Allsburg art on the cover.<br/><br/>From the Back Cover<br/><br/>Brand new editions of The Chronicles of Narnia!<br/>Prince Caspian is now repackaged in an unjacketed paper-over-board edition with black-and-white Pauline Baynes’ artwork in the interior and the iconic Chris Van Allsburg art on the cover.<br/><br/>About the Author<br/><br/>C. S. Lewis (1898-1963) was one of the intellectual giants of the twentieth century and arguably the most influential Christian writer of his day. He was a Fellow and Tutor in English literature at Oxford University until 1954 when he was unanimously elected to the Chair of Medieval and Renaissance English at Cambridge University, a position he held until his retirement. His major contributions in literary criticism, children’s literature, fantasy literature, and popular theology brought him international renown and acclaim. He wrote more than thirty books, allowing him to reach a vast audience, and his works continue to attract thousands of new readers every year. His most distinguished and popular accomplishments include The Chronicles of Narnia, Out of the Silent Planet, The Four Loves, The Screwtape Letters, and Mere Christianity.<br/><br/>Pauline Baynes illustrations for The Chronicles of Narnia span a remarkable career, beginning with The Lion, the Witch and the Wardrobe in 1949 and continuing with the hand-coloring of all seven books forty years later.", "language": "en", "image": "https: //images.isbndb.com/covers/52/56/9780061125256.jpg", "title_long": "Prince Caspian (paper-over-board): The Return to Narnia", "pages": 240, 'date_published": "2006", "subjects": ["Children's Books', 'Literature & Fiction', 'Religious Fiction', 'Action & Adventure', 'Classics', 'Science Fiction & Fantasy', 'Fantasy & Magic'], 'authors": ["C. S. Lewis'], 'title": "Prince Caspian (paper-over-board): The Return to Narnia", "isbn13": "9780061125256", "msrp": 11.99, 'binding": "Hardcover", "isbn": "0061125253", "isbn10": "0061125253"}}