{"book": {"publisher": "Harpercollins", "synopsis": "Some authors spin stories. Some create characters. And some bring into being entire universes that were never before dreamed. . . .<br/>In 1983 the literary world was surprised--and even shocked--when a paperback Dungeons and Dragons fantasy by an unknown author team rocketed to the top of the New York Times bestseller list and stayed there.<br/>With more than fifteen million copies of their books in print, Margaret Weis and Tracy Hickman have appeared on bestseller lists--including twelve New York Times bestsellers--ever since that first Dragonlance success, delighting, mystifying, intriguing, and above all, entertaining millions of readers with each new series of fantasy novels. Each series or cycle of their work is unique in that it brings into being an entire new universe, complete with its own creatures, history, geography and even physical (and magical) laws.<br/>This invaluable literary guide and companion introduces both the authors and their worlds. Extensive biographical interviews with both Weis and Hickman reveal their characters, their separate histories, their ongoing working relationship, their years at TSR and in the gaming world, and their subsequent success--including the legendary Traveling Road Show that helped establish their success.<br/>But the heart of this lavishly illustrated book is the worlds themselves. Realms of Dragons contains five separate, comprehensive, authoritative concordances--each complete from A to Z--that detail, explicate, explain, and often illustrate ever important character, event, element, and incident in every book in every series. It"s all here--from the sea-elf Apoletta (Dragons of Spring Dawning) to the loony old wizard Zafnib (Nightsword), from Death Gate to Dragonlance to Starshield.<br/>Weis and Hickman have taken their place with J.R.R. Tolkien, Robert Jordan, David Eddings, and Anne McCaffrey in the pantheon of modern fantasy. And this unique companion and guide illuminates their journey every step of the way.<br/>Lavishly illustrated, thoroughly annotated, and carefully documented, Realms of Dragons is an incomparable tribute to the bestselling fantasy team of all time--a beautiful keepsake fans new and old will treasure.", "language": "en", "image": "https: //images.isbndb.com/covers/23/92/9780061052392.jpg", "title_long": "Realms of Dragons: The Worlds of Weis and Hickman", "edition": "First Edition", "dimensions": "Height: 11.25 Inches, Length: 9 Inches, Weight: 2.6 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 9}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 2.6}, "height": {"unit": "inches", "value": 11.25}}, "pages": 218, "date_published": "1999", "subjects": ["Literature & Fiction', 'United States', 'Science Fiction & Fantasy', 'Fantasy'], 'authors": ["Margaret Weis', 'Tracy Hickman', 'Denise Little'], 'title": "Realms of Dragons: The Worlds of Weis and Hickman", "isbn13": "9780061052392", "msrp": 29.95, 'binding": "Hardcover", "isbn": "0061052396", "isbn10": "0061052396"}}