{"book": {"publisher": "Ecco", "synopsis": "Fifteen years ago, in 1975, Genna Hewett-Meade\"s college roommate died a mysterious, violent, terrible death. Minette Swift had been a fiercely individualistic scholarship student, an assertive—even prickly—personality, and one of the few black girls at an exclusive women\'s liberal arts college near Philadelphia. By contrast, Genna was a quiet, self-effacing teenager from a privileged upper-class home, self-consciously struggling to make amends for her own elite upbringing. When, partway through their freshman year, Minette suddenly fell victim to an increasing torrent of racist harassment and vicious slurs—from within the apparent safety of their tolerant,
        "enlightened" campus—Genna felt it her duty to protect her roommate at all costs.<br/>Now, as Genna reconstructs the months, weeks, and hours leading up to Minette\'s tragic death, she is also forced to confront her own identity within the social framework of that time. Her father was a prominent civil defense lawyer whose radical politics—including defending anti-war terrorists wanted by the FBI—would deeply affect his daughter\'s outlook on life, and later challenge her deepest beliefs about social obligation in a morally gray world.<br/>Black Girl / White Girl is a searing double portrait of 'black' and 'white,' of race and civil rights in post-Vietnam America, captured by one of the most important literary voices of our time.', 'language": "en", "image": "https: //images.isbndb.com/covers/56/45/9780061125645.jpg", "title_long": "Black Girl / White Girl", "edition": 1, "dimensions": "Height: 9.5 Inches, Length: 7 Inches, Weight: 1.05 Pounds, Width: 1.25 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7}, "width": {"unit": "inches", "value": 1.25}, "weight": {"unit": "pounds", "value": 1.05}, "height": {"unit": "inches", "value": 9.5}}, "pages": 272, "date_published": "2006-10-17", "subjects": ["Literature & Fiction', 'United States', 'Literary'], 'authors": ['Joyce Carol Oates'], 'title": "Black Girl / White Girl", "isbn13": "9780061125645", "msrp": "0.00", "binding": "Hardcover", "isbn": "0061125644", "isbn10": "0061125644"}}