{"book": {"publisher": "Harper", "synopsis": "From one of America’s leading reporters comes a deeply personal, extraordinarily powerful look at the most volatile crises he has witnessed around the world, from New Orleans to Baghdad and beyond.<br/>Dispatches from the Edge of the World is a book that gives us a rare up-close glimpse of what happens when the normal order of things is suddenly turned upside down, whether it’s a natural disaster, a civil war, or a heated political battle. Over the last year, few people have witnessed more scenes of chaos and conflict than Anderson Cooper, whose groundbreaking coverage on CNN has become the touchstone of twenty-first century journalism. This book explores in a very personal way the most important - and most dangerous - crises of our time, and the surprising impact they have had on his life.<br/><br/>From the devastating tsunami in South Asia to the suffering Niger, and ultimately Hurricane Katrina in New Orleans, Cooper shares his own experiences of traversing the globe, covering the world’s most astonishing stories. As a television journalist, he has the gift of speaking with an emotional directness that cuts through the barriers of the medium. In his first book, that passion communicates itself through a rich fabric of memoir and reportage, reflection and first-person narrative. Unflinching and utterly engrossing, this is the story of an extraordinary year in a reporter’s life.", "language": "en", "image": "https: //images.isbndb.com/covers/23/84/9780061132384.jpg", "title_long": "Dispatches from the Edge: A Memoir of War, Disasters, and Survival", "edition": "1", "dimensions": "Height: 9.25 Inches, Length: 6.75 Inches, Weight: 1.05 Pounds, Width: 0.75 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.75}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 1.05}, "height": {"unit": "inches", "value": 9.25}}, "pages": 224, "date_published": "2006-05-01", "subjects": ["Arts & Photography', 'Performing Arts', 'Biographies & Memoirs', 'Arts & Literature', 'Actors & Entertainers', 'Television Performers', 'Memoirs', 'Professionals & Academics', 'Journalists', 'Humor & Entertainment', 'Television', 'Reference', 'Writing, Research & Publishing Guides', 'Writing', 'Politics & Social Sciences', 'Social Sciences', 'Disaster Relief', 'Politics & Government'], 'authors": ["Anderson Cooper'], 'title": "Dispatches from the Edge: A Memoir of War, Disasters, and Survival", "isbn13": "9780061132384", "msrp": 24.95, 'binding": "Hardcover", "isbn": "0061132381", "isbn10": "0061132381"}}