{"book": {"publisher": "William Morrow", "synopsis": "The master of American fiction returns to the territory of his beloved classic, Dandelion Wine—a sequel 50 years in the making<br/>Some summers refuse to end . . .<br/>October 1st, the end of summer. The air is still warm, but fall is in the air. Thirteen-year-old Douglas Spaulding, his younger brother Tom, and their friends do their best to take advantage of these last warm days, rampaging through the ravine, tormenting the girls . . . and declaring war on the old men who run Green Town, IL. For the boys know that Colonel Quartermain and his cohorts want nothing more than to force them to put away their wild ways, to settle down, to grow up. If only, the boys believe, they could stop the clock atop the courthouse building. Then, surely, they could hold onto the last days of summer . . . and their youth.<br/>But the old men were young once, too. And Quartermain, crusty old guardian of the school board and town curfew, is bent on teaching the boys a lesson. What he doesn’t know is that before the last leaf turns, the boys will give him a gift: they will teach him the importance of not being afraid of letting go.", "language": "en", "image": "https: //images.isbndb.com/covers/15/47/9780061131547.jpg", "title_long": "Farewell Summer: A Novel", "edition": "1", "dimensions": "Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.75 Pounds, Width: 0.81 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.81}, "weight": {"unit": "pounds", "value": 0.75}, "height": {"unit": "inches", "value": 8.25}}, "pages": 224, "date_published": "2006-10-17", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Coming of Age', 'Action & Adventure', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Ray Bradbury'], 'title": "Farewell Summer: A Novel", "isbn13": "9780061131547", "msrp": 7.99, 'binding": "Hardcover", "isbn": "0061131547", "isbn10": "0061131547"}}