{"book": {"publisher": "Avon Books", "synopsis": "“Engrossing...The Pact is compelling reading.”—People<br/>In this heart-rending tale of love and friendship, Jodi Picoult brings to life a familiar world, and in a single terrifying moment awakens every parent’s worst fear: We think we know our children . . . but do we ever really know them at all?<br/>The Golds and the Hartes, neighbors for eighteen years, have always been inseparable. So have their children—and it’s no surprise that in high school Chris and Emily’s friendship blossoms into something more. But the bonds of family, friendship, and passion—which had seemed so indestructible—suddenly threaten to unravel in the wake of unimaginable tragedy.<br/>When midnight calls from the hospital come in, no one is ready for the truth. Emily is dead at seventeen from a gunshot wound to the head. There’s a single unspent bullet in the gun that Chris pilfered from his father’s cabinet—a bullet that Chris tells police he intended for himself. But a local detective has doubts about the suicide pact that Chris describes.<br/>This extraordinary, poignant novel paints an indelible portrait of two families in anguish . . . and creates an astonishingly suspenseful courtroom drama as Chris is put on trial for murder.", "language": "en", "image": "https: //images.isbndb.com/covers/01/42/9780061150142.jpg", "title_long": "The Pact", "edition": "Reprint", "dimensions": "Height: 6.75 Inches, Length: 4.1875 Inches, Weight: 0.55 Pounds, Width: 1.024 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 4.1875}, "width": {"unit": "inches", "value": 1.024}, "weight": {"unit": "pounds", "value": 0.55}, "height": {"unit": "inches", "value": 6.75}}, "pages": 496, "date_published": "2006", "subjects": ["Literature & Fiction', 'Women's Fiction', 'Domestic Life', 'Literary'], 'authors": ["Jodi Picoult'], 'title": "The Pact", "isbn13": "9780061150142", "msrp": 7.99, "binding": "Paperback", "related": {"Kindle Edition": "0061980242", "ePub": "0061980242"}, "isbn": "0061150142", "isbn10": "0061150142", "other_isbns": [{'isbn": "9780061980244", "binding": "print"}]}}