{"book": {"publisher": "Collins Reference", "synopsis": "Brewer"s Dictionary of Phrase and Fable is one of the world"s best-loved reference books. First published in 1870, this treasury of "words that have a story to tell' has established itself as one of the great reference classics—the first port of call for tens of thousands of terms, phrases and proper names, and a fund of fascinating, unusual and out-of-the-way information.<br/>At the heart of the dictionary lie entries on the meaning and origin of a vast range of words and expressions, from everyday English phrases to Latin tags. Alongside these are articles on people and events in mythology and religion, and on folk customs, superstitions and beliefs. Major events and people in history are also treated, as are movements in art and literature, famous literary characters, and key aspects of popular culture, philosophy, geography, science and magic. To complete this rich mix of information, Brewer and his subsequent editors have added an extraordinary and enticing miscellany of general knowledge—lists of patron saints, terms in heraldry, regimental nicknames, public house names, the principal English horse-races and famous last words.<br/>For the Seventeenth Edition of Brewer's the entire existing text has been revised and updated and more than 1500 new articles added. These include: words and phrases (best thing since sliced bread, bling, where the bodies are buried); characters and places from fantasy literature and film (Gollum, Hogwarts, Obi-Wan Kenobi, Voldemort); political, celebrity and sporting nicknames (Butcher of Baghdad; Dubya); miscellaneous arcana (Chorasmian Waste, dilligrout, dwile flonking).<br/>This first new Brewer's of the 21st century maintains and respects the book's 135-year-old tradition, while offering a wealth of fascinating new material to reflect the 'phrase and fable' of a changing world.', 'language": "en", "image": "https: //images.isbndb.com/covers/12/03/9780061121203.jpg", "title_long": "Brewer"s Dictionary of Phrase and Fable, Seventeenth Edition", 'edition": "17", "dimensions": "Height: 9.25 Inches, Length: 7.25 Inches, Weight: 4.6 Pounds, Width: 2.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.25}, "width": {"unit": "inches", "value": 2.5}, "weight": {"unit": "pounds", "value": 4.6}, "height": {"unit": "inches", "value": 9.25}}, "pages": 1326, "date_published": "2006-08-15", "subjects": ["Literature & Fiction', 'History & Criticism', 'Reference', 'Dictionaries & Thesauruses', 'Thesauruses', 'Dictionaries', 'Encyclopedias & Subject Guides', 'Literature', 'Words, Language & Grammar', 'Etymology', 'Linguistics'], 'authors": ["John Ayto'], 'title": "Brewer"s Dictionary of Phrase and Fable, Seventeenth Edition", 'isbn13": "9780061121203", "msrp": 34.69, 'binding": "Hardcover", "isbn": "0061121207", "isbn10": "0061121207"}}