{"book": {"publisher": "Harper Perennial", "synopsis": "From the New York Times bestselling author of The House of the Spirits, Isabelle Allende, comes a passionate tale of one young woman"s quest to save her lover set against the chaos of the 1849 California Gold Rush.<br/><br/>Orphaned at birth, Eliza Sommers is raised in the British colony of Valparaíso, Chile, by the well-intentioned Victorian spinster Miss Rose and her more rigid brother Jeremy. Just as she meets and falls in love with the wildly inappropriate Joaquín Andieta, a lowly clerk who works for Jeremy, gold is discovered in the hills of northern California. By 1849, Chileans of every stripe have fallen prey to feverish dreams of wealth. Joaquín takes off for San Francisco to seek his fortune, and Eliza, pregnant with his child, decides to follow him.<br/>As Eliza embarks on her perilous journey north in the hold of a ship and arrives in the rough-and-tumble world of San Francisco, she must navigate a society dominated by greedy men. But Eliza soon catches on with the help of her natural spirit and a good friend, the Chinese doctor Tao Chi’en. What began as a search for love ends up as the conquest of personal freedom.<br/>A marvel of storytelling, Daughter of Fortune confirms once again Isabel Allende"s extraordinary gift for fiction and her place as one of the world"s leading writers.', 'language": "en", "image": "https: //images.isbndb.com/covers/02/51/9780061120251.jpg", "title_long": "Daughter of Fortune: A Novel", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.3125 Inches, Weight: 0.75 Pounds, Width: 0.972973 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.3125}, "width": {"unit": "inches", "value": 0.972973}, "weight": {"unit": "pounds", "value": 0.75}, "height": {"unit": "inches", "value": 8}}, "pages": 432, "date_published": "2006-05-02", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'United States', 'Literary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense', 'Self Service', 'Custom Stores'], 'authors": ["Isabel Allende'], 'title": "Daughter of Fortune: A Novel", "isbn13": "9780061120251", "msrp": 16.99, 'binding": "Paperback", "isbn": "0061120251", "isbn10": "0061120251"}}