{"book": {"publisher": "William Morrow Paperbacks", "synopsis": "Welcome to Salt Lick, Texas, home of big hair,<br/>big ranches, and two of the biggest busybodies ever<br/>to wield a blow-dryer—Debbie Sue and Edwina,<br/>also known as the Domestic Equalizers. Their motto:<br/>Don"t run over him—get over him! Their mission:<br/>Track down and expose your straying man. And they<br/>won"t stop until female domestic justice is served.<br/>Debbie Sue Overstreet and Edwina Perkins-Martin have never encountered a problem that couldn"t be fixed with a strong margarita, a whole lot of hairspray, and an ear for gossip. They've learned that you'll only find a straying spouse—or solve a crime—by keeping your senses alert. After all, every red-blooded Texas woman knows ears are more than just a place to hang your diamond earrings!<br/>Newcomers stand out in Salt Lick like a preacher in a liquor store, and all ears—and eyes—are on Paige McBride and Spur Atwater. Paige arrived in town with nothing more than two hundred dollars in her pocket and a Cadillac SUV packed with designer clothes. Her oil-rich daddy has cut her off without a penny and now it's time for her to get one of those real jobs.<br/>The Domestic Equalizers know that Paige and her Barbie-doll looks are gonna stir things up. Soon every cowboy, trucker, and even one of Debbie Sue's ex-boyfriends, a rodeo star, is knocking on Paige's door. And, at just about the time she turns up to start her job tending the best cutting horses in Texas, the horses start disappearing from all the local ranches.<br/>Paige discovers she actually likes her work. After all, horses are more loyal than most men. But she doesn't like Spur, the new town veterinarian. Besides being movie-star good-looking, Spur's an ex–football star. Women of all ages love the new vet, and suddenly, more cats and dogs are getting sick than ever before.<br/>Working on the ranch means Paige can't avoid the man, and all those disappearing horses bring her together with the Domestic Equalizers. Edwina and Debbie Sue think that Spur and Paige make the cutest couple—whether they're too bull-headed to realize it or not. But finding themselves knee-deep in the muck of a horse-thievin' and husband-cheatin' escapade is a whole other issue. No doubt about it, hearts are definitely going to get broken, but if these gals have anything to do with it, the hairstyles around town are still gonna look great!', 'language": "en", "image": "https: //images.isbndb.com/covers/42/34/9780061134234.jpg", "title_long": "My Heart May Be Broken, but My Hair Still Looks Great (Domestic Equalizers, 2)", "edition": "Reprint", "dimensions": "Height: 0.77 Inches, Length: 7.96 Inches, Weight: 0.43 Pounds, Width: 5.38 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.96}, "width": {"unit": "inches", "value": 5.38}, "weight": {"unit": "pounds", "value": 0.43}, "height": {"unit": "inches", "value": 0.77}}, "pages": 336, "date_published": "2006-08-29", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Feel-Good', 'Women's Fiction', 'Contemporary', 'United States', 'Humor', 'Humor & Satire', 'Humorous', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Romance', 'Romantic Comedy', 'Self Service', 'Custom Stores'], 'authors": ["Dixie Cash'], 'title": "My Heart May Be Broken, but My Hair Still Looks Great (Domestic Equalizers, 2)", "isbn13": "9780061134234", "msrp": 12.95, "binding": "Paperback", "related": {"ePub": "0061762687"}, "isbn": "0061134236", "isbn10": "0061134236", "other_isbns": [{'isbn": "9780061762680", "binding": "print"}]}}