{"book": {"publisher": "HarperAudio", "synopsis": "Buckle your seat belts. Number-one New York Times bestselling author Janet Evanovich is moving into the fast lane with Metro Girl, a thrilling, high-octane misadventure with high stakes, hot nights, cold-blooded murder, sunken treasure, a woman with a chassis built for speed, and one very good, very sexy NASCAR driver who\"s along for the ride.<br/>"Wild" Bill Barnaby\'s dropped off the face of the earth and big sister Alex heads for Miami, Bill\'s last known sighting, on a harrowing hunt to save her brother...and maybe the world. Alex blasts through the bars of South Beach and points her search south to Key West and Cuba, laying waste to Miami hit men, dodging Palmetto bugs big enough to eat her alive, and putting the pedal to the metal with NASCAR driver Sam Hooker. Engaged in a deadly race, Wild Bill\'s 'borrowed' Hooker\'s sixty-five-foot Hatteras and sailed off into the sunset...just when Hooker has plans for the boat. Hooker figures he\'ll attach himself to Alex and maybe run into scumbag Bill. The race to the finish is hot and hard.<br/>Performed by C. J. Critt', 'language": "en", "image": "https: //images.isbndb.com/covers/65/29/9780061126529.jpg", "title_long": "Metro Girl (Alex Barnaby Series, No. 1)", "edition": "5", "dimensions": "Height: 0.78 Inches, Length: 5.82 Inches, Weight: 0.32 Pounds, Width: 5.3 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.82}, "width": {"unit": "inches", "value": 5.3}, "weight": {"unit": "pounds", "value": 0.32}, "height": {"unit": "inches", "value": 0.78}}, "pages": 6, "date_published": "2006-08-01", "subjects": ["Literature & Fiction', 'Contemporary', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Thrillers & Suspense', 'Self Service', 'Custom Stores'], 'authors": ["Janet Evanovich'], 'title": "Metro Girl (Alex Barnaby Series, No. 1)", "isbn13": "9780061126529", "msrp": 14.95, 'binding": "Audio CD", "isbn": "0061126527", "isbn10": "0061126527"}}