{"book": {"publisher": "Harper", "synopsis": "Another brilliant installment in Terry Pratchett\"s acclaimed Discworld series, "The novel exudes the curious feel of old-fashioned vampire and Frankenstein legends. . . . Pratchett lampoons everything from Christian superstition to Swiss Army knives here, proving that the fantasy satire of Discworld \"still ate\'nt dead.\'' — Publishers Weekly<br/>King Verence, in a fit of enlightened democracy and ebullient goodwill, invites Uberwald\'s undead, the Magpyrs, into Lancre to celebrate the birth of his daughter. But everyone knows you don\'t invite vampires into your house, even stylish, sophisticated ones with fancy waistcoats — unless you want permanent guests. Once ensconced within the castle, these wine-drinking, garlic-eating, sun-loving modern vampires have no intention of leaving . . . ever. Standing between the Magpyr family and Lancre are a coven of four: Granny Weatherwax, Nanny Ogg, Magrat, and young Agness. And as the Lancre living are about to discover, there\'s only one way to fight. Go for the throat, or as the vampyres themselves say . . . Carpe Jugulum!<br/>The Discworld novels can be read in any order but Carpe Jugulum is the sixth in the Witches collection. The Witches includes: Equal Rites Wyrd Sisters Witches Abroad Lords and Ladies Maskerade Carpe Jugulum', 'language": "en", "image": "https: //images.isbndb.com/covers/15/86/9780061051586.jpg", "title_long": "Carpe Jugulum: A Novel of Discworld", "edition": "First Edition", "dimensions": "Height: 9.25 Inches, Length: 6.12 Inches, Weight: 1.156875 Pounds, Width: 1.01 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.12}, "width": {"unit": "inches", "value": 1.01}, "weight": {"unit": "pounds", "value": 1.156875}, "height": {"unit": "inches", "value": 9.25}}, "pages": 304, "date_published": "1999-09-08", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Action & Adventure', 'Fantasy', 'Romance', 'Historical', 'Ancient World', 'Science Fiction & Fantasy', 'Epic', 'Humorous', 'Romantic', 'Science Fiction'], 'authors": ["Terry Pratchett'], 'title": "Carpe Jugulum: A Novel of Discworld", "isbn13": "9780061051586", "msrp": 24, 'binding": "Hardcover", "isbn": "0061051586", "isbn10": "0061051586"}}