{"book": {"publisher": "Librería Mexico", "synopsis": "El Alquimista, de Paulo Coelho, sigue cambiando la vida de sus lectores para siempre. Con más de dos millones de copias vendidas alrededor del mundo, El Alquimista se ha establecido como un clásico moderno, admirado universalmente.<br/>La obra maestra de Paulo Coelho cuenta la mágica historia de Santiago, un joven pastor andaluz que anhela viajar en busca de un tesoro valioso, el más extravagante que jamás alguien haya encontrado.<br/>La historia de los tesoros que Santiago encuentra en su camino nos enseña, como sólo pocas historias pueden, sobre de la sabiduría esencial de escuchar nuestro corazón, aprender a leer los presagios esparcidos a lo largo del camino de la vida y, sobre todo, a perseguir nuestros sueños.<br/><br/>The Alchemist by Paulo Coelho continues to change the lives of its readers forever. With more than two million copies sold around the world, The Alchemist has established itself as a modern classic, universally admired.<br/>Paulo Coelho"s masterpiece tells the magical story of Santiago, an Andalusian shepherd boy who yearns to travel in search of a worldly treasure as extravagant as any ever found.<br/>The story of the treasures Santiago finds along the way teaches us, as only a few stories can, about the essential wisdom of listening to our hearts, learning to read the omens strewn along life"s path, and, above all, following our dreams.", 'language": "es", "image": "https: //images.isbndb.com/covers/14/09/9780062511409.jpg", "title_long": "LA ALQUIMISTA", "edition": "Spanish-language Edition", "dimensions": "Height: 0.49999999949 Inches, Length: 0.393700787 Inches, Weight: 0.15 Pounds, Width: 0.393700787 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 0.393700787}, "width": {"unit": "inches", "value": 0.393700787}, "weight": {"unit": "pounds", "value": 0.15}, "height": {"unit": "inches", "value": 0.49999999949}}, "pages": 192, "date_published": "2013", "subjects": ["Christian Books & Bibles', 'Christian Living', 'Self Help', 'Worship & Devotion', 'Meditations', 'Literature & Fiction', 'World Literature', 'European', 'Literary', 'Reference', 'Foreign Language Study & Reference'], 'authors": ["paulo-coelho'], 'title": "LA ALQUIMISTA", "isbn13": "9780062511409", "msrp": 10.98, 'binding": "Paperback", "isbn": "0062511408", "isbn10": "0062511408"}}