{"book": {"publisher": "Collins", "synopsis": "A lavishly illustrated, rollicking account of the real people and events that inspired the Beatles\" lyrics.<br/>Who was "just seventeen" and made Paul\'s heart go 'boom'? Was there really an Eleanor Rigby? Where\'s Penny Lane? In A Hard Day\'s Write, music journalist Steve Turner shatters many well-worn myths and adds a new dimension to the Fab Four\'s rich legacy by investigating for the first time the ordinary people and events immortalized in the Beatles\' music and now occupying a special niche in popular culture\'s collective imagination.<br/>Arranged chronologically by album, the book breaks new ground by exploring how private incidents influenced the group\'s writing and how their music evolved. Turner reveals that Lucy in the Sky with Diamonds was really a drawing by Julian Lennon of his childhood friend; Bungalow Bill was an all-American tiger hunter; Doctor Robert was a New York \'speech doctor\'; and much more. A longtime Beatles admirer, Turner tracked down and interviewed the real-life subjects of the songs, probed public records and newspaper archives, and spoke in depth to the people closet to the Beatles to unearth tales that have never before been made public. The result is a book that chronicles an untold story of the Beatles themselves.<br/>Illustrated with over 200 photographs, A Hard Day\'s Write is a visually alluring and highly entertaining journey to the land stretching just beneath your conscious mind, mapped out with strawberry fields, fool-topped hills, and long and winding roads.', 'language": "en", "image": "https: //images.isbndb.com/covers/69/87/9780062736987.jpg", "title_long": "A Hard Day"s Write, Revised Edition: The Stories Behind Every Beatles" Song', 'edition": "Revised", "dimensions": "Height: 11.25 Inches, Length: 0.5 Inches, Weight: 1.8 Pounds, Width: 8.75 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 0.5}, "width": {"unit": "inches", "value": 8.75}, "weight": {"unit": "pounds", "value": 1.8}, "height": {"unit": "inches", "value": 11.25}}, "pages": 224, "date_published": "1999-11-01", "subjects": ["Arts & Photography', 'Music', 'Reference', 'Theory, Composition & Performance', 'Encyclopedias & Subject Guides'], 'authors": ['Steve Turner'], 'title": "A Hard Day"s Write, Revised Edition: The Stories Behind Every Beatles" Song', 'isbn13": "9780062736987", "msrp": "0.00", "binding": "Paperback", "isbn": "0062736981", "isbn10": "0062736981"}}