{"book": {"publisher": "Greenwillow Books", "synopsis": "This entrancing classic fantasy novel is filled with surprises at every turn. An international bestseller, this much-loved book is the source for the Academy Award nominee for Best Animated Feature.<br/>Sophie has the great misfortune of being the eldest of three daughters, destined to fail miserably should she ever leave home to seek her fate. But when she unwittingly attracts the ire of the Witch of the Waste, Sophie finds herself under a horrid spell that transforms her into an old lady. Her only chance at breaking it lies in the ever-moving castle in the hills: the Wizard Howl\"s castle.<br/>To untangle the enchantment, Sophie must handle the heartless Howl, strike a bargain with a fire demon, and meet the Witch of the Waste head-on. Along the way, she discovers that there\"s far more to Howl—and herself—than first meets the eye.<br/>In this giant jigsaw puzzle of a fantasy, people and things are never quite what they seem. Destinies are intertwined, identities exchanged, lovers confused. The Witch has placed a spell on Howl. Does the clue to breaking it lie in a famous poem? And what will happen to Sophie Hatter when she enters Howl\"s castle?<br/>All fans of classic fantasy books deserve the pleasure of reading those by Diana Wynne Jones, whose acclaim included the World Fantasy Award for Life Achievement. As Neil Gaiman stated, she was 'quite simply the best writer for children of her generation.'<br/>The three books in the World of Howl are: Howl\'s Moving Castle Castle in the Air House of Many Ways<br/>Other beloved series from Dianna Wynne Jones include the Chronicles of Chrestomanci and the Dalemark Quartet.', 'language": "en", "image": "https: //images.isbndb.com/covers/03/42/9780064410342.jpg", "title_long": "Howl"s Moving Castle (World of Howl, 1)", 'edition": "Reprint", "dimensions": "Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.35 Pounds, Width: 0.84 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.19}, "width": {"unit": "inches", "value": 0.84}, "weight": {"unit": "pounds", "value": 0.35}, "height": {"unit": "inches", "value": 6.75}}, "pages": 336, "date_published": "2001-08-07", "subjects": ["Teen & Young Adult', 'Literature & Fiction', 'Humorous', 'Science Fiction & Fantasy', 'Fantasy'], 'authors": ["Diana Wynne Jones'], 'title": "Howl"s Moving Castle (World of Howl, 1)", 'isbn13": "9780064410342", "msrp": "0.00", "binding": "Mass Market Paperback", "isbn": "006441034X", "isbn10": "006441034X", "other_isbns": [{'isbn": "9780062244512", "binding": "print"}]}}