{"book": {"publisher": "HarperCollins Publishers", "synopsis": "“Kids, young and old, fall in love with math when they see how real-life and effortless it becomes thanks to these books.” --Kimberly D. Mueller, Ed.D., First Grade Teacher, Ashbrook School, Lumberton NJ<br/>Which bug is the biggest? Which bug is the longest? It"s time to find out as all the bugs in Ladybug"s garden line up for the best bug parade! This fun book written by Stuart J. Murphy and illustrated by Holly Keller introduces size comparison in its simplest form.<br/>Kids will love the story and the illustrations. Parents and educators will love how the story and pictures make understanding the math concepts a breeze—as well as the concrete examples of how math works. The book contains activities for adults to do with kids to extend math into their own lives.<br/>Math skills are life skills, and the MathStart series supports success! This award-winning series by Stuart J. Murphy teaches math through stories and visual models 63 books divided into three levels with 21 books in each Fun activities kids will love are included to help parents and teachers emphasize the lessons Engaging and relatable stories, with each story revolving around practical applications of the math concept presented Lively art from top-notch illustrators Charts and other visual representations help children understand how the math works and promote deeper comprehension<br/>MathStart"s unique combination of stories, illustrations, and visual models helps teachers and parents in the teaching of math and provides all children with the opportunity to succeed.<br/>The math concepts taught in MathStart books conform to state and national standards. Level 1 is Pre-K–Kindergarten; Level 2 is Grades 1–3; Level 3 is Grades 2–4. The series follows math topics across grades so there is a foundational path to learning that runs through the levels.<br/>Help kids with their math skills plus their reading skills with the engaging and fun MathStart series!', 'language": "en", "image": "https: //images.isbndb.com/covers/70/01/9780064467001.jpg", "title_long": "HarperCollins The Best Bug Parade MathStart Comparing Sizes - Paperback", "edition": "1972nd ed.", "dimensions": "Height: 0.25 Inches, Length: 10 Inches, Weight: 0.35 Pounds, Width: 8 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 10}, "width": {"unit": "inches", "value": 8}, "weight": {"unit": "pounds", "value": 0.35}, "height": {"unit": "inches", "value": 0.25}}, "pages": 40, "date_published": "1996", "subjects": ["Children's Books', 'Animals', 'Bugs & Spiders', 'Literature & Fiction', 'Chapter Books & Readers', 'Education & Reference', 'Math'], 'authors": ["Harpercollins Publishers, Harpercrest Stuart J. Murphy'], 'title": "HarperCollins The Best Bug Parade MathStart Comparing Sizes - Paperback", "isbn13": "9780064467001", "msrp": 5.99, 'binding": "Paperback", "isbn": "0064467007", "isbn10": "0064467007"}}