{"book": {"publisher": "HarperCollins", "synopsis": "The delightful classic by E. B. White, author of Charlotte\"s Web and Stuart Little, about overcoming obstacles and the joy of music.<br/>Like the rest of his family, Louis is a trumpeter swan. But unlike his four brothers and sisters, Louis can\"t trumpet joyfully. In fact, he can\"t even make a sound. And since he can\'t trumpet his love, the beautiful swan Serena pays absolutely no attention to him.<br/>Louis tries everything he can think of to win Serena\'s affection—he even goes to school to learn to read and write. But nothing seems to work. Then his father steals him a real brass trumpet. Is a musical instrument the key to winning Louis his love?<br/>'We, and our children, are lucky to have this book.' —John Updike<br/>The Trumpet of the Swan joins E. B. White favorites Charlotte\'s Web and Stuart Little as classic illustrated novels that continue to speak to today\'s readers. Whether you curl up with your young reader to share these books or hand them off for independent reading, you are helping to create what are likely to be all-time favorite reading memories.', 'language": "en", "image": "https: //images.isbndb.com/covers/86/77/9780064408677.jpg", "title_long": "The Trumpet of the Swan 50th Anniversary", "edition": "Collectors,Anniversary", "dimensions": "Height: 7.25 Inches, Length: 5 Inches, Weight: 0.3968320716 Pounds, Width: 0.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 0.5}, "weight": {"unit": "pounds", "value": 0.3968320716}, "height": {"unit": "inches", "value": 7.25}}, "pages": 272, "date_published": "2020-09-01", "subjects": ["Children's Books', 'Animals', 'Birds', 'Classics', 'Self Service', 'Custom Stores'], 'authors": ["E. B White'], 'title": "The Trumpet of the Swan 50th Anniversary", "isbn13": "9780064408677", "msrp": 3.88, "binding": "Paperback", "isbn": "0064408671", "isbn10": "0064408671", "other_isbns": [{'isbn": "9780062406804", "binding": "print"}]}}