{"book": {"publisher": "Harper Business", "synopsis": "Are the people who report to you giving you their best? Is each individual on your team performing to his or her fullest potential?<br/>For more than thirty years, renowned business consultant and bestselling author Ken Blanchard and legendary NFL coach Don Shula have motivated teams to peak performances. In their classic, authoritative work on coaching, Everyone\"s a Coach, they distilled their rich collective experience down to its key elements and shared their secrets for inspiring others to greatness.<br/>Now, by popular demand, Blanchard and Shula have created The Little Book of Coaching, capturing the essence of their classic in this indispensable motivational gem--a gift to their readers and fans.<br/>At the heart of this book is a simple acronym that describes the qualities of an effective leader:<br/>Conviction-driven--Never compromise your beliefs<br/>Overlearning--Practice until it\"s perfect<br/>Audible-ready--Know when to change<br/>Consistency--Respond predictably to performance<br/>Honesty-based--Walk your talk<br/>Using a highly effective "tag-team' approach, Blanchard and Shula impart the five leadership secrets behind this acronym. Shula tells you how each coaching concept worked on the field, and then Blanchard explains how you can apply each strategy in a leadership situation.<br/>Instructive and inspirational, The Little Book of Coaching is the essential handbook that will teach you how to unleash excellence in anyone.', 'language": "en", "image": "https: //images.isbndb.com/covers/10/36/9780066621036.jpg", "title_long": "The Little Book of Coaching: Motivating People to Be Winners", "edition": "1", "dimensions": "Height: 7.5 Inches, Length: 5.5 Inches, Weight: 0.48 Pounds, Width: 0.57 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.57}, "weight": {"unit": "pounds", "value": 0.48}, "height": {"unit": "inches", "value": 7.5}}, "pages": 128, "date_published": "2001-01-23", "subjects": ["Business & Money', 'Business Culture', 'Motivation & Self-Improvement', 'Management & Leadership', 'Leadership & Motivation', 'Motivational', 'Human Resources', 'Human Resources & Personnel Management', 'Sports & Outdoors'], 'authors": ["Ken Blanchard', 'Don Shula'], 'title": "The Little Book of Coaching: Motivating People to Be Winners", "isbn13": "9780066621036", "msrp": 17.99, 'binding": "Hardcover", "isbn": "0066621038", "isbn10": "0066621038"}}