{"book": {"publisher": "McGraw-Hill Education", "synopsis": "A Seven-step Approach To Handling Difficult Conversations With Confidence And Skill. Crucial Conversations Are Interpersonal Exchanges At Work Or At Home That We Dread Having But Know We Cannot Avoid. How Do You Say What Needs To Be Said While Avoiding An Argument With A Boss, Child, Or Relationship Partner? This Book Offers Readers A Proven Seven-point Strategy For Achieving Their Goals In All Those Emotionally, Psychologically, Or Legally Charged Situations That Can Arise In Their Professional And Personal Lives. Based On The Authors" Dialoguesmart Training Seminars, The Techniques Are Geared Toward Getting People To Lower Their Defenses, Creating Mutual Respect And Understanding, Increasing Emotional Safety, And Encouraging Freedom Of Expression. Among Other Things, Readers Also Learn About The Four Main Factors That Characterize Crucial Conversations, And They Get A Six-minute Mastery Technique That Prepares Them To Work Through Any High-impact Situation With Confidence.--from Publisher Description. What"s A Crucial Conversation?: And Who Cares? -- Mastering Crucial Conversations: The Power Of Dialogue -- Start With Heart: How To Stay Focused On What You Really Want -- Learn To Look: How To Notice When Safety Is At Risk -- Make It Safe: How To Make It Safe To Talk About Almost Anything -- Master My Stories: How To Stay In Dialogue When You"re Angry, Scared, Or Hurt -- State My Path: How To Speak Persuasively, Not Abrasively -- Explore Others' Paths: How To Listen When Others Blow Up Or Clam Up -- Move To Action: How To Turn Crucial Conversations Into Action And Results -- Putting It All Together: Tools For Preparing And Learning -- Yeah, But: Advice For Tough Cases -- Change Your Life: How To Turn Ideas Into Habits. Kerry Patterson ... [et Al.]. Includes Bibliographical References (p. 229) And Index.', 'language": "en", "image": "https: //images.isbndb.com/covers/19/44/9780071401944.jpg", "title_long": "Find Your Courage: 12 Acts for Becoming Fearless at Work and in Life", "edition": "1", "dimensions": "Height: 8.8 Inches, Length: 6.2 Inches, Weight: 0.95680621708 Pounds, Width: 0.7 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.2}, "width": {"unit": "inches", "value": 0.7}, "weight": {"unit": "pounds", "value": 0.95680621708}, "height": {"unit": "inches", "value": 8.8}}, "pages": 320, "date_published": "2009", "subjects": ["Self-Help', 'Motivational', 'Success', 'Business & Money', 'Management & Leadership', 'Training'], 'authors": ["Margie Warrell'], 'title": "Find Your Courage: 12 Acts for Becoming Fearless at Work and in Life", "isbn13": "9780071401944", "msrp": 16.95, 'binding": "Paperback", "isbn": "0071401946", "isbn10": "0071401946"}}