{"book": {"publisher": "McGraw-Hill Science/Engineering/Math", "synopsis": "With complete coverage of the basic principles of heat transfer and a broad range of applications in a flexible format, Heat and Mass Transfer: A Practical Approach provides the perfect blend of fundamentals and applications. The text provides a highly intuitive and practical understanding of the material by emphasizing the physics and the underlying physical phenomena involved. Key: Text covers the standard topics of heat transfer with an emphasis on physics and real-world every day applications, while de-emphasizing the intimidating heavy mathematical aspects. This approach is designed to take advantage of students" intuition, making the learning process easier and more engaging. Key: The new edition will add helpful web-links for students. Key: 50% of the Homework Problems including design, computer, essay, lab-type, and FE problems are new or revised to this edition. Using a reader-friendly approach and a conversational writing style, the book is self-instructive and entertains while it teaches. It shows that highly technical matter can be communicated effectively in a simple yet precise language.", "language": "en", "image": "https: //images.isbndb.com/covers/03/59/9780073250359.jpg", "title_long": "Heat and Mass Transfer: A Practical Approach w/ EES CD", "edition": "3", "dimensions": "Height: 10 Inches, Length: 8.25 Inches, Weight: 4.05 Pounds, Width: 1.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.25}, "width": {"unit": "inches", "value": 1.5}, "weight": {"unit": "pounds", "value": 4.05}, "height": {"unit": "inches", "value": 10}}, "pages": 928, "date_published": "2006-01-04", "subjects": ["Engineering & Transportation', 'Engineering', 'Civil & Environmental', 'Mechanical', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Cengel,Yunus'], 'title": "Heat and Mass Transfer: A Practical Approach w/ EES CD", "isbn13": "9780073250359", "msrp": 82.65, 'binding": "Hardcover", "isbn": "007325035X", "isbn10": "007325035X"}}