{"book": {"publisher": "Vintage/Ebury (A Division of Random House Group)", "synopsis": "Talk about truth in advertising! Irvine Welsh\"s novel about an evil Edinburgh cop is filthy enough to please the most crud-craving fans of his blockbuster debut, Trainspotting . Like Trainspotting , Filth matches its nastiness with a maniacal, deeply peeved sense of humor. Though one does feel the need to escape this train wreck of a narrative from time to time for a shower and some chamomile tea, just as often Welsh provokes a belly laugh with an extraordinarily perverse and cruelly funny set piece. Nicely violent turns of phrase litter the ghastly landscape of his tale. Our hero, Detective Sergeant Bruce Robertson, is a cross between Harvey Keitel in Bad Lieutenant and John Belushi in Animal House . His task is to nab a killer who has brained the son of the Ghanaian ambassador, but bigoted Bruce is more urgently concerned with coercing sex from teenage Ecstasy dealers, planning vice tours of Amsterdam, and mulling over his lurid love life. He\"s also got a tapeworm, whose monologue is printed right down the middle of many pages. Here\"s one of this unusually articulate parasite\'s 'My problem is that I seem to have quite a simple biological structure with no mechanism for the transference of all my grand and noble thoughts into fine deeds.' Welsh\'s real strength is comic tough talk and inventive slang. The murder mystery helps organize his tendency to sprawl, but the engine of his art is wry, harsh dialogue. At one point, his books hogged the entire top half of Scotland\'s Top Ten Bestsellers list--and half the buyers of Trainspotting had never bought a book before. The reason is not that Welsh is the best novelist who ever got short-listed for the Booker Prize. It is that he is that rarest of phenomena, an original voice. --Tim Appelo', 'language": "en", "image": "https: //images.isbndb.com/covers/42/91/9780099284291.jpg", "title_long": "Filth", "dimensions": "Height: 7.00786 Inches, Length: 4.37007 Inches, Weight: 0.5291094288 Pounds, Width: 1.25984 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.37007}, "width": {"unit": "inches", "value": 1.25984}, "weight": {"unit": "pounds", "value": 0.5291094288}, "height": {"unit": "inches", "value": 7.00786}}, "pages": 400, "date_published": "1999-07-01", "subjects": ["Literature & Fiction', 'Contemporary'], 'authors": ['Irvine Welsh'], 'title": "Filth", "isbn13": "9780099284291", "msrp": "0.00", "binding": "Paperback", "isbn": "0099284294", "isbn10": "0099284294"}}