{"book": {"publisher": "Vintage", "synopsis": ""Fury" is a wickedly brilliant and pitch-black comedy about a middle-aged professor who finds himself in New York City in the summer of 2000. Not since, the Bombay of "Midnight\'s Children' have a time and place been so intensely and accurately captured in a novel. 'Fury' opens on a New York living at breakneck speed in an age of unprecedented decadence. Malik Solanka, a Cambridge-educated self-made millionaire originally from Bombay, arrives looking, perversely, for escape. This former philosophy professor is the inventor of the hugely popular doll, Little Brain, whose multiform ubiquity - as puppet, cartoon and masked woman - now rankles with him. He becomes frustratingly estranged from his own creation. At the same time, his marriage is disintegrating: it escalates into a rage-filled battle, and Solanka very nearly commits an unforgiveable act. Horrified by the fury within him, he flees home and family and becomes a sort of spiritual mendicant - except that he has a credit card and a duplex on the Upper West Side. Solanka discovers that he has come to a city roiling with anger, where cab drivers spout invective and a serial killer is murdering women with a lump of concrete, a metropolis whose population is united by petty spats and bone-deep resentment. His own thoughts, emotions and desires, meanwhile, are also running wild.', 'language": "hi", "image": "https: //images.isbndb.com/covers/18/63/9780099421863.jpg", "title_long": "FURY (NEW COVER RE-ISSUE)", "edition": "New Ed", "dimensions": "height: 16 mm, length: 216 mm, width: 138 mm, weight: 230 g", "dimensions_structured": {"length": {"unit": "mm", "value": 216}, "width": {"unit": "mm", "value": 138}, "weight": {"unit": "g", "value": 230}, "height": {"unit": "mm", "value": 16}}, "pages": 259, "date_published": "2001", "subjects": ["Literature & Fiction', 'Literary'], 'authors": ["RUSHDIE,SALMAN'], 'title": "FURY (NEW COVER RE-ISSUE)", "isbn13": "9780099421863", "msrp": 12.25, 'binding": "Paperback", "isbn": "0099421860", "isbn10": "0099421860"}}