{"book": {"publisher": "Vintage Crime", "synopsis": "It is Midsummer"s Eve, three young friends gather in a wood. In the still-sunlit, Scandanavian dusk, they don costumes joyfully to enact - or so it appears to an unseen observer - a kind of masque. The hidden watcher soon brings their performance to an end. His approach is careful; his aim is perfect - three bullets, three corpses. The murderer, then, carefully photographs the grisly tableau. The Ystad police station, meanwhile, is experiencing a summer lull, indeed Inspector Wallander is at last at liberty to attend to - albeit reluctantly - his deteriorating health, but his peace of mind is shattered when one of his colleagues is murdered. An unknown killer, seen by no-one, is on the loose, and the police"s only lead is a photograph of three dead young people in costume. Forced to dig more deeply than he would have wanted into the personal life of one of his colleagues, Wallander"s investigation reveals something none of his team could ever have imagined. However, they remain tantalisingly, terrifyingly one step behind the lethal progress of a killer Wallander would have to suppose was deranged if his methods were not so meticulous and his victims so clinically targeted.', 'language": "en", "image": "https: //images.isbndb.com/covers/88/77/9780099448877.jpg", "title_long": "One Step Behind", "edition": "3rd", "dimensions": "Height: 6.96849 Inches, Length: 4.3307 Inches, Weight: 0.55 Pounds, Width: 1.29921 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.3307}, "width": {"unit": "inches", "value": 1.29921}, "weight": {"unit": "pounds", "value": 0.55}, "height": {"unit": "inches", "value": 6.96849}}, "pages": 544, "date_published": "2003", "subjects": ["Mystery, Thriller & Suspense', 'Mystery', 'Police Procedurals', 'Thrillers & Suspense', 'Suspense', 'Crime'], 'authors": ["Henning Mankell'], 'title": "One Step Behind", "isbn13": "9780099448877", "msrp": 14.45, 'binding": "Paperback", "isbn": "0099448874", "isbn10": "0099448874"}}