{"book": {"publisher": "Pearson College Div", "synopsis": "The acknowledged leader and standard in general chemistry, this book maintains its effective and proven features?clarity of writing, scientific integrity, currency, strong exercises, visual emphasis and consistency in presentation. It offers readers an integrated educational solution to the challenges of the learning with an expanded media program that works in concert with the book, helping them to approach problem solving, visualization, and applications with greater success. Chapter topics cover: Matter and Measurement; Atoms, Molecules, and Ions; Stoichiometry: Calculations with Chemical Formulas and Equations; Aqueous Reactions and Solution Stoichiometry; Thermochemistry; Electronic Structure of Atoms; Periodic Properties of the Elements; Basic Concepts of Chemical Bonding; Molecular Geometry and Bonding Theories; Gases; Intermolecular Forces, Liquids, and Solids; Modern Materials; Properties of Solutions; Chemical Kinetics; Chemical Equilibrium; Acid-Base Equilibria; Additional Aspects of Equilibria; Chemistry of the Environment; Chemical Thermodynamics; Electrochemistry; Nuclear Chemistry; Chemistry of the Nonmetals; Metals and Metallurgy; Chemistry of Coordination Compounds; and The Chemistry of Life: Organic and Biological Chemistry. For individuals interested in the study of general chemistry.", "language": "en", "image": "https: //images.isbndb.com/covers/99/71/9780130669971.jpg", "title_long": "Chemistry: The Central Science, Ninth Edition", "edition": "9th", "dimensions": "Height: 11 Inches, Length: 9 Inches, Weight: 5.5225796631 Pounds, Width: 1.5 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 9}, "width": {"unit": "inches", "value": 1.5}, "weight": {"unit": "pounds", "value": 5.5225796631}, "height": {"unit": "inches", "value": 11}}, "pages": 1152, "date_published": "2002", "subjects": ["Science & Math', 'Chemistry', 'General & Reference', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Theodore L. Brown', 'Jr. H. Eugene LeMay', 'Bruce Edward Bursten', 'Julia R. Burdge'], 'title": "Chemistry: The Central Science, Ninth Edition", "isbn13": "9780130669971", "msrp": 166, 'binding": "Hardcover", "isbn": "0130669970", "isbn10": "0130669970"}}