{"book": {"publisher": "Fisicalbook", "synopsis": "Target Market: for principles of economics, surveys of economics, international economics, international trade, or managerial economics. No prior economics is assumed, but the material can be taught at all levels.<br/><br/>Written as a novel, the book makes the complex concepts, issues and terminology of international trade understandable for students.<br/><br/>Professors complain that their students cannot grasp the nature of how some economic tools are used or how they work in life. This novel bridges the gap of concepts with applications by use of a fictional story.<br/><br/>David Ricardo comes to life to discuss international trade theory and policy with Ed Johnson, a fictional American television manufacturer seeking trade protection from television manufacturers. Their dialogue is a sophisticated, rigorous discussion of virtually every major issue in trade theory and policy. To illustrate the positive and normative effects of international trade and trade policy, Ricardo takes the reader and Ed Johnson into the future to see an America of free trade and an America of complete self-sufficiency. The fictional element brings these topics to life so that students gain the intuition and understanding of how trade changes the lives of people and the industries they work in. The fundamental intuition of how international markets function including general equilibrium effects and policy analysis is provided.", "language": "en", "image": "https: //images.isbndb.com/covers/35/40/9780131433540.jpg", "title_long": "The Choice By Roberts Russell D", "edition": "3rd", "dimensions": "Height: 8.9 Inches, Length: 5.8 Inches, Weight: 0.33510263824 Pounds, Width: 0.3 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.8}, "width": {"unit": "inches", "value": 0.3}, "weight": {"unit": "pounds", "value": 0.33510263824}, "height": {"unit": "inches", "value": 8.9}}, "pages": 132, "date_published": "1900", "subjects": ["Business & Money', 'Economics', 'Free Enterprise & Capitalism', 'International', 'Accounting', 'Taxation', 'Law', 'Tax Law', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["russell-roberts'], 'title": "The Choice By Roberts Russell D", "isbn13": "9780131433540", "msrp": 33.32, 'binding": "Paperback", "isbn": "0131433547", "isbn10": "0131433547"}}