{"book": {"publisher": "Pearson College Div", "synopsis": "Dispelling current myths regarding organized crime, Lyman and Potter’s fourth edition reveals a truer picture of organized crime and criminal activity today. Providing scholarly treatment and a social perspective, the authors explore the concept of organized crime, the historical foundation for its evolution and development, and the current status of criminal groups in today’s society. Offering timely and respected research, this edition includes a thorough examination of drug trafficking, new sections on emerging organized crime groups, updated case studies, more coverage international groups, updated statistics, graphics and more!Presents a broad view of organized crime that incorporates more than just ethnically- driven, pop-culture stereotypes. Incorporates two parallel themes—organized crime consists of many different groups and corrupt individuals in public office, business etc., contribute to the continuation of the problem. Uses thematic questions (What is organized crime? Is there really a Mafia? Is terrorism organized crime? Do political machines still exist?) to promote higher-order thinking skills and a critical examination of the topic. Synthesizes volumes of historical data and archives to present the most salient aspects of the organized crime problem. References information and reports generated by the Federal Bureau of Investigation, the Pennsylvania Crime Commission, the National Institute of Justice, the Bureau of Justice Statistics and well-known researchers in the field. Law enforcement professionals and those interested in a scholarly treatment and a social perspective of organized crime.", "language": "en", "image": "https: //images.isbndb.com/covers/03/66/9780131730366.jpg", "title_long": "Organized Crime", "edition": "4", "dimensions": "Height: 10.25 Inches, Length: 8 Inches, Weight: 2.3699693165 Pounds, Width: 0.75 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 8}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 2.3699693165}, "height": {"unit": "inches", "value": 10.25}}, "pages": 496, "date_published": "2006", "subjects": ["Law', 'Legal Theory & Systems', 'Jurisprudence', 'Politics & Social Sciences', 'Social Sciences', 'Criminology', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Michael D. Lyman', 'Gary W. Potter'], 'title": "Organized Crime", "isbn13": "9780131730366", "msrp": 108.2, 'binding": "Hardcover", "isbn": "0131730363", "isbn10": "0131730363"}}