{"book": {"publisher": "Pearson College Div", "synopsis": "Written by highly acclaimed historian Gary B. Nash, this book presents an interpretive account of the interactions between Native Americans, African Americans, and Euroamericans during the colonial and revolutionary eras. It reveals the crucial interconnections between North America\"s many peoples?illustrating the ease of their interactions in the first two centuries of European and African presence?to develop a fuller, deeper understanding of the nation\"s underpinnings. Coverage explores the interaction of many peoples at all levels of society, from various cultural backgrounds and across the centuries; African-Americans as active participants in the cultural process, drawing upon the work of African and African-American historians; the origins of racism, tracing the development of racial attitudes and the mixing of people across racial boundaries; Indians as much more than victims, reaching beyond the Europeans that "discovered' North America to explore the society that had already been here for thousands of years; profiles of the various European colonizers, examining French, Dutch, and Spanish settlers and comparing their treatment of enslaved Africans and Native Americans with that of the English. For those interested in Colonial American History.', 'language": "en", "image": "https: //images.isbndb.com/covers/75/68/9780139567568.jpg", "title_long": "Red, White, and Black: The Peoples of Early North America (4th Edition)", "edition": "Subsequent", "dimensions": "Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.02955876354 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.25}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 1.02955876354}, "height": {"unit": "inches", "value": 9.25}}, "pages": 362, "date_published": "1999-07-14", "subjects": ["History', 'Americas', 'United States', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Gary B. Nash'], 'title": "Red, White, and Black: The Peoples of Early North America (4th Edition)", "isbn13": "9780139567568", "msrp": 54, 'binding": "Paperback", "isbn": "0139567569", "isbn10": "0139567569"}}