{"book": {"publisher": "Penguin", "synopsis": "The third volume of Dante"s Divine Comedy<br/><br/>To the consternation of his more academic admirers, who believed Latin to be the only proper language for dignified verse, Dante wrote his Comedy in colloquial Italian, wanting it to be a poem for the common reader. Taking two threads of a story that everybody knew and loved – the story of a vision of Hell, Purgatory and Paradise, and the story of the lover who has to brave the Underworld to find his lost lady – he combined them into a great allegory of the soul’s search for God. He made it swift, exciting and topical, lavishing upon it all his learning and wit, all his tenderness, humour and enthusiasm, and all his poetry. In Paradise, Dante journeys through the encircling spheres of heaven towards God.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https: //images.isbndb.com/covers/10/55/9780140441055.jpg", "title_long": "The Comedy of Dante Alighieri: The Florentine/Cantica III Paradise [Paperback] [Jan 01, 1962] Dante", "edition": "First Edition", "dimensions": "Height: 7.76 Inches, Length: 5.1 Inches, Weight: 0.61288508836 Pounds, Width: 0.68 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.1}, "width": {"unit": "inches", "value": 0.68}, "weight": {"unit": "pounds", "value": 0.61288508836}, "height": {"unit": "inches", "value": 7.76}}, "pages": 400, "date_published": "1962", "subjects": ["Literature & Fiction', 'Poetry', 'Ancient, Classical & Medieval'], 'authors": ["Dante Alighieri', 'translated by Dorothy L. Sayers And Barbara Reynolds'], 'title": "The Comedy of Dante Alighieri: The Florentine/Cantica III Paradise [Paperback] [Jan 01, 1962] Dante", "isbn13": "9780140441055", "msrp": 16, 'binding": "Paperback", "isbn": "0140441050", "isbn10": "0140441050"}}