{"book": {"publisher": "Penguin Books", "synopsis": "From the author of the #1 New York Times bestsellers Small Great Things and Mad Honey, a novel exploring the story of a young woman overcome by the demands of having a family.<br/><br/>Paige has only a few vivid memories of her mother, who abandoned her at five years old. Now, having left her father behind in Chicago for dreams of art school and marriage to an ambitious young doctor, she finds herself with a child of her own. But her mother"s absence and shameful memories of her past force her to doubt whether she could ever be capable of bringing joy and meaning into the life of her child, gifts her own mother never gave.<br/><br/>Harvesting the Heart is written with astonishing clarity and evocative detail, convincing in its depiction of emotional pain, love, and vulnerability, and recalls the writing of Alice Hoffman and Kristin Hannah. Out of Paige"s struggle to find wholeness, Jodi Picoult crafts an absorbing novel peopled by richly drawn characters, and explores motherhood with a power and depth only she is capable of.<br/><br/>“A brilliant, moving examination of motherhood, brimming with detail and emotion.” —Richmond Times-Dispatch<br/><br/>“Jodi Picoult explores the fragile ground of ambivalent motherhood in her lush second novel. This story belongs to… the lucky reader.” —The New York Times Book Review", 'language": "en", "image": "https: //images.isbndb.com/covers/02/77/9780140230277.jpg", "title_long": "Harvesting the Heart", "edition": "Reprint", "dimensions": "Height: 1.17 Inches, Length: 8.26 Inches, Weight: 0.87 Pounds, Width: 5.25 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.26}, "width": {"unit": "inches", "value": 5.25}, "weight": {"unit": "pounds", "value": 0.87}, "height": {"unit": "inches", "value": 1.17}}, "pages": 464, "date_published": "1995-04-01", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Family Life', 'Women's Fiction', 'Domestic Life', 'Mothers & Children', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Jodi Picoult'], 'title": "Harvesting the Heart", "isbn13": "9780140230277", "msrp": 17, "binding": "Paperback", "related": {"ePub": "1101042443"}, "isbn": "0140230270", "isbn10": "0140230270", "other_isbns": [{'isbn": "9781101042441", "binding": "print"}]}}