{"book": {"publisher": "Penguin Classics", "synopsis": 'The notorious and celebrated novel that established modern realism<br/><br/>For this novel of French bourgeois life in all its inglorious banality, Flaubert invented a paradoxically original and wholly modern style. His heroine, Emma Bovary, a bored provincial housewife, abandons her husband to pursue the libertine Rodolphe in a desperate love affair. A succès de scandale in its day, Madame Bovary remains a powerful and scintillating novel.<br/><br/>This Penguin Classics edition is translated with notes and an introduction by Geoffrey Wall. It includes a preface by Michele Roberts.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,
        700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https: //images.isbndb.com/covers/91/29/9780140449129.jpg", "title_long": "Madame Bovary (Penguin Classics)", "edition": "Revised", "dimensions": "Height: 0.91 Inches, Length: 7.74 Inches, Weight: 0.61949895622 Pounds, Width: 5.08 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.74}, "width": {"unit": "inches", "value": 5.08}, "weight": {"unit": "pounds", "value": 0.61949895622}, "height": {"unit": "inches", "value": 0.91}}, "pages": 335, "date_published": "2002-12-31", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Psychological', 'Literary', 'Reference', 'Romance', 'Self Service', 'Custom Stores'], 'authors": ['Gustave Flaubert'], 'title": "Madame Bovary (Penguin Classics)", "isbn13": "9780140449129", "msrp": "0.00", "binding": "Paperback", "isbn": "0140449124", "isbn10": "0140449124"}}