{"book": {"publisher": "Penguin Classics", "synopsis": "Boethius was an eminent public figure under the Gothic emperor Theodoric, and an exceptional Greek scholar. When he became involved in a conspiracy and was imprisoned in Pavia, it was to the Greek philosophers that he turned. The Consolation was written in the period leading up to his brutal execution. It is a dialogue of alternating prose and verse between the ailing prisoner and his "nurse" Philosophy. Her instruction on the nature of fortune and happiness, good and evil, fate and free will, restore his health and bring him to enlightenment. The Consolation was extremely popular throughout medieval Europe and his ideas were influential on the thought of Chaucer and Dante.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", 'language": "en", "image": "https: //images.isbndb.com/covers/78/04/9780140447804.jpg", "title_long": "The Consolation of Philosophy (Penguin Classics)", "edition": "Revised Edition", "dimensions": "Height: 0.9842519675 Inches, Length: 8.661417314 Inches, Weight: 0.3196702799 Pounds, Width: 5.905511805 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.661417314}, "width": {"unit": "inches", "value": 5.905511805}, "weight": {"unit": "pounds", "value": 0.3196702799}, "height": {"unit": "inches", "value": 0.9842519675}}, "pages": 155, "date_published": "1999-05-01", "subjects": ["History', 'Europe', 'World', 'Religious', 'Literature & Fiction', 'History & Criticism', 'Movements & Periods', 'Reference', 'Politics & Social Sciences', 'Philosophy', 'Medieval Thought', 'Movements'], 'authors": ["Ancius Boethius'], 'title": "The Consolation of Philosophy (Penguin Classics)", "isbn13": "9780140447804", "msrp": 16, 'binding": "Paperback", "isbn": "0140447806", "isbn10": "0140447806"}}