{"book": {"publisher": "Penguin Classics", "synopsis": "His elegantly-crafted tale of sibling rivalry, Honoré de Balzac"s The Black Sheep is translated from the French with an introduction by Donald Adamson in Penguin Classics. Philippe and Joseph Bridau are two extremely different brothers. The elder, Philippe, is a superficially heroic soldier and adored by their mother Agathe. He is nonetheless a bitter figure, secretly gambling away her savings after a brief but glorious career as Napoleon"s aide-de-camp at the battle of Montereau. His younger brother Joseph, meanwhile, is fundamentally virtuous - but their mother is blinded to his kindness by her disapproval of his life as an artist. Foolish and prejudiced, Agathe lives on unaware that she is being cynically manipulated by her own favourite child - but will she ever discover which of her sons is truly the black sheep of the family? A dazzling depiction of the power of money and the cruelty of life in nineteenth-century France, The Black Sheep compellingly explores is a compelling exploration of the nature of deceit. Donald Adamson"s translation captures the radical modernity of Balzac's style, while his introduction places The Black Sheep in its context as one of the great novels of Balzac's renowned Comédie humaine.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.', 'language": "en", "image": "https: //images.isbndb.com/covers/23/73/9780140442373.jpg", "title_long": "The Black Sheep (The Human Comedy)", "edition": "Reprint", "dimensions": "Height: 0.84 Inches, Length: 7.78 Inches, Weight: 0.56879263596 Pounds, Width: 5.22 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.78}, "width": {"unit": "inches", "value": 5.22}, "weight": {"unit": "pounds", "value": 0.56879263596}, "height": {"unit": "inches", "value": 0.84}}, "pages": 352, "date_published": "1976-08-26", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Family Life', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ['Honoré de Balzac'], 'title": "The Black Sheep (The Human Comedy)", "isbn13": "9780140442373", "msrp": "0.00", "binding": "Paperback", "isbn": "0140442375", "isbn10": "0140442375"}}