{"book": {"publisher": "Penguin Books", "synopsis": ""A lively, anecdotal, all-encompassing history of Basque ingenuity and achievement." —Atlantic Monthly<br/><br/>From Mark Kurlansky, the bestselling author of Cod, Salt, Birdseye, and Paper—the illuminating story of an ancient and enigmatic people<br/><br/>Straddling a small corner of Spain and France in a land that is marked on no maps except their own, the Basques are a puzzling contradiction—they are Europe\"s oldest nation without ever having been a country. No one has ever been able to determine their origins, and even the Basques\' language, Euskera—the most ancient in Europe—is related to none other on earth. For centuries, their influence has been felt in nearly every realm, from religion to sports to commerce. Even today, the Basques are enjoying what may be the most important cultural renaissance in their long existence, as displayed by new cookbooks like chefs Alexandra Raij and Eder Montero\'s The Basque Book and restaurateur Jose Pizarro’s Basque. Mark Kurlansky\'s passion for the Basque people and his exuberant eye for detail shine throughout this fascinating book. Like Cod, The Basque History of the World, blends human stories with economic, political, literary, and culinary history into a rich and heroic tale.<br/>Among the Basques\' greatest accomplishments:<br/>• Exploration—the first man to circumnavigate the globe, Juan Sebastian de Elcano, was a Basque and the Basques were the second Europeans, after the Vikings, in North America<br/>• Gastronomy and agriculture—they were the first Europeans to eat corn and chili peppers and cultivate tobacco, and were among the first to use chocolate<br/>• Religion—Ignatius Loyola, a Basque, founded the Jesuit religious order<br/>• Business and politics—they introduced capitalism and modern commercial banking to southern Europe<br/>• Recreation—they invented beach resorts, jai alai, and racing regattas, and were the first Europeans to play sports with balls<br/><br/>'Entertaining and instructive… [Kurlansky’s] approach is unorthodox, mixing history with anecdotes, poems with recipes.” –The New York Times Book Review', 'language": "en", "image": "https://images.isbndb.com/covers/85/12/9780140298512.jpg", "title_long": "The Basque History of the World: The Story of a Nation", "edition": "Reprint", "dimensions": "Height: 7.7 Inches, Length: 5.09 Inches, Weight: 0.5875 Pounds, Width: 0.7 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.09}, "width": {"unit": "inches", "value": 0.7}, "weight": {"unit": "pounds", "value": 0.5875}, "height": {"unit": "inches", "value": 7.7}}, "pages": 400, "date_published": "2001-02-01", "subjects": ["History', 'Americas', 'Native American', 'Europe', 'France', 'Historical Study & Educational Resources', 'Reference', 'Writing, Research & Publishing Guides', 'Writing', 'Politics & Social Sciences', 'Social Sciences', 'Human Geography', 'Ethnic Studies', 'Anthropology', 'Cultural'], 'authors": ["Mark Kurlansky'], 'title": "The Basque History of the World: The Story of a Nation", "isbn13": "9780140298512", "msrp": 17, "binding": "Paperback", "isbn": "0140298517", "isbn10": "0140298517", "other_isbns": [{'isbn": "9780593512265", "binding": "printisbncanonical"}]}}