{"book": {"publisher": "Penguin Books", "synopsis": 'Margot Fonteyn began life on the 18th of May,
        1919 in Reigate, Surrey, as plain Peggy Hookham. She ended it on the 21st of February,
        1991, as Prima Ballerina Assoluta, Dame of the British Empire and the most legendary dancer since Pavlova. Meredith Daneman, with her own extensive background in ballet, tells Fonteyn’s story in vivid prose with insight and sensitivity.<br/><br/>Drawing upon extensive research, countless interviews, and exclusive access to never-before-seen letters and diaries—including those of Fonteyn’s extraordinary and devoted mother—Daneman presents firsthand remembrances of Fonteyn from a vast array of people who knew her and danced with her during the course of her lengthy career. Margot Fonteyn contains revelations not found in any other account of the ballerina, from insights into Fonteyn’s private world (especially regarding her relationship with her mother, the “Black Queen”) to her feelings about her fellow dancers and, of course, the men in her life—including choreographer Frederick Ashton, her husband Roberto Arias, and her long-time dance partner and rumored lover Nureyev.", "language": "en", "image": "https: //images.isbndb.com/covers/53/02/9780140165302.jpg", "title_long": "Margot Fonteyn: A Life", "dimensions": "Height: 8.41 Inches, Length: 5.54 Inches, Weight: 1.05601423498 Pounds, Width: 1.57 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.54}, "width": {"unit": "inches", "value": 1.57}, "weight": {"unit": "pounds", "value": 1.05601423498}, "height": {"unit": "inches", "value": 8.41}}, "pages": 704, "date_published": "2005-10-04", "subjects": ["Arts & Photography', 'Performing Arts', 'Dance', 'Biographies & Memoirs', 'Arts & Literature', 'Actors & Entertainers', 'Dancers', 'Community & Culture', 'Women', 'Humor & Entertainment'], 'authors": ["Meredith Daneman'], 'title": "Margot Fonteyn: A Life", "isbn13": "9780140165302", "msrp": 18, 'binding": "Paperback", "isbn": "0140165304", "isbn10": "0140165304"}}