{"book": {"publisher": "Penguin UK", "synopsis": "Jane Green, author the best-sellers The Beach House and Second Chance, follows happily married Alice who moves from London to the USA only to discover that her life is not as fairy-tale as it seems in Spellbound. Alice has everything. So why isn"t she happy? After all, she has a handsome husband, a gorgeous home and membership of London"s most exclusive clubs. Okay, Joe can"t keep his hands to himself - but she got what she wanted, didn't she? When Joe's indiscretions force a transfer to New York, Alice hopes it'll be a fresh start. And when they find a beautiful old house in Connecticut she is overjoyed. For a while Alice and Joe are as happy as newlyweds. But then the late nights and unexplained absences start. Alice is desperate to give her marriage a fairy tale ending. What should she do? Stay and fight for Joe? Or try to break the spell he's cast over her? 'Will have you hungrily turning page after page' Heat 'Green whips up a sparkling morality tale that points the finger at bad boys and low-rent romance' Independent 'Her books are just damn readable' Glamour Jane Green's novels, including The Other Woman, Jemima J., Babyville, The Love Verb (published as Promises to Keep in the USA), Girl Friday (Dune Road), Life Swap (Swapping Lives), Straight Talking, The Patchwork Marriage (Another Piece of My Heart), Mr. Maybe, and Bookends, are as moving as they are funny and have achieved best-seller status internationally. Spellbound is published in the USA as To Have and to Hold.', 'language": "en", "image": "https: //images.isbndb.com/covers/59/48/9780140295948.jpg", "title_long": "Spellbound", "dimensions": "Height: 7.75 Inches, Length: 5 Inches, Weight: 0.68122838958 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 0.68122838958}, "height": {"unit": "inches", "value": 7.75}}, "pages": 448, "date_published": "2010-07-27", "subjects": ["Literature & Fiction', 'Women's Fiction', 'Contemporary'], 'authors": ['Jane Green'], 'title": "Spellbound", "isbn13": "9780140295948", "msrp": "0.00", "binding": "Paperback", "isbn": "0140295941", "isbn10": "0140295941"}}