{"book": {"publisher": "Penguin Classics", "synopsis": "Alexandre Dumas’s epic tale of suffering and retribution, inspired by a real-life case of wrongful imprisonment—nominated as one of America’s best-loved novels by PBS’s The Great American Read<br/><br/>Thrown in prison for a crime he has not committed, Edmond Dantes is confined to the grim fortress of If. There he learns of a great hoard of treasure hidden on the Isle of Monte Cristo, and he becomes determined not only to escape, but also to unearth the treasure and use it to plot the destruction of the three men responsible for his incarceration.<br/><br/>Robin Buss’s lively translation is complete and unabridged, and remains faithful to the style of Dumas’s original. This edition includes an introduction, explanatory notes, and suggestions for further reading.<br/><br/>Penguin Classics is the leading publisher of classic literature in the English-speaking world, representing a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https: //images.isbndb.com/covers/92/66/9780140449266.jpg", "title_long": "The Count of Monte Cristo (Penguin Classics)", "edition": "Reissue", "dimensions": "Height: 7.78 Inches, Length: 5.08 Inches, Weight: 1.9400679056 Pounds, Width: 2.25 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.08}, "width": {"unit": "inches", "value": 2.25}, "weight": {"unit": "pounds", "value": 1.9400679056}, "height": {"unit": "inches", "value": 7.78}}, "pages": 1276, "date_published": "2003-05-27", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Action & Adventure', 'War & Military', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Alexandre Dumas père'], 'title": "The Count of Monte Cristo (Penguin Classics)", "isbn13": "9780140449266", "msrp": 16, 'binding": "Paperback", "isbn": "0140449264", "isbn10": "0140449264"}}