{"book": {"publisher": "Penguin Classic", "synopsis": "Miguel de Cervantes"s mock-epic masterwork, Don Quixote was voted the greatest book of all time by the Nobel Institute, and this Penguin Classics edition is translated with an introduction and notes by John Rutherford. Don Quixote has become so entranced by reading romances of chivalry that he determines to become a knight errant and pursue bold adventures, accompanied by his squire, the cunning Sancho Panza. As they roam the world together, the aging Quixote"s fancy leads them wildly astray, tilting at windmills, fighting with friars, and distorting the rural Spanish landscape into a fantasy of impenetrable fortresses and wicked sorcerers. At the same time the relationship between the two men grows in fascinating subtlety. Often considered to be the first modern novel, Don Quixote is a wonderful burlesque of the popular literature its disordered protagonist is obsessed with. John Rutherford"s landmark translation does full justice to the energy and wit of Cervantes's prose, and this edition of Don Quixote won the 2002 Premio Valle Inclan prize for translation. His introduction discusses the traditional works parodied in Don Quixote and issues of literary translation. Miguel de Cervantes Saaverda's (1547-1616) life was occupied with a struggle to earn a livelihood from literature and humble government employment. As well as Don Quixote, he wrote a number of plays and a collection of highly accomplished short stories, Exemplary Tales (1613). If you enjoyed Don Quixote, you might like Homer's Odyssey, also available in Penguin Classics. 'John Rutherford makes Don Quixote funny and readable ... His Quixote can be pompous, imposingly learned, secretly fearful, mad and touching.' Colin Burrow, The Times Literary Supplement', 'language": "en", "image": "https: //images.isbndb.com/covers/90/99/9780140449099.jpg", "title_long": "Penguin Classics Don Quixote", "edition": "Revised", "dimensions": "Height: 7.8 Inches, Length: 5 Inches, Weight: 1.52339423042 Pounds, Width: 1.9 inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 1.9}, "weight": {"unit": "pounds", "value": 1.52339423042}, "height": {"unit": "inches", "value": 7.8}}, "pages": 1072, "date_published": "2002-12-31", "subjects": ["Literature & Fiction', 'Classics', 'Literary'], 'authors": ["Miguel de Cervantes'], 'title": "Penguin Classics Don Quixote", "isbn13": "9780140449099", "msrp": 15.05, 'binding": "Paperback", "isbn": "0140449094", "isbn10": "0140449094"}}