{"book": {"publisher": "Penguin Books", "synopsis": "On the brink of the 100th anniversary of the Russian Revolution, read the most vivid, moving, and comprehensive history of the events that changed the world<br/><br/>It is history on an epic yet human scale. Vast in scope, exhaustive in original research, written with passion, narrative skill, and human sympathy, A People"s Tragedy is a profound account of the Russian Revolution for a new generation. Many consider the Russian Revolution to be the most significant event of the twentieth century. Distinguished scholar Orlando Figes presents a panorama of Russian society on the eve of that revolution, and then narrates the story of how these social forces were violently erased. Within the broad stokes of war and revolution are miniature histories of individuals, in which Figes follows the main players" fortunes as they saw their hopes die and their world crash into ruins. Unlike previous accounts that trace the origins of the revolution to overreaching political forces and ideals, Figes argues that the failure of democracy in 1917 was deeply rooted in Russian culture and social history and that what had started as a people"s revolution contained the seeds of its degeneration into violence and dictatorship. A People's Tragedy is a masterful and original synthesis by a mature scholar, presented in a compelling and accessibly human narrative.', 'language": "en", "image": "https: //images.isbndb.com/covers/36/42/9780140243642.jpg", "title_long": "A People"s Tragedy: The Russian Revolution: 1891-1924", 'edition": "Reprint", "dimensions": "Height: 9.22 Inches, Length: 6.08 Inches, Weight: 2.04 Pounds, Width: 1.55 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.08}, "width": {"unit": "inches", "value": 1.55}, "weight": {"unit": "pounds", "value": 2.04}, "height": {"unit": "inches", "value": 9.22}}, "pages": 1024, "date_published": "1998-03-01", "subjects": ["History', 'Russia', 'Politics & Social Sciences', 'Politics & Government', 'Ideologies & Doctrines', 'International & World Politics'], 'authors": ['Orlando Figes'], 'title": "A People"s Tragedy: The Russian Revolution: 1891-1924", 'isbn13": "9780140243642", "msrp": "0.00", "binding": "Paperback", "isbn": "014024364X", "isbn10": "014024364X"}}