{"book": {"publisher": "Penguin Classics", "synopsis": ""Fight on, brave knights! Man dies, but glory lives!'<br/><br/>Banished from England for seeking to marry against his father\'s wishes, Ivanhoe joins Richard the Lion Heart on a crusade in the Holy Land. On his return, his passionate desire is to be reunited with the beautiful but forbidden lady Rowena, but he soon finds himself playing a more dangerous game as he is drawn into a bitter power struggle between the noble King Richard and his evil and scheming brother John. The first of Scott\'s novels to address a purely English subject, Ivanhoe is set in a highly romanticized medieval world of tournaments and sieges, chivalry and adventure where dispossessed Saxons are pitted against their Norman overlords, and where the historical and fictional seamlessly merge.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,
        700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https: //images.isbndb.com/covers/65/87/9780140436587.jpg", "title_long": "Ivanhoe (Penguin Classics)", "edition": "Reprint", "dimensions": "Height: 1.27559054988 Inches, Length: 8.5039369992 Inches, Weight: 0.8157103694 Pounds, Width: 5.4330708606 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.5039369992}, "width": {"unit": "inches", "value": 5.4330708606}, "weight": {"unit": "pounds", "value": 0.8157103694}, "height": {"unit": "inches", "value": 1.27559054988}}, "pages": 544, "date_published": "2000-10-01", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Historical', 'Action & Adventure', 'Mystery, Thriller & Suspense', 'Romance', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Sir Walter Scott'], 'title": "Ivanhoe (Penguin Classics)", "isbn13": "9780140436587", "msrp": 10, 'binding": "Paperback", "isbn": "0140436588", "isbn10": "0140436588"}}