{"book": {"publisher": "Penguin Classics", "synopsis": "A rousing call to arms whose influence is still felt today<br/><br/>Originally published on the eve of the 1848 European revolutions, The Communist Manifesto is a condensed and incisive account of the worldview Marx and Engels developed during their hectic intellectual and political collaboration. Formulating the principles of dialectical materialism, they believed that labor creates wealth, hence capitalism is exploitive and antithetical to freedom.<br/><br/>This new edition includes an extensive introduction by Gareth Stedman Jones, Britain"s leading expert on Marx and Marxism, providing a complete course for students of The Communist Manifesto, and demonstrating not only the historical importance of the text, but also its place in the world today.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https: //images.isbndb.com/covers/75/76/9780140447576.jpg", "title_long": "The Communist Manifesto (Penguin Classics)", "edition": "1", "dimensions": "Height: 7.8 Inches, Length: 0.66 Inches, Weight: 0.50265395736 Pounds, Width: 5.1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 0.66}, "width": {"unit": "inches", "value": 5.1}, "weight": {"unit": "pounds", "value": 0.50265395736}, "height": {"unit": "inches", "value": 7.8}}, "pages": 304, "date_published": "2002-08-27", "subjects": ["Business & Money', 'Economics', 'History', 'Historical Study & Educational Resources', 'Reference', 'Study & Teaching', 'Foreign Language Study & Reference', 'Politics & Social Sciences', 'Philosophy', 'Political', 'Politics & Government', 'Ideologies & Doctrines', 'Political Science'], 'authors": ['Karl Marx', 'Friedrich Engels'], 'title": "The Communist Manifesto (Penguin Classics)", "isbn13": "9780140447576", "msrp": "0.00", "binding": "Paperback", "isbn": "0140447571", "isbn10": "0140447571"}}