{"book": {"publisher": "Penguin Classics", "synopsis": "Essential reading for all students of Greek theatre and literature, and equally stimulating for anyone interested in literature<br/><br/>In the Poetics, his near-contemporary account of classical Greek tragedy, Aristotle examine the dramatic elements of plot, character, language and spectacle that combine to produce pity and fear in the audience, and asks why we derive pleasure from this apparently painful process. Taking examples from the plays of Aeschylus, Sophocles and Euripides, the Poetics introduced into literary criticism such central concepts as mimesis ("imitation"), hamartia ("error') and katharsis, which have informed serious thinking about drama ever since. Aristotle explains how the most effective tragedies rely on complication and resolution, recognition and reversals, while centring on chaaracerts of heroic stature, idealised yet true to life. One of the most perceptive and influential works of criticism in Western literary history, the Poetics has informed serious thinking about drama ever since.<br/><br/>Malcolm Heath's lucid translation makes the Poetics fully accessible to the modern reader. In this edition it is accompanied by an extended introduction, which discusses the key concepts in detail, and includes suggestions for further reading.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.', 'language": "en", "image": "https: //images.isbndb.com/covers/63/64/9780140446364.jpg", "title_long": "Poetics (Penguin Classics)", "edition": "New Ed", "dimensions": "Height: 0.36 Inches, Length: 7.92 Inches, Weight: 0.24691773344 Pounds, Width: 5.04 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.92}, "width": {"unit": "inches", "value": 5.04}, "weight": {"unit": "pounds", "value": 0.24691773344}, "height": {"unit": "inches", "value": 0.36}}, "pages": 144, "date_published": "1997-03-01", "subjects": ["Arts & Photography', 'Performing Arts', 'Theater', 'Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Movements & Periods', 'Poetry', 'Ancient, Classical & Medieval', 'Politics & Social Sciences', 'Philosophy', 'Aesthetics'], 'authors": ["Aristotle'], 'title": "Poetics (Penguin Classics)", "isbn13": "9780140446364", "msrp": 13, 'binding": "Paperback", "isbn": "0140446362", "isbn10": "0140446362"}}