{"book": {"publisher": "Penguin Classics", "synopsis": "The works collected in this volume form the true foundation of Western philosophy—the base upon which Plato and Aristotle and their successors would eventually build. Yet the importance of the Pre-Socratics thinkers lies less in their influence—great though that was—than in their astonishing intellectual ambition and imaginative reach. Zeno"s dizzying "proofs" that motion is impossible; the extraordinary atomic theories of Democritus; the haunting and enigmatic epigrams of Heraclitus; and the maxims of Alcmaeon: fragmentary as they often are, the thoughts of these philosophers seem strikingly modern in their concern to forge a truly scientific vocabulary and way of reasoning.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.', 'language": "en", "image": "https: //images.isbndb.com/covers/81/53/9780140448153.jpg", "title_long": "Early Greek Philosophy (Penguin Classics)", "edition": "2nd ed.", "dimensions": "Height: 0.59 Inches, Length: 7.78 Inches, Weight: 0.51588169308 pounds, Width: 5.14 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.78}, "width": {"unit": "inches", "value": 5.14}, "weight": {"unit": "pounds", "value": 0.51588169308}, "height": {"unit": "inches", "value": 0.59}}, "pages": 282, "date_published": "2002-11-26", "subjects": ["Literature & Fiction', 'Classics', 'Ancient & Medieval Literature', 'Greek', 'Roman', 'Ancient & Classical', 'Politics & Social Sciences', 'Philosophy', 'Greek & Roman', 'Movements'], 'authors": ["Various'], 'title": "Early Greek Philosophy (Penguin Classics)", "isbn13": "9780140448153", "msrp": 18, 'binding": "Paperback", "isbn": "0140448152", "isbn10": "0140448152"}}