{"book": {"publisher": "Penguin Classics", "synopsis": "Mild, harmless and ugly to behold, the impoverished Pons is an ageing musician whose brief fame has fallen to nothing. Living a placid Parisian life as a bachelor in a shared apartment with his friend Schmucke, he maintains only two passions: a devotion to fine dining in the company of wealthy but disdainful relatives, and a dedication to the collection of antiques. When these relatives become aware of the true value of his art collection, however, their sneering contempt for the parasitic Pons rapidly falls away as they struggle to obtain a piece of the weakening man"s inheritance. Taking its place in the Human Comedy as a companion to Cousin Bette, the darkly humorous Cousin Pons is among of the last and greatest of Balzac"s novels concerning French urban society: a cynical, pessimistic but never despairing consideration of human nature.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", 'language": "en", "image": "https: //images.isbndb.com/covers/20/52/9780140442052.jpg", "title_long": "Cousin Pons (Poor Relations, Part 2) (Penguin Classics)", "edition": "First Edition", "dimensions": "Height: 0.81 Inches, Length: 7.88 Inches, Weight: 0.54454178714 Pounds, Width: 5.08 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.88}, "width": {"unit": "inches", "value": 5.08}, "weight": {"unit": "pounds", "value": 0.54454178714}, "height": {"unit": "inches", "value": 0.81}}, "pages": 336, "date_published": "1978-08-31", "subjects": ["Literature & Fiction', 'Classics', 'Dramas & Plays', 'Comedy', 'Literary', 'Romance', 'Paranormal', 'Self Service', 'Custom Stores'], 'authors": ["Honoré de Balzac'], 'title": "Cousin Pons (Poor Relations, Part 2) (Penguin Classics)", "isbn13": "9780140442052", "msrp": 20, 'binding": "Paperback", "isbn": "0140442057", "isbn10": "0140442057"}}