{"book": {"publisher": "Penguin Classics", "synopsis": "When J. the narrator, George, Harris and Montmorency the dog set off on their hilarious misadventures, they can hardly predict the troubles that lie ahead with tow-ropes, unreliable weather-forecasts, imaginary illnesses, butter pats and tins of pineapple chunks. Denounced as vulgar by the literary establishment, Three Men in a Boat nevertheless caught the spirit of the times. The expansion of education and the increase in office workers created a new mass readership, and Jerome"s book was especially popular among the "clerking classes" who longed to be 'free from that fretful haste, that vehement striving, that is every day becoming more and more the bane of nineteenth-century life.'<br/>So popular did it prove that Jerome reunited his heroes for a bicycle tour of Germany. Despite some sharp, and with hindsight, prophetic observations of the country, Three Men on the Bummel describes an equally picaresque journey constrained only 'by the necessity of getting back within a given time to the point from which one started'.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.', 'language": "en", "image": "https: //images.isbndb.com/covers/75/08/9780140437508.jpg", "title_long": "Three Men in a Boat and Three Men on the Bummel", "edition": "Later Printing Used", "dimensions": "Height: 7.77 Inches, Length: 5.08 Inches, Weight: 0.61068046574 pounds, Width: 0.71 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.08}, "width": {"unit": "inches", "value": 0.71}, "weight": {"unit": "pounds", "value": 0.61068046574}, "height": {"unit": "inches", "value": 7.77}}, "pages": 361, "date_published": "2000-05-01", "subjects": ["Literature & Fiction', 'Classics', 'Dramas & Plays', 'Comedy', 'United States', 'Humor & Satire', 'Satire', 'Dark Humor', 'Humorous', 'Teen & Young Adult', 'Self Service', 'Custom Stores'], 'authors": ["Jerome K. Jerome'], 'title": "Three Men in a Boat and Three Men on the Bummel", "isbn13": "9780140437508", "msrp": 13, 'binding": "Paperback", "isbn": "0140437509", "isbn10": "0140437509"}}