{"book": {"publisher": "Penguin Classics", "synopsis": "Fyodor Dostoyevsky"s powerful meditation on faith, meaning and morality, The Brothers Karamazov is translated with an introduction and notes by David McDuff in Penguin Classics.<br/><br/>When brutal landowner Fyodor Karamazov is murdered, the lives of his sons are changed irrevocably: Mitya, the sensualist, whose bitter rivalry with his father immediately places him under suspicion for parricide; Ivan, the intellectual, whose mental tortures drive him to breakdown; the spiritual Alyosha, who tries to heal the family"s rifts; and the shadowy figure of their bastard half-brother Smerdyakov. As the ensuing investigation and trial reveal the true identity of the murderer, Dostoyevsky"s dark masterpiece evokes a world where the lines between innocence and corruption, good and evil, blur and everyone's faith in humanity is tested.<br/><br/>This powerful translation of The Brothers Karamazov features and introduction highlighting Dostoyevsky's recurrent themes of guilt and salvation, with a new chronology and further reading.<br/><br/>“There is no writer who better demonstrates the contradictions and fluctuations of the creative mind than Dostoyevsky, and nowhere more astonishingly than in The Brothers Karamazov.”—Joyce Carol Oates<br/><br/>“Dostoyevsky was the only psychologist from whom I had anything to learn: he belongs to the happiest windfalls of my life.”—Friedrich Nietzsche<br/><br/>“The most magnificent novel ever written.”—Sigmund Freud', 'language": "en", "image": "https: //images.isbndb.com/covers/92/42/9780140449242.jpg", "title_long": "The Brothers Karamazov: A Novel in Four Parts and an Epilogue", "edition": "Reissue", "dimensions": "Height: 1.84 Inches, Length: 7.76 Inches, Weight: 1.5873282864 Pounds, Width: 5.08 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.76}, "width": {"unit": "inches", "value": 5.08}, "weight": {"unit": "pounds", "value": 1.5873282864}, "height": {"unit": "inches", "value": 1.84}}, "pages": 960, "date_published": "2003-04-29", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Family Life', 'Psychological', 'Literary', 'Reference', 'Foreign Language Study & Reference', 'Romance', 'Historical'], 'authors": ["Fyodor Dostoyevsky'], 'title": "The Brothers Karamazov: A Novel in Four Parts and an Epilogue", "isbn13": "9780140449242", "msrp": 17, 'binding": "Paperback", "isbn": "0140449248", "isbn10": "0140449248"}}