{"book": {"publisher": "Penguin Classics", "synopsis": "The first complete English translation of the Nobel Prize-winner’s literary masterpiece<br/><br/>A Penguin Classic<br/><br/>Mysteries is the story of Johan Nilsen Nagel, a mysterious stranger who suddenly turns up in a small Norwegian town one summer—and just as suddenly disappears. Nagel is a complete outsider, a sort of modern Christ treated in a spirit of near parody. He condemns the politics and thought of the age, brings comfort to the “insulted and injured,” and gains the love of two women suggestive of the biblical Mary and Martha. But there is a sinister side of him: in his vest he carries a vial of prussic acid...<br/><br/>The novel creates a powerful sense of Nagel"s stream of thought, as he increasingly withdraws into the torture chamber of his own subconscious psyche.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,800 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https: //images.isbndb.com/covers/61/84/9780141186184.jpg", "title_long": "Mysteries (Penguin Twentieth-Century Classics)", "dimensions": "Height: 0.62 Inches, Length: 7.76 Inches, Weight: 0.54 Pounds, Width: 5.12 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.76}, "width": {"unit": "inches", "value": 5.12}, "weight": {"unit": "pounds", "value": 0.54}, "height": {"unit": "inches", "value": 0.62}}, "pages": 313, "date_published": "2001-01-01", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Psychological', 'Short Stories & Anthologies', 'Anthologies', 'World Literature', 'European', 'United States', 'Literary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Psychological Thrillers', 'Teen & Young Adult', 'Self Service', 'Custom Stores'], 'authors": ["Knut Hamsun'], 'title": "Mysteries (Penguin Twentieth-Century Classics)", "isbn13": "9780141186184", "msrp": 17, "binding": "Paperback", "related": {"Kindle Edition": "1440673632", "ePub": "1440673632"}, "isbn": "0141186186", "isbn10": "0141186186", "other_isbns": [{'isbn": "9781440673634", "binding": "print"}]}}