{"book": {"publisher": "Penguin Books", "synopsis": "F. Scott Fitzgerald\"s last completed novel, Tender is the Night is edited by Arnold Goldman with an introduction and notes by Richard Godden in Penguin Modern Classics. Between the First World War and the Wall Street Crash the French Riviera was the stylish place for wealthy Americans to visit. Among the most fashionable are psychoanalyst Dick Diver and his wife Nicole, who hold court at their villa. Into their circle comes Rosemary Hoyt, a film star, who is instantly attracted to them, but understands little of the dark secrets and hidden corruption that hold them together. As Dick draws closer to Rosemary, he fractures the delicate structure of his marriage and sets both Nicole and himself on to a dangerous path where only the strongest can survive. In this exquisite, lyrical novel, Fitzgerald has poured much of the essence of his own life; he has also depicted the age of materialism, shattered idealism and broken dreams. F. Scott Fitzgerald (1896-1940) has acquired a mythical status in American literary history, and his masterwork The Great Gatsby is considered by many to be the \"great American novel\". In 1920 he married Zelda Sayre, dubbed \'the first American Flapper\', and their traumatic marriage and Zelda\'s gradual descent into insanity became the leading influence on his writing. As well as many short stories, Fitzgerald wrote five novels This Side of Paradise, The Great Gatsby, The Beautiful and the Damned, Tender is the Night and, incomplete at the time of his death, The Last Tycoon. After his death The New York Times said of him that \'in fact and in the literary sense he created a 'generation' \'. If you enjoyed Tender is the Night, you might like Truman Capote\'s Breakfast at Tiffany\'s, also available in Penguin Classics. \'One of the most wonderful writers of the twentieth century\' Financial Times', 'language": "en", "image": "https: //images.isbndb.com/covers/35/96/9780141183596.jpg", "title_long": "Tender is the Night: A Romance (Penguin Modern Classics)", "dimensions": "Height: 7.7 Inches, Length: 5.1 Inches, Weight: 0.61068046574 Pounds, Width: 0.7 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.1}, "width": {"unit": "inches", "value": 0.7}, "weight": {"unit": "pounds", "value": 0.61068046574}, "height": {"unit": "inches", "value": 7.7}}, "pages": 400, "date_published": "2001-04-03", "subjects": ["Literature & Fiction', 'Classics', 'United States'], 'authors": ["F. Scott Fitzgerald'], 'title": "Tender is the Night: A Romance (Penguin Modern Classics)", "isbn13": "9780141183596", "msrp": 19.75, 'binding": "Paperback", "isbn": "0141183594", "isbn10": "0141183594"}}