{"book": {"publisher": "Penguin Classics", "synopsis": "Charlotte Brontë\"s moving masterpiece – the novel that has been 'teaching true strength of character for generations' (The Guardian). Nominated as one of America’s best-loved novels by PBS’s The Great American Read<br/><br/>A novel of intense power and intrigue, Jane Eyre has dazzled generations of readers with its depiction of a woman\'s quest for freedom. Having grown up an orphan in the home of her cruel aunt and at a harsh charity school, Jane Eyre becomes an independent and spirited survivor-qualities that serve her well as governess at Thornfield Hall. But when she finds love with her sardonic employer, Rochester, the discovery of his terrible secret forces her to make a choice. Should she stay with him whatever the consequences or follow her convictions, even if it means leaving her beloved? This updated Penguin Classics edition features a new introduction by Brontë scholar and award-winning novelist Stevie Davies, as well as comprehensive notes, a chronology, further reading, and an appendix.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,
        700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https: //images.isbndb.com/covers/11/46/9780141441146.jpg", "title_long": "Jane Eyre (Penguin Classics)", "edition": "Reprint", "dimensions": "xlii, 578 p. ; 20 cm.", "dimensions_structured": {"length": {"unit": "mm", "value": 198}, "width": {"unit": "mm", "value": 129}, "weight": {"unit": "g", "value": 800}, "height": {"unit": "mm", "value": 34}}, "pages": 578, "date_published": "2013", "subjects": ["Literature & Fiction', 'Classics', 'Literary', 'Romance', 'Historical', 'Regency', 'Holidays', 'Specialty Boutique', 'Kindle Store', 'Categories', 'Kindle eBooks'], 'authors": ['Charlotte Bronte & Stevie Davies'], 'title": "Jane Eyre (Penguin Classics)", "isbn13": "9780141441146", "msrp": "0.00", "binding": "Paperback", "isbn": "0141441143", "isbn10": "0141441143"}}