{"book": {"publisher": "Penguin Classics", "synopsis": '“[Sigrid Undset
        ] should be the next Elena Ferrante.” —Slate<br/><br/>A Penguin Classic<br/><br/>Kristin Lavransdatter interweaves political, social, and religious history with the daily aspects of family life to create a colorful, richly detailed tapestry of Norway during the fourteenth-century. The trilogy, however, is more than a journey into the past. Undset\'s own life—her familiarity with Norse sagas and folklore and with a wide range of medieval literature, her experiences as a daughter, wife, and mother, and her deep religious faith—profoundly influenced her writing. Her grasp of the connections between past and present and of human nature itself, combined with the extraordinary quality of her writing, sets her works far above the genre of 'historical novels.' This new translation by Tina Nunnally—the first English version since Charles Archer\'s translation in the 1920s—captures Undset\'s strengths as a stylist. Nunnally, an award-winning translator, retains the natural dialog and lyrical flow of the original Norwegian, with its echoes of Old Norse legends, while deftly avoiding the stilted language and false archaisms of Archer\'s translation. In addition, she restores key passages left out of that edition.<br/>Undset\'s ability to present a meticulously accurate historical portrait without sacrificing the poetry and narrative drive of masterful storytelling was particularly significant in her homeland. Granted independence in 1905 after five hundred years of foreign domination, Norway was eager to reclaim its national history and culture. Kristin Lavransdatter became a touchstone for Undset\'s contemporaries, and continues to be widely read by Norwegians today. In the more than 75 years since it was first published, it has also become a favorite throughout the world.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,
        700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https: //images.isbndb.com/covers/04/10/9780141180410.jpg", "title_long": "Kristin Lavransdatter I: The Wreath (Penguin Classics)", "edition": "F First Paperback Edition Used", "dimensions": "Height: 0.8 Inches, Length: 7.7 Inches, Weight: 0.6 Pounds, Width: 5.1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.7}, "width": {"unit": "inches", "value": 5.1}, "weight": {"unit": "pounds", "value": 0.6}, "height": {"unit": "inches", "value": 0.8}}, "pages": 336, "date_published": "1997-12-01", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Family Saga', 'Historical', 'Mythology & Folk Tales', 'Mythology', 'Romance', 'Medieval', 'Teen & Young Adult', 'Self Service', 'Custom Stores'], 'authors": ["Sigrid Undset'], 'title": "Kristin Lavransdatter I: The Wreath (Penguin Classics)", "isbn13": "9780141180410", "msrp": 16, "binding": "Paperback", "related": {"ePub": "1101127767"}, "isbn": "0141180412", "isbn10": "0141180412", "other_isbns": [{'isbn": "9781101127766", "binding": "print"}]}}