{"book": {"publisher": "Penguin Classics", "synopsis": 'Thomas Hardy’s impassioned novel of courtship in rural life<br/><br/>In Thomas Hardy’s first major literary success, independent and spirited Bathsheba Everdene has come to Weatherbury to take up her position as a farmer on the largest estate in the area. Her bold presence draws three very different suitors: the gentleman-farmer Boldwood, the soldier-seducer Sergeant Troy, and the devoted shepherd Gabriel Oak. Each, in contrasting ways, unsettles her decisions and complicates her life, and tragedy ensues, threatening the stability of the whole community. One of his first works set in the semi-fictional region of Wessex, Hardy’s novel of swift passion and slow courtship is imbued with his evocative descriptions of rural life and landscapes, and with unflinching honesty about sexual relationships.<br/><br/>This edition, based on Hardy’s original 1874 manuscript, is the complete novel he never saw published, and restores its full candor and innovation. Rosemarie Morgan’s introduction discusses the history of its publication, as well as the biblical and classical allusions that permeate the novel.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,
        700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https: //images.isbndb.com/covers/96/55/9780141439655.jpg", "title_long": "Far from the Madding Crowd (Penguin Classics)", "edition": "Reissue", "dimensions": "Height: 7.9 Inches, Length: 1.1 Inches, Weight: 0.7275254646 Pounds, Width: 5.1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 1.1}, "width": {"unit": "inches", "value": 5.1}, "weight": {"unit": "pounds", "value": 0.7275254646}, "height": {"unit": "inches", "value": 7.9}}, "pages": 480, "date_published": "2003-04-29", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Literary', 'Romance', 'Historical', 'Teen & Young Adult', 'Self Service', 'Custom Stores'], 'authors": ["Thomas Hardy'], 'title": "Far from the Madding Crowd (Penguin Classics)", "isbn13": "9780141439655", "msrp": 8, 'binding": "Paperback", "isbn": "0141439653", "isbn10": "0141439653"}}