{"book": {"publisher": "Penguin Classic", "synopsis": "A fascinating insight into the vibrant culture of Modernism, and the rich artistic world of Paris"s Left Bank, Gertrude Stein"s The Autobiography of Alice B. Toklas includes an introduction by Thomas Fensch in Penguin Modern Classics. For Gertrude Stein and her wife Alice B. Toklas, life in Paris was based upon the rue de Fleurus and the Saturday evenings and "it was like a kaleidoscope slowly turning'. Picasso was there with 'his high whinnying Spanish giggle', as were Cezanne and Matisse, Hemingway and Fitzgerald. As Toklas put it - 'The geniuses came and talked to Gertrude Stein and the wives sat with me'. A light-hearted entertainment, this is in fact Gertrude Stein's own autobiography and a roll-call of all the extraordinary painters and writers she met between 1903 and 1932. Audacious, sardonic and characteristically self-confident, this is a definitive account by American in Paris. Gertrude Stein (1874-1946), a writer of experimental prose, is one of the original American Modernists. Born in Pennsylvania, she lived most of her life in Paris with her partner, Alice B. Toklas. Experimental books like Three Lives (1909), Tender Buttons (1914), and The Making of Americans (1925) established her reputation as an avant-garde stylist, and The Autobiography of Alice B. Toklas made her an international celebrity. As an experimental writer she has been an inspiration to countless novelists and poets in our century, from Ernest Hemingway and Edith Sitwell in her own time to Jack Kerouac and Robert Duncan in ours. If you enjoyed The Autobiography of Alice B. Toklas, you might like Virginia Woolf's Orlando, also available in Penguin Modern Classics. 'Buttonholes the reader with its informality, its unhurried rhythms, deadpan humour and acerbic remarks' Frances Spalding, Sunday Times', 'language": "en", "image": "https: //images.isbndb.com/covers/53/61/9780141185361.jpg", "title_long": "Modern Classics Autobiography of Alice B Toklas (Penguin Modern Classics)", "edition": "New Ed", "dimensions": "Height: 7.77 Inches, Length: 5.1 Inches, Weight: 0.44533376924 Pounds, Width: 0.63 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.1}, "width": {"unit": "inches", "value": 0.63}, "weight": {"unit": "pounds", "value": 0.44533376924}, "height": {"unit": "inches", "value": 7.77}}, "pages": 272, "date_published": "2001-05-01", "subjects": ["Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Community & Culture', 'Women', 'Literature & Fiction', 'Essays & Correspondence', 'Essays', 'Genre Fiction'], 'authors": ["Gertrude Stein'], 'title": "Modern Classics Autobiography of Alice B Toklas (Penguin Modern Classics)", "isbn13": "9780141185361", "msrp": 13.5, 'binding": "Paperback", "isbn": "0141185368", "isbn10": "0141185368"}}