{"book": {"publisher": "Penguin UK", "synopsis": "Review      “Any woman who’s suffered a relationship trauma, or simply lost her way in the confusion of modern life, will die for this book . . . Wickedly funny, it may not improve your love life, but it will make you squeal with laughter.” —Cosmopolitan“Irritatingly accurate, Straight Talking is a hilarious and poignant look at love and sex.” —Elle“Sharp, funny, and packed with familiar situations for all those who’ve ever embarked on the dating game.” —Tattler      Product Description      Number one bestseller Jane Green - author of Babyville and The Love Verb - explores the hectic life of a single career girl looking to find love in her hilarious first novel Straight Talking. This could be about your best friend. Or your girlfriend. Or it might be about you. Are you Tasha - single and searching? Or her best friends: Andy, hooked on passion; Mel, stuck in a relationship with a bastard; or Emma, endlessly waiting for her other half to propose? Do you know an Andrew - suave, good-looking and head over heels in love . . . with himself? Or a Simon - allergic to commitment and dangerously treacherous? Or even an Adam - handsome, kind, humorous, but too nice to be sexy? Follow them all in their journey to find fulfillment and love. \"Funny, honest, superb\" Company \"Any woman who\'s suffered a relationship trauma will die for this book. Wickedly funny, will make you squeal with laughter\' Cosmopolitan      About the Author      Jane Green is the Number One bestselling author of nineteen novels including: Straight Talking, Jemima J, Mr Maybe, Bookends, Babyville, Spellbound, The Other Woman, Life Swap, Second Chance, The Beach House, Girl Friday, The Love Verb, The Patchwork Marriage, The Accidental Husband and Tempting Fate. Jane and her husband live in Connecticut with their blended family of six children.      Excerpt. © Reprinted by permission. All rights reserved.      1I was never supposed to be single at thirty years old. I was supposed to be like my mother, wasn\'t I? Married, a couple of kids, a nice home with Colefax and Fowler wallpaper and a husband with a sports car and a mistress or two.Well, to be honest I would mind about the mistresses, but not as much as I mind being single. What I\'d really, really love is a chance to walk down that aisle dressed in a cloud of white, and let\'s face it, I\'m up there at the top, gathering dust.It can\'t be that unusual, surely, to be thirty years old and to spend most of your spare time dreaming about the most important day of your life? I don\'t know, perhaps it\'s just me, perhaps other women redirect their energies into their careers. Perhaps I\'m just a desperately sad example of womanhood. Oh God, I hope not.It\'s not as if I haven\'t had relationships, although, admittedly, none of them have come close to proposing. I\'ve come close to thinking they were my potential husband. A bit too close. Every time. But hey, if you\'re going to go into it you may as well go into it thinking this time he might be Mr. Right, as opposed to Mr. Right-for-three-weeks-before-he-does-his-usual-disappearing-act.Sometimes I think it\'s me. I think I must be doing something wrong, giving out subliminal messages so they can smell the desperation, read the neon lights on my forehead . . . 'keep away from this woman, she is looking for commitment,' but most of the time I think it\'s them. Bastards. All of them.But I never quite lose hope that my perfect man, my soulmate, is out there waiting for me, and every time my heart gets broken I think that next time it\'s going to be different.And I\'m a sucker for big, strong, handsome men. Exactly the type my mother always told me to avoid. 'Go for the ugly ones,' she always used to say, 'then they\'ll be grateful.' But she landed up with my handsome father, so she\'s never had the pleasure of that particular experience.And the problem with small men is they make you feel like an Amazonian giant. At least they do if you\'re five feet, eight and a half inches, and a size twelve', 'language": "en", "image": "https: //images.isbndb.com/covers/15/16/9780141011516.jpg", "title_long": "Straight Talking", "dimensions": "Height: 7.78 Inches, Length: 5.15 Inches, Weight: 0.46958461806 Pounds, Width: 0.76 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.15}, "width": {"unit": "inches", "value": 0.76}, "weight": {"unit": "pounds", "value": 0.46958461806}, "height": {"unit": "inches", "value": 7.78}}, "pages": 304, "date_published": "2010-07-27", "subjects": ["Literature & Fiction', 'Women's Fiction'], 'authors": ['Jane Green'], 'title": "Straight Talking", "isbn13": "9780141011516", "msrp": "0.00", "binding": "Paperback", "isbn": "0141011513", "isbn10": "0141011513"}}