{"book": {"publisher": "Penguin Classics", "synopsis": "Winner of the Booker Prize—a tale of the strange obsessions that haunt a playwright as he composes his memoirs<br/><br/>Charles Arrowby, leading light of England"s theatrical set, retires from glittering London to an isolated home by the sea. He plans to write a memoir about his great love affair with Clement Makin, his mentor, both professionally and personally, and amuse himself with Lizzie, an actress he has strung along for many years. None of his plans work out, and his memoir evolves into a riveting chronicle of the strange events and unexpected visitors-some real, some spectral-that disrupt his world and shake his oversized ego to its very core.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https: //images.isbndb.com/covers/61/60/9780141186160.jpg", "title_long": "The Sea, the Sea (Penguin Twentieth-Century Classics)", "edition": "1", "dimensions": "Height: 0.8 Inches, Length: 7.8 Inches, Weight: 0.95 Pounds, Width: 5.1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.8}, "width": {"unit": "inches", "value": 5.1}, "weight": {"unit": "pounds", "value": 0.95}, "height": {"unit": "inches", "value": 0.8}}, "pages": 528, "date_published": "2001-03-01", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Sea Stories', 'Literary', 'Reference', 'Teen & Young Adult', 'Self Service', 'Custom Stores'], 'authors": ["Iris Murdoch'], 'title": "The Sea, the Sea (Penguin Twentieth-Century Classics)", "isbn13": "9780141186160", "msrp": 20, "binding": "Paperback", "related": {"ePub": "1101495650"}, "isbn": "014118616X", "isbn10": "014118616X", "other_isbns": [{'isbn": "9781101495650", "binding": "print"}]}}