{"book": {"publisher": "Penguin Classic", "synopsis": "The most popular of Virginia Woolf"s novels during her lifetime, The Years is a savage indictment of British society at the turn of the century, edited with an introduction and notes by Jeri Johnson in Penguin Modern Classics. The Years is the story of three generations of the Pargiter family - their intimacies and estrangements, anxieties and triumphs - mapped out against the bustling rhythms of London"s streets during the first decades of the twentieth century. Growing up in a typically Victorian household, the Pargiter children must learn to find their footing in an alternative world, where the rules of etiquette have shifted from the drawing-room to the air-raid shelter. A work of fluid and dazzling lucidity, The Years eschews a simple line of development in favour of a varied and constantly changing style, emphasises the radical discontinuity of personal experiences and historical events. Virginia Woolf"s penultimate novel celebrates the resilience of the individual self and, in her dazzlingly fluid and distinctive voice, she confidently paints a broad canvas across time, generation and class. Virginia Woolf (1882-1941) is regarded as a major 20th century author and essayist, a key figure in literary history as a feminist and modernist, and the centre of 'The Bloomsbury Group'. This informal collective of artists and writers which included Lytton Strachey and Roger Fry, exerted a powerful influence over early twentieth-century British culture. Between 1925 and 1931 Virginia Woolf produced what are now regarded as her finest masterpieces, from Mrs Dalloway (1925) to the poetic and highly experimental novel The Waves (1931). She also maintained an astonishing output of literary criticism, short fiction, journalism and biography, including the playfully subversive Orlando (1928) and A Room of One's Own (1929) a passionate feminist essay. If you enjoyed The Years, you might also like Ford Madox Ford's Parade's End, also available in Penguin Classics. 'Inspired ... a brilliant fantasia of all Time's problems, age and youth, change and performance, truth and illusion' The Times Literary Supplement', 'language": "en", "image": "https: //images.isbndb.com/covers/53/23/9780141185323.jpg", "title_long": "The Years", "dimensions": "Height: 7.8 Inches, Length: 5.1 Inches, Weight: 0.67461452172 Pounds, Width: 0.84 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.1}, "width": {"unit": "inches", "value": 0.84}, "weight": {"unit": "pounds", "value": 0.67461452172}, "height": {"unit": "inches", "value": 7.8}}, "pages": 448, "date_published": "2002-03-05", "subjects": ["Literature & Fiction', 'Classics'], 'authors": ["Virginia Woolf'], 'title": "The Years", "isbn13": "9780141185323", "msrp": 26.5, 'binding": "Paperback", "isbn": "0141185325", "isbn10": "0141185325"}}