{"book": {"publisher": "Penguin Classic", "synopsis": "Fully restored edition of Anthony Burgess" original text of A Clockwork Orange, with a glossary of the teen slang "Nadsat", explanatory notes, pages from the original typescript, interviews, articles and reviews Edited by Andrew Biswell With a Foreword by Martin Amis 'It is a horrorshow story ...' Fifteen-year-old Alex likes lashings of ultraviolence. He and his gang of friends rob, kill and rape their way through a nightmarish future, until the State puts a stop to his riotous excesses. But what will his re-education mean? A dystopian horror, a black comedy, an exploration of choice, A Clockwork Orange is also a work of exuberant invention which created a new language for its characters. This critical edition restores the text of the novel as Anthony Burgess originally wrote it, and includes a glossary of the teen slang 'Nadsat', explanatory notes, pages from the original typescript, interviews, articles and reviews, shedding light on the enduring fascination of the novel's 'sweet and juicy criminality'. Anthony Burgess was born in Manchester in 1917 and educated at Xaverian College and Manchester University. He spent six years in the British Army before becoming a schoolmaster and colonial education officer in Malaya and Brunei. After the success of his Malayan Trilogy, he became a full-time writer in 1959. His books have been published all over the world, and they include The Complete Enderby, Nothing Like the Sun, Napoleon Symphony, Tremor of Intent, Earthly Powers and A Dead Man in Deptford. Anthony Burgess died in London in 1993. Andrew Biswell is the Professor of Modern Literature at Manchester Metropolitan University and the Director of the International Anthony Burgess Foundation. His publications include a biography, The Real Life of Anthony Burgess, which won the Portico Prize in 2006. He is currently editing the letters and short stories of Anthony Burgess.', 'language": "en", "image": "https: //images.isbndb.com/covers/26/05/9780141182605.jpg", "title_long": "A Clockwork Orange", "edition": "5th or later Edition", "dimensions": "Height: 7.75 Inches, Length: 5.08 Inches, Weight: 0.29541943108 Pounds, Width: 0.41 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.08}, "width": {"unit": "inches", "value": 0.41}, "weight": {"unit": "pounds", "value": 0.29541943108}, "height": {"unit": "inches", "value": 7.75}}, "pages": 176, "date_published": "2000-02-22", "subjects": ["Literature & Fiction', 'Classics', 'Dramas & Plays', 'Anthologies'], 'authors": ["Anthony Burgess'], 'title": "A Clockwork Orange", "isbn13": "9780141182605", "msrp": 19.75, 'binding": "Paperback", "isbn": "0141182601", "isbn10": "0141182601"}}