{"book": {"publisher": "Penguin Classics", "synopsis": "Drawing on George Eliot"s own childhood experiences to craft an unforgettable story of first love, sibling rivalry and regret, The Mill on the Floss is edited with an introduction and notes by A.S. Byatt, author of Possession, in Penguin Classics. Brought up at Dorlcote Mill, Maggie Tulliver worships her brother Tom and is desperate to win the approval of her parents, but her passionate, wayward nature and her fierce intelligence bring her into constant conflict with her family. As she reaches adulthood, the clash between their expectations and her desires is painfully played out as she finds herself torn between her relationships with three very different men: her proud and stubborn brother; hunchbacked Tom Wakem, the son of her family"s worst enemy; and the charismatic but dangerous Stephen Guest. With its poignant portrayal of sibling relationships, The Mill on the Floss is considered George Eliot"s most autobiographical novel; it is also one of her most powerful and moving. In this edition, writer and critic A.S. Byatt, author of Possession, provides full explanatory notes and an introduction relating The Mill on the Floss to George Eliot's own life and times. Mary Ann Evans (1819-80) began her literary career as a translator, and later editor, of the Westminster Review. In 1857, she published Scenes of Clerical Life, the first of eight novels she would publish under the name of 'George Eliot', including The Mill on the Floss, Middlemarch, and Daniel Deronda. If you enjoyed The Mill on the Floss, you might like Thomas Hardy's Jude the Obscure, also available in Penguin Classics.', 'language": "en", "image": "https: //images.isbndb.com/covers/96/24/9780141439624.jpg", "title_long": "The Mill on the Floss (Penguin Classics)", "edition": "Reissue", "dimensions": "Height: 7.8 Inches, Length: 5.1 Inches, Weight: 0.96121546232 pounds, Width: 1.1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.1}, "width": {"unit": "inches", "value": 1.1}, "weight": {"unit": "pounds", "value": 0.96121546232}, "height": {"unit": "inches", "value": 7.8}}, "pages": 704, "date_published": "2003-04-29", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Family Life', 'Literary', 'Teen & Young Adult', 'Self Service', 'Custom Stores'], 'authors": ["George Eliot'], 'title": "The Mill on the Floss (Penguin Classics)", "isbn13": "9780141439624", "msrp": 12, 'binding": "Paperback", "isbn": "0141439629", "isbn10": "0141439629"}}