{"book": {"publisher": "Penguin Books", "synopsis": "<b>“Plague stories remind us that we cannot manage without community . . . <i>Year of Wonders </i>is a testament to that very notion.” – <i>The Washington Post<br></i><br>An unforgettable tale, set <b>in 17th century England,</b> of a village that quarantines itself to arrest the spread of the plague, from the author <i>The Secret Chord</i> and of <i>March</i>, winner of the Pulitzer Prize <br></b><br> When an infected bolt of cloth carries plague from London to an isolated village, a housemaid named Anna Frith emerges as an unlikely heroine and healer. Through Anna\"s eyes we follow the story of the fateful year of 1666, as she and her fellow villagers confront the spread of disease and superstition. As death reaches into every household and villagers turn from prayers to murderous witch-hunting, Anna must find the strength to confront the disintegration of her community and the lure of illicit love. As she struggles to survive and grow, a year of catastrophe becomes instead annus mirabilis, a "year of wonders."<br><br>Inspired by the true story of Eyam, a village in the rugged hill country of England, <i>Year of Wonders</i> is a richly detailed evocation of a singular moment in history. Written with stunning emotional intelligence and introducing 'an inspiring heroine' (<i>The Wall Street Journal</i>), Brooks blends love and learning, loss and renewal into a spellbinding and unforgettable read.', 'language": "en", "image": "https: //images.isbndb.com/covers/14/31/9780142001431.jpg", "title_long": "Year of Wonders: A Novel of the Plague", "edition": "Reprint", "dimensions": "Height: 0.61 Inches, Length: 7.74 Inches, Weight: 0.55 Pounds, Width: 5.02 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.74}, "width": {"unit": "inches", "value": 5.02}, "weight": {"unit": "pounds", "value": 0.55}, "height": {"unit": "inches", "value": 0.61}}, "pages": 352, "date_published": "2002", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'Family Life', 'World Literature', 'Australia & Oceania', 'Contemporary', 'Literary'], 'authors": ["Geraldine Brooks'], 'title": "Year of Wonders: A Novel of the Plague", "isbn13": "9780142001431", "msrp": "0.00", "binding": "Paperback", "related": {"Kindle Edition": "1101079193", "ePub": "1101079193"}, "isbn": "0142001430", "isbn10": "0142001430", "other_isbns": [{'isbn": "9781101079195", "binding": "print"}]}}