{"book": {"publisher": "Penguin Classics", "synopsis": ""All modern American literature comes from one book by Mark Twain called Hucklberry Finn.' (Ernest Heminway)<br/><br/>Of all the contenders for the title of The Great American Novel, none has a better claim than The Adventures of Huckleberry Finn. Intended at first as a simple story of a boy\'s adventures in the Mississippi Valley—a sequel to Tom Sawyer—the book grew and matured under Twain\'s hand into a work of immeasurable richness and complexity. More than a century after its publication, the critical debate over the symbolic significance of Huck\'s and Jim\'s voyage is still fresh, and it remains a major work that can be enjoyed at many levels: as an incomparable adventure story and as a classic of American humor. This Penguin Classics edition features an introduction by John Seelye, author of The True Adventures of Huckleberry Finn, and explanatory notes by Guy Cardwell.<br/>For more than sixty-five years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,
        500 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https: //images.isbndb.com/covers/71/79/9780142437179.jpg", "title_long": "The Adventures of Huckleberry Finn (Penguin Classics)", "edition": "First Edition", "dimensions": "Height: 8.11 Inches, Length: 5.06 Inches, Weight: 0.66 Pounds, Width: 0.67 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.06}, "width": {"unit": "inches", "value": 0.67}, "weight": {"unit": "pounds", "value": 0.66}, "height": {"unit": "inches", "value": 8.11}}, "pages": 368, "date_published": "2002-12-31", "subjects": ["Children's Books', 'Classics', 'Literature & Fiction', 'Genre Fiction', 'Coming of Age', 'Contemporary', 'Literary'], 'authors": ["Mark Twain'], 'title": "The Adventures of Huckleberry Finn (Penguin Classics)", "isbn13": "9780142437179", "msrp": 8, "binding": "Paperback", "isbn": "0142437174", "isbn10": "0142437174", "other_isbns": [{'isbn": "9781448155217", "binding": "print"}]}}