{"book": {"publisher": "Penguin Books", "synopsis": "The second installment in Jasper Fforde’s New York Times bestselling series follows literary detective Thursday Next on another adventure in her alternate reality of literature-obsessed England—from the author of The Constant Rabbit<br/><br/>The inventive, exuberant, and totally original literary fun that began with The Eyre Affair continues with New York Times bestselling author Jasper Fforde’s magnificent second adventure starring the resourceful, fearless literary sleuth Thursday Next. When Landen, the love of her life, is eradicated by the corrupt multinational Goliath Corporation, Thursday must moonlight as a Prose Resource Operative of Jurisfiction—the police force inside the BookWorld. She is apprenticed to the man-hating Miss Havisham from Dickens’s Great Expectations, who grudgingly shows Thursday the ropes. And she gains just enough skill to get herself in a real mess entering the pages of Poe’s “The Raven.” What she really wants is to get Landen back. But this latest mission is not without further complications.<br/><br/>Along with jumping into the works of Kafka and Austen, and even Beatrix Potter’s The Tale of the Flopsy Bunnies, Thursday finds herself the target of a series of potentially lethal coincidences, the authenticator of a newly discovered play by the Bard himself, and the only one who can prevent an unidentifiable pink sludge from engulfing all life on Earth. It’s another genre-bending blend of crime fiction, fantasy, and top-drawer literary entertainment for fans of Douglas Adams and P. G. Wodehouse. Thursday’s zany investigations continue with The Well of Lost Plots.", "language": "en", "image": "https: //images.isbndb.com/covers/40/36/9780142004036.jpg", "title_long": "Lost in a Good Book (A Thursday Next Novel)", "edition": "~", "dimensions": "Height: 7.73 Inches, Length: 0.88 Inches, Weight: 0.7 Pounds, Width: 5.07 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 0.88}, "width": {"unit": "inches", "value": 5.07}, "weight": {"unit": "pounds", "value": 0.7}, "height": {"unit": "inches", "value": 7.73}}, "pages": 399, "date_published": "2004-02-24", "subjects": ["Literature & Fiction', 'Contemporary', 'Literary', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Cozy', 'Supernatural', 'Science Fiction & Fantasy', 'Fantasy', 'Historical', 'Paranormal & Urban'], 'authors": ["Jasper Fforde'], 'title": "Lost in a Good Book (A Thursday Next Novel)", "isbn13": "9780142004036", "msrp": 18, "binding": "Paperback", "related": {"ePub": "1101158115"}, "isbn": "0142004030", "isbn10": "0142004030", "other_isbns": [{'isbn": "9781101158111", "binding": "print"}]}}