{"book": {"publisher": "Firebird", "synopsis": "On completion of her training as an agent of the interstellar federation"s Anthropological Service, Elana is sent to a world whose people may soon destroy their civilization. Since not enough is understood about the situation to justify any interference with their evolution, the Service has no power to act; its agents must go as helpless observers, posing as natives, in the hope of gaining knowledge that may help to save other worlds. This passive role proves intolerable to the young, inexperienced agent assigned to the same city as Elana, a city under totalitarian rule. After falling in love with a local girl who has become Elana"s closest friend, he identifies too completely with the natives and unwittingly endangers the entire world by a well-meant but ill-advised attempt to intervene. Forced to assume responsibility for undoing the damage, Elana finds that only she--at great cost--can prevent an immediate war of annihilation.<br/><br/>Although this novel has the same heroine as the author"s Newbery Honor book Enchantress from the Stars, it is not a sequel but a completely separate--and very different--story intended for older readers, high school age and adults. The two books are in no way dependent on each other.', 'language": "en", "image": "https: //images.isbndb.com/covers/29/31/9780142402931.jpg", "title_long": "The Far Side of Evil", "edition": "Reissue", "dimensions": "Height: 6.96 Inches, Length: 4.99 Inches, Weight: 0.4899994235212 Pounds, Width: 0.88 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.99}, "width": {"unit": "inches", "value": 0.88}, "weight": {"unit": "pounds", "value": 0.4899994235212}, "height": {"unit": "inches", "value": 6.96}}, "pages": 336, "date_published": "2005-01-13", "subjects": ["Children's Books', 'Growing Up & Facts of Life', 'Difficult Discussions', 'Science Fiction & Fantasy', 'Fantasy & Magic', 'Science & Math', 'Technology', 'Teen & Young Adult', 'Literature & Fiction', 'Girls & Women', 'Social & Family Issues', 'Fantasy', 'Science Fiction'], 'authors": ["Sylvia Engdahl'], 'title": "The Far Side of Evil", "isbn13": "9780142402931", "msrp": 20.9, 'binding": "Paperback", "isbn": "0142402931", "isbn10": "0142402931"}}