{"book": {"publisher": "Penguin Classics", "synopsis": "A Penguin Classic<br/><br/>This classic collection—the only one-volume selection of Arthur Miller"s work available—presents a rich cross section of writing from one of our most influential and humane playwrights, containing in full his masterpieces The Crucible and Death of a Salesman. This essential collection also includes the complete texts of After the Fall, The American Clock, The Last Yankee, and Broken Glass, winner of the Olivier Award for Best Play of 1995, as well as excerpts from Miller"s memoir Timebends. An essay by Harold Clurman and Christopher Bigsby"s introduction discuss Miller's standing as one of the greatest American playwrights of all time and his importance to twentieth-century literature.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.', 'language": "en", "image": "https://images.isbndb.com/covers/75/51/9780142437551.jpg", "title_long": "The Portable Arthur Miller (Penguin Classics)", "edition": "Revised", "dimensions": "Height: 1.11 Inches, Length: 7.74 Inches, Weight: 0.91 Pounds, Width: 6.36 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.74}, "width": {"unit": "inches", "value": 6.36}, "weight": {"unit": "pounds", "value": 0.91}, "height": {"unit": "inches", "value": 1.11}}, "pages": 624, "date_published": "2003-07-29", "subjects": ["Literature & Fiction', 'Classics', 'Dramas & Plays', 'United States', 'History & Criticism', 'Genres & Styles', 'Short Stories & Anthologies', 'Anthologies', 'Self Service', 'Custom Stores'], 'authors": ["Arthur Miller'], 'title": "The Portable Arthur Miller (Penguin Classics)", "isbn13": "9780142437551", "msrp": 13.14, 'binding": "Paperback", "isbn": "0142437557", "isbn10": "0142437557"}}