{"book": {"publisher": "Penguin Books", "synopsis": "“You either love Andrea Camilleri or you haven’t read him yet. Each novel in this wholly addictive, entirely magical series, set in Sicily and starring a detective unlike any other in crime fiction, blasts the brain like a shot of pure oxygen. Aglow with local color, packed with flint-dry wit, as fresh and clean as Mediterranean seafood — altogether transporting. Long live Camilleri, and long live Montalbano.” A.J. Finn, #1 New York Times bestselling author of The Woman in the Window<br/><br/>Inspector Montalbano, praised as “a delightful creation” (USA Today), has been compared to the legendary detectives of Georges Simenon, Dashiell Hammett, and Raymond Chandler. As the fourth mystery in the internationally bestselling series opens, Montalbano’s gruesome discovery of a lovely, naked young woman suffocated in her bed immediately sets him on a search for her killer. Among the suspects are her aging husband, a famous doctor; a shy admirer, now disappeared; an antiques-dealing lover from Bologna; and the victim’s friend Anna, whose charms Montalbano cannot help but appreciate... But it is a mysterious, reclusive violinist who holds the key to the murder.", "language": "en", "image": "https: //images.isbndb.com/covers/44/56/9780142004456.jpg", "title_long": "Voice of the Violin (An Inspector Montalbano Mystery)", "edition": "Reprint", "dimensions": "Height: 7.7 Inches, Length: 5 Inches, Weight: 0.39 Pounds, Width: 0.5 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 0.5}, "weight": {"unit": "pounds", "value": 0.39}, "height": {"unit": "inches", "value": 7.7}}, "pages": 256, "date_published": "2004-06-29", "subjects": ["Literature & Fiction', 'Genre Fiction', 'World Literature', 'European', 'Mystery, Thriller & Suspense', 'Mystery', 'Police Procedurals', 'International Mystery & Crime', 'Thrillers & Suspense', 'Suspense', 'Self Service', 'Custom Stores'], 'authors": ["Andrea Camilleri'], 'title": "Voice of the Violin (An Inspector Montalbano Mystery)", "isbn13": "9780142004456", "msrp": 16, "binding": "Paperback", "related": {"Kindle Edition": "1440677948", "ePub": "1440677948"}, "isbn": "0142004456", "isbn10": "0142004456", "other_isbns": [{'isbn": "9781440677946", "binding": "print"}]}}