{"book": {"publisher": "Penguin Books", "synopsis": "Meet Thursday Next, literary detective without equal, fear or boyfriend<br/><br/>Jasper Fforde’s beloved New York Times bestselling novel introduces literary detective Thursday Next and her alternate reality of literature-obsessed England—from the author of The Constant Rabbit<br/><br/>Fans of Douglas Adams and P. G. Wodehouse will love visiting Jasper Fforde"s Great Britain, circa 1985, when time travel is routine, cloning is a reality (dodos are the resurrected pet of choice), and literature is taken very, very seriously: it’s a bibliophile’s dream. England is a virtual police state where an aunt can get lost (literally) in a Wordsworth poem and forging Byronic verse is a punishable offense. All this is business as usual for Thursday Next, renowned Special Operative in literary detection. But when someone begins kidnapping characters from works of literature and plucks Jane Eyre from the pages of Brontë"s novel, Thursday is faced with the challenge of her career. Fforde"s ingenious fantasy—enhanced by a Web site that re-creates the world of the novel—unites intrigue with English literature in a delightfully witty mix.', 'language": "en", "image": "https: //images.isbndb.com/covers/18/06/9780142001806.jpg", "title_long": "The Eyre Affair: A Thursday Next Novel", "dimensions": "Height: 0.72 Inches, Length: 7.7 Inches, Weight: 0.58 Pounds, Width: 5.1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.7}, "width": {"unit": "inches", "value": 5.1}, "weight": {"unit": "pounds", "value": 0.58}, "height": {"unit": "inches", "value": 0.72}}, "pages": 400, "date_published": "2003-02-25", "subjects": ["Literature & Fiction', 'Literary', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Supernatural', 'Thrillers & Suspense', 'Spies & Politics', 'Science Fiction & Fantasy', 'Fantasy', 'Historical', 'Paranormal & Urban', 'Science Fiction', 'Alternate History', 'Politics & Social Sciences', 'Politics & Government', 'Specific Topics'], 'authors": ["Jasper Fforde'], 'title": "The Eyre Affair: A Thursday Next Novel", "isbn13": "9780142001806", "msrp": 17, "binding": "Paperback", "related": {"Kindle Edition": "1101158514", "ePub": "1101158514"}, "isbn": "0142001805", "isbn10": "0142001805", "other_isbns": [{'isbn": "9781101158517", "binding": "print"}]}}