{"book": {"publisher": "Penguin Classics", "synopsis": '“A real contribution to the study of Faulkner’s work.” —Edmund Wilson<br/><br/>A Penguin Classic<br/><br/>In prose of biblical grandeur and feverish intensity, William Faulkner reconstructed the history of the American South as a tragic legend of courage and cruelty, gallantry and greed, futile nobility and obscene crimes. He set this legend in a small, minutely realized parallel universe that he called Yoknapatawpha County, Mississippi.<br/><br/>No single volume better conveys the scope of Faulkner’s vision than The Portable Faulkner. The book includes self-contained episodes from the novels The Sound and the Fury, Light in August, and Sanctuary; the stories “The Bear,” “Spotted Horses,” “A Rose for Emily,” and “Old Man,” among others; a map of Yoknapatawpha County and a chronology of the Compson family created by Faulkner especially for this edition; and the complete text of Faulkner’s 1950 address upon receiving the Nobel Prize in literature. Malcolm Cowley’s critical introduction was praised as “splendid” by Faulkner himself.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,
        800 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https: //images.isbndb.com/covers/72/85/9780142437285.jpg", "title_long": "The Portable Faulkner (Penguin Classics)", "edition": "Revised & Expanded", "dimensions": "Height: 7.73 Inches, Length: 5.18 Inches, Weight: 1.1 Pounds, Width: 1.53 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.18}, "width": {"unit": "inches", "value": 1.53}, "weight": {"unit": "pounds", "value": 1.1}, "height": {"unit": "inches", "value": 7.73}}, "pages": 688, "date_published": "2003-02-25", "subjects": ["Biographies & Memoirs', 'Regional U.S.', 'South', 'Literature & Fiction', 'Classics', 'Genre Fiction', 'Historical', 'Short Stories & Anthologies', 'Anthologies', 'Short Stories', 'United States', 'Reference', 'Teen & Young Adult', 'Self Service', 'Custom Stores'], 'authors": ["William Faulkner'], 'title": "The Portable Faulkner (Penguin Classics)", "isbn13": "9780142437285", "msrp": 13.56, 'binding": "Paperback", "isbn": "014243728X", "isbn10": "014243728X"}}