{"book": {"publisher": "Penguin Books", "synopsis": "“The Joy Luck Club is one of my favorite books. From the moment I first started reading it, I knew it was going to be incredible. For me, it was one of those once-in-a-lifetime reading experiences that you cherish forever. It inspired me as a writer and still remains hugely inspirational.” —Kevin Kwan, author of Crazy Rich Asians<br/><br/>Amy Tan’s beloved, New York Times bestselling tale of mothers and daughters, now the focus of a new documentary Amy Tan: Unintended Memoir on Netflix<br/><br/>Four mothers, four daughters, four families whose histories shift with the four winds depending on who\"s "saying" the stories. In 1949 four Chinese women, recent immigrants to San Francisco, begin meeting to eat dim sum, play mahjong, and talk. United in shared unspeakable loss and hope, they call themselves the Joy Luck Club. Rather than sink into tragedy, they choose to gather to raise their spirits and money. 'To despair was to wish back for something already lost. Or to prolong what was already unbearable.' Forty years later the stories and history continue.<br/><br/>With wit and sensitivity, Amy Tan examines the sometimes painful, often tender, and always deep connection between mothers and daughters. As each woman reveals her secrets, trying to unravel the truth about her life, the strings become more tangled, more entwined. Mothers boast or despair over daughters, and daughters roll their eyes even as they feel the inextricable tightening of their matriarchal ties. Tan is an astute storyteller, enticing readers to immerse themselves into these lives of complexity and mystery.', 'language": "en", "image": "https://images.isbndb.com/covers/80/92/9780143038092.jpg", "title_long": "The Joy Luck Club: A Novel", "edition": "1", "dimensions": "Height: 7.97 Inches, Length: 5.27 Inches, Weight: 0.001322773572 Pounds, Width: 0.77 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.27}, "width": {"unit": "inches", "value": 0.77}, "weight": {"unit": "pounds", "value": 0.001322773572}, "height": {"unit": "inches", "value": 7.97}}, "pages": 352, "date_published": "2006-09-21", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Family Saga', 'History & Criticism', 'Criticism & Theory', 'United States', 'Asian American', 'Contemporary', 'Literary', 'Reference', 'Self Service', 'Custom Stores'], 'authors": ["Amy Tan'], 'title": "The Joy Luck Club: A Novel", "isbn13": "9780143038092", "msrp": 12.99, "binding": "Paperback", "related": {"Kindle Edition": "1101502738", "ePub": "1101502738"}, "isbn": "0143038095", "isbn10": "0143038095", "other_isbns": [{'isbn": "9781101502730", "binding": "print"}]}}