{"book": {"publisher": "Penguin Books", "synopsis": "#1 New York Times bestseller<br/><br/>“Barry will teach you almost everything you need to know about one of the deadliest outbreaks in human history.”—Bill Gates<br/><br/>"Monumental... an authoritative and disturbing morality tale."—Chicago Tribune<br/><br/>The strongest weapon against pandemic is the truth. Read why in the definitive account of the 1918 Flu Epidemic.<br/><br/>Magisterial in its breadth of perspective and depth of research, The Great Influenza provides us with a precise and sobering model as we confront the epidemics looming on our own horizon. As Barry concludes, "The final lesson of 1918, a simple one yet one most difficult to execute, is that...those in authority must retain the public\'s trust. The way to do that is to distort nothing, to put the best face on nothing, to try to manipulate no one. Lincoln said that first, and best. A leader must make whatever horror exists concrete. Only then will people be able to break it apart.'<br/><br/>At the height of World War I, history’s most lethal influenza virus erupted in an army camp in Kansas, moved east with American troops, then exploded, killing as many as 100 million people worldwide. It killed more people in twenty-four months than AIDS killed in twenty-four years, more in a year than the Black Death killed in a century. But this was not the Middle Ages, and 1918 marked the first collision of science and epidemic disease.', 'language": "en", "image": "https://images.isbndb.com/covers/64/94/9780143036494.jpg", "title_long": "The Great Influenza: The Story of the Deadliest Pandemic in History", "edition": "Revised", "dimensions": "Height: 8.46455 Inches, Length: 5.78739 Inches, Weight: 1.04940036712 Pounds, Width: 1.1811 inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.78739}, "width": {"unit": "inches", "value": 1.1811}, "weight": {"unit": "pounds", "value": 1.04940036712}, "height": {"unit": "inches", "value": 8.46455}}, "pages": 546, "date_published": "2005-10-04", "subjects": ["History', 'Americas', 'United States', 'World', 'Reference', 'Science & Math', 'History & Philosophy', 'Medical Books', 'Medicine', 'Internal Medicine', 'Politics & Social Sciences', 'Sociology'], 'authors": ["John M. M. Barry'], 'title": "The Great Influenza: The Story of the Deadliest Pandemic in History", "isbn13": "9780143036494", "msrp": 19, "binding": "Paperback", "related": {"Kindle Edition": "1101200979"}, "isbn": "0143036491", "isbn10": "0143036491", "other_isbns": [{'isbn": "9781101200971", "binding": "print"}]}}