{"book": {"publisher": "Penguin Classics", "synopsis": "A Penguin Classics Deluxe Edition of Tolstoy\"s great Russian epic. Nominated as one of America’s best-loved novels by PBS’s The Great American Read<br/><br/>Set against the sweeping panoply of Napoleon\"s invasion of Russia, War and Peace—presented here in the first new English translation in forty years—is often considered the greatest novel ever written. At its center are Pierre Bezukhov, searching for meaning in his life; cynical Prince Andrei, ennobled by wartime suffering; and Natasha Rostov, whose impulsiveness threatens to destroy her happiness. As Tolstoy follows the changing fortunes of his characters, he crafts a view of humanity that is both epic and intimate and that continues to define fiction at its most resplendent.<br/><br/>This edition includes an introduction, note on the translation, cast of characters, maps, notes on the major battles depicted, and chapter summaries.<br/><br/>Praise for Antony Brigg\"s translation of War and Peace:<br/><br/>'The best translation so far of Tolstoy\'s masterpiece into English.'<br/>-Robert A. Maguire, professor emeritus of Russian studies, Columbia University<br/><br/>'In Tolstoy\'s work part of the translator\'s difficulty lies in conveying not only the simplicity but the subtlety of the book\'s scale and effect. . . . Briggs has rendered both with a particular exactness and a vigorous precision not to be found, I think, in any previous translation.'<br/>-John Bayley, author of Elegy for Iris<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.', 'language": "en", "image": "https://images.isbndb.com/covers/99/90/9780143039990.jpg", "title_long": "War and Peace (Penguin Classics, Deluxe Edition)", "edition": "Deluxe", "dimensions": "Height: 8.32 Inches, Length: 5.6 Inches, Weight: 2.95 Pounds, Width: 2.29 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.6}, "width": {"unit": "inches", "value": 2.29}, "weight": {"unit": "pounds", "value": 2.95}, "height": {"unit": "inches", "value": 8.32}}, "pages": 1424, "date_published": "2006-11-28", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Family Saga', 'Historical', 'World Literature', 'Russian & Soviet', 'Self Service', 'Custom Stores'], 'authors": ["Leo Tolstoy'], 'title": "War and Peace (Penguin Classics, Deluxe Edition)", "isbn13": "9780143039990", "msrp": 22, "binding": "Paperback", "isbn": "0143039997", "isbn10": "0143039997", "other_isbns": [{'isbn": "9781627936644", "binding": "print"}]}}