{"book": {"publisher": "Penguin Classics", "synopsis": "An accesible version of Einstein\"s masterpiece of theory, written by the genius himself<br/><br/>According to Einstein himself, this book is intended "to give an exact insight into the theory of Relativity to those readers who, from a general scientific and philosophical point of view, are interested in the theory, but who are not conversant with the mathematical apparatus of theoretical physics." When he wrote the book in 1916, Einstein\'s name was scarcely known outside the physics institutes. Having just completed his masterpiece, The General Theory of Relativity—which provided a brand-new theory of gravity and promised a new perspective on the cosmos as a whole—he set out at once to share his excitement with as wide a public as possible in this popular and accessible book.<br/><br/>Here published for the first time as a Penguin Classic, this edition of Relativity features a new introduction by bestselling science author Nigel Calder.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.', 'language": "en", "image": "https://images.isbndb.com/covers/98/22/9780143039822.jpg", "title_long": "Relativity: The Special and the General Theory (Penguin Classics)", "edition": "Reprint", "dimensions": "Height: 7.71 Inches, Length: 5.03 Inches, Weight: 0.29 Pounds, Width: 0.41 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.03}, "width": {"unit": "inches", "value": 0.41}, "weight": {"unit": "pounds", "value": 0.29}, "height": {"unit": "inches", "value": 7.71}}, "pages": 160, "date_published": "2006-07-25", "subjects": ["Science & Math', 'Astronomy & Space Science', 'Astrophysics & Space Science', 'Cosmology', 'Essays & Commentary', 'History & Philosophy', 'Physics', 'Gravity', 'Relativity'], 'authors": ["Albert Einstein'], 'title": "Relativity: The Special and the General Theory (Penguin Classics)", "isbn13": "9780143039822", "msrp": 15, "binding": "Paperback", "related": {"ePub": "1440627126"}, "isbn": "0143039822", "isbn10": "0143039822", "other_isbns": [{'isbn": "9781440627125", "binding": "print"}]}}