{"book": {"publisher": "Penguin Books", "synopsis": "The third installment in Jasper Fforde’s New York Times bestselling series follows literary detective Thursday Next on another adventure in her alternate reality of literature-obsessed England—from the author of The Constant Rabbit<br/><br/>Jasper Fforde has done it again in this genre-bending blend of crime fiction, fantasy, and top-drawer literary entertainment. After two rollicking New York Times bestselling adventures through Western literature, resourceful BookWorld literary detective Thursday Next definitely needs some downtime. And what better place for a respite than in the hidden depths of the Well of Lost Plots, where all unpublished books reside? But peace and quiet remain elusive for Thursday, who soon discovers that the Well is a veritable linguistic free-for-all, where grammasites run rampant, plot devices are hawked on the black market, and lousy books—like the one she has taken up residence in—are scrapped for salvage. To make matters worse, a murderer is stalking the personnel of Jurisfiction and it’s up to Thursday to save the day. A brilliant feat of literary showmanship filled with wit, fantasy, and effervescent originality, this Ffordian tour de force will appeal to fans of Douglas Adams and P. G. Wodehouse.", "language": "en", "image": "https://images.isbndb.com/covers/43/53/9780143034353.jpg", "title_long": "The Well of Lost Plots (Thursday Next Series)", "edition": "~", "dimensions": "Height: 7.8 Inches, Length: 5 Inches, Weight: 0.7 Pounds, Width: 0.9 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 0.9}, "weight": {"unit": "pounds", "value": 0.7}, "height": {"unit": "inches", "value": 7.8}}, "pages": 375, "date_published": "2004-08-03", "subjects": ["Humor & Entertainment', 'Humor', 'Lawyers & Criminals', 'Literature & Fiction', 'Action & Adventure', 'Fantasy', 'Mystery, Thriller & Suspense', 'Women's Adventure', 'British & Irish', 'Humor & Satire', 'Satire', 'Humorous', 'Mystery', 'Women Sleuths', 'Cozy', 'Supernatural', 'Science Fiction & Fantasy', 'Historical', 'Self Service', 'Custom Stores'], 'authors": ["Jasper Fforde'], 'title": "The Well of Lost Plots (Thursday Next Series)", "isbn13": "9780143034353", "msrp": 17, "binding": "Paperback", "related": {"Kindle Edition": "110115862X", "ePub": "110115862X"}, "isbn": "0143034359", "isbn10": "0143034359", "other_isbns": [{'isbn": "9781101158623", "binding": "print"}]}}