{"book": {"publisher": "Penguin Books", "synopsis": "BRAND NEW FOR 2019: A fully revised and updated edition of the quintessential guide for learning to negotiate effectively in every part of your life<br/><br/>"A must read for everyone seeking to master negotiation. This newly updated classic just got even better."--Robert Cialdini, bestselling author of Influence and Pre-Suasion<br/><br/>As director of the world-renowned Wharton Executive Negotiation Workshop, Professor G. Richard Shell has taught thousands of business leaders, lawyers, administrators, and other professionals how to survive and thrive in the sometimes rough-and-tumble world of negotiation. In the third edition of this internationally acclaimed book, he brings to life his systematic, step-by-step approach, built around negotiating effectively as who you are, not who you think you need to be. Shell combines lively stories about world-class negotiators from J. P. Morgan to Mahatma Gandhi with proven bargaining advice based on the latest research into negotiation and neuroscience. This updated edition includes:<br/><br/>This updated edition includes:<br/>路 An easy-to-take "Negotiation I.Q.' test that reveals your unique strengths as a negotiator<br/>路 A brand new chapter on reliable moves to use when you are short on bargaining power or stuck at an impasse<br/>路 Insights on how to succeed when you negotiate online<br/>路 Research on how gender and cultural differences can derail negotiations, and advice for putting relationships back on track', 'language": "en", "image": "https://images.isbndb.com/covers/69/75/9780143036975.jpg", "title_long": "Bargaining for Advantage: Negotiation Strategies for Reasonable People", "edition": "2nd ed.", "dimensions": "Height: 0.29921259812 Inches, Length: 8.5039369992 Inches, Weight: 0.5952481074 Pounds, Width: 5.4330708606 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.5039369992}, "width": {"unit": "inches", "value": 5.4330708606}, "weight": {"unit": "pounds", "value": 0.5952481074}, "height": {"unit": "inches", "value": 0.29921259812}}, "pages": 304, "date_published": "2006-05-02", "subjects": ["Biographies & Memoirs', 'Leaders & Notable People', 'Political', 'Business & Money', 'Business Culture', 'Motivation & Self-Improvement', 'Management & Leadership', 'Motivational', 'Negotiating', 'Skills', 'Communications', 'Reference', 'Self Service', 'Custom Stores'], 'authors": ["G. Richard Shell'], 'title": "Bargaining for Advantage: Negotiation Strategies for Reasonable People", "isbn13": "9780143036975", "msrp": 14.98, "binding": "Paperback", "related": {"Kindle Edition": "1101221372", "ePub": "1101221372"}, "isbn": "0143036971", "isbn10": "0143036971", "other_isbns": [{'isbn": "9781101221372", "binding": "print"}]}}