{"book": {"publisher": "Penguin Classics", "synopsis": "The masterwork of Spain’s preeminent dramatist—now in a new verse translation<br/>Life Is a Dream is a work many hold to be the supreme example of Spanish Golden Age drama. Imbued with highly poetic language and humanist ideals, it is an allegory that considers contending themes of free will and predestination, illusion and reality, played out against the backdrop of court intrigue and the restoration of personal honor.<br/>In the mountainous barrens of Poland, the rightful heir to the kingdom has been imprisoned since birth in an attempt by his father to thwart fate. Meanwhile, a noblewoman arrives to seek revenge against the man who deceived and forsook her love for the prospect of becoming king of Poland. Richly symbolic and metaphorical, Life Is a Dream explores the deepest mysteries of human experience.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https://images.isbndb.com/covers/48/27/9780143104827.jpg", "title_long": "Life Is a Dream (Penguin Classics)", "edition": "ANN", "dimensions": "Height: 7.73 Inches, Length: 5.1 Inches, Weight: 0.29982867632 Pounds, Width: 0.46 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.1}, "width": {"unit": "inches", "value": 0.46}, "weight": {"unit": "pounds", "value": 0.29982867632}, "height": {"unit": "inches", "value": 7.73}}, "pages": 160, "date_published": "2006-12-26", "subjects": ["Literature & Fiction', 'Dramas & Plays', 'Regional & Cultural', 'History & Criticism', 'Genres & Styles', 'Short Stories & Anthologies', 'Anthologies', 'World Literature', 'European', 'Contemporary', 'Self Service', 'Custom Stores'], 'authors": ["Pedro Calderon de la Barca'], 'title": "Life Is a Dream (Penguin Classics)", "isbn13": "9780143104827", "msrp": 14, "binding": "Paperback", "related": {"Kindle Edition": "1440649391", "ePub": "1440649391"}, "isbn": "0143104829", "isbn10": "0143104829", "other_isbns": [{'isbn": "9781440649394", "binding": "print"}]}}