{"book": {"publisher": "Penguin Classics", "synopsis": "Graham Greene\"s classic exploration of love, innocence, and morality in Vietnam<br/><br/>"I never knew a man who had better motives for all the trouble he caused," Graham Greene\'s narrator Fowler remarks of Alden Pyle, the eponymous 'Quiet American' of what is perhaps the most controversial novel of his career. Pyle is the brash young idealist sent out by Washington on a mysterious mission to Saigon, where the French Army struggles against the Vietminh guerrillas.<br/><br/>As young Pyle\'s well-intentioned policies blunder into bloodshed, Fowler, a seasoned and cynical British reporter, finds it impossible to stand safely aside as an observer. But Fowler\'s motives for intervening are suspect, both to the police and himself, for Pyle has stolen Fowler\'s beautiful Vietnamese mistress.<br/><br/>Originally published in 1956 and twice adapted to film, The Quiet American remains a terrifiying and prescient portrait of innocence at large. This Graham Greene Centennial Edition includes a new introductory essay by Robert Stone.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.', 'language": "en", "image": "https://images.isbndb.com/covers/90/20/9780143039020.jpg", "title_long": "The Quiet American (Penguin Classics Deluxe Edition)", "edition": "Reprint", "dimensions": "Height: 8.36 Inches, Length: 5.67 Inches, Weight: 0.51 Pounds, Width: 0.55 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.67}, "width": {"unit": "inches", "value": 0.55}, "weight": {"unit": "pounds", "value": 0.51}, "height": {"unit": "inches", "value": 8.36}}, "pages": 180, "date_published": "2004-08-31", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'United States', 'Contemporary', 'Literary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Spies & Politics', 'Teen & Young Adult', 'Self Service', 'Custom Stores'], 'authors": ["Graham Greene'], 'title": "The Quiet American (Penguin Classics Deluxe Edition)", "isbn13": "9780143039020", "msrp": 17, 'binding": "Paperback", "isbn": "0143039024", "isbn10": "0143039024"}}