{"book": {"publisher": "Penguin Classics", "synopsis": "The final novel of one of America’s most beloved writers—a tale of degeneration, corruption, and spiritual crisis<br/><br/>A Penguin Classic<br/><br/>In awarding John Steinbeck the 1962 Nobel Prize in Literature, the Nobel committee stated that with The Winter of Our Discontent, he had “resumed his position as an independent expounder of the truth, with an unbiased instinct for what is genuinely American.” Ethan Allen Hawley, the protagonist of Steinbeck’s last novel, works as a clerk in a grocery store that his family once owned. With Ethan no longer a member of Long Island’s aristocratic class, his wife is restless, and his teenage children are hungry for the tantalizing material comforts he cannot provide. Then one day, in a moment of moral crisis, Ethan decides to take a holiday from his own scrupulous standards. Set in Steinbeck’s contemporary 1960 America, the novel explores the tenuous line between private and public honesty, and today ranks alongside his most acclaimed works of penetrating insight into the American condition. This Penguin Classics edition features an introduction and notes by leading Steinbeck scholar Susan Shillinglaw.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https://images.isbndb.com/covers/94/88/9780143039488.jpg", "title_long": "The Winter of Our Discontent (Penguin Classics)", "edition": "Reissue", "dimensions": "Height: 7.74 Inches, Length: 5.06 Inches, Weight: 0.53 Pounds, Width: 0.53 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.06}, "width": {"unit": "inches", "value": 0.53}, "weight": {"unit": "pounds", "value": 0.53}, "height": {"unit": "inches", "value": 7.74}}, "pages": 336, "date_published": "2008-08-26", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Family Life', 'United States', 'Literary', 'Teen & Young Adult', 'Self Service', 'Custom Stores'], 'authors": ["John Steinbeck'], 'title": "The Winter of Our Discontent (Penguin Classics)", "isbn13": "9780143039488", "msrp": 17, "binding": "Paperback", "related": {"ePub": "1440638675"}, "isbn": "0143039482", "isbn10": "0143039482", "other_isbns": [{'isbn": "9781440638671", "binding": "print"}]}}