{"book": {"publisher": "Penguin Classics", "synopsis": "Considered by many to be her masterpiece, Edith Wharton"s second full-length work is a scathing yet personal examination of the exploits and follies of the modern upper class. As she unfolds the story of Undine Spragg, from New York to Europe, Wharton affords us a detailed glimpse of what might be called the interior décor of this America and its nouveau riche fringes. Through a heroine who is as vain, spoiled, and selfish as she is irresistibly fascinating, and through a most intricate and satisfying plot that follows Undine"s marriages and affairs, she conveys a vision of social behavior that is both supremely informed and supremely disenchanted. This edition features a new introduction and explanatory notes and reset text.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", 'language": "en", "image": "https://images.isbndb.com/covers/97/09/9780143039709.jpg", "title_long": "The Custom of the Country (Penguin Classics)", "edition": "First Edition", "dimensions": "Height: 7.7 Inches, Length: 5 Inches, Weight: 0.7385485777 Pounds, Width: 0.92 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 0.92}, "weight": {"unit": "pounds", "value": 0.7385485777}, "height": {"unit": "inches", "value": 7.7}}, "pages": 400, "date_published": "2006-05-30", "subjects": ["Humor & Entertainment', 'Humor', 'Lawyers & Criminals', 'Literature & Fiction', 'Classics', 'Genre Fiction', 'Family Life', 'United States', 'Literary', 'Teen & Young Adult'], 'authors": ["Edith Wharton'], 'title": "The Custom of the Country (Penguin Classics)", "isbn13": "9780143039709", "msrp": "0.00", "binding": "Paperback", "related": {"ePub": "1440649383"}, "isbn": "0143039709", "isbn10": "0143039709", "other_isbns": [{'isbn": "9781440649387", "binding": "print"}]}}