{"book": {"publisher": "Penguin Classics", "synopsis": "Now in Penguin Classics Deluxe: a treasure trove of Jane Austen"s novels<br/>Few novelists have conveyed the subtleties and nuances of their own social milieu with the wit and insight of Jane Austen. Here in one volume are her seven great novels: Sense and Sensibility, Pride and Prejudice, Mansfield Park, Emma, Northanger Abbey, Persuasion, and Lady Susan. Through her vivacious and spirited heroines and their circle, Austen vividly portrays English middle-class life as the eighteenth century came to a close and the nineteenth century began. Each of the novels is a love story and a story about marriage—marriage for love, for financial security, for social status. But they are not romances; ironic, comic, and wise, they are masterly evocations of the society Jane Austen observed. This beautiful volume covers the literary career of one of England’s finest prose stylists of any century.<br/><br/>•<br/>A Penguin Classics Deluxe Edition with French flaps and luxurious packaging<br/>•<br/>Features the definitive Penguin Classics texts recommended by the Jane Austen Society<br/>•<br/>New introduction by bestselling author of The Jane Austen Book Club Karen Joy Fowler<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https://images.isbndb.com/covers/95/01/9780143039501.jpg", "title_long": "The Complete Novels (Penguin Classics Deluxe Edition)", "edition": "Deluxe Paperback", "dimensions": "Height: 3.00787401268 Inches, Length: 8.5039369992 Inches, Weight: 2.8219169536 Pounds, Width: 5.4330708606 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.5039369992}, "width": {"unit": "inches", "value": 5.4330708606}, "weight": {"unit": "pounds", "value": 2.8219169536}, "height": {"unit": "inches", "value": 3.00787401268}}, "pages": 1278, "date_published": "2006-03-28", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Family Life', 'Short Stories & Anthologies', 'Anthologies', 'Literary', 'Reference', 'Teen & Young Adult', 'Self Service', 'Custom Stores'], 'authors": ["Jane Austen'], 'title": "The Complete Novels (Penguin Classics Deluxe Edition)", "isbn13": "9780143039501", "msrp": "0.00", "binding": "Paperback", "related": {"ePub": "1440649367"}, "isbn": "0143039504", "isbn10": "0143039504", "other_isbns": [{'isbn": "9781440649363", "binding": "print"}]}}