{"book": {"publisher": "Penguin Classics", "synopsis": "Now a Broadway musical<br/><br/>Inspiration for Francis Ford Coppola’s iconic film<br/><br/>Nominated as one of America’s best-loved novels by PBS’s The Great American Read<br/><br/>First published in 1967, S. E. Hinton"s novel was an immediate phenomenon. Today, with more than eight million copies sold, The Outsiders continues to resonate with its powerful portrait of the bonds and boundaries of friendship.<br/><br/>In Ponyboy"s world there are two types of people. There are the Socs, the rich society kids who get away with anything. Then there are the greasers, like Ponyboy, who aren"t so lucky. Ponyboy has a few things he can count on: his older brothers, his friends, and trouble with the Socs, whose idea of a good time is beating up greasers. At least he knows what to expect-until the night things go too far.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.', 'language": "en", "image": "https://images.isbndb.com/covers/98/53/9780143039853.jpg", "title_long": "The Outsiders (Penguin Classics)", "edition": "1", "dimensions": "Height: 0.5 Inches, Length: 7.6 Inches, Weight: 0.3 Pounds, Width: 5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.6}, "width": {"unit": "inches", "value": 5}, "weight": {"unit": "pounds", "value": 0.3}, "height": {"unit": "inches", "value": 0.5}}, "pages": 136, "date_published": "2006-05-30", "subjects": ["Children's Books', 'Classics', 'Literature & Fiction', 'Genre Fiction', 'Coming of Age', 'Small Town & Rural', 'United States', 'Teen & Young Adult', 'Politics & Social Sciences', 'Politics & Government', 'Specific Topics', 'Self Service', 'Custom Stores'], 'authors": ["S. E. Hinton'], 'title": "The Outsiders (Penguin Classics)", "isbn13": "9780143039853", "msrp": 14, "binding": "Paperback", "isbn": "0143039857", "isbn10": "0143039857", "other_isbns": [{'isbn": "9781101642610", "binding": "e"}]}}