{"book": {"publisher": "Penguin Classics", "synopsis": "The Adventures of Tom Sawyer is the first of Mark Twain"s novels to feature one of the best-loved characters in American fiction, with a critical introduction by John Seelye in Penguin Classics. From the famous episodes of the whitewashed fence and the ordeal in the cave to the trial of Injun Joe, The Adventures of Tom Sawyer is redolent of life in the Mississippi River towns in which Twain spent his own youth. A sombre undercurrent flows through the high humour and unabashed nostalgia of the novel, however, for beneath the innocence of childhood lie the inequities of adult reality - base emotions and superstitions, murder and revenge, starvation and slavery. In his illuminating introduction, noted Twain scholar John Seelye considers Twain"s impact on American letters and discusses the balance between humorous escapades and serious concern that is found in much of Twain"s writing. Samuel Langhorne Clemens (1835-1910) trained as a steamboat pilot on the Mississippi river; 'Mark Twain', a phrase used on riverboats to indicate that the water is two fathoms deep, became the pseudonym by which he was best known. After the Civil War, Twain turned to journalism, publishing his first short story in 1865. Dubbed 'the father of American literature' by William Faulkner, Twain led a colourful life of travelling, bankruptcy and great literary success. If you enjoyed The Adventures of Tom Sawyer, you may like Mark Twain's The Adventures of Huckleberry Finn, also available in Penguin Classics. 'The hero is one of the most endearing in literature' Daily Telegraph', 'language": "en", "image": "https://images.isbndb.com/covers/95/63/9780143039563.jpg", "title_long": "The Adventures of Tom Sawyer (Penguin Classics)", "edition": "Reissue", "dimensions": "Height: 7.7 Inches, Length: 5.2 Inches, Weight: 0.42769678828 Pounds, Width: 0.49 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 0.49}, "weight": {"unit": "pounds", "value": 0.42769678828}, "height": {"unit": "inches", "value": 7.7}}, "pages": 272, "date_published": "2006-02-28", "subjects": ["Children's Books', 'Literature & Fiction', 'Classics', 'Genre Fiction', 'Coming of Age', 'Action & Adventure', 'United States', 'Anthologies', 'Self Service', 'Custom Stores'], 'authors": ["Mark Twain'], 'title": "The Adventures of Tom Sawyer (Penguin Classics)", "isbn13": "9780143039563", "msrp": 8, 'binding": "Paperback", "isbn": "0143039563", "isbn10": "0143039563"}}