{"book": {"publisher": "Penguin Classics", "synopsis": "“[Sigrid Undset] should be the next Elena Ferrante.” —Slate<br/><br/>The turbulent historical masterpiece of Norway’s literary master<br/><br/>A Penguin Classic<br/><br/>In her great historical epic Kristin Lavransdatter, set in fourteenth-century Norway, Nobel laureate Sigrid Undset tells the life story of one passionate and headstrong woman. Painting a richly detailed backdrop, Undset immerses readers in the day-to-day life, social conventions, and political and religious undercurrents of the period. Now in one volume, Tiina Nunnally’s award-winning definitive translation brings this remarkable work to life with clarity and lyrical beauty.<br/>As a young girl, Kristin is deeply devoted to her father, a kind and courageous man. But when as a student in a convent school she meets the charming and impetuous Erlend Nikulaussøn, she defies her parents in pursuit of her own desires. Her saga continues through her marriage to Erlend, their tumultuous life together raising seven sons as Erlend seeks to strengthen his political influence, and finally their estrangement as the world around them tumbles into uncertainty.<br/>With its captivating heroine and emotional potency, Kristin Lavransdatter is the masterwork of Norway’s most beloved author—one of the twentieth century’s most prodigious and engaged literary minds—and, in Nunnally’s exquisite translation, a story that continues to enthrall.<br/><br/>This Penguin Classics Deluxe Edition includes an introduction by Brad Leithauser and features French flaps and deckle-edged paper.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https://images.isbndb.com/covers/91/67/9780143039167.jpg", "title_long": "Kristin Lavransdatter: (Penguin Classics Deluxe Edition)", "edition": "3rd Edition", "dimensions": "Height: 8.39 Inches, Length: 5.68 Inches, Weight: 2.59704544636 Pounds, Width: 1.86 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.68}, "width": {"unit": "inches", "value": 1.86}, "weight": {"unit": "pounds", "value": 2.59704544636}, "height": {"unit": "inches", "value": 8.39}}, "pages": 1168, "date_published": "2005-09-27", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Family Saga', 'Historical', 'Family Life', 'Short Stories & Anthologies', 'Anthologies', 'Contemporary', 'Literary', 'Teen & Young Adult', 'Self Service', 'Custom Stores'], 'authors": ["Sigrid Undset'], 'title": "Kristin Lavransdatter: (Penguin Classics Deluxe Edition)", "isbn13": "9780143039167", "msrp": 28, "binding": "Paperback", "related": {"ePub": "1101098457"}, "isbn": "0143039164", "isbn10": "0143039164", "other_isbns": [{'isbn": "9781101098455", "binding": "print"}]}}