{"book": {"publisher": "Texas Bookman", "synopsis": "Few writings explore a woman\"s love life in such detail, with such subtlety, insight, and pain, as does Anais Nin\"s original, uncensored diary. It is a life record that deals openly with the physical aspects of relationships and unsparingly with the full spectrum of psychological ramifications. Here was a woman who sought the freedom to act out her sexual and emotional desires with the same guiltless, "amoral' abandon that men have always claimed for themselves.<br/>When Nin began publishing sections of her diary in 1966, this aspect of her life was excised, though clearly there was more than could be told at the time concerning her relationships with Henry Miller and his wife, June, with the writer and actor Antonin Artaud, with her analysts Rene Allendy and Otto Rank, and - most important - with her father. Here now is the previously missing portion of Nin\'s life in the crucial years from 1932 to 1934, the shattering psychological drama that drove her to seek absolution from her psychoanalysts for the ultimate transgression. In its raw exposure of a woman\'s struggle to come to terms with herself, to find salvation in the very act of writing, Incest unveils an Anais Nin without masks and secrets, yet in the end still mysterious, perhaps inexplicable.', 'language": "en", "image": "https://images.isbndb.com/covers/36/66/9780151443666.jpg", "title_long": "Incest: From a Journal of Love : The Unexpurgated Diary of Anias Nin, 1932-1934", "edition": "First Edition", "dimensions": "Height: 1.38 Inches, Length: 9.57 Inches, Weight: 1.9 Pounds, Width: 6.43 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 9.57}, "width": {"unit": "inches", "value": 6.43}, "weight": {"unit": "pounds", "value": 1.9}, "height": {"unit": "inches", "value": 1.38}}, "pages": 418, "date_published": "1992", "subjects": ["Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Community & Culture', 'Women'], 'authors": ["Anais Nin'], 'title": "Incest: From a Journal of Love : The Unexpurgated Diary of Anias Nin, 1932-1934", "isbn13": "9780151443666", "msrp": 1.99, 'binding": "Hardcover", "isbn": "0151443661", "isbn10": "0151443661"}}