{"book": {"publisher": "Harvest Books", "synopsis": "“We are not the playwright, we are not the producer, we are not even the audience. We are on the stage. To play well the scenes in which we are "on" concerns us much more than to guess about the scenes that follow it.”<br/><br/>In these seven witty, lucid, and tough-minded essays, the famous, infamous Screwtape makes a special appearance, proposing a toast that brilliantly explores the many opportunities for exploiting evil in the world. Lewis also considers the evidence for whether and how prayer works, plays with the meaning of the words “I believe,” and asks what happens to our concept of God when we send rockets into outer space. And, in a moving final piece, he forces us to wonder how we should live if any day might bring the world’s last night. Anyone who ever appreciated his unique blend of humor, paradox, and searing insight will find these further thoughts from C.S. Lewis richly illuminating and remember that he is, as ever, one of the greatest writers and challengers of living faith.<br/><br/>"[Lewis] addresses himself to the task of disputing belief with energy, humor, and intense conviction.' —Los Angeles Times<br/><br/>'Reveals the expected wit, the Chestertonian ability to make Christian orthodoxy exciting and fit for the brave rebel, and an abundance of offbeat insights into the human scene.' —New York Times Book Review<br/>C. S. (Clive Staples) Lewis (1898-1963), one of the great writers of the twentieth century, also continues to be one of our most influential Christian thinkers. He wrote more than thirty books, both popular and scholarly, including The Chronicles of Narnia series, The Screwtape Letters, The Four Loves, Mere Christianity, and Surprised by Joy.', 'language": "en", "image": "https://images.isbndb.com/covers/77/17/9780156027717.jpg", "title_long": "The World"s Last Night: And Other Essays", 'edition": "First Edition", "dimensions": "Height: 7.999984 Inches, Length: 5.3125878 Inches, Weight: 0.3 Pounds, Width: 0.33598358 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.3125878}, "width": {"unit": "inches", "value": 0.33598358}, "weight": {"unit": "pounds", "value": 0.3}, "height": {"unit": "inches", "value": 7.999984}}, "pages": 132, "date_published": "2002-11-04", "subjects": ["Christian Books & Bibles', 'Religion & Spirituality', 'Worship & Devotion', 'Inspirational'], 'authors": ["C.S. Lewis'], 'title": "The World"s Last Night: And Other Essays", 'isbn13": "9780156027717", "msrp": 13.95, 'binding": "Paperback", "isbn": "0156027712", "isbn10": "0156027712"}}