{"book": {"publisher": "Harcourt", "synopsis": "A NATIONAL BESTSELLER<br/><br/>“Inspiring…Crammed with facts and anecdotes about Temple Grandin’s favorite subject: the senses, brains, emotions, and amazing talents of animals.”—New York Times Book Review<br/><br/>A groundbreaking look at the emotional lives of animals, from beloved animal scientist Temple Grandin.<br/><br/>Why would a cow lick a tractor? Why are collies getting dumber? Why do dolphins sometimes kill for fun? How can a parrot learn to spell? How did wolves teach man to evolve? Temple Grandin draws upon a long, distinguished career as an animal scientist and her own experiences with autism to deliver an extraordinary message about how animals act, think, and feel. She has a perspective like that of no other expert in the field, which allows her to offer unparalleled observations and groundbreaking ideas. People with autism can often think the way animals think, putting them in the perfect position to translate "animal talk." Grandin is a faithful guide into their world, exploring animal pain, fear, aggression, love, friendship, communication, learning, and, yes, even animal genius. Animals in Translation will forever change the way we think about animals.<br/><br/>Includes a Behavior and Training Troubleshooting Guide.", 'language": "en", "image": "https://images.isbndb.com/covers/14/48/9780156031448.jpg", "title_long": "Animals in Translation: Using the Mysteries of Autism to Decode Animal Behavior (A Harvest Book)", "edition": "First Edition", "dimensions": "Height: 8 Inches, Length: 5.3125 Inches, Weight: 0.65 Pounds, Width: 0.922 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.3125}, "width": {"unit": "inches", "value": 0.922}, "weight": {"unit": "pounds", "value": 0.65}, "height": {"unit": "inches", "value": 8}}, "pages": 358, "date_published": "2006-01-02", "subjects": ["Health, Fitness & Dieting', 'Psychology & Counseling', 'Evolutionary Psychology', 'Crafts, Hobbies & Home', 'Pets & Animal Care', 'Essays', 'Science & Math', 'Behavioral Sciences', 'Cognitive Psychology', 'Biological Sciences', 'Animals', 'Biology', 'Zoology', 'Nature & Ecology', 'Fauna', 'Sports & Outdoors', 'Medical Books', 'Psychology', 'Cognitive'], 'authors": ["Temple Grandin', 'Catherine Johnson'], 'title": "Animals in Translation: Using the Mysteries of Autism to Decode Animal Behavior (A Harvest Book)", "isbn13": "9780156031448", "msrp": 15.95, 'binding": "Paperback", "isbn": "0156031442", "isbn10": "0156031442"}}