{"book": {"publisher": "Harper Paperbacks", "synopsis": "New York Times Bestseller<br/>The dazzling short story collection by music legend Jimmy Buffett inspired by his real life.<br/>"Good natured tales of free-spirited characters . . . In fact, Buffett\"s lighthearted endorsement of adventure is so persuasive that, upon finishing the book, many readers will be tempted to get out their maps." —The New York Times Book Review<br/>Margaritaville may not appear on a map, but it does exist—at least in the brilliantly creative, sometimes slightly skewed imagination of Jimmy Buffett. Tales from Margaritaville is a collection of short stories (some purely fiction, some based in truth) so vividly packed with restless dreamers, wild wanderers, and pure gypsy souls that just reading it is a wild adventure. Travel along with a cowboy named Tully Mars, as he heads from Heartache, Wyoming to Graceland, and relive the autobiographical odyssey of a third-generation sailor and first-rate musical outlaw. With unforgettable stories that present the true roamer\'s twin loves—the sea and the road—Tales from Margaritaville is one 'smooth sailing book of infinite imagination' (Chicago Sun-Times).', 'language": "en", "image": "https://images.isbndb.com/covers/69/87/9780156026987.jpg", "title_long": "Tales From Margaritaville (Harvest Book)", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 0.5 Pounds, Width: 0.62 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 0.62}, "weight": {"unit": "pounds", "value": 0.5}, "height": {"unit": "inches", "value": 8}}, "pages": 264, "date_published": "2002-06-03", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Feel-Good', 'Short Stories & Anthologies', 'Anthologies', 'Short Stories', 'United States', 'Romance', 'Contemporary', 'New Adult & College', 'Romantic Comedy', 'Self Service', 'Custom Stores'], 'authors": ["Jimmy Buffett'], 'title": "Tales From Margaritaville (Harvest Book)", "isbn13": "9780156026987", "msrp": 14, 'binding": "Paperback", "isbn": "0156026988", "isbn10": "0156026988"}}