{"book": {"publisher": "Mariner Books Classics", "synopsis": "A charming portrait of one man’s dreams and schemes, by “the greatest Italian writer of the twentieth century” (Guardian).<br/><br/>In this enchanting book of linked stories, Italo Calvino charts the disastrous schemes of an Italian peasant, an unskilled worker in a drab northern industrial city in the 1950s and ’60s, struggling to reconcile his old country habits with his current urban life.<br/><br/>Marcovaldo has a practiced eye for spotting natural beauty and an unquenchable longing for the unspoiled rural world of his imagination. Much to the continuing puzzlement of his wife, his children, his boss, and his neighbors, he chases his dreams and gives rein to his fantasies, whether it’s sleeping in the great outdoors on a park bench, following a stray cat, or trying to catch wasps. Unfortunately, the results are never quite what he anticipates.<br/><br/>Spanning from the 1950s to the 1960s, the twenty stories in Marcovaldo are alternately comic and melancholy, farce and fantasy. Throughout, Calvino’s unassuming masterpiece “conveys the sensuous, tangible qualities of life” (New York Times).<br/><br/>Translated from the Italian by William Weaver.", "language": "en", "image": "https://images.isbndb.com/covers/20/40/9780156572040.jpg", "title_long": "Marcovaldo: or the Seasons in the City", "edition": "First Edition", "dimensions": "Height: 0.4 Inches, Length: 8.1 Inches, Weight: 0.25 Pounds, Width: 5.4 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 8.1}, "width": {"unit": "inches", "value": 5.4}, "weight": {"unit": "pounds", "value": 0.25}, "height": {"unit": "inches", "value": 0.4}}, "pages": 121, "date_published": "1983-11-16", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Coming of Age', 'Family Life', 'Short Stories & Anthologies', 'Short Stories', 'United States', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Italo Calvino'], 'title": "Marcovaldo: or the Seasons in the City", "isbn13": "9780156572040", "msrp": 13.95, "binding": "Paperback", "related": {"Page Fidelity": "0544133226", "eBook": "0544133226"}, "isbn": "0156572044", "isbn10": "0156572044", "other_isbns": [{'isbn": "9780544133228", "binding": "print"}]}}