{"book": {"publisher": "Harper Perennial", "synopsis": "He thought I\"d forged my mom\"s name on the slip. How stupid is that? On this thing Mom just made a kind of squiggly shape on the page. That jerk didn\"t even think about what he was saying, didn\'t even ask himself why her signature might be weird. He\'s one of those people who think illiteracy is like AIDS. It only exists in Africa.<br/>--from Kiffe Kiffe Tomorrow<br/><br/>'A tale for anyone who has ever lived outside looking in, especially from that alien country called adolescence. A funny, heartfelt story from a wise guy who happens to be a girl. If you\'ve ever fallen in love, if you\'ve ever had your heart broken, this story is your story.' -- Sandra Cisneros, author of THE HOUSE ON MANGO STREET<br/><br/>The Paradise projects are only a few metro stops from Paris, but here it\'s a whole different kind of France. Doria\'s father, the Beard, has headed back to their hometown in Morocco, leaving her and her mom to cope with their mektoub—their destiny—alone. They have a little help-- from a social worker sent by the city, a psychiatrist sent by the school, and a thug friend who recites Rimbaud.<br/><br/>It seems like fate’s dealt them an impossible hand, but Doria might still make a new life. She\'ll prove the projects aren\'t only about rap, soccer, and religious tension. She’ll take the Arabic word kif-kif (same old, same old) and mix it up with the French verb kiffer (to really like something). Now she has a whole new motto: KIFFE KIFFE TOMORROW.<br/><br/>'Moving and irreverent, sad and funny, full of rage and intelligence. [Guène\'s] characters are unforgettable, her voice fresh, and her book a delight.' -- Laila Lalami, author of Hope and Other Dangerous Pursuits<br/><br/>Faïza Guène, the child of Algerian immigrants, grew up in the public housing projects of Pantin, outside Paris. This is her first book.', 'language": "en", "image": "https://images.isbndb.com/covers/04/89/9780156030489.jpg", "title_long": "Kiffe Kiffe Tomorrow", "edition": "First Edition", "dimensions": "Height: 8 Inches, Length: 5.25 Inches, Weight: 0.47 Pounds, Width: 0.48 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.25}, "width": {"unit": "inches", "value": 0.48}, "weight": {"unit": "pounds", "value": 0.47}, "height": {"unit": "inches", "value": 8}}, "pages": 179, "date_published": "2006-07-03", "subjects": ["Literature & Fiction', 'Contemporary', 'Literary', 'Teen & Young Adult', 'Social & Family Issues', 'Social Issues'], 'authors": ["Faiza Guene'], 'title": "Kiffe Kiffe Tomorrow", "isbn13": "9780156030489", "msrp": 15.95, "binding": "Paperback", "related": {"ePub": "054754118X"}, "isbn": "0156030489", "isbn10": "0156030489", "other_isbns": [{'isbn": "9780547541181", "binding": "print"}]}}