{"book": {"publisher": "Oxford University Press", "synopsis": "When John Maynard Smith and Eörs Szathmáry published The Major Transitions in Evolution, it was seen as a major work in biology. Nature hailed it as a book of "grand and daunting sweep...A splendid and rewarding tour de force." And New Scientist wrote that it captured "the essence of modern biology,' calling it 'an extremely significant book which, as a bonus, is very readable.' Now, in The Origins of Life, Maynard Smith and Szathmáry have completely rewritten Transitions to bring their ideas to a wider audience of general readers. Here is a brilliant, original picture of how life evolved on earth, focusing primarily on six major transitionsdramatic breakthroughs in the way that information was passed between generations. The authors offer illuminating explorations of the origin of life itself, the arrival of the first cells with nuclei, the first reproduction by sexual means, the appearance of multicellular plants and animals, the emergence of cooperative animal societies, and the birth of language.<br/><br/>The Origins of Life represents the thinking of two leading scientists on questions that engage us allhow life began and how it gradually evolved from tiny invisible cells into whales and trees and human beings.', 'language": "en", "image": "https://images.isbndb.com/covers/20/99/9780192862099.jpg", "title_long": "The Origins of Life: From the Birth of Life to the Origin of Language", "edition": "1", "dimensions": "Height: 0.41338582635 Inches, Length: 7.7952755826 Inches, Weight: 0.440924524 Pounds, Width: 5.0787401523 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.7952755826}, "width": {"unit": "inches", "value": 5.0787401523}, "weight": {"unit": "pounds", "value": 0.440924524}, "height": {"unit": "inches", "value": 0.41338582635}}, "pages": 192, "date_published": "2000-11-26", "subjects": ["Science & Math', 'Biological Sciences', 'Biology', 'Evolution', 'History & Philosophy', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["John Maynard Smith', 'Eörs Szathmáry'], 'title": "The Origins of Life: From the Birth of Life to the Origin of Language", "isbn13": "9780192862099", "msrp": 14.01, "binding": "Paperback", "related": {"ePub": "0191647322"}, "isbn": "019286209X", "isbn10": "019286209X", "other_isbns": [{'isbn": "9780191647321", "binding": "printisbncanonical"}]}}