{"book": {"publisher": "Oxford University Press", "synopsis": "Since its first publication in 1890, Oscar Wilde"s only novel, The Picture of Dorian Gray, has remained the subject of critical controversy. Acclaimed by some as an instructive moral tale, it has been denounced by others for its implicit immorality. After having his portrait painted, Dorian Gray is captivated by his own beauty. Tempted by his world-weary friend, decadent friend Lord Henry Wotton, he wished to stay young forever and pledges his very soul to keep his good looks. As Dorian"s slide into crime and cruelty progresses, he stays magically youthful, while his beautiful portrait changes, revealing the hideous corruption of moral decay.<br/>Set in fin-de-siécle London, the novel traces a path from the studio of painter Basil Howard to the opium dens of the East End. The text of this edition is derived from the Oxford English Texts, which prints a critically established version of the first book edition of 1891. Also included is a new, fuller introduction, which considers the difference between the 1890 and 1891 texts, Wilde"s range of sources, significant critical approaches to the novel and its reputation since 1891, full explanatory notes that identify Wilde's sources, and an up-to-date-bibliography.', 'language": "en", "image": "https://images.isbndb.com/covers/72/98/9780192807298.jpg", "title_long": "The Picture of Dorian Gray (Oxford World"s Classics)", 'dimensions": "Height: 7.5 Inches, Length: 7.5 Inches, Weight: 0.42 Pounds, Width: 0.75 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.5}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 0.42}, "height": {"unit": "inches", "value": 7.5}}, "pages": 272, "date_published": "2006-11-06", "subjects": ["LGBTQ+ Books', 'Literature & Fiction', 'Genre Fiction', 'Classics', 'Contemporary', 'Literary'], 'authors": ["Oscar Wilde'], 'title": "The Picture of Dorian Gray (Oxford World"s Classics)", 'isbn13": "9780192807298", "msrp": 7.95, 'binding": "Paperback", "isbn": "0192807293", "isbn10": "0192807293"}}