{"book": {"publisher": "Oxford University Press", "synopsis": "How would a creature limited to two dimensions be able to grasp the possibility of a third? Edwin A. Abbott\"s droll and delightful "romance of many dimensions" explores this conundrum in the experiences of his protagonist, A Square, whose linear world is invaded by an emissary Sphere bringing the gospel of the third dimension. Part geometry lesson, part social satire, this classic work of science fiction brilliantly succeeds in enlarging all readers\' imaginations beyond the limits of their 'respective dimensional prejudices.'<br/>This new edition begins with an introduction by Rosemary Jann that illuminates the social and intellectual context that produced the work and explains its relationship to the theological issues central to Abbott\'s career. It also provides the most extensive discussion to date of the class and gender issues raised by the text and of the debates over the limits of scientific and mathematical knowledge in which it participated.<br/>Flatland\'s unique combination of astute social, philosophical, and mathematical observations with wit and humor can be read at many different levels, and will prove especially enjoyable to readers of Victorian literature and philosophy.', 'language": "en", "image": "https://images.isbndb.com/covers/59/80/9780192805980.jpg", "title_long": "Flatland: A Romance of Many Dimensions (Oxford World"s Classics)", 'dimensions": "Height: 8 Inches, Length: 5.5 Inches, Weight: 0.35 Pounds, Width: 0.75 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 0.35}, "height": {"unit": "inches", "value": 8}}, "pages": 176, "date_published": "2006-09-07", "subjects": ["Literature & Fiction', 'Classics', 'Contemporary', 'Literary', 'Reference', 'Writing, Research & Publishing Guides', 'Writing', 'Science Fiction & Fantasy', 'Fantasy', 'Science Fiction', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Edwin A. Abbott'], 'title": "Flatland: A Romance of Many Dimensions (Oxford World"s Classics)", 'isbn13": "9780192805980", "msrp": 8.95, 'binding": "Paperback", "isbn": "0192805983", "isbn10": "0192805983"}}