{"book": {"publisher": "Oxford University Press", "synopsis": "In his staggeringly popular work of fiction, Dan Brown states up front that the historical information in the The Da Vinci Code is all factually accurate. But is this claim true? As historian Bart D. Ehrman shows in this informative and witty book, The Da Vinci Code is filled with numerous historical mistakes.<br/>Did the ancient church engage in a cover-up to make the man Jesus into a divine figure? Did Emperor Constantine select for the New Testament--from some 80 contending Gospels--the only four Gospels that stressed that Jesus was divine? Was Jesus Christ married to Mary Magdalene? Did the Church suppress Gospels that told the secret of their marriage? Bart Ehrman thoroughly debunks all of these claims. But the book is not merely a laundry list of Brown"s misreading of history. Throughout, Ehrman offers a wealth of fascinating background information--all historically accurate--on early Christianity. He describes, for instance, the discovery of the Dead Sea Scrolls ; outlines in simple terms how scholars of early Christianity determine which sources are most reliable; and explores the many other Gospels that have been found in the last half century. In his engaging book, Ehrman separates fact from fiction, the historical realities from the flights of literary fancy. Anyone who would like to know the truth about the beginnings of Christianity and the real truth behind The Da Vinci Code will find this book riveting.", "language": "en", "image": "https://images.isbndb.com/covers/71/39/9780195307139.jpg", "title_long": "Truth and Fiction in The Da Vinci Code: A Historian Reveals What We Really Know about Jesus, Mary Magdalene, and Constantine", "edition": "1", "dimensions": "Height: 0.67 Inches, Length: 8.52 Inches, Weight: 0.4188782978 Pounds, Width: 5.55 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.52}, "width": {"unit": "inches", "value": 5.55}, "weight": {"unit": "pounds", "value": 0.4188782978}, "height": {"unit": "inches", "value": 0.67}}, "pages": 207, "date_published": "2006-03-31", "subjects": ["Christian Books & Bibles', 'Catholicism', 'Saints', 'Churches & Church Leadership', 'Church History', 'Theology', 'Biographies', 'New Testament', 'History', 'Literature & Fiction', 'History & Criticism', 'Regional & Cultural', 'Religion & Spirituality'], 'authors": ["Bart D. Ehrman'], 'title": "Truth and Fiction in The Da Vinci Code: A Historian Reveals What We Really Know about Jesus, Mary Magdalene, and Constantine", "isbn13": "9780195307139", "msrp": 19.99, "binding": "Paperback", "related": {"Kindle Edition": "0199924120", "ePub": "0199924120"}, "isbn": "0195307135", "isbn10": "0195307135", "other_isbns": [{'isbn": "9780199924127", "binding": "printisbncanonical"}]}}