{"book": {"publisher": "Oxford University Press", "synopsis": "Paul Revere\"s midnight ride looms as an almost mythical event in American history--yet it has been largely ignored by scholars and left to patriotic writers and debunkers. Now one of the foremost American historians offers the first serious look at the events of the night of April 18, 1775--what led up to it, what really happened, and what followed--uncovering a truth far more remarkable than the myths of tradition.<br/><br/>In Paul Revere\"s Ride, David Hackett Fischer fashions an exciting narrative that offers deep insight into the outbreak of revolution and the emergence of the American republic. Beginning in the years before the eruption of war, Fischer illuminates the figure of Paul Revere, a man far more complex than the simple artisan and messenger of tradition. Revere ranged widely through the complex world of Boston\"s revolutionary movement--from organizing local mechanics to mingling with the likes of John Hancock and Samuel Adams. When the fateful night arrived, more than sixty men and women joined him on his task of alarm--an operation Revere himself helped to organize and set in motion. Fischer recreates Revere\'s capture that night, showing how it had an important impact on the events that followed. He had an uncanny gift for being at the center of events, and the author follows him to Lexington Green--setting the stage for a fresh interpretation of the battle that began the war. Drawing on intensive new research, Fischer reveals a clash very different from both patriotic and iconoclastic myths. The local militia were elaborately organized and intelligently led, in a manner that had deep roots in New England. On the morning of April 19, they fought in fixed positions and close formation, twice breaking the British regulars. In the afternoon, the American officers switched tactics, forging a ring of fire around the retreating enemy which they maintained for several hours--an extraordinary feat of combat leadership. In the days that followed, Paul Revere led a new battle-- for public opinion--which proved even more decisive than the fighting itself.<br/>]<br/>When the alarm-riders of April 18 took to the streets, they did not cry, 'the British are coming,' for most of them still believed they were British. Within a day, many began to think differently. For George Washington, Thomas Jefferson, John Adams, and Thomas Paine, the news of Lexington was their revolutionary Rubicon. Paul Revere\'s Ride returns Paul Revere to center stage in these critical events, capturing both the drama and the underlying developments in a triumphant return to narrative history at its finest.', 'language": "en", "image": "https://images.isbndb.com/covers/83/10/9780195098310.jpg", "title_long": "Paul Revere"s Ride", 'edition": 1, "dimensions": "Height: 6.23 Inches, Length: 9.31 Inches, Weight: 1.4550509292 Pounds, Width: 1.18 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 9.31}, "width": {"unit": "inches", "value": 1.18}, "weight": {"unit": "pounds", "value": 1.4550509292}, "height": {"unit": "inches", "value": 6.23}}, "pages": 445, "date_published": "1995-04-19", "subjects": ["Arts & Photography', 'History', 'Americas', 'United States'], 'authors": ["David Hackett Fischer'], 'title": "Paul Revere"s Ride", 'isbn13": "9780195098310", "msrp": 21.95, "binding": "Paperback", "related": {"ePub": "0199779651"}, "isbn": "0195098315", "isbn10": "0195098315", "other_isbns": [{'isbn": "9780199779659", "binding": "print"}]}}