{"book": {"publisher": "Oxford University Press", "synopsis": "Thomas Jefferson designed his own tombstone, describing himself simply as "Author of the Declaration of Independence and of the Virginia Statute for Religious Freedom, and Father of the University of Virginia." It is in this simple epitaph that R.B. Bernstein finds the key to this enigmatic Founder--not as a great political figure, but as leader of "a revolution of ideas that would make the world over again.'<br/><br/>In Thomas Jefferson, Bernstein offers the definitive short biography of this revered American--the first concise life in six decades. Bernstein deftly synthesizes the massive scholarship on his subject into a swift, insightful, evenhanded account. Here are all of Jefferson\'s triumphs, contradictions, and failings, from his luxurious (and debt-burdened) life as a Virginia gentleman to his passionate belief in democracy, from his tortured defense of slavery to his relationship with Sally Hemings. Jefferson was indeed multifaceted--an architect, inventor, writer, diplomat, propagandist, planter, party leader--and Bernstein explores all these roles even as he illuminates Jefferson\'s central place in the American enlightenment, that 'revolution of ideas' that did so much to create the nation we know today. Together with the less well-remembered points in Jefferson\'s thinking--the nature of the Union, his vision of who was entitled to citizenship, his dread of debt (both personal and national)--they form the heart of this lively biography.<br/><br/>In this marvel of compression and comprehension, we see Jefferson more clearly than in the massive studies of earlier generations. More important, we see, in Jefferson\'s visionary ideas, the birth of the nation\'s grand sense of purpose.', 'language": "en", "image": "https://images.isbndb.com/covers/13/02/9780195181302.jpg", "title_long": "Thomas Jefferson", "edition": "Reprint", "dimensions": "Height: 5.1 Inches, Length: 8.36 Inches, Weight: 0.53351867404 Pounds, Width: 0.54 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.36}, "width": {"unit": "inches", "value": 0.54}, "weight": {"unit": "pounds", "value": 0.53351867404}, "height": {"unit": "inches", "value": 5.1}}, "pages": 253, "date_published": "2005-09-15", "subjects": ["Biographies & Memoirs', 'Community & Culture', 'Black & African American', 'Historical', 'United States', 'Leaders & Notable People', 'Military', 'Presidents & Heads of State', 'History', 'Americas'], 'authors": ["R. B. Bernstein'], 'title": "Thomas Jefferson", "isbn13": "9780195181302", "msrp": 19.99, 'binding": "Paperback", "isbn": "0195181301", "isbn10": "0195181301"}}