{"book": {"publisher": "Oxford University Press", "synopsis": ""Accurst be he that first invented war," wrote Christopher Marlowe--a declaration that most of us would take as a literary, not literal, construction. But in this sweeping overview of the rise of civilization, Robert O\"Connell finds that war is indeed an invention--an institution that arose due to very specific historical circumstances, an institution that now verges on extinction.<br/>In Ride of the Second Horseman, O\'Connell probes the distant human past to show how and why war arose. He begins with a definition that distinguishes between war and mere feuding: war involves group rather than individual issues, political or economic goals, and direction by some governmental structure, carried out with the intention of lasting results. With this definition, he finds that ants are the only other creatures that conduct it--battling other colonies for territory and slaves. But ants, unlike humans, are driven by their genes; in humans, changes in our culture and subsistence patterns, not our genetic hardware, brought the rise of organized warfare. O\'Connell draws on anthropology and archeology to locate the rise of war sometime after the human transition from nomadic hunting and gathering to agriculture, when society split between farmers and pastoralists. Around 5500 BC, these pastoralists initiated the birth of war with raids on Middle Eastern agricultural settlements. The farmers responded by ringing their villages with walls, setting off a process of further social development, intensified combat, and ultimately the rise of complex urban societies dependent upon warfare to help stabilize what amounted to highly volatile population structures, beset by frequent bouts of famine and epidemic disease. In times of overpopulation, the armies either conquered new lands or self-destructed, leaving fewer mouths to feed. In times of underpopulation, slaves were taken to provide labor. O\'Connell explores the histories of the civilizations of ancient Sumeria, Egypt, Assyria, China, and the New World, showing how war came to each and how it adapted to varying circumstances. On the other hand, societies based on trade employed war much more selectively and pragmatically. Thus, Minoan Crete, long protected from marauding pastoralists, developed a wealthy mercantile society marked by unmilitaristic attitudes, equality between men and women, and a relative absence of class distinctions. In Assyria, by contrast, war came to be an end in itself, in a culture dominated by male warriors.<br/>Despite the violence in the world today, O\'Connell finds reason for hope. The industrial revolution broke the old patterns of subsistence: war no longer serves the demographic purpose it once did. Fascinating and provocative, Ride of the Second Horseman offers a far-reaching tour of human history that suggests the age-old cycle of war may now be near its end.', 'language": "en", "image": "https://images.isbndb.com/covers/92/06/9780195119206.jpg", "title_long": "Ride of the Second Horseman: The Birth and Death of War", "edition": "Reprint", "dimensions": "Height: 6.02 Inches, Length: 9.2 Inches, Weight: 1.0141264052 Pounds, Width: 0.8 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 9.2}, "width": {"unit": "inches", "value": 0.8}, "weight": {"unit": "pounds", "value": 1.0141264052}, "height": {"unit": "inches", "value": 6.02}}, "pages": 320, "date_published": "1997-10-23", "subjects": ["History', 'Military', 'World', 'Engineering & Transportation', 'Engineering', 'Science & Math', 'Technology', 'History of Technology', 'Politics & Social Sciences', 'Anthropology', 'General', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Robert L. O'Connell'], 'title": "Ride of the Second Horseman: The Birth and Death of War", "isbn13": "9780195119206", "msrp": 39.99, "binding": "Paperback", "related": {"eBook": "019802293X"}, "isbn": "0195119207", "isbn10": "0195119207", "other_isbns": [{'isbn": "9780198022930", "binding": "printisbncanonical"}]}}