{"book": {"publisher": "Oxford University Press", "synopsis": "2004 marks the fiftieth anniversary of the Supreme Court\"s unanimous decision to end segregation in public schools. Many people were elated when Supreme Court Chief Justice Earl Warren delivered Brown v. Board of Education of Topeka in May 1954, the ruling that struck down state-sponsored racial segregation in America\"s public schools. Thurgood Marshall, chief attorney for the black families that launched the litigation, exclaimed later, "I was so happy, I was numb.' The novelist Ralph Ellison wrote, 'another battle of the Civil War has been won. The rest is up to us and I\'m very glad. What a wonderful world of possibilities are unfolded for the children!'<br/><br/>Here, in a concise, moving narrative, Bancroft Prize-winning historian James T. Patterson takes readers through the dramatic case and its fifty-year aftermath. A wide range of characters animates the story, from the little-known African Americans who dared to challenge Jim Crow with lawsuits (at great personal cost); to Thurgood Marshall, who later became a Justice himself; to Earl Warren, who shepherded a fractured Court to a unanimous decision. Others include segregationist politicians like Governor Orval Faubus of Arkansas; Presidents Eisenhower, Johnson, and Nixon; and controversial Supreme Court justices such as William Rehnquist and Clarence Thomas.<br/><br/>Most Americans still see Brown as a triumph--but was it? Patterson shrewdly explores the provocative questions that still swirl around the case. Could the Court--or President Eisenhower--have done more to ensure compliance with Brown? Did the decision touch off the modern civil rights movement? How useful are court-ordered busing and affirmative action against racial segregation? To what extent has racial mixing affected the academic achievement of black children? Where indeed do we go from here to realize the expectations of Marshall, Ellison, and others in 1954?', 'language": "en", "image": "https://images.isbndb.com/covers/63/24/9780195156324.jpg", "title_long": "Brown v. Board of Education: A Civil Rights Milestone and Its Troubled Legacy (Pivotal Moments in American History)", "dimensions": "Height: 0.88 Inches, Length: 9.34 Inches, Weight: 0.99869404686 Pounds, Width: 6.28 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 9.34}, "width": {"unit": "inches", "value": 6.28}, "weight": {"unit": "pounds", "value": 0.99869404686}, "height": {"unit": "inches", "value": 0.88}}, "pages": 320, "date_published": "2002-12-12", "subjects": ["History', 'Americas', 'United States', 'Law', 'Administrative Law', 'Legal History', 'Politics & Social Sciences', 'Politics & Government', 'Specific Topics', 'Education & Teaching', 'Schools & Teaching', 'Education Theory', 'Self Service', 'Custom Stores', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["James T. Patterson'], 'title": "Brown v. Board of Education: A Civil Rights Milestone and Its Troubled Legacy (Pivotal Moments in American History)", "isbn13": "9780195156324", "msrp": 15.62, "binding": "Paperback", "related": {"ePub": "0199880840"}, "isbn": "0195156323", "isbn10": "0195156323", "other_isbns": [{'isbn": "9780199880843", "binding": "printisbncanonical"}]}}