{"book": {"publisher": "Oxford University Press", "synopsis": "It is not uncommon to hear Christians argue that America was founded as a Christian nation. But how true is this claim?<br/>In this compact book, David L. Holmes offers a clear, concise and illuminating look at the spiritual beliefs of our founding fathers. He begins with an informative account of the religious culture of the late colonial era, surveying the religious groups in each colony. In particular, he sheds light on the various forms of Deism that flourished in America, highlighting the profound influence this intellectual movement had on the founding generation. Holmes then examines the individual beliefs of a variety of men and women who loom large in our national history. He finds that some, like Martha Washington, Samuel Adams, John Jay, Patrick Henry, and Thomas Jefferson"s daughters, held orthodox Christian views. But many of the most influential figures, including Benjamin Franklin, George Washington, John and Abigail Adams, Jefferson, James and Dolley Madison, and James Monroe, were believers of a different stripe. Respectful of Christianity, they admired the ethics of Jesus, and believed that religion could play a beneficial role in society. But they tended to deny the divinity of Christ, and a few seem to have been agnostic about the very existence of God. Although the founding fathers were religious men, Holmes shows that it was a faith quite unlike the Christianity of today"s evangelicals. Holmes concludes by examining the role of religion in the lives of the presidents since World War II and by reflecting on the evangelical resurgence that helped fuel the reelection of George W. Bush.<br/>An intriguing look at a neglected aspect of our history, the book will appeal to American history buffs as well as to anyone concerned about the role of religion in American culture.", 'language": "en", "image": "https://images.isbndb.com/covers/09/25/9780195300925.jpg", "title_long": "The Faiths of the Founding Fathers", "edition": "Illustrated", "dimensions": "Height: 0.85 Inches, Length: 8.48 Inches, Weight: 0.8928721611 Pounds, Width: 6.04 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.48}, "width": {"unit": "inches", "value": 6.04}, "weight": {"unit": "pounds", "value": 0.8928721611}, "height": {"unit": "inches", "value": 0.85}}, "pages": 225, "date_published": "2006-05-01", "subjects": ["Biographies & Memoirs', 'Historical', 'United States', 'Leaders & Notable People', 'Military', 'Political', 'History', 'Americas', 'World', 'Religious', 'Religion & Spirituality', 'Religious Studies'], 'authors": ["David L. Holmes'], 'title": "The Faiths of the Founding Fathers", "isbn13": "9780195300925", "msrp": 20, "binding": "Hardcover", "related": {"ePub": "0199740968"}, "isbn": "0195300920", "isbn10": "0195300920", "other_isbns": [{'isbn": "9780199740963", "binding": "print"}]}}