{"book": {"publisher": "Oxford University Press", "synopsis": "The Oxford School Shakespeare has become the preferred introduction to the literary legacy of the greatest playwright in the English language. This exclusive collection of the Bard"s best works has been designed specifically for readers new to Shakespeare"s rich literary legacy. Each play is presented complete and unabridged, in large print. Every book is well illustrated, and starts with a commentary and character summary. Scene synopses and character summaries clarify confusing plots, while incisive essays explore the historical context and Shakespeare"s sources. Each book ends with a complete list of Shakespeare's plays and a brief chronology of the Bard's life. The detailed explanatory notes are written clearly and positioned right next to the text--no more squinting at microscopic footnotes or flipping pages back and forth in search of endnotes!<br/><br/>The new edition of the series features new covers and new illustrations, including both new drawings and photos from recent productions of Shakespeare's plays around the globe. In addition, the notes and the introductory material have been completely revised in line with new research and in order to make them clearer and more accessible. Finally, the entire text has been redesigned and reset to enhance readability. The new edition achieves the feat of unprecedented clarity of presentation without any cuts to the original text or the detailed explanations.', 'language": "en", "image": "https://images.isbndb.com/covers/02/72/9780198320272.jpg", "title_long": "Julius Caesar (Oxford School Shakespeare Series)", "edition": "3", "dimensions": "Height: 8.75 Inches, Length: 7 Inches, Weight: 0.54 Pounds, Width: 0.25 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7}, "width": {"unit": "inches", "value": 0.25}, "weight": {"unit": "pounds", "value": 0.54}, "height": {"unit": "inches", "value": 8.75}}, "pages": 160, "date_published": "2002-10-17", "subjects": ["Literature & Fiction', 'Dramas & Plays', 'Shakespeare', 'Teen & Young Adult', 'Education & Teaching', 'Schools & Teaching', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["William Shakespeare'], 'title": "Julius Caesar (Oxford School Shakespeare Series)", "isbn13": "9780198320272", "msrp": 9.95, 'binding": "Paperback", "isbn": "0198320272", "isbn10": "0198320272"}}