{"book": {"publisher": "Oxford University Press", "synopsis": "This new edition of Will Kymlicka"s best selling critical introduction to contemporary political theory has been fully revised to include many of the most significant developments in Anglo-American political philosophy in the last 11 years, particularly the new debates over issues of democratic citizenship and cultural pluralism. The book now includes two new chapters on citizenship theory and multiculturalism, in addition to updated chapters on utilitarianism, liberal egalitarianism, libertarianism, socialism, communitarianism, and feminism. The many thinkers discussed include G. A. Cohen, Ronald Dworkin, William Galston, Carol Gilligan, R. M. Hare, Chandran Kukathas, Catherine Mackinnon, David Miller, Philippe Van Parijs, Susan Okin, Robert Nozick, John Rawls, John Roemer, Michael Sandel, Charles Taylor, Michael Walzer, and Iris Young. Extended guides to further reading have been added at the end of each chapter, listing the most important books and articles on each school of thought, as well as relevant journals and websites. Covering some of the most advanced contemporary thinking, Will Kymlicka writes in an engaging, accessible, and non-technical way to ensure the book is suitable for students approaching these difficult concepts for the first time. This second edition promises to build on the original edition"s success as a key text in the teaching of modern political theory.", 'language": "en", "image": "https://images.isbndb.com/covers/27/42/9780198782742.jpg", "title_long": "Contemporary Political Philosophy: An Introduction", "edition": "2", "dimensions": "Height: 1.09 Inches, Length: 9.54 Inches, Weight: 1.66889932334 Pounds, Width: 6 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 9.54}, "width": {"unit": "inches", "value": 6}, "weight": {"unit": "pounds", "value": 1.66889932334}, "height": {"unit": "inches", "value": 1.09}}, "pages": 512, "date_published": "2001-10-25", "subjects": ["Politics & Social Sciences', 'Philosophy', 'Political', 'Politics & Government', 'Ideologies & Doctrines', 'Political Science', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Will Kymlicka'], 'title": "Contemporary Political Philosophy: An Introduction", "isbn13": "9780198782742", "msrp": 69.95, 'binding": "Paperback", "isbn": "0198782748", "isbn10": "0198782748"}}