{"book": {"publisher": "Oxford University Press", "synopsis": "The phrase "the meaning of life" for many seems a quaint notion fit for satirical mauling by Monty Python or Douglas Adams. But in this spirited Very Short Introduction, famed critic Terry Eagleton takes a serious if often amusing look at the question and offers his own surprising answer.<br/><br/>Eagleton first examines how centuries of thinkers and writers--from Marx and Schopenhauer to Shakespeare, Sartre, and Beckett--have responded to the ultimate question of meaning. He suggests, however, that it is only in modern times that the question has become problematic. But instead of tackling it head-on, many of us cope with the feelings of meaninglessness in our lives by filling them with everything from football to sex, Kabbala, Scientology, "New Age softheadedness,' or fundamentalism. On the other hand, Eagleton notes, many educated people believe that life is an evolutionary accident that has no intrinsic meaning. If our lives have meaning, it is something with which we manage to invest them, not something with which they come ready made. Eagleton probes this view of meaning as a kind of private enterprise, and concludes that it fails to holds up. He argues instead that the meaning of life is not a solution to a problem, but a matter of living in a certain way. It is not metaphysical but ethical. It is not something separate from life, but what makes it worth living--that is, a certain quality, depth, abundance and intensity of life.<br/><br/>Here then is a brilliant discussion of the problem of meaning by a leading thinker, who writes with a light and often irreverent touch, but with a very serious end in mind.<br/><br/>About the Series: Combining authority with wit, accessibility, and style, Very Short Introductions offer an introduction to some of life\'s most interesting topics. Written by experts for the newcomer, they demonstrate the finest contemporary thinking about the central problems and issues in hundreds of key topics, from philosophy to Freud, quantum theory to Islam.', 'language": "en", "image": "https://images.isbndb.com/covers/07/01/9780199210701.jpg", "title_long": "The Meaning of Life: A Very Short Introduction (Very Short Introductions)", "edition": "First Edition", "dimensions": "Height: 6.75 Inches, Length: 4.75 Inches, Weight: 0.55 Pounds, Width: 0.75 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.75}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 0.55}, "height": {"unit": "inches", "value": 6.75}}, "pages": 200, "date_published": "2007-03-29", "subjects": ["Religion & Spirituality', 'Religious Studies', 'Philosophy', 'Psychology', 'Politics & Social Sciences', 'Religious', 'Sociology', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Terry Eagleton'], 'title": "The Meaning of Life: A Very Short Introduction (Very Short Introductions)", "isbn13": "9780199210701", "msrp": 25, "binding": "Hardcover", "isbn": "0199210705", "isbn10": "0199210705", "other_isbns": [{'isbn": "9780191579035", "binding": "printisbncanonical"}]}}