{"book": {"publisher": "Addison-Wesley Professional", "synopsis": ""This is an eminently readable book which an ordinary programmer, unskilled in mathematical analysis and wary of theoretical algorithms, ought to be able to pick up and get a lot out of.."<br/>- Steve Summit, author of C Programming FAQs<br/>Sedgewick has a real gift for explaining concepts in a way that makes them easy to understand. The use of real programs in page-size (or less) chunks that can be easily understood is a real plus. The figures, programs, and tables are a significant contribution to the learning experience of the reader; they make this book distinctive.<br/>- William A. Ward, University of South Alabama<br/>Robert Sedgewick has thoroughly rewritten and substantially expanded his popular work to provide current and comprehensive coverage of important algorithms and data structures. Many new algorithms are presented, and the explanations of each algorithm are much more detailed than in previous editions. A new text design and detailed, innovative figures, with accompanying commentary, greatly enhance the presentation. The third edition retains the successful blend of theory and practice that has made Sedgewick\"s work an invaluable resource for more than 250,000 programmers!<br/>This particular book, Parts 1-4, represents the essential first half of Sedgewick\'s complete work. It provides extensive coverage of fundamental data structures and algorithms for sorting, searching, and related applications. The algorithms and data structures are expressed in concise implementations in C, so that you can both appreciate their fundamental properties and test them on real applications. Of course, the substance of the book applies to programming in any language. Highlights Expanded coverage of arrays, linked lists, strings, trees, and other basic data structures Greater emphasis on abstract data types (ADTs) than in previous editions Over 100 algorithms for sorting, selection, priority queue ADT implementations, and symbol table ADT (searching) implementations New implementations of binomial queues, multiway radix sorting, Batcher\'s sorting networks, randomized BSTs, splay trees, skip lists, multiway tries, and much more Increased quantitative information about the algorithms, including extensive empirical studies and basic analytic studies, giving you a basis for comparing them Over 1000 new exercises to help you learn the properties of algorithms<br/>Whether you are a student learning the algorithms for the first time or a professional interested in having up-to-date reference material, you will find a wealth of useful information in this book.', 'language": "en", "image": "https://images.isbndb.com/covers/45/26/9780201314526.jpg", "title_long": "Algorithms in C, Parts 1-4: Fundamentals, Data Structures, Sorting, Searching", "edition": "3", "dimensions": "Height: 1.1 Inches, Length: 9.2 Inches, Weight: 2.7778245012 Pounds, Width: 7.78 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 9.2}, "width": {"unit": "inches", "value": 7.78}, "weight": {"unit": "pounds", "value": 2.7778245012}, "height": {"unit": "inches", "value": 1.1}}, "pages": 720, "date_published": "1997-09-17", "subjects": ["Computers & Technology', 'Computer Science', 'Systems Analysis & Design', 'Programming', 'Algorithms', 'Software Design, Testing & Engineering', 'Software', 'Programming Languages', 'C & C++', 'Science & Math', 'Mathematics', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Robert Sedgewick'], 'title": "Algorithms in C, Parts 1-4: Fundamentals, Data Structures, Sorting, Searching", "isbn13": "9780201314526", "msrp": 89.99, "binding": "Paperback", "related": {"Kindle Edition": "076868501X", "ePub": "076868501X"}, "isbn": "0201314525", "isbn10": "0201314525", "other_isbns": [{'isbn": "9780768685015", "binding": "print"}]}}