{"book": {"publisher": "Yellow Jersey", "synopsis": "People around the world have found inspiration in the story of Lance Armstrong--a world-class athlete nearly struck down by cancer, only to recover and win the Tour de France, the multiday bicycle race famous for its gruelling intensity. Armstrong is a thoroughgoing Texan jock, and the changes brought to his life by his illness are startling and powerful, but he\"s just not interested in wearing a hero suit. While his vocabulary is a bit on the he-man side (highest compliment to his wife: "she\"s a stud'), his actions will melt the most hard-bitten souls: a cancer foundation and benefit bike ride, his astonishing commitment to training that got him past countless hurdles, loyalty to the people and corporations that never gave up on him. There\'s serious medical detail here, which may not be for the faint of heart; from chemo to surgical procedures to his wife\'s in vitro fertilization, you won\'t be spared a single x-ray, IV drip, or unfortunate side effect. Athletes and coaches everywhere will benefit from the same extraordinary detail provided about training sessions--every aching tendon, every rainy afternoon, and every small triumph during his long recovery is here in living colour. It\'s Not About the Bike is the perfect title for this book about life, death, illness, family, setbacks, and triumphs, but not especially about the bike. --Jill Lightner, Amazon.com', 'language": "en", "image": "https://images.isbndb.com/covers/08/75/9780224060875.jpg", "title_long": "It"s Not About the Bike : My Journey Back to Life", 'edition": "New edition", "dimensions": "Height: 7.79526 Inches, Length: 5.07873 Inches, Weight: 0.52029093832 Pounds, Width: 0.7874 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.07873}, "width": {"unit": "inches", "value": 0.7874}, "weight": {"unit": "pounds", "value": 0.52029093832}, "height": {"unit": "inches", "value": 7.79526}}, "pages": 304, "date_published": "2001", "subjects": ["Biographies & Memoirs'], 'authors": ["Lance Armstrong'], 'title": "It"s Not About the Bike : My Journey Back to Life", 'isbn13": "9780224060875", "msrp": 19.75, 'binding": "Paperback", "isbn": "0224060872", "isbn10": "0224060872"}}