{"book": {"publisher": "Vintage Uk", "synopsis": ""Haunted" is a novel made up of twenty-three of them to be precise. Twenty-three of the most horrifying, hilarious, mind-blowing, stomach-churning tales you\"ll ever encounter - sometimes all at once. They are told by the people who have all answered the ad headlined \'Artists Abandon your life for three months\'. They are led to believe that here they will leave behind all the distractions of \'real life\' that are keeping them from creating the masterpiece that is in them. But \'here\' turns out to be a cavernous and ornate old theatre where they are utterly isolated from the outside world - and where heat and power and, most importantly, food are in increasingly short supply. And the more desperate the circumstances become, the more desperate the stories they tell - and the more devious their machinations become to make themselves the hero of the inevitable play/movie/non-fiction blockbuster that will certainly be made from their plight. 'Haunted' is at one level a satire of reality television. It draws from a great literary tradition - 'The Canterbury Tales', 'The Decameron', the English storytellers in the Villa Diodati who produced, among other works, 'Frankenstein' - to tell an utterly contemporary tale of people desperate that their story be told at any cost. Appallingly entertaining, 'Haunted' is Chuck Palahniuk at his finest - which means his most extreme and his most provocative.', 'language": "en", "image": "https://images.isbndb.com/covers/44/53/9780224064453.jpg", "title_long": "Haunted", "edition": "5th", "dimensions": "Weight: 1.4660740423 Pounds", "dimensions_structured": {"weight": {"unit": "pounds", "value": 1.4660740423}}, "pages": 416, "date_published": "2005", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Horror', 'Short Stories & Anthologies', 'Short Stories', 'Humor & Satire', 'Satire', 'Dark Humor'], 'authors": ['Chuck Palahniuk'], 'title": "Haunted", "isbn13": "9780224064453", "msrp": "0.00", "binding": "Hardcover", "isbn": "0224064452", "isbn10": "0224064452"}}