{"book": {"publisher": "University of Chicago Press", "synopsis": "While humanists have pondered the subject of love to the point of obsessiveness, philosophers have steadfastly ignored it. One might wonder whether the discipline of philosophy even recognizes love. The word philosophy means “love of wisdom,” but the absence of love from philosophical discourse is curiously glaring. So where did the love go? In The Erotic Phenomenon, Jean-Luc Marion asks this fundamental question of philosophy, while reviving inquiry into the concept of love itself.<br/>Marion begins his profound and personal book with a critique of Descartes’ equation of the ego’s ability to doubt with the certainty that one exists—“I think, therefore I am”—arguing that this is worse than vain. We encounter being, he says, when we first experience love: I am loved, therefore I am; and this love is the reason I care whether I exist or not. This philosophical base allows Marion to probe several manifestations of love and its variations, including carnal excitement, self-hate, lying and perversion, fidelity, the generation of children, and the love of God. Throughout, Marion stresses that all erotic phenomena, including sentimentality, pornography, and even boasts about one’s sexual conquests, stem not from the ego as popularly understood but instead from love.<br/>A thoroughly enlightening and captivating philosophical investigation of a strangely neglected subject, The Erotic Phenomenon is certain to initiate feverish new dialogue about the philosophical meanings of that most desirable and mysterious of all concepts—love.", "language": "en", "image": "https://images.isbndb.com/covers/53/67/9780226505367.jpg", "title_long": "The Erotic Phenomenon", "edition": "First Edition", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 1.1243575362 Pounds, Width: 0.9 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 0.9}, "weight": {"unit": "pounds", "value": 1.1243575362}, "height": {"unit": "inches", "value": 9}}, "pages": 248, "date_published": "2006-11-15", "subjects": ["Religion & Spirituality', 'Religious Studies', 'Philosophy', 'Politics & Social Sciences', 'Consciousness & Thought', 'Ethics & Morality', 'Movements', 'Religious', 'Social Sciences', 'Gender Studies'], 'authors": ["Jean-Luc Marion'], 'title": "The Erotic Phenomenon", "isbn13": "9780226505367", "msrp": "0.00", "binding": "Hardcover", "isbn": "0226505367", "isbn10": "0226505367", "other_isbns": [{'isbn": "9780226839967", "binding": "print"}]}}