{"book": {"publisher": "University Of Chicago Press", "synopsis": "Jacques Derrida is, in the words of the New York Times, "perhaps the world\"s most famous philosopher—if not the only famous philosopher." He often provokes controversy as soon as his name is mentioned. But he also inspires the respect that comes from an illustrious career, and, among many who were his colleagues and peers, he inspired friendship. The Work of Mourning is a collection that honors those friendships in the wake of passing.<br/><br/>Gathered here are texts—letters of condolence, memorial essays, eulogies, funeral orations—written after the deaths of well-known figures: Roland Barthes, Paul de Man, Michel Foucault, Louis Althusser, Edmond Jabès, Louis Marin, Sarah Kofman, Gilles Deleuze, Emmanuel Levinas, Jean-François Lyotard, Max Loreau, Jean-Marie Benoist, Joseph Riddel, and Michel Servière.<br/><br/>With his words, Derrida bears witness to the singularity of a friendship and to the absolute uniqueness of each relationship. In each case, he is acutely aware of the questions of tact, taste, and ethical responsibility involved in speaking of the dead—the risks of using the occasion for one\'s own purposes, political calculation, personal vendetta, and the expiation of guilt. More than a collection of memorial addresses, this volume sheds light not only on Derrida\'s relation to some of the most prominent French thinkers of the past quarter century but also on some of the most important themes of Derrida\'s entire oeuvre-mourning, the 'gift of death,' time, memory, and friendship itself.<br/><br/>'In his rapt attention to his subjects\' work and their influence upon him, the book also offers a hesitant and tangential retelling of Derrida\'s own life in French philosophical history. There are illuminating and playful anecdotes—how Lyotard led Derrida to begin using a word-processor; how Paul de Man talked knowledgeably of jazz with Derrida\'s son. Anyone who still thinks that Derrida is a facetious punster will find such resentful prejudice unable to survive a reading of this beautiful work.'—Steven Poole, Guardian<br/><br/>'Strikingly simpa meditations on friendship, on shared vocations and avocations and on philosophy and history.'—Publishers Weekly', 'language": "en", "image": "https://images.isbndb.com/covers/28/14/9780226142814.jpg", "title_long": "The Work of Mourning", "edition": "1", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 0.8157103694 Pounds, Width: 0.9 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 0.9}, "weight": {"unit": "pounds", "value": 0.8157103694}, "height": {"unit": "inches", "value": 9}}, "pages": 272, "date_published": "2003-09-15", "subjects": ["Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Regional & Cultural', 'Politics & Social Sciences', 'Philosophy', 'Modern', 'Movements'], 'authors": ["Jacques Derrida'], 'title": "The Work of Mourning", "isbn13": "9780226142814", "msrp": 11.3, 'binding": "Paperback", "isbn": "0226142817", "isbn10": "0226142817"}}