{"book": {"publisher": "University Of Chicago Press", "synopsis": "On August 5, 1949, a crew of fifteen of the United States Forest Service\"s elite airborne firefighters, the Smokejumpers, stepped into the sky above a remote forest fire in the Montana wilderness. Two hours after their jump, all but three of these men were dead or mortally burned. Haunted by these deaths for forty years, Norman Maclean puts back together the scattered pieces of the Mann Gulch tragedy.<br/><br/>Young Men and Fire won the National Book Critics Circle Award in 1992.<br/><br/>"A magnificent drama of writing, a tragedy that pays tribute to the dead and offers rescue to the living.... Maclean\"s search for the truth, which becomes an exploration of his own mortality, is more compelling even than his journey into the heart of the fire. His description of the conflagration terrifies, but it is his battle with words, his effort to turn the story of the 13 men into tragedy that makes this book a classic.'—from New York Times Book Review Editor\'s Choice, Best Books of 1992<br/><br/>'A treasure: part detective story, part western, part tragedy, part elegy and wholly eloquent ghost story in which the dead and the living join ranks cheerfully, if sometimes eerily, in a search for truth and the rest it brings.'—Joseph Coates, Chicago Tribune<br/><br/>'An astonishing book. In compelling language, both homely and elegant, Young Men and Fire miraculously combines a fascinating primer on fires and firefighting, a powerful, breathtakingly real reconstruction of a tragedy, and a meditation on writing, grief and human character.... Maclean\'s last book will stir your heart and haunt your memory.'—Timothy Foote, USA Today<br/><br/>'Beautiful.... A dark American idyll of which the language can be proud.'—Robert M. Adams, The New York Review of Books<br/><br/>'Young Men and Fire is redolent of Melville. Just as the reader of Moby Dick comes to comprehend the monstrous entirety of the great white whale, so the reader of Young Men and Fire goes into the heart of the great red fire and comes out thoroughly informed. Don\'t hesitate to take the plunge.'—Dennis Drabelle, Washington Post Book World<br/><br/>'Young Men and Fire is a somber and poetic retelling of a tragic event. It is the pinnacle of smokejumping literature and a classic work of 20th-century nonfiction.'—John Holkeboer, The Wall Street Journal<br/><br/>'Maclean is always with the brave young dead. . . . They could not have found a storyteller with a better claim to represent their honor. . . . A great book.'—James R. Kincaid, New York Times Book Review', 'language": "en", "image": "https://images.isbndb.com/covers/06/21/9780226500621.jpg", "title_long": "Young Men and Fire", "edition": "1", "dimensions": "Height: 8.5 Inches, Length: 0.75 Inches, Weight: 0.86862131228 Pounds, Width: 5.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 0.75}, "width": {"unit": "inches", "value": 5.5}, "weight": {"unit": "pounds", "value": 0.86862131228}, "height": {"unit": "inches", "value": 8.5}}, "pages": 301, "date_published": "1992", "subjects": ["Biographies & Memoirs', 'Historical', 'United States', 'Regional U.S.', 'West', 'History', 'Americas', 'Science & Math', 'Biological Sciences', 'Plants', 'Earth Sciences', 'Natural Disasters', 'Nature & Ecology', 'Natural Resources', 'Nature Writing & Essays', 'Sports & Outdoors', 'Politics & Social Sciences', 'Politics & Government', 'Public Affairs & Policy'], 'authors": ["Norman Maclean'], 'title": "Young Men and Fire", "isbn13": "9780226500621", "msrp": 12.15, 'binding": "Paperback", "isbn": "0226500624", "isbn10": "0226500624"}}