{"book": {"publisher": "University of Chicago Press", "synopsis": "On February 6, 1945, Robert Brasillach was executed for treason by a French firing squad. He was a writer of some distinction—a prolific novelist and a keen literary critic. He was also a dedicated anti-Semite, an acerbic opponent of French democracy, and editor in chief of the fascist weekly Je Suis Partout, in whose pages he regularly printed wartime denunciations of Jews and resistance activists.<br/><br/>Was Brasillach in fact guilty of treason? Was he condemned for his denunciations of the resistance, or singled out as a suspected homosexual? Was it right that he was executed when others, who were directly responsible for the murder of thousands, were set free? Kaplan\"s meticulous reconstruction of Brasillach\"s life and trial skirts none of these ethical subtleties: a detective story, a cautionary tale, and a meditation on the disturbing workings of justice and memory, The Collaborator will stand as the definitive account of Brasillach\"s crime and punishment.<br/><br/>A National Book Award Finalist<br/><br/>A National Book Critics Circle Award Finalist<br/><br/>'A well-researched and vivid account.'—John Weightman, New York Review of Books<br/><br/>'A gripping reconstruction of [Brasillach\'s] trial.'—The New Yorker<br/><br/>'Readers of this disturbing book will want to find moral touchstones of their own. They\'re going to need them. This is one of the few works on Nazism that forces us to experience how complex the situation really was, and answers won\'t come easily.'—Daniel Blue, San Francisco Chronicle Book Review<br/><br/>'The Collaborator is one of the best-written, most absorbing pieces of literary history in years.'—David A. Bell, New York Times Book Review<br/><br/>'Alice Kaplan\'s clear-headed study of the case of Robert Brasillach in France has a good deal of current-day relevance. . . . Kaplan\'s fine book . . . shows that the passage of time illuminates different understandings, and she leaves it to us to reflect on which understanding is better.'—Richard Bernstein, The New York Times', 'language": "en", "image": "https://images.isbndb.com/covers/41/56/9780226424156.jpg", "title_long": "The Collaborator: The Trial and Execution of Robert Brasillach", "edition": "First Edition. pb an", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 1.1243575362 Pounds, Width: 0.6 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 0.6}, "weight": {"unit": "pounds", "value": 1.1243575362}, "height": {"unit": "inches", "value": 9}}, "pages": 336, "date_published": "2001-11-01", "subjects": ["Biographies & Memoirs', 'Historical', 'Europe', 'Leaders & Notable People', 'Military', 'Social Activists', 'History', 'France', 'World War II'], 'authors": ["Alice Kaplan'], 'title": "The Collaborator: The Trial and Execution of Robert Brasillach", "isbn13": "9780226424156", "msrp": 26, "binding": "Paperback", "isbn": "0226424154", "isbn10": "0226424154", "other_isbns": [{'isbn": "9780226308746", "binding": "print"}]}}