{"book": {"publisher": "University of Chicago Press", "synopsis": "Winner of the 2005 Harold Morton Landon Translation Award from the Academy of American Poets.<br/><br/>In Works of Hesiod and the Homeric Hymns, highly acclaimed poet and translator Daryl Hine brings to life the words of Hesiod and the world of Archaic Greece. While most available versions of these early Greek writings are rendered in prose, Hine"s illuminating translations represent these early classics as they originally appeared, in verse. Since prose was not invented as a literary medium until well after Hesiod"s time, presenting these works as poems more closely approximates not only the mechanics but also the melody of the originals.<br/><br/>This volume includes Hesiod"s Works and Days and Theogony, two of the oldest non-Homeric poems to survive from antiquity. Works and Days is in part a farmer's almanac—filled with cautionary tales and advice for managing harvests and maintaining a good work ethic—and Theogony is the earliest comprehensive account of classical mythology—including the names and genealogies of the gods (and giants and monsters) of Olympus, the sea, and the underworld. Hine brings out Hesiod's unmistakable personality; Hesiod's tales of his escapades and his gritty and persuasive voice not only give us a sense of the author's own character but also offer up a rare glimpse of the everyday life of ordinary people in the eighth century BCE.<br/><br/>In contrast, the Homeric Hymns are more distant in that they depict aristocratic life in a polished tone that reveals nothing of the narrators' personalities. These hymns (so named because they address the deities in short invocations at the beginning and end of each) are some of the earliest examples of epyllia, or short stories in the epic manner in Greek.<br/><br/>This volume unites Hine's skillful translations of the Works of Hesiod and the Homeric Hymns—along with Hine's rendering of the mock-Homeric epic The Battle of the Frogs and the Mice—in a stunning pairing of these masterful classics.', 'language": "en", "image": "https://images.isbndb.com/covers/96/59/9780226329659.jpg", "title_long": "Works of Hesiod and the Homeric Hymns", "edition": "1", "dimensions": "Height: 0.74 Inches, Length: 8.46 Inches, Weight: 0.58202037168 Pounds, Width: 5.44 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.46}, "width": {"unit": "inches", "value": 5.44}, "weight": {"unit": "pounds", "value": 0.58202037168}, "height": {"unit": "inches", "value": 0.74}}, "pages": 230, "date_published": "2005-01-15", "subjects": ["Literature & Fiction', 'Classics', 'History & Criticism', 'Criticism & Theory', 'Movements & Periods', 'Poetry', 'Ancient, Classical & Medieval', 'Ancient & Medieval Literature', 'Greek', 'Ancient & Classical'], 'authors": ["Hesiod', 'Daryl Hine'], 'title": "Works of Hesiod and the Homeric Hymns", "isbn13": "9780226329659", "msrp": 50, "binding": "Hardcover", "related": {"Kindle Edition": "0226329674", "eBook": "0226329674"}, "isbn": "0226329658", "isbn10": "0226329658", "other_isbns": [{'isbn": "9780226329673", "binding": "print"}]}}