{"book": {"publisher": "University of Chicago Press", "synopsis": "Anthony Powell\"s universally acclaimed epic encompasses a four-volume panorama of twentieth century London. Hailed by Time as "brilliant literary comedy as well as a brilliant sketch of the times," A Dance to the Music of Time opens just after World War I. Amid the fever of the 1920s and the first chill of the 1930s, Nick Jenkins and his friends confront sex, society, business, and art. In the second volume they move to London in a whirl of marriage and adulteries, fashions and frivolities, personal triumphs and failures. These books 'provide an unsurpassed picture, at once gay and melancholy, of social and artistic life in Britain between the wars' (Arthur Schlesinger, Jr.). The third volume follows Nick into army life and evokes London during the blitz. In the climactic final volume, England has won the war and must now count the losses.<br/>In this third volume of A Dance to the Music of Time, we again meet Widmerpool, doggedly rising in rank; Jenkins, shifted from one dismal army post to another; Stringham, heroically emerging from alcoholism; Templer, still on his eternal sexual quest. Here, too, we are introduced to Pamela Flitton, one of the most beautiful and dangerous women in modern fiction. Wickedly barbed in its wit, uncanny in its seismographic recording of human emotions and social currents, this saga stands as an unsurpassed rendering of England\'s finest yet most costly hour.<br/><br/>Includes these novels:<br/>The Valley of Bones<br/>The Soldier\'s Art<br/>The Military Philosophers<br/><br/>'Anthony Powell is the best living English novelist by far. His admirers are addicts, let us face it, held in thrall by a magician.'—Chicago Tribune<br/><br/>'A book which creates a world and explores it in depth, which ponders changing relationships and values, which creates brilliantly living and diverse characters and then watches them grow and change in their milieu. . . . Powell\'s world is as large and as complex as Proust\'s.'—Elizabeth Janeway, New York Times<br/><br/>'One of the most important works of fiction since the Second World War. . . . The novel looked, as it began, something like a comedy of manners; then, for a while, like a tragedy of manners; now like a vastly entertaining, deeply melancholy, yet somehow courageous statement about human experience.'—Naomi Bliven, New Yorker', 'language": "en", "image": "https://images.isbndb.com/covers/71/70/9780226677170.jpg", "title_long": "A Dance to the Music of Time: Third Movement", "edition": "1", "dimensions": "Height: 1.57 Inches, Length: 8.07 Inches, Weight: 1.6755131912 Pounds, Width: 5.27 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.07}, "width": {"unit": "inches", "value": 5.27}, "weight": {"unit": "pounds", "value": 1.6755131912}, "height": {"unit": "inches", "value": 1.57}}, "pages": 731, "date_published": "1995-05-31", "subjects": ["Literature & Fiction', 'Contemporary', 'Literary'], 'authors": ["Anthony Powell'], 'title": "A Dance to the Music of Time: Third Movement", "isbn13": "9780226677170", "msrp": 24, 'binding": "Paperback", "isbn": "0226677176", "isbn10": "0226677176"}}