{"book": {"publisher": "University of Chicago Press", "synopsis": "When Western scholars write about non-Western societies, do they inevitably perpetuate the myths of European imperialism? Can they ever articulate the meanings and logics of non-Western peoples? Who has the right to speak for whom? Questions such as these are among the most hotly debated in contemporary intellectual life. In How "Natives" Think, Marshall Sahlins addresses these issues head on, while building a powerful case for the ability of anthropologists working in the Western tradition to understand other cultures.<br/><br/>In recent years, these questions have arisen in debates over the death and deification of Captain James Cook on Hawai\"i Island in 1779. Did the Hawaiians truly receive Cook as a manifestation of their own god Lono? Or were they too pragmatic, too worldly-wise to accept the foreigner as a god? Moreover, can a 'non-native' scholar give voice to a 'native' point of view? In his 1992 book The Apotheosis of Captain Cook, Gananath Obeyesekere used this very issue to attack Sahlins\'s decades of scholarship on Hawaii. Accusing Sahlins of elementary mistakes of fact and logic, even of intentional distortion, Obeyesekere portrayed Sahlins as accepting a naive, enthnocentric idea of superiority of the white man over 'natives'—Hawaiian and otherwise. Claiming that his own Sri Lankan heritage gave him privileged access to the Polynesian native perspective, Obeyesekere contended that Hawaiians were actually pragmatists too rational and sensible to mistake Cook for a god.<br/><br/>Curiously then, as Sahlins shows, Obeyesekere turns eighteenth-century Hawaiians into twentieth-century modern Europeans, living up to the highest Western standards of 'practical rationality.' By contrast, Western scholars are turned into classic custom-bound 'natives', endlessly repeating their ancestral traditions of the White man\'s superiority by insisting Cook was taken for a god. But this inverted ethnocentrism can only be supported, as Sahlins demonstrates, through wholesale fabrications of Hawaiian ethnography and history—not to mention Obeyesekere\'s sustained misrepresentations of Sahlins\'s own work. And in the end, although he claims to be speaking on behalf of the 'natives,' Obeyesekere, by substituting a home-made 'rationality' for Hawaiian culture, systematically eliminates the voices of Hawaiian people from their own history.<br/><br/>How 'Natives' Think goes far beyond specialized debates about the alleged superiority of Western traditions. The culmination of Sahlins\'s ethnohistorical research on Hawaii, it is a reaffirmation for understanding difference.', 'language": "en", "image": "https://images.isbndb.com/covers/36/92/9780226733692.jpg", "title_long": "How "Natives" Think: About Captain Cook, For Example', 'edition": "1", "dimensions": "Height: 0.73 Inches, Length: 9.09 Inches, Weight: 1.1243575362 Pounds, Width: 5.88 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 9.09}, "width": {"unit": "inches", "value": 5.88}, "weight": {"unit": "pounds", "value": 1.1243575362}, "height": {"unit": "inches", "value": 0.73}}, "pages": 328, "date_published": "1996-10-01", "subjects": ["History', 'Americas', 'Native American', 'United States', 'Australia & Oceania', 'Oceania', 'Travel', 'Politics & Social Sciences', 'Social Sciences', 'Anthropology', 'General'], 'authors": ["Marshall Sahlins'], 'title": "How "Natives" Think: About Captain Cook, For Example', 'isbn13": "9780226733692", "msrp": 34, "binding": "Paperback", "related": {"Page Fidelity": "0226733718", "eBook": "0226733718"}, "isbn": "0226733696", "isbn10": "0226733696", "other_isbns": [{'isbn": "9780226733715", "binding": "print"}]}}