{"book": {"publisher": "University Of Chicago Press", "synopsis": "On Thursday, July 13, 1995, Chicagoans awoke to a blistering day in which the temperature would reach 106 degrees. The heat index, which measures how the temperature actually feels on the body, would hit 126 degrees by the time the day was over. Meteorologists had been warning residents about a two-day heat wave, but these temperatures did not end that soon. When the heat wave broke a week later, city streets had buckled; the records for electrical use were shattered; and power grids had failed, leaving residents without electricity for up to two days. And by July 20, over seven hundred people had perished-more than twice the number that died in the Chicago Fire of 1871, twenty times the number of those struck by Hurricane Andrew in 1992—in the great Chicago heat wave, one of the deadliest in American history.<br/><br/>Heat waves in the United States kill more people during a typical year than all other natural disasters combined. Until now, no one could explain either the overwhelming number or the heartbreaking manner of the deaths resulting from the 1995 Chicago heat wave. Meteorologists and medical scientists have been unable to account for the scale of the trauma, and political officials have puzzled over the sources of the city\"s vulnerability. In Heat Wave, Eric Klinenberg takes us inside the anatomy of the metropolis to conduct what he calls a "social autopsy," examining the social, political, and institutional organs of the city that made this urban disaster so much worse than it ought to have been.<br/><br/>Starting with the question of why so many people died at home alone, Klinenberg investigates why some neighborhoods experienced greater mortality than others, how the city government responded to the crisis, and how journalists, scientists, and public officials reported on and explained these events. Through a combination of years of fieldwork, extensive interviews, and archival research, Klinenberg uncovers how a number of surprising and unsettling forms of social breakdown—including the literal and social isolation of seniors, the institutional abandonment of poor neighborhoods, and the retrenchment of public assistance programs—contributed to the high fatality rates. The human catastrophe, he argues, cannot simply be blamed on the failures of any particular individuals or organizations. For when hundreds of people die behind locked doors and sealed windows, out of contact with friends, family, community groups, and public agencies, everyone is implicated in their demise.<br/><br/>As Klinenberg demonstrates in this incisive and gripping account of the contemporary urban condition, the widening cracks in the social foundations of American cities that the 1995 Chicago heat wave made visible have by no means subsided as the temperatures returned to normal. The forces that affected Chicago so disastrously remain in play in America\'s cities, and we ignore them at our peril.', 'language": "en", "image": "https://images.isbndb.com/covers/32/25/9780226443225.jpg", "title_long": "Heat Wave: A Social Autopsy of Disaster in Chicago", "edition": "First Edition", "dimensions": "Height: 8.75 Inches, Length: 5.75 Inches, Weight: 0.95 Pounds, Width: 0.75 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.75}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 0.95}, "height": {"unit": "inches", "value": 8.75}}, "pages": 328, "date_published": "2003-07-15", "subjects": ["Biographies & Memoirs', 'Regional U.S.', 'Midwest', 'History', 'Americas', 'United States', 'Historical Study & Educational Resources', 'Reference', 'Science & Math', 'Earth Sciences', 'Natural Disasters', 'Politics & Social Sciences', 'Social Sciences', 'Disaster Relief', 'Sociology', 'Urban', 'Politics & Government', 'Public Affairs & Policy', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Eric Klinenberg'], 'title": "Heat Wave: A Social Autopsy of Disaster in Chicago", "isbn13": "9780226443225", "msrp": 14.1, 'binding": "Paperback", "isbn": "0226443221", "isbn10": "0226443221"}}