{"book": {"publisher": "Columbia University Press", "synopsis": "The celebrated author of Gender Trouble here redefines Antigone\"s legacy, recovering her revolutionary significance and liberating it for a progressive feminism and sexual politics. Butler\"s new interpretation does nothing less than reconceptualize the incest taboo in relation to kinship―and open up the concept of kinship to cultural change.<br/><br/>Antigone, the renowned insurgent from Sophocles\"s Oedipus, has long been a feminist icon of defiance. But what has remained unclear is whether she escapes from the forms of power that she opposes. Antigone proves to be a more ambivalent figure for feminism than has been acknowledged, since the form of defiance she exemplifies also leads to her death. Butler argues that Antigone represents a form of feminist and sexual agency that is fraught with risk. Moreover, Antigone shows how the constraints of normative kinship unfairly decide what will and will not be a livable life.<br/><br/>Butler explores the meaning of Antigone, wondering what forms of kinship might have allowed her to live. Along the way, she considers the works of such philosophers as Hegel, Lacan, and Irigaray. How, she asks, would psychoanalysis have been different if it had taken Antigone―the 'postoedipal' subject―rather than Oedipus as its point of departure? If the incest taboo is reconceived so that it does not mandate heterosexuality as its solution, what forms of sexual alliance and new kinship might be acknowledged as a result? The book relates the courageous deeds of Antigone to the claims made by those whose relations are still not honored as those of proper kinship, showing how a culture of normative heterosexuality obstructs our capacity to see what sexual freedom and political agency could be.', 'language": "en", "image": "https://images.isbndb.com/covers/89/58/9780231118958.jpg", "title_long": "Antigone"s Claim", 'edition": "25313", "dimensions": "Height: 9 Inches, Length: 5 Inches, Weight: 0.32 Pounds, Width: 0.25 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 0.25}, "weight": {"unit": "pounds", "value": 0.32}, "height": {"unit": "inches", "value": 9}}, "pages": 118, "date_published": "2002-03-15", "subjects": ["Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Movements & Periods', 'Politics & Social Sciences', 'Philosophy', 'Movements', 'Social Sciences', 'Folklore & Mythology', 'LGBTQ+ Demographic Studies', 'Women's Studies', 'Feminist Theory', 'Women Writers', 'Sociology', 'Marriage & Family', 'Self Service', 'Custom Stores'], 'authors": ["Judith Butler'], 'title": "Antigone"s Claim", 'isbn13": "9780231118958", "msrp": 24, "binding": "Paperback", "isbn": "0231118953", "isbn10": "0231118953", "other_isbns": [{'isbn": "9780231518048", "binding": "print"}]}}