{"book": {"publisher": "Indiana University Press", "synopsis": "Introduction to Documentary provides a one-of-a-kind overview of the most important topics and issues in documentary history and criticism. Designed for students in any field that makes use of visual evidence and persuasive strategies, from the law to anthropology, and from history to journalism, this book spells out the distinguishing qualities of documentary. A wide-ranging and freewheeling form of filmmaking, documentary has not yet received a proper, written introduction to its public, or its future makers.<br/>Introduction to Documentary is not organized as a history of the form although its examples span a century of filmmaking. Instead, this book offers suggestive answers to basic issues that have stood at the center of all debate on documentary from its very beginnings to today. Each chapter takes up a distinct question from ""How did documentary filmmaking get started?"' to ''Why are ethical issues central to documentary?'' These questions move through issues of ethics, form, modes, voice, history and politics, among others. A final chapter addresses the question of how to write about documentary in a clear, convincing manner. Introduction to Documentary provides the foundational key to further explorations in this exceptionally vital area of filmmaking today.', 'language": "en", "image": "https://images.isbndb.com/covers/46/90/9780253214690.jpg", "title_long": "Introduction to Documentary:", "edition": "1", "dimensions": "Height: 9 Inches, Length: 6.62 Inches, Weight: 0.9700339528 Pounds, Width: 0.6 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.62}, "width": {"unit": "inches", "value": 0.6}, "weight": {"unit": "pounds", "value": 0.9700339528}, "height": {"unit": "inches", "value": 9}}, "pages": 223, "date_published": "2001-11-15", "subjects": ["Arts & Photography', 'Performing Arts', 'Humor & Entertainment', 'Movies', 'History & Criticism', 'Documentaries', 'Television'], 'authors": ["Bill Nichols'], 'title": "Introduction to Documentary:", "isbn13": "9780253214690", "msrp": 20.95, 'binding": "Paperback", "isbn": "0253214696", "isbn10": "0253214696"}}