{"book": {"publisher": "HarperCollins UK", "synopsis": "The second part of The History of The Lord of the Rings, an enthralling account of the writing of the Book of the Century which contains many additional scenes and includes the unpublished Epilogue in its entirety. The Treason of Isengard continues the account of the creation of The Lord of the Rings started in the earlier volume, The Return of the Shadow. It races the great expansion of the tale into new lands and peoples south and east of the Misty Mountains: the emerence of Lothlorien, of Ents, of the Riders of Rohan, and of Saruman the White in the fortress of Isengard. In brief outlines and pencilled drafts dashed down on scraps of paper are seen the first entry of Galadriel, the earliest ideas of the history of Gondor, and the original meeting of Aragorn and Eowyn, its significance destined to be wholly transformed. The book also contains a full account of the original map which was to be the basis of the emerging geography of Middle-earth. This series of fascinating books has now been repackaged to complement the distinctive and classic style of the "black cover" A-format paperbacks of The Hobbit, The Lord of the Rings, The Silmarillion and Unfinished Tales.", 'language": "en", "image": "https://images.isbndb.com/covers/22/00/9780261102200.jpg", "title_long": "The Treason of Isengard The History of the Lord of the Rings Part 2", "edition": "International Edition", "dimensions": "height: 198 mm, length: 129 mm, width: 34 mm, weight: 360 g", "dimensions_structured": {"length": {"unit": "mm", "value": 129}, "width": {"unit": "mm", "value": 34}, "weight": {"unit": "g", "value": 360}, "height": {"unit": "mm", "value": 198}}, "pages": 504, "date_published": "1992", "subjects": ["Literature & Fiction', 'Classics', 'Science Fiction & Fantasy', 'Fantasy', 'Epic', 'Science Fiction', 'History & Criticism'], 'authors": ["J. R. R. Tolkien'], 'title": "The Treason of Isengard The History of the Lord of the Rings Part 2", "isbn13": "9780261102200", "msrp": 20.65, 'binding": "Mass Market Paperback", "isbn": "0261102206", "isbn10": "0261102206"}}