{"book": {"publisher": "The MIT Press", "synopsis": "A lively, unorthodox look at economics, business, and public policy told in the form of a novel.<br/>A love story that embraces the business and economic issues of the day?<br/>The Invisible Heart takes a provocative look at business, economics, and regulation through the eyes of Sam Gordon and Laura Silver, teachers at the exclusive Edwards School in Washington, D.C. Sam lives and breathes capitalism. He thinks that most government regulation is unnecessary or even harmful. He believes that success in business is a virtue. He believes that our humanity flourishes under economic freedom. Laura prefers Wordsworth to the Wall Street Journal. Where Sam sees victors, she sees victims. She wants the government to protect consumers and workers from the excesses of Sam"s beloved marketplace.<br/>While Sam and Laura argue about how to make the world a better place, a parallel story unfolds across town. Erica Baldwin, the crusading head of a government watchdog agency, tries to bring Charles Krauss, a ruthless CEO, to justice. How are these two dramas connected? Why is Sam under threat of dismissal? Will Erica Baldwin find the evidence she needs? Can Laura love a man with an Adam Smith poster on his wall? The answers in The Invisible Heart give the reader a richer appreciation for how business and the marketplace transform our lives.", "language": "en", "image": "https://images.isbndb.com/covers/13/53/9780262681353.jpg", "title_long": "The Invisible Heart: An Economic Romance", "edition": "1", "dimensions": "Height: 8 Inches, Length: 5.38 Inches, Weight: 0.70106999316 Pounds, Width: 0.68 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.38}, "width": {"unit": "inches", "value": 0.68}, "weight": {"unit": "pounds", "value": 0.70106999316}, "height": {"unit": "inches", "value": 8}}, "pages": 282, "date_published": "2002-03-07", "subjects": ["Business & Money', 'Economics', 'Economic Policy & Development', 'International', 'Literature & Fiction', 'Dramas & Plays', 'Comedy', 'Genre Fiction', 'Reference', 'Romance', 'Romantic Suspense', 'Politics & Social Sciences', 'Politics & Government', 'Specific Topics', 'Public Affairs & Policy'], 'authors": ["Russell Roberts'], 'title": "The Invisible Heart: An Economic Romance", "isbn13": "9780262681353", "msrp": 26.95, "binding": "Paperback", "isbn": "0262681358", "isbn10": "0262681358", "other_isbns": [{'isbn": "9780262250399", "binding": "print"}]}}