{"book": {"publisher": "The MIT Press", "synopsis": "Why do certain ideas gain currency in economics while others fall by the wayside? Paul Krugman argues that the unwillingness of mainstream economists to think about what they could not formalize led them to ignore ideas that turn out, in retrospect, to have been very good ones. Krugman examines the course of economic geograph and development theory to shed light on the nature of economic inquiry. He traces how development theory lost its huge initial influence and virtually disappeared from economic discourse after it became clear that many of the theory\"s main insights could not be clearly modeled. Economic geography seems to have fared even worse, as economists shied away from grappling with questions about space\x97such as the size, location, or even existence of cities\x97because the "terrain was seen as unsuitable for the tools at hand." Krugman\'s book, however, is not a call to abandon economic modeling. He concludes with a reminder of why insisting on the use of models may be right, even when these sometimes lead economists to overlook good ideas. He also recaps the discussion of development and economic geography with a commentary on recent developments in those fields and areas where further inquiry looks most promising.', 'language": "en", "image": "https://images.isbndb.com/covers/13/50/9780262611350.jpg", "title_long": "Development, Geography, and Economic Theory (Ohlin Lectures)", "edition": "Reprint", "dimensions": "Height: 7.8 Inches, Length: 5.3 Inches, Weight: 0.35053499658 Pounds, Width: 0.4 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.3}, "width": {"unit": "inches", "value": 0.4}, "weight": {"unit": "pounds", "value": 0.35053499658}, "height": {"unit": "inches", "value": 7.8}}, "pages": 128, "date_published": "1997-08-01", "subjects": ["Business & Money', 'Economics', 'Development & Growth', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Paul Krugman'], 'title": "Development, Geography, and Economic Theory (Ohlin Lectures)", "isbn13": "9780262611350", "msrp": 14.48, 'binding": "Paperback", "isbn": "026261135X", "isbn10": "026261135X"}}