{"book": {"publisher": "Bradford Books", "synopsis": "An Odyssey in Learning and Perception documents a fifty-year intellectual expedition in the areas of learning and perception—always with an eye to combining them in a theory of perceptual learning and development, a theory that may be broadly applicable to humans and nonhumans, young and old.<br/>In the field of psychology, beginning in the 1950s, Eleanor J. Gibson nearly single-handedly developed the field of perceptual learning with a series of brilliant studies that culminated in the seminal work, Perceptual Learning and Development. An Odyssey in Learning and Perception brings together Gibson"s scientific papers, including difficult-to-find or previously unpublished work, along with classic studies in perception and action. Gibson introduces each paper to show why the research was undertaken and concludes each section with comments linking the findings to later developments. A personal essay touches on the questions and concerns that guided her research.", "language": "en", "image": "https://images.isbndb.com/covers/10/36/9780262571036.jpg", "title_long": "An Odyssey in Learning and Perception (Learning, Development, and Conceptual Change)", "edition": "New edition", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 2.10100535686 Pounds, Width: 1.48 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1.48}, "weight": {"unit": "pounds", "value": 2.10100535686}, "height": {"unit": "inches", "value": 9}}, "pages": 656, "date_published": "1994-02-03", "subjects": ["Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Medical', 'Science & Math', 'Behavioral Sciences', 'Cognitive Psychology', 'Medical Books', 'Psychology', 'Cognitive'], 'authors": ["Eleanor J. Gibson'], 'title": "An Odyssey in Learning and Perception (Learning, Development, and Conceptual Change)", "isbn13": "9780262571036", "msrp": 10, 'binding": "Paperback", "isbn": "026257103X", "isbn10": "026257103X"}}