{"book": {"publisher": "The MIT Press", "synopsis": ""Pop internationalists"—people who speak impressively about international trade while ignoring basic economics and misusing economic figures are the target of this collection of Paul Krugman\"s most recent essays. In the clear, readable, entertaining style that brought acclaim for his best-selling Age of Diminished Expectations, Krugman explains what real economic analysis is. He discusses economic terms and measurements, like 'value-added' and GDP, in simple language so that readers can understand how pop internationalists distort, and sometimes contradict, the most basic truths about world trade.<br/>All but two of the essays have previously appeared in such publications as Foreign Affairs, Scientific American, and the Harvard Business Review. The first five essays take on exaggerations of foreign competition\'s effects on the U.S. economy and represent Krugman\'s central criticisms of public debate over world trade. The next three essays expose further distortions of economic theory and include the complete, unaltered, controversial review of Laura Tyson\'s Who\'s Bashing Whom. The third group of essays highlights misconceptions about competition from less industrialized countries. The concluding essays focus on interesting and legitimate economic questions, such as the effects of technological change on society.', 'language": "en", "image": "https://images.isbndb.com/covers/13/36/9780262611336.jpg", "title_long": "Pop Internationalism (The MIT Press)", "edition": "Revised ed.", "dimensions": "Height: 0.69 Inches, Length: 7.99 Inches, Weight: 0.59965735264 Pounds, Width: 5.37 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.99}, "width": {"unit": "inches", "value": 5.37}, "weight": {"unit": "pounds", "value": 0.59965735264}, "height": {"unit": "inches", "value": 0.69}}, "pages": 237, "date_published": "1997-02-07", "subjects": ["Business & Money', 'Economics', 'Theory', 'International', 'Politics & Social Sciences', 'Politics & Government', 'Ideologies & Doctrines'], 'authors": ["Paul Krugman'], 'title": "Pop Internationalism (The MIT Press)", "isbn13": "9780262611336", "msrp": 34, 'binding": "Paperback", "isbn": "0262611333", "isbn10": "0262611333"}}