{"book": {"publisher": "Holtzbrinck", "synopsis": "Most popularly known as the author of the children"s classic The Chronicles of Narnia, C. S. Lewis was also a prolific poet, essayist, novelist, and Christian writer. His most famous work, The Lion, the Witch, and the Wardrobe, while known as a children"s book is often read as a Christian allegory and remains to this day one of his best-loved works. But Lewis was prolific in a number of areas, including poetry, Christian writing, literary criticism, letters, memoir, autobiography, sermons and more. This set, written by experts, guides readers to a better understanding and appreciation of this important and influential writer.<br/><br/>Clive Staples Lewis was born on November 29, 1898, in Belfast, Northern Ireland. His mother died when he was young, leaving his father to raise him and his older brother Warren. He fought and was wounded in World War I and later became immersed in the spiritual life of Christianity. While he delved into the world of Christian writing, he did not limit himself to one genre and produced a remarkable oeuvre that continues to be widely read, taught, and adored at all levels. As part of the circle known as the Inklings, which consisted of writers and intellectuals, and included J.R.R. Tolkien, Charles Williams, and others, he developed and honed his skills and continued to put out extensive writings. Many different groups now claim him as their own: spanning genres from science fiction to Christian literature, from nonfiction to children"s stories, his output remains among the most popular and complex. Here, experts in the field of Lewis studies examine all his works along with the details of his life and the culture in which he lived to give readers the fullest complete picture of the man, the writer, and the husband, alongside his works, his legacy, and his place in English letters.', 'language": "en", "image": "https://images.isbndb.com/covers/11/66/9780275991166.jpg", "title_long": "C. S. Lewis: Life, Works, and Legacy [4 volumes] (Praeger Perspectives)", "dimensions": "Height: 10.0999798 Inches, Length: 6.8999862 Inches, Weight: 7 Pounds, Width: 5.6999886 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.8999862}, "width": {"unit": "inches", "value": 5.6999886}, "weight": {"unit": "pounds", "value": 7}, "height": {"unit": "inches", "value": 10.0999798}}, "pages": 1416, "date_published": "2007-04-30", "subjects": ["Literature & Fiction', 'History & Criticism', 'Movements & Periods', 'Regional & Cultural', 'British & Irish', 'Religion & Spirituality'], 'authors": [], "title": "C. S. Lewis: Life, Works, and Legacy [4 volumes] (Praeger Perspectives)", "isbn13": "9780275991166", "msrp": 216, 'binding": "Hardcover", "isbn": "0275991164", "isbn10": "0275991164"}}