{"book": {"publisher": "University of Texas Press", "synopsis": "Against the backdrop of Isla Negra — the sea and wind, the white sand with its scattering of delicate wild flowers, the hot sun and salty smells of the Pacific — Nobel laureate Pablo Neruda sets these joyfully sensual poems in celebration of his love. The subject of that love: Matilde Urrutia de Neruda, the poet\"s "beloved wife."<br/>As popular in the Hispanic world as the poet\'s renowned Twenty Love Poems and a Song of Despair, One Hundred Love Sonnets has never before been published in its entirety in English translation. The reason for this astonishing neglect may lie in the historical circumstances that surrounded Neruda\'s 'discovery ' by English-speaking readers. In the United States he came to popularity during the turmoil of the sixties, when Americans needed a politically committed poet, and much of Neruda\'s canon answered that need. But, in his native Chile and throughout Latin America, Neruda has always been cherished as dearly for the earthly sensuality and eroticism of his love poetry as for his statements of political belief. To know this work, then is to understand the poet\'s art more thoroughly.', 'language": "en", "image": "https://images.isbndb.com/covers/02/88/9780292760288.jpg", "title_long": "100 Love Sonnets: Cien sonetos de amor (Texas Pan American Series) (English and Spanish Edition)", "edition": "Reissue", "dimensions": "Height: 9 Inches, Length: 5.75 Inches, Weight: 0.7495716908 Pounds, Width: 0.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.75}, "width": {"unit": "inches", "value": 0.5}, "weight": {"unit": "pounds", "value": 0.7495716908}, "height": {"unit": "inches", "value": 9}}, "pages": 232, "date_published": "1986", "subjects": ["Literature & Fiction', 'Poetry', 'Regional & Cultural', 'Themes & Styles', 'World Literature', 'Caribbean & Latin American', 'Education & Teaching', 'Schools & Teaching'], 'authors": ["Pablo Neruda'], 'title": "100 Love Sonnets: Cien sonetos de amor (Texas Pan American Series) (English and Spanish Edition)", "isbn13": "9780292760288", "msrp": 18.95, 'binding": "Paperback", "isbn": "0292760280", "isbn10": "0292760280"}}