{"book": {"publisher": "University of Washington Press", "synopsis": "Filipino farmworkers sat down in the grape fields of Delano, California, in 1965 and began the strike that brought about a dramatic turn in the long history of farm labor struggles in California. Their efforts led to the creation of the United Farm Workers union under Cesar Chavez, with Philip Vera Cruz as its vice-president and highest-ranking Filipino officer.<br/><br/>Philip Vera Cruz (1904–1994) embodied the experiences of the manong generation, an enormous wave of Filipino immigrants who came to the United States between 1910 and 1930. Instead of better opportunities, they found racial discrimination, deplorable living conditions, and oppressive labor practices. In his deeply reflective and thought-provoking oral memoir, Vera Cruz explores the toll these conditions took on both families and individuals.<br/><br/>Craig Scharlin and Lilia V. Villanueva met Philip Vera Cruz in 1974 as volunteers in the construction of Agbayani Village, the United Farm Workers retirement complex in Delano, California. This oral history, first published in 1992, is the product of hundreds of hours of interviews. Elaine H. Kim teaches Asian American studies at the University of California, Berkeley, and is the author of Asian American Literature: An Introduction to the Writings and Their Social Context.", "language": "en", "image": "https://images.isbndb.com/covers/98/47/9780295979847.jpg", "title_long": "Philip Vera Cruz: A Personal History of Filipino Immigrants and the Farmworkers Movement, Third Edition", "edition": "Third", "dimensions": "Height: 0.52 Inches, Length: 9.04 Inches, Weight: 0.70106999316 Pounds, Width: 6.15 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 9.04}, "width": {"unit": "inches", "value": 6.15}, "weight": {"unit": "pounds", "value": 0.70106999316}, "height": {"unit": "inches", "value": 0.52}}, "pages": 210, "date_published": "2000-06-01", "subjects": ["Biographies & Memoirs', 'Community & Culture', 'Emigrants & Immigrants', 'Historical', 'United States', 'Business & Money', 'Economics', 'Labor & Industrial Relations', 'Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies', 'Politics & Government', 'International & World Politics', 'Specific Topics'], 'authors": ["Lilia Villanueva', 'Craig Scharlin'], 'title": "Philip Vera Cruz: A Personal History of Filipino Immigrants and the Farmworkers Movement, Third Edition", "isbn13": "9780295979847", "msrp": 19.68, "binding": "Paperback", "related": {"eBook": "0295802952", "ePub": "0295802952"}, "isbn": "0295979844", "isbn10": "0295979844", "other_isbns": [{'isbn": "9780295802954", "binding": "ebook"}]}}