{"book": {"publisher": "University of Washington Press", "synopsis": "In Long Day"s Journey Carlos Schwantes gathers historical photographs, advertisements, posters, and contemporary accounts to recreate one of the most colorful periods in the American West. He traces the rapidly evolving saga of miners and settlers struggling to get from here to there in the days before railroads reached the West, trying to establish methods of transportation and communication between the eastern United States and the new territories that became Oregon, Washington, Idaho, Montana, and Wyoming―first by sea, around continents, then by land and water routes across America. Many of the enduring images and myths of the West derive from this era: the Pony Express, mule trains and plodding ox-team freighters, the picturesque side-wheelers and stern-wheelers that churned along the rivers, the colorful Concord stagecoaches drawn by four or six jingling, fleet horses.<br/><br/>Schwantes describes in detail the technology of preindustrial modes of transportation. He explains the economics that linked the birth and death of western towns and cities, the business history of entrepreneurs and stagecoach and steamboat companies, and the challenges facing passengers and employees on the stages and steamers of the northern West. Integrating more than 200 historical photographs and other illustrations with vivid contemporary accounts, Schwantes presents a fascinating history of Americans forging the first working connections between the West and the rest of America―connections that the railroads would soon smooth and strengthen. His book Railroad Signatures across the Pacific Northwest detailed that story; here he tells of the people and animals and equipment supplanted by the twin ribbons of steel.", "language": "en", "image": "https://images.isbndb.com/covers/69/14/9780295976914.jpg", "title_long": "Long Day"s Journey: The Steamboat and Stagecoach Era in the Northern West", 'edition": "First Edition", "dimensions": "Height: 10.21 Inches, Length: 10.75 Inches, Weight: 4.60104740794 Pounds, Width: 1.47 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 10.75}, "width": {"unit": "inches", "value": 1.47}, "weight": {"unit": "pounds", "value": 4.60104740794}, "height": {"unit": "inches", "value": 10.21}}, "pages": 408, "date_published": "1999-09-01", "subjects": ["History', 'Americas', 'United States', 'Engineering & Transportation', 'Transportation'], 'authors": ["Carlos Arnaldo Schwantes'], 'title": "Long Day"s Journey: The Steamboat and Stagecoach Era in the Northern West", 'isbn13": "9780295976914", "msrp": 57.77, 'binding": "Hardcover", "isbn": "0295976918", "isbn10": "0295976918"}}