{"book": {"publisher": "University of Wisconsin Press", "synopsis": "He published his only novel more than fifty years ago. He has hardly been seen or heard from since 1965. Most writers fitting such a description are long forgotten, but if the novel is The Catcher in the Rye and the writer is J. D. Salinger . . . well, he’s the stuff of legends, the most famously reclusive writer of the twentieth century. If you could write to him, what would you say?<br/><br/>Salinger continues to maintain his silence, but Holden Caulfield, Franny and Zooey, and Seymour Glass—the unforgettable characters of his novel and short stories—continue to speak to generations of readers and writers. Letters to Salinger includes more than 150 personal letters addressed to Salinger from well-known writers, editors, critics, journalists, and other luminaries, as well as from students, teachers, and readers around the world, some of whom have just discovered Salinger for the first time. Their voices testify to the lasting impressions Salinger’s ideas and emotions have made on so many diverse lives.<br/><br/>Contributors include Marvin Bell, Frederick Busch, Stephen Collins, Nicholas Delbanco, Warren French, Herbert Gold, W. P. Kinsella, Molly McQuade, Stewart O’Nan, Robert O’Connor, Ellis Paul, Molly Peacock, Sanford Pinsker, George Plimpton, Gerald Rosen, Sid Salinger, David Shields, Joseph Skibell, Melanie Rae Thon, Alma Luz Villanueva, Katharine Weber, and many others", "language": "en", "image": "https://images.isbndb.com/covers/80/00/9780299178000.jpg", "title_long": "Letters to J. D. Salinger", "edition": "1", "dimensions": "Height: 10 Inches, Length: 6.5 Inches, Weight: 1.35 Pounds, Width: 0.8 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.5}, "width": {"unit": "inches", "value": 0.8}, "weight": {"unit": "pounds", "value": 1.35}, "height": {"unit": "inches", "value": 10}}, "pages": 270, "date_published": "2002-03-28", "subjects": ["Literature & Fiction', 'History & Criticism', 'Regional & Cultural', 'United States', 'Anthologies'], 'authors": [], "title": "Letters to J. D. Salinger", "isbn13": "9780299178000", "msrp": 24.95, "binding": "Hardcover", "related": {"eBook": "029917803X"}, "isbn": "0299178005", "isbn10": "0299178005", "other_isbns": [{'isbn": "9780299178031", "binding": "print"}]}}