{"book": {"publisher": "Yale University Press", "synopsis": "This book invites\x97no, demands\x97a response from its readers. It is impossible not to be drawn in to the provocative (often contentious) discussion that Harvey Mansfield sets before us. This is the first comprehensive study of manliness, a quality both bad and good, mostly male, often intolerant, irrational, and ambitious. Our \x93gender-neutral society” does not like it but cannot get rid of it.<br/>Drawing from science, literature, and philosophy, Mansfield examines the layers of manliness, from vulgar aggression, to assertive manliness, to manliness as virtue, and to philosophical manliness. He shows that manliness seeks and welcomes drama, prefers times of war, conflict, and risk, and brings change or restores order at crucial moments. Manly men in their assertiveness raise issues, bring them to the fore, and make them public and political\x97as for example, the manliness of the women’s movement.<br/>After a wide-ranging tour from stereotypes to Hemingway and Achilles, to Nietzsche, to feminism, and to Plato, the author returns to today’s problem of \x93unemployed manliness.” Formulating a reasoned defense of a quality hardly obedient to reason, he urges men, and especially women, to understand and accept manliness, and to give it honest and honorable employment.", "language": "en", "image": "https://images.isbndb.com/covers/66/40/9780300106640.jpg", "title_long": "Manliness", "edition": "annotated edition", "dimensions": "Height: 9.25 Inches, Length: 6 Inches, Weight: 1.24 Pounds, Width: 1.25 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1.25}, "weight": {"unit": "pounds", "value": 1.24}, "height": {"unit": "inches", "value": 9.25}}, "pages": 304, "date_published": "2006-02-06", "subjects": ["Politics & Social Sciences', 'Social Sciences', 'Gender Studies', 'Sociology'], 'authors": ["Harvey C. Mansfield'], 'title": "Manliness", "isbn13": "9780300106640", "msrp": "0.00", "binding": "Hardcover", "related": {"ePub": "0300129939"}, "isbn": "0300106645", "isbn10": "0300106645", "other_isbns": [{'isbn": "9780300129939", "binding": "print"}]}}