{"book": {"publisher": "Yale University Press", "synopsis": "The Annotated Shakespeare series allows readers to fully understand and enjoy the rich plays of the world’s greatest dramatist<br/><br/>“If any work deserves a student’s closest attention, it is Hamlet. Burton Raffel’s fully annotated edition is a teacher’s and student’s dream: the words are fully explained, and they get a wonderful essay by Harold Bloom as well.”—George Soule, Carleton College<br/><br/>One of the most frequently read and performed of all stage works, Shakespeare’s Hamlet is unsurpassed in its complexity and richness. This fully annotated version of Hamlet makes the play completely accessible to readers in the twenty-first century. It has been carefully assembled, with students, teachers, and the general reader in mind.<br/><br/>Eminent linguist and translator Burton Raffel offers generous help with vocabulary and usage of Elizabethan English, pronunciation, prosody, and alternative readings of phrases and lines. His on-page annotations provide readers with all the tools they need to comprehend the play and begin to explore its many possible interpretations. This version of Hamlet is unparalleled for its thoroughness and adherence to sound linguistic principles. In his Introduction, Raffel offers important background on the origins and previous versions of the Hamlet story, along with an analysis of the characters Hamlet and Ophelia. And in a concluding essay, Harold Bloom meditates on the originality of Shakespeare’s achievement. The book also includes a Further Reading section.", "language": "en", "image": "https://images.isbndb.com/covers/10/58/9780300101058.jpg", "title_long": "Hamlet", "edition": "5", "dimensions": "Height: 8 Inches, Length: 5.25 Inches, Weight: 0.50044933474 Pounds, Width: 0.5 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.25}, "width": {"unit": "inches", "value": 0.5}, "weight": {"unit": "pounds", "value": 0.50044933474}, "height": {"unit": "inches", "value": 8}}, "pages": 253, "date_published": "2003-10-01", "subjects": ["Literature & Fiction', 'Dramas & Plays', 'Shakespeare', 'Contemporary', 'Education & Teaching', 'Studying & Workbooks', 'Study Guides'], 'authors": ["William Shakespeare'], 'title": "Hamlet", "isbn13": "9780300101058", "msrp": 6.95, "binding": "Paperback", "related": {"Kindle Edition": "0300138237", "ePub": "0300138237"}, "isbn": "0300101058", "isbn10": "0300101058", "other_isbns": [{'isbn": "9780300138238", "binding": "printisbn"}]}}