{"book": {"publisher": "Yale University Press", "synopsis": "The first collection of Mark Rothko’s writings, which range the entire span of his career<br/><br/>While the collected writings of many major 20th-century artists, including Barnett Newman, Robert Motherwell, and Ad Reinhardt, have been published, Mark Rothko’s writings have only recently come to light, beginning with the critically acclaimed The Artist’s Reality: Philosophies of Art. Rothko’s other written works have yet to be brought together into a major publication. Writings on Art fills this significant void; it includes some 90 documents—including short essays, letters, statements, and lectures—written by Rothko over the course of his career. The texts are fully annotated, and a chronology of the artist’s life and work is also included.<br/><br/>This provocative compilation of both published and unpublished writings from 1934--69 reveals a number of things about Rothko: the importance of writing for an artist who many believed had renounced the written word; the meaning of transmission and transition that he experienced as an art teacher at the Brooklyn Jewish Center Academy; his deep concern for meditation and spirituality; and his private relationships with contemporary artists (including Newman, Motherwell, and Clyfford Still) as well as journalists and curators.<br/><br/>As was revealed in Rothko’s The Artist’s Reality, what emerges from this collection is a more detailed picture of a sophisticated, deeply knowledgeable, and philosophical artist who was also a passionate and articulate writer.", "language": "en", "image": "https://images.isbndb.com/covers/44/09/9780300114409.jpg", "title_long": "Writings on Art", "edition": "Annotated", "dimensions": "Height: 0.72 Inches, Length: 9.3 Inches, Weight: 1.04940036712 Pounds, Width: 6.32 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 9.3}, "width": {"unit": "inches", "value": 6.32}, "weight": {"unit": "pounds", "value": 1.04940036712}, "height": {"unit": "inches", "value": 0.72}}, "pages": 172, "date_published": "2006-04-28", "subjects": ["Arts & Photography', 'Individual Artists', 'History & Criticism', 'Criticism', 'History'], 'authors": ["Mark Rothko'], 'title": "Writings on Art", "isbn13": "9780300114409", "msrp": 32, 'binding": "Hardcover", "isbn": "0300114400", "isbn10": "0300114400"}}