{"book": {"publisher": "Yale University Press", "synopsis": "This new look at the history of Cuba illuminates the island’s entire revolutionary past as well as the most recent decades of the Castro regime<br/><br/>Events in Fidel Castro’s island nation often command international attention and just as often inspire controversy. Impassioned debate over situations as diverse as the Cuban Missile Crisis and the Elián Gonzáles affair is characteristic not only of modern times but of centuries of Cuban history. In this concise and up-to-date book, British journalist Richard Gott casts a fresh eye on the history of the Caribbean island from its pre-Columbian origins to the present day. He provides a European perspective on a country that is perhaps too frequently seen solely from the American point of view.<br/><br/>The author emphasizes such little-known aspects of Cuba’s history as its tradition of racism and violence, its black rebellions, the survival of its Indian peoples, and the lasting influence of Spain. The book also offers an original look at aspects of the Revolution, including Castro’s relationship with the Soviet Union, military exploits in Africa, and his attempts to promote revolution in Latin America and among American blacks. In a concluding section, Gott tells the extraordinary story of the Revolution’s survival in the post-Soviet years.", "language": "en", "image": "https://images.isbndb.com/covers/11/49/9780300111149.jpg", "title_long": "Cuba: A New History", "edition": "First Thus, First printing", "dimensions": "Height: 7.84 Inches, Length: 5.04 Inches, Weight: 0.89948602896 Pounds, Width: 1.08 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.04}, "width": {"unit": "inches", "value": 1.08}, "weight": {"unit": "pounds", "value": 0.89948602896}, "height": {"unit": "inches", "value": 7.84}}, "pages": 400, "date_published": "2005-11-01", "subjects": ["History', 'Americas', 'Caribbean & West Indies', 'Politics & Social Sciences', 'Politics & Government', 'International & World Politics'], 'authors": ["Richard Gott'], 'title": "Cuba: A New History", "isbn13": "9780300111149", "msrp": 20, 'binding": "Paperback", "isbn": "0300111142", "isbn10": "0300111142"}}