{"book": {"publisher": "Yale University Press", "synopsis": "Essayist Stephen Miller pursues a lifelong interest in conversation by taking an historical and philosophical view of the subject. He chronicles the art of conversation in Western civilization from its beginnings in ancient Greece to its apex in eighteenth-century Britain to its current endangered state in America. As Harry G. Frankfurt brought wide attention to the art of bullshit in his recent bestselling On Bullshit, so Miller now brings the art of conversation into the light, revealing why good conversation matters and why it is in decline.<br/>Miller explores the conversation about conversation among such great writers as Cicero, Montaigne, Swift, Defoe, Lady Mary Wortley Montagu, and Virginia Woolf. He focuses on the world of British coffeehouses and clubs in \x93The Age of Conversation” and examines how this era ended. Turning his attention to the United States, the author traces a prolonged decline in the theory and practice of conversation from Benjamin Franklin through Hemingway to Dick Cheney. He cites our technology (iPods, cell phones, and video games) and our insistence on unguarded forthrightness as well as our fear of being judgmental as powerful forces that are likely to diminish the art of conversation.", "language": "en", "image": "https://images.isbndb.com/covers/03/02/9780300110302.jpg", "title_long": "Conversation: A History of a Declining Art", "edition": "First Edition", "dimensions": "Height: 8.25 Inches, Length: 5.5 Inches, Weight: 1.14 Pounds, Width: 1.06 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 1.06}, "weight": {"unit": "pounds", "value": 1.14}, "height": {"unit": "inches", "value": 8.25}}, "pages": 336, "date_published": "2006-03-11", "subjects": ["History', 'Historical Study & Educational Resources', 'Essays', 'Reference', 'Words, Language & Grammar', 'Communication', 'Politics & Social Sciences', 'Social Sciences', 'Communication & Media Studies', 'Sociology'], 'authors": ["Stephen Miller'], 'title": "Conversation: A History of a Declining Art", "isbn13": "9780300110302", "msrp": 40, 'binding": "Hardcover", "isbn": "0300110308", "isbn10": "0300110308"}}