{"book": {"publisher": "Da Capo Press", "synopsis": "To millions, Johnny Cash was the rebellious Man in Black, the unabashed patriot, the redeemed Christian-the king of country music. But Johnny Cash was also an uncertain country boy whose dreams were born in the cotton fields of Arkansas and who struggled his entire life with a guilt-ridden childhood, addictions, and self-doubt. A sensitive songwriter with profound powers of musical expression, Cash told America and the world the stories of a nation"s heroes and outcasts.Johnny Cash: The Biography explores in depth many often-overlooked aspects of the legend"s life and career. It examines the powerful artistic influence of his older brother, Roy, and chronicles Cash"s air force career in the early 1950s, when his songwriting took form...and when he purchased his first guitar. It uncovers the origins of his trademark boom-chicka-boom rhythm and traces his courtship of Bob Dylan in the folk revival era of the 1960s.Johnny Cash also delves into the details of Cash's personal life, including his drug dependency, which dogged him long after many thought he had beaten it. It unflinchingly recounts his relationships with his first wife, Vivian Liberto, his second wife, June Carter Cash, and his children. And it follows Cash as man and musician from his early years of success through the commercially desolate years of the 1980s to his reemergence under the influence of producer Rick Rubin-and association that revitalized his career yet raised contradictions about Cash's values and craft.Scrupulously researched, passionately told, Johnny Cash: The Biography is the unforgettable portrait of an enduring American icon.', 'language": "en", "image": "https://images.isbndb.com/covers/36/89/9780306813689.jpg", "title_long": "Johnny Cash: The Biography", "edition": "First De Capo Press Edition", "dimensions": "Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.25 Pounds, Width: 1.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.25}, "width": {"unit": "inches", "value": 1.5}, "weight": {"unit": "pounds", "value": 1.25}, "height": {"unit": "inches", "value": 9.25}}, "pages": 368, "date_published": "2006-09-04", "subjects": ["Arts & Photography', 'Music', 'Musical Genres', 'Biographies & Memoirs', 'Arts & Literature', 'Composers & Musicians'], 'authors": ["Michael Streissguth'], 'title": "Johnny Cash: The Biography", "isbn13": "9780306813689", "msrp": 26, 'binding": "Hardcover", "isbn": "0306813688", "isbn10": "0306813688"}}