{"book": {"publisher": "Da Capo Press", "synopsis": "In the year 216 B.C., Hannibal of Carthage, faced with an opposing Roman army twice the size of his own, outwitted the enemy at Cannae by means of a strategy which has become a classic of its kind. As a result of his famous "double pincer" maneuver, 70,000 Roman soldiers died within the space of a few hours on a field the size of New York\"s Central Park. Yet, as devastating and startling as Cannae was, it was only one of a long list of incredible achievements. Hannibal\'s fantastic 1,000-mile march across the Alps from Spain to Italy was one of the wonders of ancient times. He began his hazardous journey with 90,000 infantry, 12,000 cavalry, and 37 elephants. By the time he reached the Valley of the Po, more than 30,000 troops and many of his elephants had perished, but he still managed to stay in Italy for sixteen years.Blending biography and military adventure, Hannibal is a portrait of a military genius who was also a highly civilized man. The son of Hamilcar Barca, a famous general in his own right, Hannibal was a student of the Greek classics. But his father\'s lifelong grudge against Rome fostered in the son a deep hatred for that Republic and a fierce determination to subdue it forever. This resulted in the bloody battles of Lake Trasimene, Campania, Nole, Capua, and Zama, all of which Leonard Cottrell describes with vigor and authority. In gathering material for Hannibal, Cottrell traveled the entire route that Hannibal took across the Alps, thus bringing to his account a valuable firsthand knowledge of his subject. With the drama and authenticity for which he is famous, Leonard Cottrell describes Hannibal\'s amazing campaign-a saga of victory after victory which fell just short of its ultimate goal: the annihilation of Rome.', 'language": "en", "image": "https://images.isbndb.com/covers/49/84/9780306804984.jpg", "title_long": "Hannibal: Enemy Of Rome", "edition": "New", "dimensions": "Height: 8 Inches, Length: 5 Inches, Weight: 0.64815905028 Pounds, Width: 0.72 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 0.72}, "weight": {"unit": "pounds", "value": 0.64815905028}, "height": {"unit": "inches", "value": 8}}, "pages": 288, "date_published": "1992-08-22", "subjects": ["Biographies & Memoirs', 'Historical', 'Africa', 'Europe', 'Middle East', 'Leaders & Notable People', 'Military', 'History', 'North Africa', 'Ancient Civilizations', 'Rome', 'World'], 'authors": ["Leonard Cottrell'], 'title": "Hannibal: Enemy Of Rome", "isbn13": "9780306804984", "msrp": 16.99, 'binding": "Paperback", "isbn": "0306804980", "isbn10": "0306804980"}}