{"book": {"publisher": "Knopf", "synopsis": "A short, sleek novel of encounters set in Tokyo during the witching hours between midnight and dawn, and every bit as gripping as Haruki Murakami’s masterworks The Wind-Up Bird Chronicle and Kafka on the Shore.<br/><br/>At its center are two sisters—Eri, a fashion model slumbering her way into oblivion, and Mari, a young student soon led from solitary reading at an anonymous Denny’s toward people whose lives are radically alien to her own: a jazz trombonist who claims they’ve met before, a burly female “love hotel” manager and her maid staff, and a Chinese prostitute savagely brutalized by a businessman. These “night people” are haunted by secrets and needs that draw them together more powerfully than the differing circumstances that might keep them apart, and it soon becomes clear that Eri’s slumber—mysteriously tied to the businessman plagued by the mark of his crime—will either restore or annihilate her.<br/><br/>After Dark moves from mesmerizing drama to metaphysical speculation, interweaving time and space as well as memory and perspective into a seamless exploration of human agency—the interplay between self-expression and empathy, between the power of observation and the scope of compassion and love. Murakami’s trademark humor, psychological insight, and grasp of spirit and morality are here distilled with an extraordinary, harmonious mastery.", "language": "en", "image": "https://images.isbndb.com/covers/58/38/9780307265838.jpg", "title_long": "After Dark", "edition": "F First American Edition", "dimensions": "Height: 9.19 Inches, Length: 5.85 Inches, Weight: 0.865 Pounds, Width: 0.85 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.85}, "width": {"unit": "inches", "value": 0.85}, "weight": {"unit": "pounds", "value": 0.865}, "height": {"unit": "inches", "value": 9.19}}, "pages": 208, "date_published": "2007-05-08", "subjects": ["Literature & Fiction', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Haruki Murakami'], 'title": "After Dark", "isbn13": "9780307265838", "msrp": 22.95, "binding": "Hardcover", "related": {"Kindle Edition": "0307267016", "ePub": "0307267016"}, "isbn": "0307265838", "isbn10": "0307265838", "other_isbns": [{'isbn": "9780307267016", "binding": "printisbn"}]}}