{"book": {"publisher": "Crown", "synopsis": "#1 NEW YORK TIMES BESTSELLER • Barack Obama’s lucid vision of America’s place in the world and call for a new kind of politics that builds upon our shared understandings as Americans, based on his years in the Senate<br/><br/>“In our lowdown, dispiriting era, Obama’s talent for proposing humane, sensible solutions with uplifting, elegant prose does fill one with hope.”—Michael Kazin, The Washington Post<br/><br/>In July 2004, four years before his presidency, Barack Obama electrified the Democratic National Convention with an address that spoke to Americans across the political spectrum. One phrase in particular anchored itself in listeners’ minds, a reminder that for all the discord and struggle to be found in our history as a nation, we have always been guided by a dogged optimism in the future, or what Obama called “the audacity of hope.”<br/><br/>The Audacity of Hope is Barack Obama’s call for a different brand of politics—a politics for those weary of bitter partisanship and alienated by the “endless clash of armies” we see in congress and on the campaign trail; a politics rooted in the faith, inclusiveness, and nobility of spirit at the heart of “our improbable experiment in democracy.” He explores those forces—from the fear of losing to the perpetual need to raise money to the power of the media—that can stifle even the best-intentioned politician. He also writes, with surprising intimacy and self-deprecating humor, about settling in as a senator, seeking to balance the demands of public service and family life, and his own deepening religious commitment.<br/><br/>At the heart of this book is Barack Obama’s vision of how we can move beyond our divisions to tackle concrete problems. He examines the growing economic insecurity of American families, the racial and religious tensions within the body politic, and the transnational threats—from terrorism to pandemic—that gather beyond our shores. And he grapples with the role that faith plays in a democracy—where it is vital and where it must never intrude. Underlying his stories is a vigorous search for connection: the foundation for a radically hopeful political consensus.<br/><br/>Only by returning to the principles that gave birth to our Constitution, Obama says, can Americans repair a political process that is broken, and restore to working order a government that has fallen dangerously out of touch with millions of ordinary Americans. Those Americans are out there, he writes—“waiting for Republicans and Democrats to catch up with them.”", "language": "en", "image": "https://images.isbndb.com/covers/76/99/9780307237699.jpg", "title_long": "The Audacity of Hope: Thoughts on Reclaiming the American Dream", "edition": "1st", "dimensions": "Height: 1.44 Inches, Length: 9.52 inches, Weight: 1.6 Pounds, Width: 6.52 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 9.52}, "width": {"unit": "inches", "value": 6.52}, "weight": {"unit": "pounds", "value": 1.6}, "height": {"unit": "inches", "value": 1.44}}, "pages": 375, "date_published": "2006-10-17", "subjects": ["Biographies & Memoirs', 'Community & Culture', 'Black & African American', 'Leaders & Notable People', 'Military', 'Presidents & Heads of State', 'Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies', 'Politics & Government', 'Ideologies & Doctrines', 'United States', 'Specific Topics', 'Self Service', 'Custom Stores'], 'authors": ["Barack Obama'], 'title": "The Audacity of Hope: Thoughts on Reclaiming the American Dream", "isbn13": "9780307237699", "msrp": 27, "binding": "Hardcover", "related": {"Kindle Edition": "0307382095", "ePub": "0307382095"}, "isbn": "0307237699", "isbn10": "0307237699", "other_isbns": [{'isbn": "9780307382092", "binding": "printisbn"}]}}