{"book": {"publisher": "Knopf", "synopsis": "From one of the most gifted American writers of the twentieth century—and the author of the acclaimed Rabbit series: “A chilling tale that is perhaps the most essential novel to emerge from September 11” (People) about an eighteen-year-old devoted to Allah, who’s convinced he’s discovered God’s purpose for him.<br/><br/>“The most satisfactory elements in Terrorist are those that remind us that no amount of special pleading can set us free of history, no matter how oblivious and unresponsive to it we may be.” —The New York Times Book Review<br/><br/>The terrorist of John Updike’s title is eighteen-year-old Ahmad Ashmawy Mulloy, the son of an Irish American mother and an Egyptian father who disappeared when he was three. Devoted to Allah and to the Qur’an as expounded by the imam of his neighborhood mosque, Ahmad feels his faith threatened by the materialistic, hedonistic society he sees around him in the slumping New Jersey factory town of New Prospect. Neither Jack Levy, his life-weary guidance counselor at Central High, nor Joryleen Grant, his seductive black classmate, succeeds in diverting Ahmad from what the Qur’an calls the Straight Path. Now driving a truck for a local Lebanese furniture store—a job arranged through his imam—Ahmad thinks he has discovered God’s purpose for him. But to quote the Qur’an: Of those who plot, God is the best.", "language": "en", "image": "https://images.isbndb.com/covers/46/57/9780307264657.jpg", "title_long": "Terrorist: A novel", "edition": "First Edition", "dimensions": "Height: 1.15 Inches, Length: 8.56 Inches, Weight: 1.18 Pounds, Width: 6.1 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 8.56}, "width": {"unit": "inches", "value": 6.1}, "weight": {"unit": "pounds", "value": 1.18}, "height": {"unit": "inches", "value": 1.15}}, "pages": 310, "date_published": "2006-06-06", "subjects": ["Literature & Fiction', 'United States', 'Contemporary', 'Literary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Spies & Politics', 'Crime', 'Religion & Spirituality', 'Mystery', 'Self Service', 'Custom Stores'], 'authors": ["John Updike'], 'title": "Terrorist: A novel", "isbn13": "9780307264657", "msrp": 1.99, 'binding": "Hardcover", "isbn": "0307264653", "isbn10": "0307264653"}}