{"book": {"publisher": "Alfred A. Knopf", "synopsis": "WINNER OF THE PULITZER PRIZE • NATIONAL BESTSELLER • A searing, post-apocalyptic novel about a father and son\"s fight to survive, this "tale of survival and the miracle of goodness only adds to McCarthy\"s stature as a living master. It\'s gripping, frightening and, ultimately, beautiful' (San Francisco Chronicle). • From the bestselling author of The Passenger<br/><br/>A father and his son walk alone through burned America. Nothing moves in the ravaged landscape save the ash on the wind. It is cold enough to crack stones, and when the snow falls it is gray. The sky is dark. Their destination is the coast, although they don\'t know what, if anything, awaits them there. They have nothing; just a pistol to defend themselves against the lawless bands that stalk the road, the clothes they are wearing, a cart of scavenged food—and each other.<br/><br/>The Roadis the profoundly moving story of a journey. It boldly imagines a future in which no hope remains, but in which the father and his son, 'each the other\'s world entire,' are sustained by love. Awesome in the totality of its vision, it is an unflinching meditation on the worst and the best that we are capable of: ultimate destructiveness, desperate tenacity, and the tenderness that keeps two people alive in the face of total devastation.<br/><br/>Look for Cormac McCarthy\'s latest bestselling novels, The Passenger and Stella Maris.', 'language": "en", "image": "https://images.isbndb.com/covers/54/32/9780307265432.jpg", "title_long": "The Road", "edition": "First Edition", "dimensions": "Height: 1.16 Inches, Length: 9.56 Inches, Weight: 1.1 Pounds, Width: 6.02 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 9.56}, "width": {"unit": "inches", "value": 6.02}, "weight": {"unit": "pounds", "value": 1.1}, "height": {"unit": "inches", "value": 1.16}}, "pages": 241, "date_published": "2006-09-26", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Family Saga', 'Coming of Age', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Cormac McCarthy'], 'title": "The Road", "isbn13": "9780307265432", "msrp": 29.95, "binding": "Hardcover", "related": {"Kindle Edition": "0307267458", "ePub": "0307267458"}, "isbn": "0307265439", "isbn10": "0307265439", "other_isbns": [{'isbn": "9780307267450", "binding": "printisbn"}]}}