{"book": {"publisher": "Crown", "synopsis": "#1 NEW YORK TIMES BESTSELLER • ONE OF ESSENCE’S 50 MOST IMPACTFUL BLACK BOOKS OF THE PAST 50 YEARS<br/><br/>In this iconic memoir of his early days, Barack Obama “guides us straight to the intersection of the most serious questions of identity, class, and race” (The Washington Post Book World).<br/><br/>“Quite extraordinary.”—Toni Morrison<br/><br/>In this lyrical, unsentimental, and compelling memoir, the son of a black African father and a white American mother searches for a workable meaning to his life as a black American. It begins in New York, where Barack Obama learns that his father—a figure he knows more as a myth than as a man—has been killed in a car accident. This sudden death inspires an emotional odyssey—first to a small town in Kansas, from which he retraces the migration of his mother’s family to Hawaii, and then to Kenya, where he meets the African side of his family, confronts the bitter truth of his father’s life, and at last reconciles his divided inheritance.<br/><br/>Praise for Dreams from My Father<br/><br/>“Beautifully crafted . . . moving and candid . . . This book belongs on the shelf beside works like James McBride’s The Color of Water and Gregory Howard Williams’s Life on the Color Line as a tale of living astride America’s racial categories.”—Scott Turow<br/><br/>“Provocative . . . Persuasively describes the phenomenon of belonging to two different worlds, and thus belonging to neither.”—The New York Times Book Review<br/><br/>“Obama’s writing is incisive yet forgiving. This is a book worth savoring.”—Alex Kotlowitz, author of There Are No Children Here<br/><br/>“One of the most powerful books of self-discovery I’ve ever read, all the more so for its illuminating insights into the problems not only of race, class, and color, but of culture and ethnicity. It is also beautifully written, skillfully layered, and paced like a good novel.”—Charlayne Hunter-Gault, author of In My Place<br/><br/>“Dreams from My Father is an exquisite, sensitive study of this wonderful young author’s journey into adulthood, his search for community and his place in it, his quest for an understanding of his roots, and his discovery of the poetry of human life. Perceptive and wise, this book will tell you something about yourself whether you are black or white.”—Marian Wright Edelman", "language": "en", "image": "https://images.isbndb.com/covers/34/19/9780307383419.jpg", "title_long": "Dreams from My Father: A Story of Race and Inheritance", "edition": "Reprint", "dimensions": "Height: 1.5 inches, Length: 9.3 inches, Weight: 1.58 Pounds, Width: 6.3 inches", "dimensions_structured": {'length": {"unit": "inches", "value": 9.3}, "width": {"unit": "inches", "value": 6.3}, "weight": {"unit": "pounds", "value": 1.58}, "height": {"unit": "inches", "value": 1.5}}, "pages": 442, "date_published": "2007-01-09", "subjects": ["Biographies & Memoirs', 'Community & Culture', 'Black & African American', 'Leaders & Notable People', 'Military', 'Political', 'Presidents & Heads of State', 'Memoirs', 'Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies', 'Sociology', 'Race Relations', 'Self Service', 'Custom Stores'], 'authors": ["Barack Obama'], 'title": "Dreams from My Father: A Story of Race and Inheritance", "isbn13": "9780307383419", "msrp": 30, "binding": "Hardcover", "related": {"Kindle Edition": "0307394123", "ePub": "0307394123"}, "isbn": "0307383415", "isbn10": "0307383415", "other_isbns": [{'isbn": "9780307394125", "binding": "printisbn"}]}}