{"book": {"publisher": "Knopf", "synopsis": "In each of her previous ten critically acclaimed and hugely popular novels, Minette Walters has explored the dark terrain of the human psyche to give us thrillers of exceptional psychological complexity and suspense. Now, in The Devil’s Feather, she gives us her most unexpected and electrifying novel yet.<br/><br/>In 2002, five women are discovered barbarously murdered in Sierra Leone. Reuters Africa correspondent Connie Burns suspects a British mercenary: a man who seems to turn up in every war-torn corner of Africa, whose reputation for violence and brutality is well-founded and widely known. Connie’s suspicions that he’s using the chaos of war to act out sadistic, misogynistic fantasies fall on deaf ears—but she’s determined to expose him and his secret.<br/><br/>The consequences are devastating.<br/><br/>Connie encounters the man again in Baghdad, but almost immediately she’s taken hostage. Released after three desperate days, terrified and traumatized by the experience—fearing that she will never again be the person she once was—Connie retreats to England. She is bent on protecting herself by withholding information about her abduction. But secluded in a remote rented house—where the jealously guarded history of her landlady’s family seems to mirror her own fears—she knows that it is only a matter of time before her nightmares become real . . . .<br/><br/>With its sinuous plot, its acutely drawn characters, and its blistering suspense, The Devil’s Feather keeps us riveted from first to last. It is a dazzling reminder of why Publishers Weekly has dubbed Minette Walters “Agatha Christie with the gloves off.”", "language": "en", "image": "https://images.isbndb.com/covers/46/26/9780307264626.jpg", "title_long": "The Devil"s Feather", "edition": "1", "dimensions": "Height: 9.4 Inches, Length: 6.4 Inches, Weight: 1.65 Pounds, Width: 1.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.4}, "width": {"unit": "inches", "value": 1.5}, "weight": {"unit": "pounds", "value": 1.65}, "height": {"unit": "inches", "value": 9.4}}, "pages": 368, "date_published": "2006-08-22", "subjects": ["Literature & Fiction', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense'], 'authors": ["Minette Walters'], 'title": "The Devil"s Feather", 'isbn13": "9780307264626", "msrp": 24, "binding": "Hardcover", "related": {"ePub": "0307266052"}, "isbn": "0307264629", "isbn10": "0307264629", "other_isbns": [{'isbn": "9780307266057", "binding": "printisbn"}]}}