{"book": {"publisher": "Knopf", "synopsis": "The author of The Untouchable (“contemporary fiction gets no better than this”—Patrick McGrath, The New York Times Book Review) now gives us a luminous novel about love, loss, and the unpredictable power of memory.<br/><br/>The narrator is Max Morden, a middle-aged Irishman who, soon after his wife’s death, has gone back to the seaside town where he spent his summer holidays as a child—a retreat from the grief, anger, and numbness of his life without her. But it is also a return to the place where he met the Graces, the well-heeled vacationing family with whom he experienced the strange suddenness of both love and death for the first time. The seductive mother; the imperious father; the twins—Chloe, fiery and forthright, and Myles, silent and expressionless—in whose mysterious connection Max became profoundly entangled, each of them a part of the “barely bearable raw immediacy” of his childhood memories.<br/><br/>Interwoven with this story are Morden’s memories of his wife, Anna—of their life together, of her death—and the moments, both significant and mundane, that make up his life now: his relationship with his grown daughter, Claire, desperate to pull him from his grief; and with the other boarders at the house where he is staying, where the past beats inside him “like a second heart.”<br/><br/>What Max comes to understand about the past, and about its indelible effects on him, is at the center of this elegiac, vividly dramatic, beautifully written novel—among the finest we have had from this extraordinary writer.", "language": "en", "image": "https://images.isbndb.com/covers/31/17/9780307263117.jpg", "title_long": "The Sea (Man Booker Prize)", "dimensions": "Height: 8.25 Inches, Length: 5.75 Inches, Weight: 0.8 Pounds, Width: 1 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.75}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 0.8}, "height": {"unit": "inches", "value": 8.25}}, "pages": 208, "date_published": "2005-11-01", "subjects": ["Literature & Fiction', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["John Banville'], 'title": "The Sea (Man Booker Prize)", "isbn13": "9780307263117", "msrp": 25.95, "binding": "Hardcover", "related": {"Kindle Edition": "030742930X", "ePub": "030742930X"}, "isbn": "0307263118", "isbn10": "0307263118", "other_isbns": [{'isbn": "9780307429308", "binding": "printisbn"}]}}