{"book": {"publisher": "Clarkson Potter", "synopsis": "Whether he’s setting the scene at his acclaimed restaurant Table 8 in Los Angeles, entertaining the audience on Food Network’s Iron Chef America, or designing the menus for Hollywood hot-spots RokBar and L’Scorpion, chef Govind Armstrong knows how to create spectacular menus for occasions of all sizes. As Govind says, small plates encourage people to be more adventurous, to share food, and to enjoy the mélange of flavors and textures. In his first cookbook, Small Bites, Big Nights, he shows you how to put together a menu of small, sophisticated, sexy dishes and pair them with the perfect cocktail. The result? Guests get to enjoy a feast of flavors, and as the host, you’ll be able to relax and have fun, instead of spending the whole night in the kitchen.<br/><br/>Wow a crowd with hors d’oeuvres like Arugula, Dates, and Parmesan (a salad that’s finger food; Rare Tuna Crostini with White Bean Puree and Tapenade; or Seared Kobe Beef on Mini Yorkshire Pudding. To drink: Black Martinis. Barbecue sizzling treats like Grilled Endive with Serrano Ham; New Zealand Scampi with Heirloom Tomatoes and Summer Truffle Vinaigrette; or Grilled Chicken Thighs with Wood-Roasted Gazpacho and Avocado Salsa.<br/><br/>Make dinner for 8 unforgettable with Tender Bean Salad and Prosciutto; a deceptively simple Foie Gras–Stuffed Quail; and luscious Panna Cotta with Raspberry Coulis.<br/><br/>Warm up a cool night with bite-size comfort foods: Mini Onion Soup; Braised Chicken Oysters Piccata; and Carrot Cake with Cream Cheese Mousse.", "language": "en", "image": "https://images.isbndb.com/covers/79/31/9780307337931.jpg", "title_long": "Small Bites, Big Nights: Seductive Little Plates for Intimate Occasions and Lavish Parties", "edition": "First Edition", "dimensions": "Height: 10.25 Inches, Length: 7.75 Inches, Weight: 2.4 Pounds, Width: 0.8 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 7.75}, "width": {"unit": "inches", "value": 0.8}, "weight": {"unit": "pounds", "value": 2.4}, "height": {"unit": "inches", "value": 10.25}}, "pages": 256, "date_published": "2007-04-10", "subjects": ["Cookbooks, Food & Wine', 'Cooking Methods', 'Gourmet', 'Main Courses & Side Dishes', 'Appetizers', 'Entertaining & Holidays'], 'authors": ["Govind Armstrong'], 'title": "Small Bites, Big Nights: Seductive Little Plates for Intimate Occasions and Lavish Parties", "isbn13": "9780307337931", "msrp": 30, 'binding": "Hardcover", "isbn": "0307337936", "isbn10": "0307337936"}}