{"book": {"publisher": "Knopf", "synopsis": "Maeve Binchy once again brings us an enchanting book full of the wit, warmth, and wisdom that have made her one of the most beloved and widely read writers at work today.<br/><br/>When a new highway threatens to bypass the town of Rossmore and cut through Whitethorn Woods, everyone has a passionate opinion about whether the town will benefit or suffer. But young Father Flynn is most concerned with the fate of St. Ann’s Well, which is set at the edge of the woods and slated for destruction. People have been coming to St. Ann’s for generations to share their dreams and fears, and speak their prayers. Some believe it to be a place of true spiritual power, demanding protection; others think it’s a mere magnet for superstitions, easily sacrificed. Not knowing which faction to favor, Father Flynn listens to all those caught up in the conflict, and these are the voices we hear in the stories of Whitethorn Woods—men and women deciding between the traditions of the past and the promises of the future, ordinary people brought vividly to life by Binchy’s generosity and empathy, and in the vivacity and surprise of her storytelling.<br/><br/>Maeve Binchy is at the very top of her form in this irresistible tale.", "language": "en", "image": "https://images.isbndb.com/covers/57/84/9780307265784.jpg", "title_long": "Whitethorn Woods", "edition": "First Edition", "dimensions": "Height: 9.6 Inches, Length: 6.5 Inches, Weight: 1.3988 Pounds, Width: 1.5 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.5}, "width": {"unit": "inches", "value": 1.5}, "weight": {"unit": "pounds", "value": 1.3988}, "height": {"unit": "inches", "value": 9.6}}, "pages": 352, "date_published": "2007-03-06", "subjects": ["Literature & Fiction', 'Women's Fiction', 'Contemporary'], 'authors": ["Maeve Binchy'], 'title": "Whitethorn Woods", "isbn13": "9780307265784", "msrp": 25.95, "binding": "Hardcover", "related": {"ePub": "030726744X"}, "isbn": "0307265781", "isbn10": "0307265781", "other_isbns": [{'isbn": "9780307267443", "binding": "printisbn"}]}}