{"book": {"publisher": "Random House Mondadori", "synopsis": "Clare y Henry son en apariencia una pareja normal que lleva una vida corriente en Chicago. Él es bibliotecario y ella artista, pero la terrible verdad es que Henry sufre una extraña enfermedad que lo hace viajar en el tiempo, al pasado o al futuro sin previo aviso, normalmente fruto de una situación de estrés previa. Lo transporta desnudo, con desagradables malestares y vulnerable.<br/>Cuando Henry tiene 31 años y Clare 23 se encuentran por primera vez. Y allí nace en tiempo presente su historia de amor, su vida en común de la que ocasionalmente Henry se ausenta propulsado a otras épocas de su vida y revisitando otros momentos felices o tristes, a veces encontrándose a sí mismo cuando era niño, con el temor de Clare de que no regrese de uno de esos viajes.<br/>La historia se va desplegando contada a dos voces, bajo los puntos de vista de Clare y Henry, y enfoca las consecuencias de esta particularidad en su matrimonio y el amor apasionado que se tienen. Clare y Henry intentar llevar vidas normales, buscar una cura médica para la disfunción de Henry, ponerse objetivos a futuro, disfrutar de sus amigos y familia; aunque a veces se presenta la tentación de utilizar su capacidad de conocer el futuro para manejar el presente o evitar algún peligro... Pero todo ello está amenazado por algo que no pueden controlar ni prevenir: Henry puede viajar un día al futuro y descubrir que él ya no forma parte de ese tiempo, descubrir su propia muerte o la de sus seres queridos, ver a una Clare sola y envejecida, conocer a una hija que todavía no ha tenido y que heredará su extraña disfunción.", "language": "es", "image": "https://images.isbndb.com/covers/48/30/9780307344830.jpg", "title_long": "La mujer del viajero en el tiempo (Spanish Edition)", "dimensions": "Height: 9.08 Inches, Length: 5.99 Inches, Weight: 1.65 Pounds, Width: 1.6 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.99}, "width": {"unit": "inches", "value": 1.6}, "weight": {"unit": "pounds", "value": 1.65}, "height": {"unit": "inches", "value": 9.08}}, "pages": 608, "date_published": "2005-12-06", "subjects": ["Literature & Fiction', 'World Literature', 'European'], 'authors": ['Audrey Niffenegger'], 'title": "La mujer del viajero en el tiempo (Spanish Edition)", "isbn13": "9780307344830", "msrp": "0.00", "binding": "Paperback", "isbn": "0307344835", "isbn10": "0307344835"}}