{"book": {"publisher": "Knopf", "synopsis": "Honey Santana—impassioned, willful, possibly bipolar, self-proclaimed “queen of lost causes”—has a scheme to help rid the world of irresponsibility, indifference, and dinnertime sales calls. She’s taking rude, gullible Relentless, Inc., telemarketer Boyd Shreave and his less-than-enthusiastic mistress, Eugenie—the fifteen-minute-famous girlfriend of a tabloid murderer—into the wilderness of Florida’s Ten Thousand Islands for a gentle lesson in civility. What she doesn’t know is that she’s being followed by her Honey-obsessed former employer, Piejack (whose mismatched fingers are proof that sexual harassment in the workplace is a bad idea). And he doesn’t know he’s being followed by Honey’s still-smitten former drug-running ex-husband, Perry, and their wise-and-protective-way-beyond-his-years twelve-year-old-son, Fry. And when they all pull up on Dismal Key, they don’t know they’re intruding on Sammy Tigertail, a half white–half Seminole failed alligator wrestler, trying like hell to be a hermit despite the Florida State coed who’s dying to be his hostage . . .<br/><br/>Will Honey be able to make a mensch of a “greedhead”? Will Fry be able to protect her from Piejack—and herself? Will Sammy achieve his true Seminole self? Will Eugenie ever get to the beach? Will the Everglades survive the wild humans? All the answers are revealed in the delectably outrageous mayhem that propels this novel to its Hiaasen-of-the-highest-order climax.", "language": "en", "image": "https://images.isbndb.com/covers/29/98/9780307262998.jpg", "title_long": "Nature Girl", "edition": "First Edition", "dimensions": "Height: 9.75 Inches, Length: 6.75 Inches, Weight: 1.45 Pounds, Width: 1.5 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.75}, "width": {"unit": "inches", "value": 1.5}, "weight": {"unit": "pounds", "value": 1.45}, "height": {"unit": "inches", "value": 9.75}}, "pages": 320, "date_published": "2006-11-14", "subjects": ["Literature & Fiction', 'Contemporary', 'Mystery, Thriller & Suspense', 'Mystery'], 'authors": ["Carl Hiaasen'], 'title": "Nature Girl", "isbn13": "9780307262998", "msrp": 25.95, "binding": "Hardcover", "related": {"Kindle Edition": "0307266591", "ePub": "0307266591"}, "isbn": "0307262995", "isbn10": "0307262995", "other_isbns": [{'isbn": "9780307266590", "binding": "printisbn"}]}}