{"book": {"publisher": "Zondervan", "synopsis": "The World"s Best-Selling Study Bible Now Raises the Standard Even Higher That"s because its celebrated study notes have been thoroughly revised. Turn to any page and discover the difference: over 20,000 of the Zondervan NIV Study Bible"s Gold Medallion Award-winning study notes---now meticulously updated and expanded to reflect the most current conservative Bible scholarship. Unmatched in any other study Bible, these notes place at your fingertips a treasury of instant commentary from today's top evangelical scholars. Icons highlight notes of special interest in the areas of character study, archaeology, and personal application. Simply put, you won't find study notes as complete, up-to-date, helpful, and easy to use anywhere else. And the benefits build from there. Like no other Bible, the Zondervan NIV Study Bible places an entire resource library for Bible study in your hands. Over 6 million people have made it their study Bible of choice. Make it yours as well. It's one choice you'll always be glad you made. SPECIAL FEATURES NIV text remains unchanged - the most read, most trusted English-language translation. Over 20,000 study notes. NIV translators thoroughly revised and expanded the award-winning study notes and added over 800 new notes. Icons make important information easy to spot. 900 Character Profile icons. 425 Archaeology icons. Almost 3,000 Personal Application icons. Introductions and outlines provide valuable background information for each book of the Bible. In-text maps, charts, diagrams, and illustrations right where you want them---five of which are completely new. 16 pages of full-color maps plus timelines and presentation page. Words of Christ in red letter. NIV concordance plus subject and study notes indexes. Clearer. Stronger. Better. Referred to daily by millions of pastors, students, church leaders, and other Bible readers around the world, the renowned Zondervan NIV Study Bible notes are the crown jewel of the world's best-selling study Bible. These over-20,000 notes are the handiwork of the same translation team that produced this Bible's text, the New International Version. The same exacting, conservative scholarship that brought you today's most read, most trusted Bible translation went into creating the most celebrated, widely used Bible study notes in existence. Why improve on what's already outstanding? Because now it can be made even better. In the years since the 1985 publication of the first Zondervan NIV Study Bible edition, ongoing discoveries in archaeology, linguistics, biblical history, and other disciplines have suggested the need to revise the notes. Drawing on the most current scholarship, the world-class team who first created the study notes now present comprehensive revisions and additions that bring the notes thoroughly up to date. With all the changes to the study notes, however, one thing has remained unchanged---the time-tested, trusted text of the NIV itself. You'll be pleased with the results. If you found the original notes indispensable in clarifying obscure Bible passages and shedding light on the meaning and significance of Scripture, you'll love how these revised and expanded notes add even greater depth to your study of God's Word. The New International Version (NIV) is today's most read and most trusted English Bible translation. The goal of the NIV translation team was to produce an accurate translation and one that would have clarity and literary quality and so prove suitable for public and private reading, teaching, preaching, memorizing, and liturgical use. Today the NIV is accepted by more denominations than any other translation and is supported by a library of reference resources that is unmatched by any other translation. Over the last five years, the editors of the NIV study Bible have painstakingly reviewed, revised, and rewritten the notes of the classic, best-selling NIV Study Bible. Over 80 percent of the no', 'language": "en", "image": "https://images.isbndb.com/covers/95/50/9780310929550.jpg", "title_long": "Zondervan NIV Study Bible", "edition": "Revised", "dimensions": "Height: 9.75 Inches, Length: 6.75 Inches, Weight: 3.35 Pounds, Width: 1.75 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.75}, "width": {"unit": "inches", "value": 1.75}, "weight": {"unit": "pounds", "value": 3.35}, "height": {"unit": "inches", "value": 9.75}}, "pages": 2240, "date_published": "2002-10-01", "subjects": ["Christian Books & Bibles', 'Bibles', 'Bible Study & Reference', 'Bible Study', 'Religion & Spirituality'], 'authors": ["Zondervan'], 'title": "Zondervan NIV Study Bible", "isbn13": "9780310929550", "msrp": 39.99, 'binding": "Hardcover", "isbn": "0310929555", "isbn10": "0310929555"}}