{"book": {"publisher": "Zondervan", "synopsis": "A Is for Abductive B is for Body C is for Carpe Manana D is for Double-Ring E is for EPICtivities F is for Fractals G is for Grace H is for Holarchy I is for Icon J is for the J-Factor K is for Kaleidoscopic Change L is for Loopy M is for Metanarrative N is for Neurological Pre-Rewirings O is for Open-Endedness P is for Prayer Q is for Quest-ions R is for Radical Orthodoxy S is for Systems Theology T is for Tribal U is for Unknown V is for Voice W is for Wonder X is for Xenophilia Y is for Yes! Z is for Zending Do You Know the Postmodern Alphabet? The letters are all the same, but the things they stand for are as different as the future is from the past. A Is for Abductive helps you get a handle today on the vocabulary of tomorrow, and on concepts indispensable for living out the old-fashioned gospel in these newfangled times. "You caused this book," writes one of the authors. "People like you were insisting on a beginner's guide to the pathway of postmodern ministry.' Here it is. There is no right or wrong place to begin---just pick a letter and start reading. You'll acquire new words for a new world that will change how you think about church, about ministry, and about what it means to follow in Jesus' footsteps---entering today's culture in order to love it, serve it, and lead it home to God.', 'language": "en", "image": "https://images.isbndb.com/covers/35/64/9780310243564.jpg", "title_long": "A Is for Abductive", "dimensions": "Height: 8.50392 Inches, Length: 5.39369 Inches, Weight: 0.7054792384 Pounds, Width: 0.86614 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.39369}, "width": {"unit": "inches", "value": 0.86614}, "weight": {"unit": "pounds", "value": 0.7054792384}, "height": {"unit": "inches", "value": 8.50392}}, "pages": 352, "date_published": "2003-01-01", "subjects": ["Christian Books & Bibles', 'Ministry & Evangelism', 'Religion & Spirituality'], 'authors": ["Leonard Sweet', 'Brian D. McLaren', 'Jerry Haselmayer'], 'title": "A Is for Abductive", "isbn13": "9780310243564", "msrp": 1.99, 'binding": "Paperback", "isbn": "0310243564", "isbn10": "0310243564"}}