{"book": {"publisher": "St. Martin"s Paperbacks", "synopsis": "Each millennium brings a new Neteru, a vampire huntress whose mission is to vanquish evil from the world. This millennium"s savior has come in the form of Damali Richards, a hip-hop diva with the heart of a warrior and an attitude to match. But a war in Hell has cost Damali both her powers and her past love, Carlos Rivera. Still, Damali can"t let her grief stand in her way. Several gruesome deaths, starting with an American research team, have come to Damali's attention in Brazil. The nature of the deaths leads Damali to believe that the killer is anything but human...<br/>Unknown to Damali, the life of Master Vampire Carlos Rivera was saved by a most unlikely group: a band of monks also dedicated to fighting the Dark Realm. In exchange, they want Carlos to help stop the inhuman murders plaguing Brazil-and they will use Damali as bait if they have to. Reunited, Damali and Carlos give in to the erotic passion they have fought for so long. Together, they are a powerful force. But Damali has made a terrifying enemy who won't rest until the beautiful Neteru is dead...', 'language": "en", "image": "https://images.isbndb.com/covers/77/20/9780312937720.jpg", "title_long": "The Hunted (Vampire Huntress Legends)", "edition": "Reprint", "dimensions": "Height: 6.68 Inches, Length: 4.2 Inches, Weight: 0.65 Pounds, Width: 1.3098399 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.2}, "width": {"unit": "inches", "value": 1.3098399}, "weight": {"unit": "pounds", "value": 0.65}, "height": {"unit": "inches", "value": 6.68}}, "pages": 592, "date_published": "2005-06-13", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Horror', 'Romance', 'Paranormal', 'Vampires', 'Science Fiction & Fantasy', 'Fantasy', 'Paranormal & Urban', 'Romantic', 'Self Service', 'Custom Stores'], 'authors": ["L. A. Banks'], 'title": "The Hunted (Vampire Huntress Legends)", "isbn13": "9780312937720", "msrp": 7.99, "binding": "Mass Market Paperback", "isbn": "0312937725", "isbn10": "0312937725", "other_isbns": [{'isbn": "9781429994460", "binding": "printisbncanonical"}]}}