{"book": {"publisher": "Tor Books", "synopsis": "Jack Vance is undoubtedly one of the most gifted and versatile authors of science fiction today. The winner of a Hugo, a Nebula, and a World Fantasy Award, Vance lays claim to a career that spans more than five decades of critical acclaim and devoted readership. Tor Books has recognized his widespread audience and for years has brought classic Jack Vance novels back into print--most recently The Demon Princes, Volume One, and omnibus containing the first three books of Vance"s beloved Demon Princes series. Tor now presents The Demon Princes, Volume Two, and omnibus containing the series" final two novels, The Face and The Book of Dreams.<br/><br/>Kirth Gersen carries in his pocket a slip of paper with a list of five names written upon it--the names of five Demon Princes. The Demon Princes are a race of beings who disguise themselves as humans and delight in power and destruction. however, to Kirth they are merely murderers who killed his family and destroyed his home planet--and who deserves to die for those misdeeds. Three have already fallen in Kirth"s hands, but there are two more names on his list, two more Princes who will live only long enough to regret their evil ways.<br/><br/>Lens Larque was just as unique as the other Demon Princes--uniquely appalling. He was personally ugly, startling vicious, and arrogant above all others. Larque's own mission was a villainy of the highest order, and his personal obsession with success kept him hidden well from attackers--almost well enough. Howard Alan Treesong poisoned his friends, tortured his colleagues, and wrote his own horrific holy book, The Book of Dreams. But, clever as he may be, a galaxy-wide guessing game will be his undoing--and Kirth Gersen's sworn vengeance will be complete.', 'language": "en", "image": "https://images.isbndb.com/covers/57/64/9780312865764.jpg", "title_long": "The Demon Princes (Volume Two): The Face, The Book of Dreams", "edition": "ORB ed.", "dimensions": "Height: 8.5 Inches, Length: 5.98 Inches, Weight: 1.25002102554 Pounds, Width: 1.22 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.98}, "width": {"unit": "inches", "value": 1.22}, "weight": {"unit": "pounds", "value": 1.25002102554}, "height": {"unit": "inches", "value": 8.5}}, "pages": 400, "date_published": "1997-08-15", "subjects": ["Science Fiction & Fantasy', 'Science Fiction', 'Adventure'], 'authors": ["Jack Vance'], 'title": "The Demon Princes (Volume Two): The Face, The Book of Dreams", "isbn13": "9780312865764", "msrp": 29.95, 'binding": "Hardcover", "isbn": "0312865767", "isbn10": "0312865767"}}