{"book": {"publisher": "St. Martin"s Press", "synopsis": "The new standard in reference from the nation"s leading newspaper:<br/>A thorough, authoritative, easy-to-use guide offering deeper coverage on a broad range of essential subjects.<br/><br/>Whether you are researching the history of the world, interested in learning more about an obscure medical procedure, exploring environmental trends, studying a great work of literature, looking for tips on how to improve your crossword puzzle skills, or just trying to gain a deeper understanding of the latest current events, this book is for you. An indispensable resource for every home, office, dorm room, and library, The New York Times Guide to Essential Knowledge includes insightful sidebars by Times writers, and covers major categories including art, astronomy, business, sports, history, medicine, philosophy, photography, biology, film, and much more!<br/><br/>Years in the making, this one volume is designed to offer more information than any other book on the most popular subjects as well as providing easy-to-access data vital for everyday living. It is the only comprehensive reference book to include authoritative, engaging in-depth essays from experts in almost every field of endeavor, with innovative cross-referencing to allow for to even greater understanding.<br/><br/>Featuring:<br/>- Biographical dictionary of nearly one thousand of the most important people of every field<br/>- Writers Guide to grammar, usage and style<br/>- The United States Constitution<br/>- The most complete sports section of any one-volume reference book<br/>- A thirty-thousand-word history of the world<br/>- Crossword dictionary<br/><br/>Contributors include:<br/>- Jane Brody on health matters<br/>- Dennis Overbye on the Big Bang<br/>- Linda Greenhouse on the Supreme Court today<br/>- Andrew Revkin on the state of the world"s environment<br/>- John Noble Wilford on the oldest human fossil<br/>- Michael Kimmelman on the origins of photography<br/>- Will Shortz on crosswords<br/>- Natalie Angier on war<br/>- Nicholas Wade on how life began', 'language": "en", "image": "https://images.isbndb.com/covers/36/78/9780312313678.jpg", "title_long": "The New York Times Guide to Essential Knowledge: A Desk Reference for the Curious Mind", "edition": "First Edition", "dimensions": "Height: 9.53 Inches, Length: 7.71 Inches, Weight: 4.2 Pounds, Width: 2.295 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.71}, "width": {"unit": "inches", "value": 2.295}, "weight": {"unit": "pounds", "value": 4.2}, "height": {"unit": "inches", "value": 9.53}}, "pages": 1104, "date_published": "2004-11-05", "subjects": ["Reference'], 'authors": ["John Leonard'], 'title": "The New York Times Guide to Essential Knowledge: A Desk Reference for the Curious Mind", "isbn13": "9780312313678", "msrp": 31.95, 'binding": "Hardcover", "isbn": "0312313675", "isbn10": "0312313675"}}