{"book": {"publisher": "St. Martin"s Press", "synopsis": "Edgar award nominee James N. Frey, author of the internationally best-selling books on the craft of writing, How to Write a Damn Good Novel, How to Write a Damn Good Novel II: Advanced Techniques, and The Key: How to Write Damn Good Fiction Using the Power of Myth, has now written what is certain to become the standard "how to" book for mystery writing, How to Write a Damn Good Mystery.<br/><br/>Frey urges writers to aim high-not to try to write a good-enough-to-get-published mystery, but a damn good mystery. A damn good mystery is first a dramatic novel, Frey insists-a dramatic novel with living, breathing characters-and he shows his readers how to create a living, breathing, believable character who will be clever and resourceful, willful and resolute, and will be what Frey calls 'the author of the plot behind the plot.'<br/><br/>Frey then shows, in his well-known, entertaining, and accessible (and often humorous) style , how the characters-the entire ensemble, including the murderer, the detective, the authorities, the victims, the suspects, the witnesses and the bystanders-create a complete and coherent world.<br/><br/>Exploring both the on-stage action and the behind-the-scenes intrigue, Frey shows prospective writers how to build a fleshed-out, believable, and logical world. He shows them exactly which parts of that world show up in the pages of a damn good mystery-and which parts are held back just long enough to keep the reader guessing.<br/><br/>This is an indispensable step-by-step guide for anyone who\'s ever dreamed of writing a damn good mystery.', 'language": "en", "image": "https://images.isbndb.com/covers/44/61/9780312304461.jpg", "title_long": "How to Write a Damn Good Mystery: A Practical Step-by-Step Guide from Inspiration to Finished Manuscript", "edition": "First Edition", "dimensions": "Height: 8.5 Inches, Length: 5.5 Inches, Weight: 1.1 Pounds, Width: 0.8118094 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.8118094}, "weight": {"unit": "pounds", "value": 1.1}, "height": {"unit": "inches", "value": 8.5}}, "pages": 288, "date_published": "2004-02-12", "subjects": ["Reference', 'Writing, Research & Publishing Guides', 'Writing', 'Research'], 'authors": ["James N. Frey'], 'title": "How to Write a Damn Good Mystery: A Practical Step-by-Step Guide from Inspiration to Finished Manuscript", "isbn13": "9780312304461", "msrp": "0.00", "binding": "Hardcover", "isbn": "0312304463", "isbn10": "0312304463", "other_isbns": [{'isbn": "9781429974134", "binding": "printisbncanonical"}]}}