{"book": {"publisher": "Picador", "synopsis": "From a major voice in Southern literature comes award-winning author Ron Rash"s Saints at the River, a novel about a town divided by the aftermath of a tragic accident--and the woman caught in the middle.<br/><br/>When a twelve-year-old girl drowns in the Tamassee River and her body is trapped in a deep eddy, the people of the small South Carolina town that bears the river"s name are thrown into the national spotlight. The girl"s parents want to attempt a rescue of the body; environmentalists are convinced the rescue operation will cause permanent damage to the river and set a dangerous precedent. Torn between the two sides is Maggie Glenn, a twenty-eight-year-old newspaper photographer who grew up in the town and has been sent to document the incident. Since leaving home almost ten years ago, Maggie has done her best to avoid her father, but now, as the town's conflict opens old wounds, she finds herself revisiting the past she's fought so hard to leave behind. Meanwhile, the reporter who's accompanied her to cover the story turns out to have a painful past of his own, and one that might stand in the way of their romance.<br/><br/>Drawing on the same lyrical prose and strong sense of place that distinguished his award-winning first novel, One Foot in Eden, Ron Rash has written a book about the deepest human themes: the love of the land, the hold of the dead on the living, and the need to dive beneath the surface to arrive at a deeper truth. Saints at the River confirms the arrival of one of today's most gifted storytellers.', 'language": "en", "image": "https://images.isbndb.com/covers/49/16/9780312424916.jpg", "title_long": "Saints at the River: A Novel", "edition": "First Edition", "dimensions": "Height: 8.1999836 Inches, Length: 5.55 Inches, Weight: 0.52 Pounds, Width: 0.65 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.55}, "width": {"unit": "inches", "value": 0.65}, "weight": {"unit": "pounds", "value": 0.52}, "height": {"unit": "inches", "value": 8.1999836}}, "pages": 239, "date_published": "2005-07-01", "subjects": ["Literature & Fiction', 'United States', 'Southern', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Ron Rash'], 'title": "Saints at the River: A Novel", "isbn13": "9780312424916", "msrp": 15, "binding": "Paperback", "isbn": "0312424914", "isbn10": "0312424914", "other_isbns": [{'isbn": "9781429900836", "binding": "printisbncanonical"}]}}