{"book": {"publisher": "St. Martin"s Griffin", "synopsis": "Tom Stanton"s The Final Season offers a powerful memoir of fathers, sons, and the end of a baseball era.<br/><br/>Maybe your dad took you to ball games at Fenway, Wrigley, or Ebbets. Maybe the two of you watched broadcasts from Yankee Stadium or Candlestick Park, or listened as Red Barber or Vin Scully called the plays on radio. Or maybe he coached your team or just played catch with you in the yard. Chances are good that if you"re a baseball fan, your dad had something to do with it--and your thoughts of the sport evoke thoughts of him. If so, you will treasure The Final Season, a poignant true story about baseball and heroes, family and forgiveness, doubts and dreams, and a place that brings them all together.<br/><br/>Growing up in the 60s and 70s, Tom Stanton lived for his Detroit Tigers. When Tiger Stadium began its 88th and final season, he vowed to attend all 81 home games in order to explore his attachment to the place where four generations of his family have shared baseball. Join him as he encounters idols, conjures decades past, and discovers the mysteries of a park where Cobb and Ruth played. Come along and sit beside Al Kaline on the dugout bench, eat popcorn with Elmore Leonard, hear Alice Cooper's confessions, soak up the warmth of Ernie Harwell, see McGwire and Ripken up close, and meet Chicken Legs Rau, Bleacher Pete, Al the Usher, and a parade of fans who are anything but ordinary.<br/><br/>By the autumn of his odyssey, Stanton comes to realize that his anguish isn't just about the loss of a beloved ballpark but about his dad's mortality, for at the heart of this story is the love between fathers and sons--a theme that resonates with baseball fans of all ages.', 'language": "en", "image": "https://images.isbndb.com/covers/15/63/9780312291563.jpg", "title_long": "The Final Season: Fathers, Sons, and One Last Season in a Classic American Ballpark (Honoring a Detroit Legend)", "edition": "First Edition", "dimensions": "Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.75 Pounds, Width: 0.58 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.58}, "weight": {"unit": "pounds", "value": 0.75}, "height": {"unit": "inches", "value": 8.5}}, "pages": 256, "date_published": "2002-05-08", "subjects": ["Biographies & Memoirs', 'Memoirs', 'History', 'Americas', 'United States', 'Sports & Outdoors', 'Baseball', 'Biographies', 'Miscellaneous', 'Journalism'], 'authors": ["Tom Stanton'], 'title": "The Final Season: Fathers, Sons, and One Last Season in a Classic American Ballpark (Honoring a Detroit Legend)", "isbn13": "9780312291563", "msrp": 19.99, "binding": "Paperback", "isbn": "0312291566", "isbn10": "0312291566", "other_isbns": [{'isbn": "9781429981118", "binding": "printisbncanonical"}]}}