{"book": {"publisher": "Picador", "synopsis": "Winner of the National Book Award<br/><br/>From the Pulitzer Prize–winning author of The Overstory and the Oprah"s Book Club selection Bewilderment comes Richard Powers"s The Echo Maker, a powerful novel about family and loss.<br/><br/>“Wise and elegant . . . The mysteries unfold so organically and stealthily that you are unaware of his machinations until they come to stunning fruition . . . Powers accomplishes something magnificent.” ―Colson Whitehead, The New York Times Book Review<br/><br/>On a winter night on a remote Nebraska road, twenty-seven-year-old Mark Schluter has a near-fatal car accident. His older sister, Karin, returns reluctantly to their hometown to nurse Mark back from a traumatic head injury. But when Mark emerges from a coma, he believes that this woman―who looks, acts, and sounds just like his sister―is really an imposter. When Karin contacts the famous cognitive neurologist Gerald Weber for help, he diagnoses Mark as having Capgras syndrome. The mysterious nature of the disease, combined with the strange circumstances surrounding Mark’s accident, threatens to change all of their lives beyond recognition. In The Echo Maker, Richard Powers proves himself to be one of our boldest and most entertaining novelists.", 'language": "en", "image": "https://images.isbndb.com/covers/64/39/9780312426439.jpg", "title_long": "The Echo Maker", "edition": "First Edition", "dimensions": "Height: 8.16 Inches, Length: 5.63 Inches, Weight: 0.7 Pounds, Width: 0.814959 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.63}, "width": {"unit": "inches", "value": 0.814959}, "weight": {"unit": "pounds", "value": 0.7}, "height": {"unit": "inches", "value": 8.16}}, "pages": 451, "date_published": "2007-08-21", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Psychological', 'United States', 'Contemporary', 'Literary', 'Mystery, Thriller & Suspense', 'Self Service', 'Custom Stores'], 'authors": ["Richard Powers'], 'title": "The Echo Maker", "isbn13": "9780312426439", "msrp": 20, "binding": "Paperback", "isbn": "0312426437", "isbn10": "0312426437", "other_isbns": [{'isbn": "9780374706548", "binding": "print"}]}}