{"book": {"publisher": "Wentworth Press", "synopsis": "Bounty hunter Stephanie Plum and Trenton vice cop Joe Morelli join forces to find the madman killer who shot and barbecued the youngest son of international black-market arms dealer Alexander Ramos.<br/><br/>Carlos Manoso, street name Ranger, is caught on video just minutes before the crime occurs. He"s at the scene, he"s with the victim, and he"s the number-one suspect. Ranger is former special forces turned soldier of fortune. He has a blue-chip stock portfolio and no known address. He moves in mysterious circles. He's Stephanie's mentor--the man who taught her everything she knows about fugitive apprehension. And he's more than her friend.<br/><br/>Now he's the hunted and Stephanie's the hunter, and it's time for her to test her skills against the master. But if she does catch him...what then? Can she bring herself to turn him in?<br/><br/>Plus there are other things keeping Stephanie awake at night. Her maternal grandmother has set up housekeeping in Stephanie's apartment, a homicidal maniac has selected Stephanie as his next victim, her love life is in the toilet, she's adopted a dog with an eating disorder, and she can't button the top snap on her Levi's.<br/><br/>Experience the world of Plum--in Janet Evanovich's new thriller. It's surreal, it's frenetic, it's incendiary. Hot Six. It's the best yet.', 'language": "fr", "image": "https://images.isbndb.com/covers/62/79/9780312976279.jpg", "title_long": "Manuel De Correspondance Commerciale: Suivi D"une Phraséologie Française-allemande... (French Edition)", 'edition": "Reissue", "dimensions": "Height: 9.21 Inches, Length: 6.14 Inches, Weight: 1.47048328754 Pounds, Width: 0.81 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.14}, "width": {"unit": "inches", "value": 0.81}, "weight": {"unit": "pounds", "value": 1.47048328754}, "height": {"unit": "inches", "value": 9.21}}, "pages": 352, "date_published": "2018-08-08", "subjects": ["History'], 'authors": ["August Schiebe', 'Charles-Gustave Odermann'], 'title": "Manuel De Correspondance Commerciale: Suivi D"une Phraséologie Française-allemande... (French Edition)", 'isbn13": "9780312976279", "msrp": 8.99, "binding": "Hardcover", "isbn": "0312976275", "isbn10": "0312976275", "other_isbns": [{'isbn": "9781429971454", "binding": "printisbncanonical"}]}}