{"book": {"publisher": "St. Martin"s Griffin", "synopsis": "This sweeping epic set in 19th-century India begins in the foothills of the towering Himalayas and follows a young Indian-born orphan as he\"s raised in England and later returns to India where he falls in love with an Indian princess and struggles with cultural divides.<br/><br/>The Far Pavilions is itself a Himalayan achievement, a book we hate to see come to an end. It is a passionate, triumphant story that excites us, fills us with joy, move us to tears, satisfies us deeply, and helps us remember just what it is we want most from a novel.<br/><br/>M.M. Kaye\"s masterwork is a vast, rich and vibrant tapestry of love and war that ranks with the greatest panoramic sagas of modern fiction, moving the famed literary critic Edmond Fuller to write: "Were Miss Kaye to produce no other book, The Far Pavilions might stand as a lasting accomplishment in a single work comparable to Margaret Mitchell\"s achievement in Gone With the Wind.'<br/><br/>Adapted into the 1984 miniseries starring Ben Cross, Amy Irving, Omar Sharif, and Christopher Lee; and into the 2005 stage musical with music composed by Philip Henderson.', 'language": "en", "image": "https://images.isbndb.com/covers/12/56/9780312151256.jpg", "title_long": "The Far Pavilions", "edition": "Reprint", "dimensions": "Height: 8.15 Inches, Length: 5.3999892 Inches, Weight: 1.63 Pounds, Width: 1.6 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.3999892}, "width": {"unit": "inches", "value": 1.6}, "weight": {"unit": "pounds", "value": 1.63}, "height": {"unit": "inches", "value": 8.15}}, "pages": 960, "date_published": "1997-01-15", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'British & Irish', 'Self Service', 'Custom Stores'], 'authors": ["M. M. Kaye'], 'title": "The Far Pavilions", "isbn13": "9780312151256", "msrp": "0.00", "binding": "Paperback", "isbn": "031215125X", "isbn10": "031215125X", "other_isbns": [{'isbn": "9781250089298", "binding": "printisbncanonical"}]}}