{"book": {"publisher": "St. Martin"s Paperbacks", "synopsis": "It isn"t easy moving about Society dressed like a dandy-especially when one is a ruthless spy. But that"s precisely the latest mission for Liar's Club agent Dalton Montmorecy. Dalton is posing as Sir Thorogood, the elusive cartoonist whose scathing political caricatures have all of London abuzz. The true identity of Sir Thorogood is a mystery, and Dalton hopes that impersonating him will flush out the real menace before his cartoons do further damage to the Crown. Now, if Dalton could only find a way to get the irksome, yet oddly appealing widow, Clara Simpson, off his trail...<br/><br/>When Clara meets Sir Thorogood at a ball, she's certain he is an impostor-because she's the true Sir Thorogood. Secretly penning the cartoons under the frothy nom de plume, Clara hopes to save enough money so that she can leave her in-laws and find a new residence. Now she is determined to reveal an imposter's identity-and that means doing some undercover work herself. But pretending to be someone you're not has a funny way of making a woman do things she wouldn't ordinarily dream of-even if it drives her straight into the arms of her devilishly handsome adversary!', 'language": "en", "image": "https://images.isbndb.com/covers/48/61/9780312984861.jpg", "title_long": "The Impostor (The Liars Club, Book 2)", "dimensions": "Height: 6.78 Inches, Length: 4.26 Inches, Weight: 0.41005980732 pounds, Width: 1.05 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.26}, "width": {"unit": "inches", "value": 1.05}, "weight": {"unit": "pounds", "value": 0.41005980732}, "height": {"unit": "inches", "value": 6.78}}, "pages": 384, "date_published": "2003-10-19", "subjects": ["Romance', 'Historical', 'Regency'], 'authors": ["Celeste Bradley'], 'title": "The Impostor (The Liars Club, Book 2)", "isbn13": "9780312984861", "msrp": "0.00", "binding": "Mass Market Paperback", "isbn": "0312984863", "isbn10": "0312984863", "other_isbns": [{'isbn": "9781429901918", "binding": "printisbncanonical"}]}}