{"book": {"publisher": "St. Martin"s Paperbacks", "synopsis": "Rosalind Rutherford knows full well the scandal she courts when she attempts to seduce the notorious Armond Wulf―in fact, she"s counting on it as a means to escape her sadistic stepbrother"s control. Unfortunately, Lord Wulf's better instincts prevail...although not before he gives Rosalind a tantalizing taste of what she's missing. And when the opportunity arises to rescue Armond from a grim fate while changing her own, Rosalind knows she must seize it...<br/>Armond can no more ignore the Rutherford woman than his ancestor could resist the temptress who cursed the Wulf men with a terrifying transformation that occurs at the appearance of the full moon―and is set in motion by love. Now, to save her reputation and his freedom, Armond must marry Rosalind. But he vows that while they may share the pleasures of the marriage bed, she will never have his heart...<br/>Yet as strange and mysterious events bring them closer in body and soul, Armond finds it increasingly difficult to keep his feelings for his new wife locked away. Especially when the reality of unquenchable desire―and certain danger―burn stronger than ever by the light of a full moon...', 'language": "en", "image": "https://images.isbndb.com/covers/57/33/9780312935733.jpg", "title_long": "The Dark One (The Wild Wulfs of London)", "edition": "First Edition", "dimensions": "Height: 6.68 Inches, Length: 4.25 Inches, Weight: 0.3 Pounds, Width: 0.965 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.25}, "width": {"unit": "inches", "value": 0.965}, "weight": {"unit": "pounds", "value": 0.3}, "height": {"unit": "inches", "value": 6.68}}, "pages": 352, "date_published": "2005-11-01", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Gothic', 'Erotica', 'Romantic', 'Suspense', 'Romance', 'Vampires', 'Fantasy', 'Self Service', 'Custom Stores'], 'authors": ["Ronda Thompson'], 'title": "The Dark One (The Wild Wulfs of London)", "isbn13": "9780312935733", "msrp": 6.99, "binding": "Mass Market Paperback", "isbn": "0312935730", "isbn10": "0312935730", "other_isbns": [{'isbn": "9781429909563", "binding": "printisbncanonical"}]}}