{"book": {"publisher": "Minotaur Books", "synopsis": "On the streets of Tucson, Arizona, a riot breaks out after a basketball game and a man is shot dead in the street. He carries no identification, and the usual police checks---fingerprints and an artist"s sketch---provide nothing. Was this a case of police brutality, or did someone use the riot to conceal a murder? April Lennox, a young reporter from L.A., has a theory, and she turns to private detective Roscoe Brinker for help.<br/><br/>April received a call from Mexico a few days earlier---a call from a man promising a story of oppression and murder. They arranged to meet the night of the riot. He didn"t show, and April now suspects that her informant and the murder victim are one and the same.<br/><br/>She needs Brinker"s connections in Tucson and across the border, but after being shot and nearly killed in Mexico, he's less than eager to go back. New information and a little bit of charm finally wear him down, and Brinker decides to take on her case. Before he can join her, April uncovers a personal connection to the murder. She heads south and doesn't come back.<br/><br/>On the trail of the clues she's left behind, Brinker returns to Mexico only to find something darker and more dangerous than he'd ever imagined.', 'language": "en", "image": "https://images.isbndb.com/covers/53/20/9780312315320.jpg", "title_long": "Choke Point: A Brinker Mystery (Brinker P.I.)", "edition": "First Edition", "dimensions": "Height: 8.64 Inches, Length: 5.58 Inches, Weight: 0.92 Pounds, Width: 1.11 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.58}, "width": {"unit": "inches", "value": 1.11}, "weight": {"unit": "pounds", "value": 0.92}, "height": {"unit": "inches", "value": 8.64}}, "pages": 272, "date_published": "2004-10-05", "subjects": ["Mystery, Thriller & Suspense', 'Mystery'], 'authors": ["James C. Mitchell'], 'title": "Choke Point: A Brinker Mystery (Brinker P.I.)", "isbn13": "9780312315320", "msrp": 23.95, 'binding": "Hardcover", "isbn": "0312315325", "isbn10": "0312315325"}}