{"book": {"publisher": "St. Martin"s Paperbacks", "synopsis": "The introspective hero of Wings of Fire and A Test of Wills (Edgar Award nominee) returns in Search the Dark, a provocative mystery by Charles Todd.<br/><br/>Inspector Ian Rutledge, haunted by memories of World War I and the harrowing presence of Hamish, a dead soldier, is "a superb characterization of a man whose wounds have made him a stranger in his own land." (The New York Times Book Review)<br/><br/>A dead woman and two missing children bring Inspector Rutledge to the lovely Dorset town of Singleton Magna, where the truth lies buried with the dead. A tormented veteran whose family died in an enemy bombing is the chief suspect. Dubious, Rutledge presses on to find the real killer. And when another body is found in the rich Dorset earth, his quest reaches into the secret lives of villagers and Londoners whose privileged positions and private passions give them every reason to thwart him. Someone is protecting a murderer. And two children are out there, somewhere, in the dark....', 'language": "en", "image": "https://images.isbndb.com/covers/12/81/9780312971281.jpg", "title_long": "Search the Dark: An Inspector Ian Rutledge Mystery (Ian Rutledge Mysteries, 3)", "edition": "First Edition", "dimensions": "Height: 6.65 Inches, Length: 4.25 Inches, Weight: 0.34 Pounds, Width: 3.35 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.25}, "width": {"unit": "inches", "value": 3.35}, "weight": {"unit": "pounds", "value": 0.34}, "height": {"unit": "inches", "value": 6.65}}, "pages": 310, "date_published": "2000-05-15", "subjects": ["Mystery, Thriller & Suspense', 'Mystery', 'Police Procedurals', 'Historical', 'Self Service', 'Custom Stores'], 'authors": ["Charles Todd'], 'title": "Search the Dark: An Inspector Ian Rutledge Mystery (Ian Rutledge Mysteries, 3)", "isbn13": "9780312971281", "msrp": 8.99, "binding": "Mass Market Paperback", "isbn": "0312971281", "isbn10": "0312971281", "other_isbns": [{'isbn": "9780312264673", "binding": "printisbncanonical"}]}}