{"book": {"publisher": "St Martins Pr", "synopsis": "Wed and widowed in one day, stunning socialite Amelia Sinclair\x92s honeymoon is anything but typical. Then again, neither is Amelia\x97rebellious and impulsive, marrying Robert Collingsworth was the one sensible thing she ever did. Now he\x92s dead and she must escape the vicious creatures stalking her\x97even if it means relying on a stranger. Well, maybe not a complete stranger. Amelia first glimpsed Gabriel Wulf years ago on the busy streets of London; since then he has haunted her dreams. But in the flesh, Gabriel is much more tantalizing than she ever dreamt, and much more complicated\x85<br/><br/>Gabriel Wulf, the strong one, the sensible one\x97the, and the curse that plagued them, were his only priorities; there was little time for women and none for love. Now, he must protect an enticing beauty\x97and not just from the dangers that prowl the woods around them. Gabriel has secrets, dark ones he\x92s sure Amelia must never know and could never understand. But she has already awakened his heart...and the beast within. Will Amelia be the key to his salvation, or the architect of her own demise?", "language": "en", "image": "https://images.isbndb.com/covers/57/57/9780312935757.jpg", "title_long": "The Cursed One (Wild Wulfs of London)", "edition": "First Edition", "dimensions": "Height: 7.25 Inches, Length: 4.25 Inches, Weight: 0.35 Pounds, Width: 1 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 4.25}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 0.35}, "height": {"unit": "inches", "value": 7.25}}, "pages": 336, "date_published": "2006", "subjects": ["Literature & Fiction', 'United States', 'Contemporary', 'Romance', 'Fantasy'], 'authors": ["Ronda Thompson'], 'title": "The Cursed One (Wild Wulfs of London)", "isbn13": "9780312935757", "msrp": 6.99, "binding": "Paperback", "isbn": "0312935757", "isbn10": "0312935757", "other_isbns": [{'isbn": "9781429934053", "binding": "printisbncanonical"}]}}