{"book": {"publisher": "St. Martin"s Paperbacks", "synopsis": "Running from angry villagers and the man who ravaged her, the witch Lucinda flees into the forest to have her child. But Lord Jackson Wulf hunts her down, believing her death will break the family curse that transforms him into a monster. Instead of killing the witch, Jackson is moved by her beauty and desperate plight. And Lucinda seizes the chance to find safety for herself and her babe when a bargain is struck between this outcast woman and this doomed man--and sealed by their marriage in name only…<br/><br/>In return for his protection, Lucinda has promised that her magick can free Jackson from his torment. But this pretty witch soon finds herself in danger of being seduced by Jackson"s charms and pursued by the man who would see both her and her child dead. Can she trust a Wulf with her safety and the safety of her child? Can she trust her heart to Jackson? To surrender to a Wulf is a terrible risk, for love will either unleash the beast within the man...or finally set him free.", 'language": "en", "image": "https://images.isbndb.com/covers/57/40/9780312935740.jpg", "title_long": "The Untamed One (Book 2 of The Wild Wulfs of London)", "edition": "First Edition", "dimensions": "Height: 6.73 Inches, Length: 4.13 Inches, Weight: 0.35 Pounds, Width: 0.855 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.13}, "width": {"unit": "inches", "value": 0.855}, "weight": {"unit": "pounds", "value": 0.35}, "height": {"unit": "inches", "value": 6.73}}, "pages": 320, "date_published": "2006-05-02", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Gothic', 'Erotica', 'Romantic', 'Contemporary', 'Romance', 'Fantasy'], 'authors": ["Ronda Thompson'], 'title": "The Untamed One (Book 2 of The Wild Wulfs of London)", "isbn13": "9780312935740", "msrp": 6.99, "binding": "Mass Market Paperback", "isbn": "0312935749", "isbn10": "0312935749", "other_isbns": [{'isbn": "9781429909570", "binding": "printisbncanonical"}]}}