{"book": {"publisher": "Picador", "synopsis": "Winner of the Kiriyama Pacific Rim Book Prize<br/>A New York Times Notable Book of the Year<br/>Winner of the Whiting Writers\" Award<br/>A Seattle Post-Intelligencer Best Book of the Year<br/><br/>Catfish and Mandala is the story of an American odyssey―a solo bicycle voyage around the Pacific Rim to Vietnam―made by a young Vietnamese-American man in pursuit of both his adopted homeland and his forsaken fatherland. Intertwined with an often humorous travelogue spanning a year of discovery is a memoir of war, escape, and ultimately, family secrets.<br/><br/>Andrew X. Pham was born in Vietnam and raised in California. His father had been a POW of the Vietcong; his family came to America as "boat people." Following the suicide of his sister, Pham quit his job, sold all of his possessions, and embarked on a year-long bicycle journey that took him through the Mexican desert; on a thousand-mile loop from Narita in South Korea to Kyoto in Japan; and, after five months and 2,357 miles, to Saigon, where he finds 'nothing familiar in the bombed-out darkness.' In Vietnam, he\'s taken for Japanese or Korean by his countrymen, except, of course, by his relatives, who doubt that as a Vietnamese he has the stamina to complete his journey ('Only Westerners can do it'); and in the United States he\'s considered anything but American.<br/><br/>A vibrant, picaresque memoir written with narrative flair and an eye-opening sense of adventure, Catfish and Mandala is an unforgettable search for cultural identity.', 'language": "en", "image": "https://images.isbndb.com/covers/71/79/9780312267179.jpg", "title_long": "Catfish and Mandala: A Two-Wheeled Voyage Through the Landscape and Memory of Vietnam", "edition": "1", "dimensions": "Height: 5.2 Inches, Length: 8.1 Inches, Weight: 0.72 Pounds, Width: 0.9 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.1}, "width": {"unit": "inches", "value": 0.9}, "weight": {"unit": "pounds", "value": 0.72}, "height": {"unit": "inches", "value": 5.2}}, "pages": 352, "date_published": "2000-09-02", "subjects": ["Biographies & Memoirs', 'Community & Culture', 'Asian American & Asian', 'Memoirs', 'Travelers & Explorers', 'History', 'Americas', 'Asia', 'Military', 'Travel', 'Vietnam', 'Southeast', 'Specialty Travel', 'Adventure', 'Self Service', 'Custom Stores'], 'authors": ["Andrew X. Pham'], 'title": "Catfish and Mandala: A Two-Wheeled Voyage Through the Landscape and Memory of Vietnam", "isbn13": "9780312267179", "msrp": 20, "binding": "Paperback", "isbn": "0312267177", "isbn10": "0312267177", "other_isbns": [{'isbn": "9781429979924", "binding": "printisbncanonical"}]}}