{"book": {"publisher": "St. Martin"s Griffin", "synopsis": "Richard Brautigan"s last novel, published in the U.S. for the first time<br/><br/>Richard Brautigan was an original--brilliant and wickedly funny, his books resonated with the sixties, making him an overnight counterculture hero. Taken in its entirety, his body of work reveals an artistry that outreaches the literary fads that so quickly swept him up.<br/><br/>Dark, funny, and exquisitely haunting, his final book-length fiction explores the fragile, mysterious shadowland surrounding death. Told with classic Brautigan wit, poetic style, and mordant irony, An Unfortunate Woman assumes the form of a peripatetic journal chronicling the protagonist"s travels and oblique ruminations on the suicide of one woman, and a close friend's death from cancer.<br/><br/>After Richard Brautigan committed suicide, his only child, Ianthe Brautigan, found among his possessions the manuscript of An Unfortunate Woman. It had been completed over a year earlier, but was still unpublished at the time of his death. Finding it was too painful to face her father's presence page after page, she put the manuscript aside.<br/><br/>Years later, having completed a memoir about her father's life and death, Ianthe Brautigan reread An Unfortunate Woman, and finally, clear-eyed, she saw that it was her father's work at its best and had to be published.', 'language": "en", "image": "https://images.isbndb.com/covers/71/09/9780312277109.jpg", "title_long": "An Unfortunate Woman: A Journey", "edition": "First Edition", "dimensions": "Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.37 Pounds, Width: 0.3 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.3}, "weight": {"unit": "pounds", "value": 0.37}, "height": {"unit": "inches", "value": 8.5}}, "pages": 132, "date_published": "2001-07-10", "subjects": ["Humor & Entertainment', 'Humor', 'Self-Help & Psychology', 'Literature & Fiction', 'United States', 'Humor & Satire', 'Dark Humor', 'Humorous', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Richard Brautigan'], 'title": "An Unfortunate Woman: A Journey", "isbn13": "9780312277109", "msrp": 12.95, 'binding": "Paperback", "isbn": "0312277105", "isbn10": "0312277105"}}