{"book": {"publisher": "St. Martin"s Paperbacks", "synopsis": "Moscow-a city under siege by hardcore Communists threatening to plunge the country back into Stalinist darkness. Into the heart of the firestorm, American ambassador Stephen Metcalf has been summoned to find the one man who controls the levers of power in absolute secrecy-an official known only as the Dirizhor. His support of the bloody coup will bring the entire world to the brink of nuclear war. Metcalfe is the only man with the cunning to reach him and to convince him to resist. It"s up to Metcalf to change the course of history. He"s done it before.<br/><br/>For Metcalf, returning to Russia is also a personal mission that will stretch across three continents and fifty years into his past where the loyalties of a former love-a woman both impossibly beautiful and possibly treacherous-were tested; where the shadow of a Nazi assassin still haunts; a debauched German aristocrat manipulated the destiny of everyone he touched. Now, as past and present converge, Metcalf braces himself for a new trial of trust and betrayal, one with chilling implications that could threaten what remains of the free world.', 'language": "en", "image": "https://images.isbndb.com/covers/06/88/9780312990688.jpg", "title_long": "The Tristan Betrayal", "edition": "1st", "dimensions": "Height: 6.75 Inches, Length: 4.1875 Inches, Weight: 1.0031032921 Pounds, Width: 1.0625 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.1875}, "width": {"unit": "inches", "value": 1.0625}, "weight": {"unit": "pounds", "value": 1.0031032921}, "height": {"unit": "inches", "value": 6.75}}, "pages": 528, "date_published": "2004-10-17", "subjects": ["Literature & Fiction', 'Contemporary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Spies & Politics'], 'authors": ['Robert Ludlum'], 'title": "The Tristan Betrayal", "isbn13": "9780312990688", "msrp": "0.00", "binding": "Mass Market Paperback", "isbn": "0312990685", "isbn10": "0312990685"}}