{"book": {"publisher": "St. Martin"s Paperbacks", "synopsis": "Minion: The Special Huntress Edition<br/>In this exciting new edition of the first book in the Vampire Huntress Legend series, both fans and newcomers alike will experience a Minion that includes:<br/><br/>* An Exciting New Beginning<br/>* Never-Before-Read scenes<br/>* Fast and Furious Action-readers better hold on to their seats!<br/><br/>Fans wanted more and now they"ve got it! In this special author"s edition of Minion, readers will uncover more intrigue, more heat, and most importantly, more Damali Richards, vampire huntress.<br/><br/>All Damali Richards ever wanted to do was create music and bring it to the people. Now she is a Spoken Word artist and the top act for Warriors of Light Records. But come nightfall, she hunts vampires and demons-predators that people tend to dismiss as myth or fantasy. Damali and her Guardian team cannot afford such delusions, especially now, when a group of rogue vampires has been killing the artists of Warriors of Light and their rival, Blood Music.<br/><br/>When strange attacks erupt within the club drug-trafficking network and draw the attention of the police, Damali realizes these killings are a bit out of the ordinary, even for vampires. Instead of neat puncture marks in the neck showing where the blood has been drained from the body, these corpses are mutilated beyond recognition, indicating a blood lust and thirst for destruction that surpasses any Damali has encountered before. Soon she discovers that behind these brutal murders is the most powerful vampire Damali has ever met-a seductive beast who is coming for her next...', 'language": "en", "image": "https://images.isbndb.com/covers/70/15/9780312987015.jpg", "title_long": "Minion: A Vampire Huntress Legend (Vampire Huntress Legends, 1)", "edition": "First Edition", "dimensions": "Height: 6.82 Inches, Length: 4.24 Inches, Weight: 0.34 Pounds, Width: 0.78 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.24}, "width": {"unit": "inches", "value": 0.78}, "weight": {"unit": "pounds", "value": 0.34}, "height": {"unit": "inches", "value": 6.82}}, "pages": 320, "date_published": "2004-05", "subjects": ["Literature & Fiction', 'United States', 'Romance', 'Paranormal', 'Vampires', 'Science Fiction & Fantasy', 'Fantasy', 'Paranormal & Urban', 'Romantic', 'Self Service', 'Custom Stores'], 'authors": ["L. A. Banks'], 'title": "Minion: A Vampire Huntress Legend (Vampire Huntress Legends, 1)", "isbn13": "9780312987015", "msrp": 7.99, "binding": "Mass Market Paperback", "isbn": "0312987013", "isbn10": "0312987013", "other_isbns": [{'isbn": "9781429994408", "binding": "printisbncanonical"}]}}