{"book": {"publisher": "Stonewall Inn Editions", "synopsis": "By the time Rock Hudson"s death in 1985 alerted all America to the danger of the AIDS epidemic, the disease had spread across the nation, killing thousands of people and emerging as the greatest health crisis of the 20th century. America faced a troubling question: What happened? How was this epidemic allowed to spread so far before it was taken seriously? In answering these questions, Shilts weaves weaves the disparate threads into a coherent story, pinning down every evasion and contradiction at the highest levels of the medical, political, and media establishments.<br/><br/>Shilts shows that the epidemic spread wildly because the federal government put budget ahead of the nation"s welfare; health authorities placed political expediency before the public health; and scientists were often more concerned with international prestige than saving lives. Against this backdrop, Shilts tells the heroic stories of individuals in science and politics, public health and the gay community, who struggled to alert the nation to the enormity of the danger it faced. And the Band Played On is both a tribute to these heroic people and a stinging indictment of the institutions that failed the nation so badly.", 'language": "en", "image": "https://images.isbndb.com/covers/13/53/9780312241353.jpg", "title_long": "And the Band Played On: Politics, People, and the AIDS Epidemic", "edition": "First Edition", "dimensions": "Height: 8.21 Inches, Length: 5.46 Inches, Weight: 1.3999353637 Pounds, Width: 1.72 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.46}, "width": {"unit": "inches", "value": 1.72}, "weight": {"unit": "pounds", "value": 1.3999353637}, "height": {"unit": "inches", "value": 8.21}}, "pages": 656, "date_published": "2000-04-09", "subjects": ["Health, Fitness & Dieting', 'Diseases & Physical Ailments', 'AIDS', 'Politics & Social Sciences', 'Social Sciences', 'LGBTQ+ Demographic Studies'], 'authors": ["Randy Shilts'], 'title": "And the Band Played On: Politics, People, and the AIDS Epidemic", "isbn13": "9780312241353", "msrp": 16.95, 'binding": "Paperback", "isbn": "0312241356", "isbn10": "0312241356"}}