{"book": {"publisher": "Picador", "synopsis": "Paul La Farge\"s stunning, imaginative novel about the great architect of Paris "full of artful prose, wit, and provocative ideas.” (The Philadelphia Inquirer)<br/><br/>Baron Georges-Eugène Haussmann, who demolished and rebuilt Paris in the middle of the nineteenth century, was the first urbanist of the modern era--and perhaps the greatest. He presided over two decades of riches, peace, and progress in a city the likes of which no one had ever seen before, with boulevards monumentally conceived and brilliantly lit, clean water, public transportation, and sewers that were the envy of every nation in the world. Yet there is a story that, on his deathbed, Haussmann wished all his work undone. "Would that it had died with me!' he is supposed to have said. What is the secret of the baron\'s last regret?<br/><br/>To answer this question, Haussmann tells the story of Madeleine, a foundling who grew up in the magical, chaotic world that Haussmann destroyed; of de Fonce, one of the great artistes démolisseurs who tore Paris down and sold its rubble as antiques; and of a three-sided affair that pits love against ambition, architecture against flesh, and the living Parisians against Haussmann\'s unbuilt masterpiece, the Railroad of the Dead.<br/><br/>Although steeped in history, Paul La Farge\'s Haussmann, or the Distinction is a novel not bound by fact; it is an account of the hidden, sometimes fantastical life of the nineteenth century, a work that will make readers think of Borges as well as Balzac; it is a view of cities, of love, and of history itself from the other side of the mirror.', 'language": "en", "image": "https://images.isbndb.com/covers/09/25/9780312420925.jpg", "title_long": "Haussmann, or the Distinction: A Novel", "edition": "First Edition", "dimensions": "Height: 8.5 Inches, Length: 5.5 Inches, Weight: 1.15 pounds, Width: 0.88 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.88}, "weight": {"unit": "pounds", "value": 1.15}, "height": {"unit": "inches", "value": 8.5}}, "pages": 400, "date_published": "2002-10-02", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'City Life', 'United States', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Paul La Farge'], 'title": "Haussmann, or the Distinction: A Novel", "isbn13": "9780312420925", "msrp": 27, "binding": "Paperback", "isbn": "0312420927", "isbn10": "0312420927", "other_isbns": [{'isbn": "9781466865228", "binding": "printisbncanonical"}]}}