{"book": {"publisher": "St. Martin"s Paperbacks", "synopsis": "One of the world"s most acclaimed adventure writers returns to the world of ancient Egypt with the stunning sequel to the New York Times bestselling River God. In the wake of a sixty-year war over the reign of the kingdoms of Egypt, two young pharaohs have risen to claim power, but only one can succeed, deciding the fate of his empire forever...<br/><br/>The mission of Prince Nefer, rightful heir to the throne, is to rebuild a magnificent kingdom in the stark and tumbled ruins of the embattled city of Gallala. The desire of Lord Naja is to destroy his rival and rule the land with unholy supremacy. But Nefer has on his side the warlock Taita, a matchless ally and legendary priest of notorious powers...<br/><br/>To see their dream come true, Nefer and Taita must stay one step ahead of the depraved assassin, survive the tortuous shadow of her ever-pursuing armies, and outwit the shocking betrayals of is own flesh and blood. As Nefer"s courage increases, and as Taita's magic grows more beguiling, so grows stronger the power of their tireless enemies....<br/><br/>Now, with the threat of tyranny and blood thundering closer and closer toward the vulnerable gates of Gallala, the ultimate battle for Egypt will begin...', 'language": "en", "image": "https://images.isbndb.com/covers/03/82/9780312980382.jpg", "title_long": "Warlock: A Novel of Ancient Egypt (Novels of Ancient Egypt)", "edition": "First Edition", "dimensions": "Height: 6.64 Inches, Length: 4.18 Inches, Weight: 0.7 Pounds, Width: 1.39 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.18}, "width": {"unit": "inches", "value": 1.39}, "weight": {"unit": "pounds", "value": 0.7}, "height": {"unit": "inches", "value": 6.64}}, "pages": 704, "date_published": "2002-09-16", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'Action & Adventure', 'United States', 'Contemporary'], 'authors": ["Wilbur Smith'], 'title": "Warlock: A Novel of Ancient Egypt (Novels of Ancient Egypt)", "isbn13": "9780312980382", "msrp": 7.99, 'binding": "Mass Market Paperback", "isbn": "0312980388", "isbn10": "0312980388"}}