{"book": {"publisher": "St. Martin"s Griffin", "synopsis": "The Bitten is the fourth daring and pulse-pounding book in L. A. Banks"s Vampire Huntress Legend series<br/><br/>The vampire civil war has been averted, deadly were-demons have been beaten back, and now it Damali Richards and Carlos Rivera (now a Council level vampire) will finally have the chance to settle in and explore their deeper, sexier love.<br/><br/>But Carlos and Damali should know by now that there is no rest for the saviors of the known world. One of the four topside Master vampires has stolen one of the Keys---the living blood of Christ---that opens the sixth seal as foretold in Revelations. He who possesses the Key and the Seal can decide to the outcome of the Final War, a.k.a. Armageddon. With a vampire in possession of the Key, the balance between the Light and the Dark have been thrown off and even Damali is deeply affected: she is now sporting a pair of fangs.<br/><br/>In order to retrieve the Key, Carlos and Damali are quickly thrust into a web of vampire politics and intrigue. And when Carlos"s secret drug, Oblivion, finds its way into the hands of the enemies, even the seventh level of Hell comes calling.', 'language": "en", "image": "https://images.isbndb.com/covers/40/87/9780312324087.jpg", "title_long": "The Bitten: A Vampire Huntress Legend (Vampire Huntress Legends, 4)", "edition": "First Edition", "dimensions": "Height: 8.5 Inches, Length: 5.5 Inches, Weight: 1.2 Pounds, Width: 0.988187 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.988187}, "weight": {"unit": "pounds", "value": 1.2}, "height": {"unit": "inches", "value": 8.5}}, "pages": 448, "date_published": "2005-02-01", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Horror', 'United States', 'Romance', 'Paranormal', 'Vampires', 'Science Fiction & Fantasy', 'Fantasy', 'Paranormal & Urban', 'Romantic', 'Self Service', 'Custom Stores'], 'authors": ["L. A. Banks'], 'title": "The Bitten: A Vampire Huntress Legend (Vampire Huntress Legends, 4)", "isbn13": "9780312324087", "msrp": 26.99, "binding": "Paperback", "isbn": "0312324081", "isbn10": "0312324081", "other_isbns": [{'isbn": "9781429994484", "binding": "print"}]}}