{"book": {"publisher": "Wentworth Press", "synopsis": "Rusty Young was backpacking in South America when he heard about Thomas McFadden, a convicted English drug trafficker who ran tours inside Bolivia\"s notorious San Pedro prison. Intrigued, the young Australian journalisted went to La Paz and joined one of Thomas\"s illegal tours. They formed an instant friendship and then became partners in an attempt to record Thomas\"s experiences in the jail. Rusty bribed the guards to allow him to stay and for the next three months he lived inside the prison, sharing a cell with Thomas and recording one of the strangest and most compelling prison stories of all time. The result is Marching Powder.<br/><br/>This book establishes that San Pedro is not your average prison. Inmates are expected to buy their cells from real estate agents. Others run shops and restaurants. Women and children live with imprisoned family members. It is a place where corrupt politicians and drug lords live in luxury apartments, while the poorest prisoners are subjected to squalor and deprivation. Violence is a constant threat, and sections of San Pedro that echo with the sound of children by day house some of Bolivia\'s busiest cocaine laboratories by night. In San Pedro, cocaine--'Bolivian marching powder'--makes life bearable. Even the prison cat is addicted.<br/><br/>Yet Marching Powder is also the tale of friendship, a place where horror is countered by humor and cruelty and compassion can inhabit the same cell. This is cutting-edge travel-writing and a fascinating account of infiltration into the South American drug culture.', 'language": "fr", "image": "https://images.isbndb.com/covers/03/47/9780312330347.jpg", "title_long": "La Mort Des Justes Ou Manière De Bien Mourir, À L"usage De Ceux Qui Sont Privés Des Secours Des Pasteurs, Ou Manuel Des Malades... (French Edition)", 'edition": "1st", "dimensions": "Height: 9.21 Inches, Length: 6.14 Inches, Weight: 0.7495716908 Pounds, Width: 0.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.14}, "width": {"unit": "inches", "value": 0.5}, "weight": {"unit": "pounds", "value": 0.7495716908}, "height": {"unit": "inches", "value": 9.21}}, "pages": 238, "date_published": "2018-08-08", "subjects": ["History'], 'authors": ["Jean La Placette'], 'title": "La Mort Des Justes Ou Manière De Bien Mourir, À L"usage De Ceux Qui Sont Privés Des Secours Des Pasteurs, Ou Manuel Des Malades... (French Edition)", 'isbn13": "9780312330347", "msrp": 19.99, "binding": "Paperback", "isbn": "0312330340", "isbn10": "0312330340", "other_isbns": [{'isbn": "9781466817326", "binding": "printisbncanonical"}]}}