{"book": {"publisher": "Picador", "synopsis": "A stunning tour of China, its people, and its history. Chosen as one of the best travel books of 1996 by the New York Times Book Review.<br/><br/>Rising in the mountains of the Tibetan border, the Yangtze River, the symbolic heart of China pierces 3,900 miles of rugged country before debouching into the oily swells of the East China Sea. Connecting China"s heartland cities with the volatile coastal giant, Shanghai, it has also historically connected China to the outside world through its nearly one thousand miles of navigable waters. To travel those waters is to travel back in history, to sense the soul of China, and Simon Winchester takes us along with him as he encounters the essence of China--its history and politics, its geography and climate as well as engage in its culture, and its people in remote and almost inaccessible places.<br/><br/>The River at the Center of the World is travel writing at its best: lively, informative, and thoroughly enchanting.", "language": "en", "image": "https://images.isbndb.com/covers/33/77/9780312423377.jpg", "title_long": "The River at the Center of the World: A Journey Up the Yangtze, and Back in Chinese Time", "edition": "Second Edition, Revised", "dimensions": "Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.75 Pounds, Width: 0.96 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.96}, "weight": {"unit": "pounds", "value": 0.75}, "height": {"unit": "inches", "value": 8.5}}, "pages": 432, "date_published": "2004-04-01", "subjects": ["Reference', 'Writing, Research & Publishing Guides', 'Writing', 'Romance', 'Historical', 'Victorian', 'Travel', 'Asia', 'China', 'Travel Writing'], 'authors": ["Simon Winchester'], 'title": "The River at the Center of the World: A Journey Up the Yangtze, and Back in Chinese Time", "isbn13": "9780312423377", "msrp": 19, "binding": "Paperback", "isbn": "0312423373", "isbn10": "0312423373", "other_isbns": [{'isbn": "9781466867499", "binding": "printisbncanonical"}]}}