{"book": {"publisher": "St. Martin"s Press", "synopsis": "As Kurt Vonnegut once said, “True terror is to wake up one morning and discover that your high school class is running the country.”<br/><br/>When it comes down to it, workæwith its know-it-alls, gossips, and brown-nosersæis a lot like high school. This clever and useful book helps readers identify and better communicate with these and other common types we all remember from the days when report cards, not business reports, were our concern, and when the big social event was the prom, not the company picnic.<br/><br/>You don’t need to dig out your yearbook to get a glimpse of these typesæjust take a look around your office: the Teacher’s Pet, the Player, the Cheerleader, the Go-Getter, the Underachiever, the Class Clown, and many more.<br/><br/>With wit and uncanny accuracy, corporate coaches Wilma Davidson and Jack Dougherty outline all the members of the “class,” offering tips on working efficiently with each type, whether they’re your boss, your client, or a colleague. The book also delivers advice on handling authority, conformity, looks, popularity, “sex education,” and other indignities from high school that live on in the workplace.<br/><br/>Whether you’re still the same as you were in high school, a combination of types, or a reformed Rebel turned Class President, you will delight in and learn from this unique guide.", "language": "en", "image": "https://images.isbndb.com/covers/70/89/9780312317089.jpg", "title_long": "Most Likely to Succeed at Work: How Work Is Just Like High School -- Crib Notes for Getting Along and Getting Ahead Amidst Bullies, Teachers\" Pets, Cheerleaders, and Other Members of the "Class'', 'edition": "First Edition", "dimensions": "Height: 8.62 Inches, Length: 5.74 Inches, Weight: 0.85 Pounds, Width: 0.9 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.74}, "width": {"unit": "inches", "value": 0.9}, "weight": {"unit": "pounds", "value": 0.85}, "height": {"unit": "inches", "value": 8.62}}, "pages": 224, "date_published": "2003-06-05", "subjects": ["Business & Money', 'Processes & Infrastructure', 'Skills', 'Communications'], 'authors": ["Wilma Davidson', 'Jack Dougherty'], 'title": "Most Likely to Succeed at Work: How Work Is Just Like High School -- Crib Notes for Getting Along and Getting Ahead Amidst Bullies, Teachers\" Pets, Cheerleaders, and Other Members of the "Class'', 'isbn13": "9780312317089", "msrp": 24.95, "binding": "Hardcover", "isbn": "0312317085", "isbn10": "0312317085", "other_isbns": [{'isbn": "9781429972703", "binding": "printisbncanonical"}]}}