{"book": {"publisher": "Picador", "synopsis": "Vivid, harrowing yet ultimately hopeful, The World Made Straight is Ron Rash\"s subtlest exploration yet of the painful conflict between the bonds of home and the desire for independence.<br/><br/>NOW A MAJOR MOTION PICTURE STARRING NOAH WYLE, JEREMY IRVINE, MINKA KELLY, ADELAIDE CLEMENS, STEVE EARLE, AND HALEY JOEL OSMENT.<br/><br/>"ONE OF THE MAJOR WRITERS OF OUR TIME."―THE ATLANTA JOURNAL-CONSTITUTION<br/><br/>Travis Shelton is seventeen the summer he wanders into the woods onto private property outside his North Carolina hometown, discovers a grove of marijuana large enough to make him some serious money, and steps into the jaws of a bear trap. After hours of passing in and out of consciousness, Travis is discovered by Carlton Toomey, the wise and vicious farmer who set the trap to protect his plants, and Travis\'s confrontation with the subtle evils within his rural world has begun.<br/><br/>Before long, Travis has moved out of his parents\' home to live with Leonard Shuler, a one-time schoolteacher who lost his job and custody of his daughter years ago, when he was framed by a vindictive student. Now Leonard lives with his dogs and his sometime girlfriend in a run-down trailer outside town, deals a few drugs, and studies journals from the Civil War. Travis becomes his student, of sorts, and the fate of these two outsiders becomes increasingly entwined as the community\'s terrible past and corrupt present bear down on each of them from every direction, leading to a violent reckoning―not only with Toomey, but with the legacy of the Civil War massacre that, even after a century, continues to divide an Appalachian community.', 'language": "en", "image": "https://images.isbndb.com/covers/66/06/9780312426606.jpg", "title_long": "The World Made Straight: A Novel", "edition": "First Edition", "dimensions": "Height: 8.1999836 Inches, Length: 5.5 Inches, Weight: 0.6 Pounds, Width: 0.8499983 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.8499983}, "weight": {"unit": "pounds", "value": 0.6}, "height": {"unit": "inches", "value": 8.1999836}}, "pages": 304, "date_published": "2007-03-20", "subjects": ["Literature & Fiction', 'Genre Fiction', 'War', 'United States', 'Southern', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Ron Rash'], 'title": "The World Made Straight: A Novel", "isbn13": "9780312426606", "msrp": 17, "binding": "Paperback", "isbn": "0312426607", "isbn10": "0312426607", "other_isbns": [{'isbn": "9781429900850", "binding": "print"}]}}