{"book": {"publisher": "St. Martin"s True Crime", "synopsis": "The victim was shot through the heart--but no bullet was ever found.<br/>In a case full of baffling twists, a gunshot wound to the heart leads to a brilliant investigator to one conclusion: a bullet designed to disappear...<br/><br/>The skin was peeled from the victim"s hands<br/>A beautiful woman almost gets away with murder because her victim cannot be identified. Then a forensic scientist leads police to the peeled skin from two boiled hands--and the fingerprints that will crack the case.<br/><br/>The murder weapon was smashed to smithereens<br/>A man was killed by a blow from a bottle. Now, determined investigator carefully puts the pieces of glass back together to catch a kiler--and to carry out a crime of his own...<br/><br/>What the corpse revealed<br/>Once detectives solved crimes with shoe leather and a gun. Now they use DNA samples, blood splatters, microbes and psychological profilings. This extraordinary book, through details drawn from some of the most baffling cases of the last fifty years, shows how a new generation fo real-life crime busters is catching stalkers, poisoners, mass murderers, and assassins--through the astounding art of forensic science.", 'language": "en", "image": "https://images.isbndb.com/covers/57/39/9780312975739.jpg", "title_long": "What the Corpse Revealed", "edition": "First Edition", "dimensions": "Height: 6.7 Inches, Length: 4.26 Inches, Weight: 0.4 Pounds, Width: 0.885 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.26}, "width": {"unit": "inches", "value": 0.885}, "weight": {"unit": "pounds", "value": 0.4}, "height": {"unit": "inches", "value": 6.7}}, "pages": 320, "date_published": "2000-12-15", "subjects": ["Biographies & Memoirs', 'True Crime', 'Murder & Mayhem'], 'authors": ["Hugh Miller'], 'title": "What the Corpse Revealed", "isbn13": "9780312975739", "msrp": 6.99, 'binding": "Mass Market Paperback", "isbn": "0312975732", "isbn10": "0312975732"}}