{"book": {"publisher": "Little, Brown and Company", "synopsis": "Alex Cross was a rising star in the Washington, DC, Police Department when an unknown shooter gunned down his wife, Maria, in front of him. Alex"s need for vengeance was placed on hold as he faced another huge challenge-raising his children without their mother.<br/><br/>Years later Alex is making a bold move in his life. He has left the FBI and set up practice as a psychologist once again. His life with Nana Mama, Damon, Jannie, and little Alex finally feels like it"s in order. He even has a chance at a new love.<br/><br/>Then Cross"s former partner, John Sampson, calls in a favor. He is tracking a serial rapist in Georgetown, one whose brutal modus operandi includes threatening his victims with terrifying photos. Cross and Sampson need the testimonies of these women to stop the predator, but the rape victims refuse to reveal anything about their attacker.<br/><br/>When the case triggers a connection to Maria's death, Alex may have a chance to catch his wife's murderer after all these years. Is this a chance for justice at long last? Or the culminating scene in his own deadly obsession?', 'language": "en", "image": "https://images.isbndb.com/covers/97/91/9780316159791.jpg", "title_long": "Cross", "edition": "1", "dimensions": "Height: 9.5 Inches, Length: 6.75 Inches, Weight: 1.35 Pounds, Width: 1.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.75}, "width": {"unit": "inches", "value": 1.5}, "weight": {"unit": "pounds", "value": 1.35}, "height": {"unit": "inches", "value": 9.5}}, "pages": 393, "date_published": "2006-11-13", "subjects": ["Literature & Fiction', 'Action & Adventure', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Police Procedurals', 'Thrillers & Suspense', 'Suspense'], 'authors": ["James Patterson'], 'title": "Cross", "isbn13": "9780316159791", "msrp": 27.99, "binding": "Hardcover", "related": {"ePub": "145554518X"}, "isbn": "0316159794", "isbn10": "0316159794", "other_isbns": [{'isbn": "9780759569744", "binding": "saleableprint"}, {"isbn": "9781455545186", "binding": "print"}]}}