{"book": {"publisher": "New Riders Pub", "synopsis": "Five years and more than 100,000 copies after it was first published, it\"s hard to imagine anyone working in Web design who hasn\"t read Steve Krug\"s 'instant classic' on Web usability, but people are still discovering it every day. In this second edition, Steve adds three new chapters in the same style as the original: wry and entertaining, yet loaded with insights and practical advice for novice and veteran alike. Don\'t be surprised if it completely changes the way you think about Web design. With these three new chapters:<br/>Usability as common courtesy -- Why people really leave Web sites Web Accessibility, CSS, and you -- Making sites usable and accessible Help! My boss wants me to ______. -- Surviving executive design whims<br/>'I thought usability was the enemy of design until I read the first edition of this book. Don\'t Make Me Think! showed me how to put myself in the position of the person who uses my site. After reading it over a couple of hours and putting its ideas to work for the past five years, I can say it has done more to improve my abilities as a Web designer than any other book.<br/><br/>In this second edition, Steve Krug adds essential ammunition for those whose bosses, clients, stakeholders, and marketing managers insist on doing the wrong thing. If you design, write, program, own, or manage Web sites, you must read this book.' -- Jeffrey Zeldman, author of Designing with Web Standards', 'language": "en", "image": "https://images.isbndb.com/covers/47/55/9780321344755.jpg", "title_long": "Don"t Make Me Think: A Common Sense Approach to Web Usability, 2nd Edition", 'edition": "2nd", "dimensions": "Height: 9 Inches, Length: 7 Inches, Weight: 1.04499112188 Pounds, Width: 0.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7}, "width": {"unit": "inches", "value": 0.5}, "weight": {"unit": "pounds", "value": 1.04499112188}, "height": {"unit": "inches", "value": 9}}, "pages": 201, "date_published": "2005", "subjects": ["Computers & Technology', 'Web Development & Design', 'User Experience & Usability', 'Internet & Social Media', 'Self Service', 'Custom Stores', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Steve Krug'], 'title": "Don"t Make Me Think: A Common Sense Approach to Web Usability, 2nd Edition", 'isbn13": "9780321344755", "msrp": 40, 'binding": "Paperback", "isbn": "0321344758", "isbn10": "0321344758"}}