{"book": {"publisher": "Heinemann", "synopsis": "Improving your high school doesn"t only mean raising test scores―it means creating a school where authentic teaching and learning happens. In Ohio, George Wood coordinated an effort by staff, faculty, and parents to transform a struggling school into a nationally recognized symbol of educational excellence, and now he shares with you how he―and other reformers―have created lasting, effective changes in the ways their schools do business.<br/>But more than one school"s story, Time to Learn uses the story of Federal Hocking High School"s metamorphosis as a case study for understanding the mechanisms of high-quality high school reform. Wood opens by defining successful reform as graduating students who are active, engaged members of both their high school and their local communities. But far from a book of abstract ideas about how to reach that goal, Time to Learn zeroes in on the nitty-gritty details behind any successful school-restructuring effort. Wood identifies common and seemingly unsolvable hurdles like scheduling, the time crunch, and class size, offering proven strategies for coping with the crucial everyday issues that can derail genuine improvement. Equally important, he shares practical techniques for dealing with external pressures like standards and testing while maintaining your commitment to student-centered practices.<br/>Whether you are a school administrator, a teacher, or a small-school advocate in a rural, suburban, or urban district, find time for Time to Learn. Its plans, resources, ideas, and inspiring stories will show you how can restructure your high school to work for every student.', 'language": "en", "image": "https://images.isbndb.com/covers/80/80/9780325008080.jpg", "title_long": "Time to Learn, Second Edition: How to Create High Schools That Serve All Students", "edition": "2", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 0.73 Pounds, Width: 0.48 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 0.48}, "weight": {"unit": "pounds", "value": 0.73}, "height": {"unit": "inches", "value": 9}}, "pages": 240, "date_published": "2005-08-25", "subjects": ["Education & Teaching', 'Schools & Teaching', 'Instruction Methods', 'Certification & Development', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["George Wood'], 'title": "Time to Learn, Second Edition: How to Create High Schools That Serve All Students", "isbn13": "9780325008080", "msrp": 37.15, 'binding": "Paperback", "isbn": "0325008086", "isbn10": "0325008086"}}