{"book": {"publisher": "Pan MacMillan", "synopsis": "MARCHING POWDER is the story of Thomas McFadden, a small-time English drug smuggler who was arrested in Bolivia and thrown inside the notorious San Pedro prison. He found himself in a bizarre world, the prison reflecting all that is wrong with South American society. Prisoners have to pay an entrance fee and buy their own cells (the alternative is to sleep outside and die of exposure), prisoners` wives and children often live inside too, high quality cocaine is manufactured and sold from the prison.<br/>Thomas ended up making a living by giving backpackers tours of the prison - he became a fixture on the backpacking circuit and was named in the Lonely Planet guide to Bolivia. When he was told that for a bribe of $5000 his sentence could be overturned, it was the many backpackers who`d passed through who sent him the money. Sometimes shocking, sometimes funny, MARCHING POWDER is an always riveting story of survival.<br/>‘All the staples of the prison memoir are here: sadistic guards, an attempted break-out, the terrors of solitary confinement, the joys of freedom... The result is a truly gripping piece of testimony’ Sunday Telegraph<br/>‘This exotic, cautionary yarn opens the abyss beneath our wealthy world’ Uncut", "language": "en", "image": "https://images.isbndb.com/covers/95/81/9780330419581.jpg", "title_long": "Marching Powder", "edition": "New Ed", "dimensions": "Height: 7.76 Inches, Length: 5.12 Inches, Weight: 0.66359140862 Pounds, Width: 0.96 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.12}, "width": {"unit": "inches", "value": 0.96}, "weight": {"unit": "pounds", "value": 0.66359140862}, "height": {"unit": "inches", "value": 7.76}}, "pages": 320, "date_published": "2004-07", "subjects": ["Biographies & Memoirs', 'True Crime', 'Crime & Criminal Biographies', 'Travel', 'South America', 'General'], 'authors": ["Rusty Young'], 'title": "Marching Powder", "isbn13": "9780330419581", "msrp": 8.12, 'binding": "Paperback", "isbn": "0330419587", "isbn10": "0330419587"}}