{"book": {"publisher": "Random House Worlds", "synopsis": "In his hugely influential and tempestuous career, Robert E. Howard created the genre that came to be known as sword and sorcery—and brought to life one of fantasy’s boldest and most enduring figures: Conan the Cimmerian—reaver, slayer, barbarian, king.<br/><br/>“Stories such as ‘The People of the Black Circle’ glow with the fierce and eldritch light of [Howard’s] frenzied intensity.”—Stephen King<br/><br/>This lavishly illustrated volume gathers together three of Howard’s longest and most famous Conan stories–two of them printed for the first time directly from Howard’ s typescript–along with a collection of the author’s previously unpublished and rarely seen outlines, notes, and drafts. Longtime fans and new readers alike will agree that The Bloody Crown of Conan merits a place of honor on every fantasy lover’s bookshelf.<br/><br/>THE PEOPLE OF THE BLACK CIRCLE<br/>Amid the towering crags of Vendhya, in the shadowy citadel of the Black Circle, Yasmina of the golden throne seeks vengeance against the Black Seers. Her only ally is also her most formidable enemy–Conan, the outlaw chief.<br/><br/>THE HOUR OF THE DRAGON<br/>Toppled from the throne of Aquilonia by the evil machinations of an undead wizard, Conan must find the fabled jewel known as the Heart of Ahriman to reclaim his crown . . . and save his life.<br/><br/>A WITCH SHALL BE BORN<br/>A malevolent witch of evil beauty. An enslaved queen. A kingdom in the iron grip of ruthless mercenaries. And Conan, who plots deadly vengeance against the human wolf who left him in the desert to die.", "language": "en", "image": "https://images.isbndb.com/covers/15/20/9780345461520.jpg", "title_long": "The Bloody Crown of Conan (Conan of Cimmeria, Book 2)", "edition": "1", "dimensions": "Height: 9.22 Inches, Length: 6.09 Inches, Weight: 1.21 Pounds, Width: 0.73 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.09}, "width": {"unit": "inches", "value": 0.73}, "weight": {"unit": "pounds", "value": 1.21}, "height": {"unit": "inches", "value": 9.22}}, "pages": 384, "date_published": "2004-11-23", "subjects": ["Comics & Graphic Novels', 'Graphic Novels', 'Literature & Fiction', 'Genre Fiction', 'Action & Adventure', 'Fantasy', 'Classics', 'United States', 'Science Fiction & Fantasy', 'Epic', 'Sword & Sorcery'], 'authors": ["Robert E. Howard'], 'title": "The Bloody Crown of Conan (Conan of Cimmeria, Book 2)", "isbn13": "9780345461520", "msrp": 16.36, "binding": "Paperback", "related": {"Kindle Edition": "0345480783", "ePub": "0345480783"}, "isbn": "0345461525", "isbn10": "0345461525", "other_isbns": [{'isbn": "9780345480781", "binding": "printisbn"}]}}