{"book": {"publisher": "Random House Worlds", "synopsis": "“For headling, nonstop adventure and for vivid, even florid, scenery, no one even comes close to Howard.”—Harry Turtledove<br/><br/>In a meteoric career that covered only a dozen years, Robert E. Howard defined the sword-and-sorcery genre. In doing so, he brought to life the archetypal adventurer known to millions around the world as Conan the barbarian.<br/><br/>Witness, then, Howard at his finest, and Conan at his most savage, in the latest volume featuring the collected works of Robert E. Howard, lavishly illustrated by award-winning artist Greg Manchess. Prepared directly from the earliest known versions—often Howard’s own manuscripts—are such sword-and-sorcery classics as “The Servants of Bit-Yakin” (formerly published as “Jewels of Gwahlur”), “Beyond the Black River,” “The Black Stranger,” “Man-Eaters of Zamboula” (formerly published as “Shadows in Zamboula”), and, perhaps his most famous adventure of all, “Red Nails.”<br/><br/>The Conquering Sword of Conan includes never-before-published outlines, notes, and story drafts, plus a new introduction, personal correspondence, and the revealing essay “Hyborian Genesis”—which chronicles the history of the creation of the Conan series. Truly, this is heroic fantasy at its finest.", "language": "en", "image": "https://images.isbndb.com/covers/15/37/9780345461537.jpg", "title_long": "The Conquering Sword of Conan (Conan of Cimmeria, Book 3)", "dimensions": "Height: 9.2 Inches, Length: 6.1 Inches, Weight: 1.275 Pounds, Width: 1.12 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.1}, "width": {"unit": "inches", "value": 1.12}, "weight": {"unit": "pounds", "value": 1.275}, "height": {"unit": "inches", "value": 9.2}}, "pages": 416, "date_published": "2005-11-29", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Action & Adventure', 'Fantasy', 'Classics', 'United States', 'Science Fiction & Fantasy', 'Epic', 'Sword & Sorcery'], 'authors": ["Robert E. Howard'], 'title": "The Conquering Sword of Conan (Conan of Cimmeria, Book 3)", "isbn13": "9780345461537", "msrp": 16.36, "binding": "Paperback", "related": {"Kindle Edition": "0345486056", "ePub": "0345486056"}, "isbn": "0345461533", "isbn10": "0345461533", "other_isbns": [{'isbn": "9780345486059", "binding": "printisbn"}]}}