{"book": {"publisher": "Del Rey", "synopsis": "Ever since his classic debut, The Tar-Aiym Krang, the first of the wildly successful Pip and Flinx adventures, New York Times bestselling author Alan Dean Foster has captivated readers around the world. Now this writer of bold imagination and stunning originality has created an electrifying space epic set in a universe at once strangely familiar and starkly terrifying. Familiar because the universe is ours; terrifying because the human condition might soon be. . . .<br/><br/>Not so long ago Marcus Walker was just another young commodities trader in Chicago, working hard and playing harder. But that’s all in the past, part of a life half forgotten—a reality that vanished when he was attacked while camping and tossed aboard a starship bound for deep space.<br/><br/>Desperately, Walker searches for explanations, only to realize he’s trapped in a horrifying nightmare that is all too real. Instead of being a rich hotshot at the top of the food chain, Walker discovers he’s just another amusing novelty, part of a cargo of “cute” aliens from primitive planets—destined to be sold as pets to highly advanced populations in “civilized” regions of the galaxy.<br/><br/>Even if he weren’t constantly watched by his captors, Walker has few options. After all, there is no escape from a speeding starship. Another man might resign himself to the inevitable and hope to be sold to a kindly owner, but not Walker. This former college football star has plenty of American ingenuity and no intention of admitting defeat, now or ever. In fact, he’s only just begun to fight.<br/><br/>The adventure will continue with two more novels", "language": "en", "image": "https://images.isbndb.com/covers/12/78/9780345461278.jpg", "title_long": "Lost and Found: A Novel (The Taken Trilogy)", "edition": "Reprint", "dimensions": "Height: 6.79 Inches, Length: 4.19 Inches, Weight: 0.27 Pounds, Width: 0.55 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 4.19}, "width": {"unit": "inches", "value": 0.55}, "weight": {"unit": "pounds", "value": 0.27}, "height": {"unit": "inches", "value": 6.79}}, "pages": 256, "date_published": "2005-05-31", "subjects": ["Literature & Fiction', 'Humor & Satire', 'Satire', 'Humorous', 'Science Fiction & Fantasy', 'Science Fiction', 'Adventure', 'Short Stories', 'Space Opera'], 'authors": ["Alan Dean Foster'], 'title": "Lost and Found: A Novel (The Taken Trilogy)", "isbn13": "9780345461278", "msrp": 7.99, 'binding": "Mass Market Paperback", "isbn": "0345461274", "isbn10": "0345461274"}}