{"book": {"publisher": "Ballantine Books", "synopsis": "Until I Find You is the story of the actor Jack Burns – his life, loves, celebrity and astonishing search for the truth about his parents.<br/><br/>When he is four years old, Jack travels with his mother Alice, a tattoo artist, to several North Sea ports in search of his father, William Burns. From Copenhagen to Amsterdam, William, a brilliant church organist and profligate womanizer, is always a step ahead – has always just departed in a wave of scandal, with a new tattoo somewhere on his body from a local master or “scratcher.”<br/><br/>Alice and Jack abandon their quest, and Jack is educated at schools in Canada and New England – including, tellingly, a girls’ school in Toronto. His real education consists of his relationships with older women – from Emma Oastler, who initiates him into erotic life, to the girls of St. Hilda’s, with whom he first appears on stage, to the abusive Mrs. Machado, whom he first meets when sent to learn wrestling at a local gym.<br/><br/>Too much happens in this expansive, eventful novel to possibly summarize it all. Emma and Jack move to Los Angeles, where Emma becomes a successful novelist and Jack a promising actor. A host of eccentric minor characters memorably come and go, including Jack’s hilariously confused teacher the Wurtz; Michelle Maher, the girlfriend he will never forget; and a precocious child Jack finds in the back of an Audi in a restaurant parking lot. We learn about tattoo addiction and movie cross-dressing, “sleeping in the needles” and the cure for cauliflower ears. And John Irving renders his protagonist’s unusual rise through Hollywood with the same vivid detail and range of emotions he gives to the organ music Jack hears as a child in European churches. This is an absorbing and moving book about obsession and loss, truth and storytelling, the signs we carry on us and inside us, the traces we can’t get rid of.<br/><br/>Jack has always lived in the shadow of his absent father. But as he grows older – and when his mother dies – he starts to doubt the portrait of his father’s character she painted for him when he was a child. This is the cue for a second journey around Europe in search of his father, from Edinburgh to Switzerland, towards a conclusion of great emotional force.<br/><br/>A melancholy tale of deception, Until I Find Youis also a swaggering comic novel, a giant tapestry of life’s hopes. It is a masterpiece to compare with John Irving’s great novels, and restates the author’s claim to be considered the most glorious, comic, moving novelist at work today.", "language": "en", "image": "https://images.isbndb.com/covers/97/23/9780345479723.jpg", "title_long": "Until I Find You", "edition": "Reprint", "dimensions": "Height: 7.98 Inches, Length: 5.26 Inches, Weight: 1.3125 Pounds, Width: 1.49 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.26}, "width": {"unit": "inches", "value": 1.49}, "weight": {"unit": "pounds", "value": 1.3125}, "height": {"unit": "inches", "value": 7.98}}, "pages": 848, "date_published": "2006-05-30", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Family Saga', 'Family Life', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["John Irving'], 'title": "Until I Find You", "isbn13": "9780345479723", "msrp": 18, 'binding": "Paperback", "isbn": "0345479726", "isbn10": "0345479726"}}