{"book": {"publisher": "Del Rey", "synopsis": "The first three Malloreon books appear in a single volume, taking us on an epic quest across strange lands among gods, kings, sorcerers, and ordinary men. It is a gripping tale of two ancient warring destinies fighting a battle of good against evil.<br/><br/>Garion has slain the evil God Torak and is now the King of Riva. The prophecy has been fulfilled—or so it seems. For there is a dire warning, as a great evil brews in the East. Now Garion once again finds himself with the fate of the world resting on his shoulders. When Garion’s infant son is kidnapped by Zandramas, the Child of Dark, a great quest begins to rescue the child. Among those on the dangerous mission are Garion and his wife, Queen Ce’ Nedra, and the immortal Belgarath the Sorcerer and his daughter, Polgara. They must make their way through the foul swamps of Nyissa, then into the lands of the Murgos. Along the way, they will face grave dangers—captivity, a horde of demons, a fatal plague—while Zandramas plots to use Garion’s son in a chilling ritual that will make the Dark Prophecy supreme. . .", "language": "en", "image": "https://images.isbndb.com/covers/38/67/9780345483867.jpg", "title_long": "The Malloreon, Vol. 1 (Books 1-3): Guardians of the West, King of the Murgos, Demon Lord of Karanda", "edition": "Illustrated", "dimensions": "Height: 9.2 Inches, Length: 6.06 Inches, Weight: 1.63803460666 Pounds, Width: 1.32 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.06}, "width": {"unit": "inches", "value": 1.32}, "weight": {"unit": "pounds", "value": 1.63803460666}, "height": {"unit": "inches", "value": 9.2}}, "pages": 816, "date_published": "2005-08-30", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Action & Adventure', 'Fantasy', 'Science Fiction & Fantasy', 'Anthologies', 'Epic', 'Science Fiction'], 'authors": ["David Eddings'], 'title": "The Malloreon, Vol. 1 (Books 1-3): Guardians of the West, King of the Murgos, Demon Lord of Karanda", "isbn13": "9780345483867", "msrp": 20, 'binding": "Paperback", "isbn": "0345483863", "isbn10": "0345483863"}}