{"book": {"publisher": "Del Rey", "synopsis": "From bestselling author Alan Dean Foster comes a fantastic Pip and Flinx adventure starring a certain twenty-four-year-old redhead with emerald eyes and uncanny abilities and his devoted mini-dragon protector. Time and again, the daring pair have braved countless dangers to emerge victorious. But now Flinx attempts something that may be impossible for the heretofore undefeated hero. His mission: to take a vacation.<br/><br/>Never have the cares of the universe lain so heavily on Flinx’s shoulders, nor the forces arrayed against him seemed so invincible. Pursued by a newly revealed sect of doomsday fanatics, hunted by factions inside and outside the Commonwealth for transgressions real and imagined, expected to single-handedly avert a looming galactic crisis (or bear responsibility for the consequences), Flinx can be forgiven for feeling a slight touch of melancholy.<br/><br/>There’s only one solution for what ails Flinx, according to his ship’s AI. But taking time off is tricky business. With an increasing number of enemies chasing him with ever-greater enthusiasm, Flinx must find a getaway shrouded in obscurity. Jast, a planet smack in the middle of nowhere, is the perfect locale.<br/><br/>Yet even in a place where hardly anyone’s ever seen a human, Flinx and trouble can’t stay separated for long. Unfortunately, Flinx hasn’t a clue that his vacation paradise is in reality a danger zone of the highest magnitude. And by the time he learns the truth, it may be too late.", "language": "en", "image": "https://images.isbndb.com/covers/15/82/9780345461582.jpg", "title_long": "Sliding Scales (A Pip & Flinx Adventure)", "edition": "Reprint", "dimensions": "Height: 6.8 Inches, Length: 4.2 Inches, Weight: 0.3 Pounds, Width: 0.6 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 4.2}, "width": {"unit": "inches", "value": 0.6}, "weight": {"unit": "pounds", "value": 0.3}, "height": {"unit": "inches", "value": 6.8}}, "pages": 288, "date_published": "2005-09-27", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Action & Adventure', 'Mystery, Thriller & Suspense', 'Science Fiction & Fantasy', 'Science Fiction', 'Adventure', 'Space Opera', 'First Contact', 'Galactic Empire', 'Humorous'], 'authors": ["Alan Dean Foster'], 'title": "Sliding Scales (A Pip & Flinx Adventure)", "isbn13": "9780345461582", "msrp": 6.99, 'binding": "Mass Market Paperback", "isbn": "0345461584", "isbn10": "0345461584"}}