{"book": {"publisher": "Del Rey", "synopsis": "From the beat-up landspeeders that whisk travelers between desert towns on Tatooine to Jabba the Hutt’s luxurious sail barge and the elegant Naboo Royal Starship, the vehicles and vessels in the Star Wars universe have captivated millions of delighted fans.<br/><br/>In light of the ever-expanding saga, the New Essential Guide to Vehicles and Vessels features completely updated entries that cover more than 150 ships, along with brand new, full-color illustrations by dazzling artist Ian Fullwood. This new volume encompasses craft from all five movies, the bestselling novels of the New Jedi Order, comics, TV specials, and games. Inside you will find:<br/><br/>• Detailed profiles and vital statistics for each vessel, including data covering the vehicle’s construction, size, maximum speed, and its role in Star Wars history<br/>• A revealing Layman’s Guide to Technology, covering common terms applied to each class of vehicle<br/>• An outline of engine technologies that drive the craft across the Star Wars galaxy, and of the unique weapons they boast<br/>• Schematics for each vehicle, providing the reader with instant visual reference<br/><br/>Discover the modifications Han Solo and Chewbacca made on the Millennium Falcon to make it one of the fastest vessels in the galaxy; the secrets of the Imperial All Terrain Armored Transport Walker, possibly the most formidable military vehicle ever assembled; the reasons the Tribubble Bongo Sub is the chosen way to navigate the watery depths of Naboo; and the unique and lethal properties of the Yuuzhan Vong’s living starship, the Coralskipper.<br/><br/>Skiffs, cargo haulers, shuttles, podracers, gunships, sandcrawlers– if it flies, glides, drives, or speeds in the Star Wars galaxy, you’ll find it in The New Essential Guide to Vehicle and Vessels!", "language": "en", "image": "https://images.isbndb.com/covers/90/23/9780345449023.jpg", "title_long": "The New Essential Guide to Vehicles and Vessels (Star Wars)", "edition": "Subsequent", "dimensions": "Height: 11 inches, Length: 8.5 inches, Weight: 0.82 Pounds, Width: 0.75 inches", "dimensions_structured": {'length": {"unit": "inches", "value": 8.5}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 0.82}, "height": {"unit": "inches", "value": 11}}, "pages": 224, "date_published": "2003-09-30", "subjects": ["Arts & Photography', 'Performing Arts', 'Humor & Entertainment', 'Movies', 'Reference', 'Video', 'Science Fiction & Fantasy', 'Science Fiction', 'Space Opera'], 'authors": ["Haden Blackman'], 'title": "The New Essential Guide to Vehicles and Vessels (Star Wars)", "isbn13": "9780345449023", "msrp": 30, 'binding": "Paperback", "isbn": "0345449029", "isbn10": "0345449029"}}