{"book": {"publisher": "Del Rey", "synopsis": "The extraordinary history of Middle-earth, edited by Christopher Tolkien<br/><br/>The Book of Lost Tales stands at the beginning of the entire conception of Middle-earth and Valinor. Embedded in English legend and English association, they were set in the narrative frame of a great westward voyage over the Ocean by a mariner named Eriol (or Ælfwine) to Tol Eressëa, the Lonely Isle, where Elves dwelt; from them he learned their true history, the Lost Tales of Elfinesse. In the Tales are found the earliest accounts and original ideas of Gods and Elves; Dwarves and Orcs; the Silmarils and the Two Trees of Valinor; Nargothrond and Gondolin; and the geography and cosmology of the invented world.<br/><br/>Praise for Book of Lost Tales 1<br/><br/>“In these tales we have the scholar joyously gamboling in the thickets of his imagination. . . . A commentary and notes greatly enrich the quest.”—The Daily Telegraph<br/><br/>“Affords us an almost over-the-shoulder view into the evolving creative process and genius of J.R.R. Tolkien in a new, exciting aspect . . .The superb, sensitive, and extremely helpful commentary and editing done by Christopher Tolkien make all of this possible.”—Mythlore", "language": "en", "image": "https://images.isbndb.com/covers/52/16/9780345375216.jpg", "title_long": "The Book of Lost Tales 1(The History of Middle-Earth, Vol. 1)", "edition": "Reprint", "dimensions": "Height: 6.8 Inches, Length: 4.12 Inches, Weight: 0.425 Pounds, Width: 0.9 inches", "dimensions_structured": {'length": {"unit": "inches", "value": 4.12}, "width": {"unit": "inches", "value": 0.9}, "weight": {"unit": "pounds", "value": 0.425}, "height": {"unit": "inches", "value": 6.8}}, "pages": 344, "date_published": "1992-06", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Short Stories & Anthologies', 'Anthologies', 'Action & Adventure', 'Fantasy', 'Literary', 'Science Fiction & Fantasy', 'Epic', 'Sword & Sorcery', 'Science Fiction', 'History & Criticism'], 'authors": ["J.R.R. Tolkien'], 'title": "The Book of Lost Tales 1(The History of Middle-Earth, Vol. 1)", "isbn13": "9780345375216", "msrp": 7.99, 'binding": "Mass Market Paperback", "isbn": "0345375211", "isbn10": "0345375211"}}