{"book": {"publisher": "Random House Publishing Group", "synopsis": "The memoir of a young American soldier who became the most powerful man in a remote rural district of Vietnam<br/><br/>In the spring of 1969, First Lieutenant David Donovan arrived in the Mekong Delta of South Vietnam to work as military advisor with village chiefs and local militia to win the war. But as he was the highest-ranking person in the entire district, his life there was far more complex than anyone could have imagined.<br/><br/>This is Donovan’s gripping account of combat missions and night ambushes in the swamps and jungles of the Delta; his heartrending tale of personal involvement with the culture and families in his charge; his humane introspection on his awesome responsibility as both warrior and king; and his stark reflections on the changes he saw in himself and his country upon his return to the United States.<br/><br/>“Donovan’s memoir . . . provides valuable documentation on a relatively obscure part of the American military effort—it describes how the war really worked on the front line of ‘Vietnamization,’ the training of local militia. His reflections on his own use of power raise serious and important questions about the American expierence in Vietnam.”—The New York Times Book Review", "language": "en", "image": "https://images.isbndb.com/covers/90/75/9780345479075.jpg", "title_long": "Once a Warrior King: Memories of an Officer in Vietnam", "dimensions": "Height: 8.5 Inches, Length: 5.5 Inches, Weight: 1.02 Pounds, Width: 0.88 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.88}, "weight": {"unit": "pounds", "value": 1.02}, "height": {"unit": "inches", "value": 8.5}}, "pages": 352, "date_published": "1986-07-12", "subjects": ["Biographies & Memoirs', 'Historical', 'Asia', 'Leaders & Notable People', 'Military', 'Memoirs', 'History', 'Southeast Asia', 'Vietnam War', 'World'], 'authors": ["David Donovan'], 'title": "Once a Warrior King: Memories of an Officer in Vietnam", "isbn13": "9780345479075", "msrp": 19, 'binding": "Paperback", "isbn": "0345479076", "isbn10": "0345479076"}}