{"book": {"publisher": "Del Rey", "synopsis": "In Changelings, bestselling authors Anne McCaffrey and Elizabeth Ann Scarborough returned to the sentient planet Petaybee with a story of growth and transformation in the face of deadly new threats. The telepathic, shapeshifting twins Murel and Ronan found that Petaybee had plans for them as well. Now those plans begin to bear fruit with fresh possibilities . . . and dangers.<br/><br/>MAELSTROM<br/><br/>Now that Petaybee is forming a new equatorial island, the planet has agreed to harbor a group of new refugees, workers indentured to the powerful InterGal Corporation. But the mission to collect the immigrants becomes a rescue operation when it is revealed that InterGal is doing nothing to help these survivors of a world devastated by a meteor shower. Murel and Ronan set out to persuade the frightened refugees to come out of hiding, leave their world, and bring along their sacred totem animals, the gifted sea turtles called the Honus. But the twins discover that they’ve taken on more than they expected: The Honus are not the only animals sacred to the refugees. There are also the Manos, intelligent sharks who have lost none of their predatory habits–and who cannot be left behind to die.<br/><br/>When the Manos are released into Petaybee’s waters, a tragic misunderstanding endangers the whole resettlement operation. At the same time, the mysterious sea otters who once rescued the twins’ father are suddenly revealed to be much more than they appear to be.<br/><br/>Now it is up to Ronan and Murel, with the intrepid assistance of their river otter friend Sky, to smooth the waters before a maelstrom of revenge destroys Petaybee’s harmonious way of life.<br/><br/>But even as the twins uncover startling new facts about Petaybee’s past that will change everything they thought they knew about the planet, the forces of InterGal are gathering, preparing to strike. . . .", "language": "en", "image": "https://images.isbndb.com/covers/00/41/9780345470041.jpg", "title_long": "Maelstrom (The Twins of Petaybee, Book 2)", "edition": "First Edition", "dimensions": "Height: 9.75 Inches, Length: 7 Inches, Weight: 1.15 Pounds, Width: 1 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 7}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 1.15}, "height": {"unit": "inches", "value": 9.75}}, "pages": 256, "date_published": "2006-12-26", "subjects": ["Science Fiction & Fantasy', 'Science Fiction'], 'authors": ["Anne McCaffrey', 'Elizabeth Ann Scarborough'], 'title": "Maelstrom (The Twins of Petaybee, Book 2)", "isbn13": "9780345470041", "msrp": 23.95, "binding": "Hardcover", "related": {"ePub": "0345497368"}, "isbn": "0345470044", "isbn10": "0345470044", "other_isbns": [{'isbn": "9780345497369", "binding": "printisbn"}]}}