{"book": {"publisher": "Ballantine Books", "synopsis": "What happens when the most beautiful girl in the world marries the handsomest prince of all time and he turns out to be...well...a lot less than the man of her dreams?<br/><br/>As a boy, William Goldman claims, he loved to hear his father read the "S. Morgenstern classic, The Princess Bride. But as a grown-up he discovered that the boring parts were left out of good old Dad\"s recitation, and only the "good parts' reached his ears.<br/><br/>Now Goldman does Dad one better. He\'s reconstructed the 'Good Parts Version' to delight wise kids and wide-eyed grownups everywhere.<br/><br/>What\'s it about? Fencing. Fighting. True Love. Strong Hate. Harsh Revenge. A Few Giants. Lots of Bad Men. Lots of Good Men. Five or Six Beautiful Women. Beasties Monstrous and Gentle. Some Swell Escapes and Captures. Death, Lies, Truth, Miracles, and a Little Sex.<br/><br/>In short, it\'s about everything.<br/><br/>Eventually to be adapted for the silver screen, THE PRINCESS BRIDE was originally a beautifully simple, insightfully comic story of what happens when the most beautiful girl in the world marries the handsomest prince in the world--and he turnsout to be a son of a bitch. Guaranteed to entertain both young and old alike by combining scenes of rowsing fantasy with hilarious reality, THE PRINCESS BRIDE secures Goldman\'s place as a master storyteller.<br/><br/>From the Paperback edition.', 'language": "en", "image": "https://images.isbndb.com/covers/82/65/9780345418265.jpg", "title_long": "The Princess Bride (Ballantine Reader"s Circle)", 'edition": "Anniversary", "dimensions": "Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.85 Pounds, Width: 1.25 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 1.25}, "weight": {"unit": "pounds", "value": 0.85}, "height": {"unit": "inches", "value": 8.25}}, "pages": 429, "date_published": "2003-07-15", "subjects": ["Science Fiction & Fantasy', 'Fantasy', 'Historical'], 'authors": ["William Goldman'], 'title": "The Princess Bride (Ballantine Reader"s Circle)", 'isbn13": "9780345418265", "msrp": 14.95, 'binding": "Paperback", "isbn": "0345418263", "isbn10": "0345418263"}}