{"book": {"publisher": "LucasBooks", "synopsis": "The turning point for the entire Star Wars saga is at hand<br/><br/>After years of civil war, the Separatists have battered the already faltering Republic nearly to the point of collapse. On Coruscant, the Senate watches anxiously as Supreme Chancellor Palpatine aggressively strips away more and more constitutional liberties in the name of safeguarding the Republic. Yoda, Mace Windu, and their fellow Masters grapple with the Chancellor’s disturbing move to assume control of the Jedi Council. And Anakin Skywalker, the prophesied Chosen One, destined to bring balance to the Force, is increasingly consumed by his fear that his secret love, Senator Padmé Amidala, will die.<br/><br/>As the combat escalates across the galaxy, the stage is set for an explosive endgame: Obi-Wan undertakes a perilous mission to destroy the dreaded Separatist military leader General Grievous. Palpatine, eager to secure even greater control, subtly influences public opinion to turn against the Jedi. And a conflicted Anakin–tormented by unspeakable visions–edges dangerously closer to the brink of a galaxy-shaping decision. It remains only for Darth Sidious, whose shadow looms ever larger, to strike the final staggering blow against the Republic . . . and to ordain a fearsome new Sith Lord: Darth Vader.<br/><br/>Based on the screenplay of the eagerly anticipated final film in George Lucas’s epic saga, bestselling Star Wars author Matthew Stover’s novel crackles with action, captures the iconic characters in all their complexity, and brings a space opera masterpiece full circle in stunning style.", "language": "en", "image": "https://images.isbndb.com/covers/88/37/9780345428837.jpg", "title_long": "Star Wars, Episode III - Revenge of the Sith", "edition": "First Edition", "dimensions": "Height: 9.4 Inches, Length: 6.4 Inches, Weight: 3.55 Pounds, Width: 1.7 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.4}, "width": {"unit": "inches", "value": 1.7}, "weight": {"unit": "pounds", "value": 3.55}, "height": {"unit": "inches", "value": 9.4}}, "pages": 432, "date_published": "2005-04-02", "subjects": ["Literature & Fiction', 'Action & Adventure', 'United States', 'Science Fiction & Fantasy', 'Science Fiction', 'Adventure', 'Space Opera'], 'authors": ["MATTHEW STOVER'], 'title": "Star Wars, Episode III - Revenge of the Sith", "isbn13": "9780345428837", "msrp": 25.95, 'binding": "Hardcover", "isbn": "0345428838", "isbn10": "0345428838"}}