{"book": {"publisher": "Ballantine Books", "synopsis": "In the late twentieth century, fundamentalism has emerged as one of the most powerful forces at work in the world, contesting the dominance of modern secular values and threatening peace and harmony around the globe. Yet it remains incomprehensible to a large number of people. In The Battle for God, Karen Armstrong brilliantly and sympathetically shows us how and why fundamentalist groups came into existence and what they yearn to accomplish.<br/><br/>We see the West in the sixteenth century beginning to create an entirely new kind of civilization, which brought in its wake change in every aspect of life -- often painful and violent, even if liberating. Armstrong argues that one of the things that changed most was religion. People could no longer think about or experience the divine in the same way; they had to develop new forms of faith to fit their new circumstances.<br/><br/>Armstrong characterizes fundamentalism as one of these new ways of being religious that have emerged in every major faith tradition. Focusing on Protestant fundamentalism in the United States, Jewish fundamentalism in Israel, and Muslim fundamentalism in Egypt and Iran, she examines the ways in which these movements, while not monolithic, have each sprung from a dread of modernity -- often in response to assault (sometimes unwitting, sometimes intentional) by the mainstream society.<br/><br/>Armstrong sees fundamentalist groups as complex, innovative, and modern -- rather than as throwbacks to the past -- but contends that they have failed in religious terms. Maintaining that fundamentalism often exists in symbiotic relationship with an aggressive modernity, each impelling the other on to greater excess, she suggests compassion as a way to defuse what is now an intensifying conflict.<br/><br/>BONUS: This edition contains an excerpt from Karen Armstrong"s Twelve Steps to a Compassionate Life.", "language": "en", "image": "https://images.isbndb.com/covers/16/98/9780345391698.jpg", "title_long": "The Battle for God", "edition": "1", "dimensions": "Height: 8.2 Inches, Length: 5.5 Inches, Weight: 0.85 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 0.85}, "height": {"unit": "inches", "value": 8.2}}, "pages": 480, "date_published": "2001-01-30", "subjects": ["Christian Books & Bibles', 'Theology', 'Fundamentalism', 'History', 'World', 'Religious', 'Reference', 'Encyclopedias & Subject Guides', 'Mythology & Folklore', 'Religion', 'Religion & Spirituality', 'Islam', 'Judaism', 'Religious Studies', 'Comparative Religion', 'Psychology & Christianity', 'Medical Books', 'Psychology', 'General'], 'authors": ["Karen Armstrong'], 'title": "The Battle for God", "isbn13": "9780345391698", "msrp": 18, "binding": "Paperback", "related": {"Kindle Edition": "0307798607", "ePub": "0307798607"}, "isbn": "0345391691", "isbn10": "0345391691", "other_isbns": [{'isbn": "9780307798602", "binding": "printisbn"}]}}