{"book": {"publisher": "Ballantine Books", "synopsis": "From the inimitable Anne Tyler, a rich and compelling novel about a mismatched marriage—and its consequences, spanning three generations.<br/><br/>They seemed like the perfect couple—young, good-looking, made for each other. The moment Pauline, a stranger to the Polish Eastern Avenue neighborhood of Baltimore (though she lived only twenty minutes away), walked into his mother’s grocery store, Michael was smitten. And in the heat of World War II fervor, they are propelled into a hasty wedding. But they never should have married.<br/><br/>Pauline, impulsive, impractical, tumbles hit-or-miss through life; Michael, plodding, cautious, judgmental, proceeds deliberately. While other young marrieds, equally ignorant at the start, seemed to grow more seasoned, Pauline and Michael remain amateurs. In time their foolish quarrels take their toll. Even when they find themselves, almost thirty years later, loving, instant parents to a little grandson named Pagan, whom they rescue from Haight-Ashbury, they still cannot bridge their deep-rooted differences. Flighty Pauline clings to the notion that the rifts can always be patched. To the unyielding Michael, they become unbearable.<br/><br/>From the sound of the cash register in the old grocery to the counterculture jargon of the sixties, from the miniskirts to the multilayered apparel of later years, Anne Tyler captures the evocative nuances of everyday life during these decades with such telling precision that every page brings smiles of recognition. Throughout, as each of the competing voices bears witness, we are drawn ever more fully into the complex entanglements of family life in this wise, embracing, and deeply perceptive novel.", "language": "en", "image": "https://images.isbndb.com/covers/24/58/9780345472458.jpg", "title_long": "The Amateur Marriage: A Novel", "edition": "Reprint", "dimensions": "Height: 6.88 Inches, Length: 4.19 Inches, Weight: 0.3675 Pounds, Width: 0.95 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 4.19}, "width": {"unit": "inches", "value": 0.95}, "weight": {"unit": "pounds", "value": 0.3675}, "height": {"unit": "inches", "value": 6.88}}, "pages": 352, "date_published": "2006-01-31", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'Family Life', 'Psychological', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Anne Tyler'], 'title": "The Amateur Marriage: A Novel", "isbn13": "9780345472458", "msrp": 7.99, 'binding": "Mass Market Paperback", "isbn": "0345472454", "isbn10": "0345472454"}}