{"book": {"publisher": "Ballantine Books", "synopsis": "Good news! Fannie’s back in town—and the town is among the leading characters in her new novel.<br/><br/>Along with Neighbor Dorothy, the lady with the smile in her voice, whose daily radio broadcasts keep us delightfully informed on all the local news, we also meet Bobby, her ten-year-old son, destined to live a thousand lives, most of them in his imagination; Norma and Macky Warren and their ninety-eight-year-old Aunt Elner; the oddly sexy and charismatic Hamm Sparks, who starts off in life as a tractor salesman and ends up selling himself to the whole state and almost the entire country; and the two women who love him as differently as night and day. Then there is Tot Whooten, the beautician whose luck is as bad as her hairdressing skills; Beatrice Woods, the Little Blind Songbird; Cecil Figgs, the Funeral King; and the fabulous Minnie Oatman, lead vocalist of the Oatman Family Gospel Singers.<br/><br/>The time is 1946 until the present. The town is Elmwood Springs, Missouri, right in the middle of the country, in the midst of the mostly joyous transition from war to peace, aiming toward a dizzyingly bright future.<br/><br/>Once again, Fannie Flagg gives us a story of richly human characters, the saving graces of the once-maligned middle classes and small-town life, and the daily contest between laughter and tears. Fannie truly writes from the heartland, and her storytelling is, to quote Time, "utterly irresistible."", 'language": "en", "image": "https://images.isbndb.com/covers/28/87/9780345452887.jpg", "title_long": "Standing in the Rainbow: A Novel (Elmwood Springs)", "edition": "Later Printing", "dimensions": "Height: 7.99 Inches, Length: 5.18 Inches, Weight: 0.9 Pounds, Width: 1.12 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.18}, "width": {"unit": "inches", "value": 1.12}, "weight": {"unit": "pounds", "value": 0.9}, "height": {"unit": "inches", "value": 7.99}}, "pages": 560, "date_published": "2004-08-03", "subjects": ["Literature & Fiction', 'Dramas & Plays', 'Comedy', 'United States', 'Humor', 'Humor & Satire', 'Humorous', 'Contemporary', 'Self Service', 'Custom Stores'], 'authors": ["Fannie Flagg'], 'title": "Standing in the Rainbow: A Novel (Elmwood Springs)", "isbn13": "9780345452887", "msrp": 17, "binding": "Paperback", "related": {"ePub": "0345478630"}, "isbn": "0345452887", "isbn10": "0345452887", "other_isbns": [{'isbn": "9780345478634", "binding": "printisbn"}]}}