{"book": {"publisher": "Presidio Press", "synopsis": "PULITZER PRIZE WINNER • “A brilliant piece of military history which proves up to the hilt the force of Winston Churchill’s statement that the first month of World War I was ‘a drama never surpassed.’”—Newsweek<br/><br/>Selected by the Modern Library as one of the 100 best nonfiction books of all time<br/><br/>In this landmark account, renowned historian Barbara W. Tuchman re-creates the first month of World War I: thirty days in the summer of 1914 that determined the course of the conflict, the century, and ultimately our present world. Beginning with the funeral of Edward VII, Tuchman traces each step that led to the inevitable clash. And inevitable it was, with all sides plotting their war for a generation. Dizzyingly comprehensive and spectacularly portrayed with her famous talent for evoking the characters of the war’s key players, Tuchman’s magnum opus is a classic for the ages.<br/><br/>The Proud Tower, the Pulitzer Prize–winning The Guns of August, and The Zimmermann Telegram comprise Barbara W. Tuchman’s classic histories of the First World War era", "language": "en", "image": "https://images.isbndb.com/covers/60/98/9780345476098.jpg", "title_long": "The Guns of August: The Pulitzer Prize-Winning Classic About the Outbreak of World War I", "edition": "Reprint", "dimensions": "Height: 6.9 Inches, Length: 4.15 Inches, Weight: 0.68 Pounds, Width: 1 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 4.15}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 0.68}, "height": {"unit": "inches", "value": 6.9}}, "pages": 640, "date_published": "2004-08-03", "subjects": ["History', 'Historical Study & Educational Resources', 'Military', 'World War I', 'World', 'Reference', 'Encyclopedias & Subject Guides'], 'authors": ["Barbara W. Tuchman'], 'title": "The Guns of August: The Pulitzer Prize-Winning Classic About the Outbreak of World War I", "isbn13": "9780345476098", "msrp": 8.99, 'binding": "Mass Market Paperback", "isbn": "0345476093", "isbn10": "0345476093"}}