{"book": {"publisher": "Random House Worlds", "synopsis": "A must-have for Star Wars fans—the definitive behind-the-scenes history of the classic film that started it all<br/><br/>After the 1973 success of American Graffiti, filmmaker George Lucas made the fateful decision to pursue a longtime dream project: a space fantasy movie unlike any ever produced. Lucas envisioned a swashbuckling SF saga inspired by the Flash Gordon serials classic American westerns, the epic cinema of Japanese auteur Akira Kurosawa, and mythological heroes. Its original title: The Star Wars. The rest is history, and how it was made is a story as entertaining and exciting as the movie that has enthralled millions for thirty years–a story that has never been told as it was meant to be. Until now.<br/><br/>Using his unprecedented access to the Lucasfilm Archives and its trove of never-before-published “lost” interviews, photos, production notes, factoids, and anecdotes, Star Wars scholar J. W. Rinzler hurtles readers back in time for a one-of-a-kind behind-the-scenes look at the nearly decade-long quest of George Lucas and his key collaborators to make the “little” movie that became a phenomenon. For the first time, it’s all here:<br/><br/>• the evolution of the now-classic story and characters–including “Annikin Starkiller” and “a huge green-skinned monster with no nose and large gills” named Han Solo<br/>• excerpts from George Lucas’s numerous, ever-morphing script drafts<br/>• the birth of Industrial Light & Magic, the special-effects company that revolutionized Hollywood filmmaking<br/>• the studio-hopping and budget battles that nearly scuttled the entire project<br/>• the director’s early casting saga, which might have led to a film spoken mostly in Japanese–including the intensive auditions that won the cast members their roles and made them legends<br/>• the grueling, nearly catastrophic location shoot in Tunisia and the subsequent breakneck dash at Elstree Studios in London<br/>• the who’s who of young film rebels who pitched in to help–including Francis Ford Coppola, Steven Spielberg, and Brian DePalma<br/><br/>But perhaps most exciting, and rarest of all, are the interviews conducted before and during production and immediately after the release of Star Wars–in which George Lucas, Mark Hamill, Harrison Ford, Carrie Fisher, Sir Alec Guinness, Anthony Daniels, composer John Williams, effects masters Dennis Muren, Richard Edlund, and John Dykstra, Phil Tippett, Rick Baker, legendary production designer John Barry, and a host of others share their fascinating tales from the trenches and candid opinions of the film that would ultimately change their lives.<br/><br/>No matter how you view the spectrum of this thirty-year phenomenon, The Making of Star Wars stands as a crucial document–rich in fascination and revelation–of a genuine cinematic and cultural touchstone.", "language": "en", "image": "https://images.isbndb.com/covers/47/64/9780345494764.jpg", "title_long": "The Making of Star Wars: The Definitive Story Behind the Original Film", "edition": "NO-VALUE", "dimensions": "Height: 10.66 Inches, Length: 11.75 Inches, Weight: 5.06181353552 Pounds, Width: 1.26 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 11.75}, "width": {"unit": "inches", "value": 1.26}, "weight": {"unit": "pounds", "value": 5.06181353552}, "height": {"unit": "inches", "value": 10.66}}, "pages": 372, "date_published": "2007-04-24", "subjects": ["Arts & Photography', 'Performing Arts', 'Reference', 'Humor & Entertainment', 'Movies', 'Direction & Production', 'History & Criticism', 'Video', 'History', 'Europe', 'Great Britain', 'Writing, Research & Publishing Guides', 'Writing', 'Self Service', 'Custom Stores'], 'authors": ["J.W. Rinzler'], 'title": "The Making of Star Wars: The Definitive Story Behind the Original Film", "isbn13": "9780345494764", "msrp": 85, 'binding": "Hardcover", "isbn": "0345494768", "isbn10": "0345494768"}}