{"book": {"publisher": "Ballantine Books", "synopsis": "“The more you transform your life from the material to the spiritual domain, the less you become afraid of death.” Leo Tolstoy spoke these words, and they became Henry Stuart’s raison d’etre. The Poet of Tolstoy Park is the unforgettable novel based on the true story of Henry Stuart’s life, which was reclaimed from his doctor’s belief that he would not live another year.<br/><br/>Henry responds to the news by slogging home barefoot in the rain. It’s 1925. The place: Canyon County, Idaho. Henry is sixty-seven, a retired professor and a widower who has been told a warmer climate would make the end more tolerable. San Diego would be a good choice.<br/><br/>Instead, Henry chose Fairhope, Alabama, a town with utopian ideals and a haven for strong-minded individualists. Upton Sinclair, Sherwood Anderson, and Clarence Darrow were among its inhabitants. Henry bought his own ten acres of piney woods outside Fairhope. Before dying, underscored by the writings of his beloved Tolstoy, Henry could begin to “perfect the soul awarded him” and rest in the faith that he, and all people, would succeed, “even if it took eons.” Human existence, Henry believed, continues in a perfect circle unmarred by flaws of personality, irrespective of blood and possessions and rank, and separate from organized religion. In Alabama, until his final breath, he would chase these high ideas.<br/><br/>But first, Henry had to answer up for leaving Idaho. Henry’s dearest friend and intellectual sparring partner, Pastor Will Webb, and Henry’s two adult sons, Thomas and Harvey, were baffled and angry that he would abandon them and move to the Deep South, living in a barn there while he built a round house of handmade concrete blocks. His new neighbors were perplexed by his eccentric behavior as well. On the coldest day of winter he was barefoot, a philosopher and poet with ideas and words to share with anyone who would listen. And, mysteriously, his “last few months” became years. He had gone looking for a place to learn lessons in dying, and, studiously advanced to claim a vigorous new life.<br/><br/>The Poet of Tolstoy Park is a moving and irresistible story, a guidebook of the mind and spirit that lays hold of the heart. Henry Stuart points the way through life’s puzzles for all of us, becoming in this timeless tale a character of such dimension that he seems more alive now than ever.", "language": "en", "image": "https://images.isbndb.com/covers/63/26/9780345476326.jpg", "title_long": "The Poet of Tolstoy Park: A Novel (Reader"s Circle)", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.16 Inches, Weight: 0.6 Pounds, Width: 0.69 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.16}, "width": {"unit": "inches", "value": 0.69}, "weight": {"unit": "pounds", "value": 0.6}, "height": {"unit": "inches", "value": 8}}, "pages": 304, "date_published": "2006-03-28", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'Biographical', 'Psychological', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Sonny Brewer'], 'title": "The Poet of Tolstoy Park: A Novel (Reader"s Circle)", 'isbn13": "9780345476326", "msrp": 17, 'binding": "Paperback", "isbn": "0345476328", "isbn10": "0345476328"}}