{"book": {"publisher": "Del Rey", "synopsis": "An absorbing collection of stories, poems, and commentaries by the author of The Hobbit and The Lord of the Rings<br/><br/>Renowned around the world as the author of The Hobbit and The Lord of the Rings, J.R.R. Tolkien was also a distinguished academic and professor whose writings and lectures expand beyond the scope of his beloved Middle-earth. From short stories of fantastical adventures to essays on imagination and the narrative form, The Tolkien Reader gathers some of these fascinating and hard-to-find works into one volume.<br/><br/>Tree and Leaf: Professor Tolkien’s now-famous essay “On Fairy-stories” and the short story “Leaf by Niggle” examine and illustrate the form and treatment of fantasy narratives.<br/><br/>The Homecoming of Beorhtnoth Beorhthelm’s Son: A short play inspired by The Battle of Malden, an Old English poem with no ending and no beginning that describes a historical tenth-century battle between the English and Viking invaders.<br/><br/>Farmer Giles of Ham: An imaginative history of the distant past that follows the unheroic Farmer Giles as he attempts to capture a somewhat untrustworthy dragon.<br/><br/>The Adventures of Tom Bombadil: A delightful collection of verse in praise of Tom Bombadil, staunch friend of the hobbits in The Lord of the Rings.", "language": "en", "image": "https://images.isbndb.com/covers/50/66/9780345345066.jpg", "title_long": "The Tolkien Reader", "edition": "Reprint", "dimensions": "Height: 6.85 Inches, Length: 4.15 Inches, Weight: 0.3125 Pounds, Width: 0.7 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 4.15}, "width": {"unit": "inches", "value": 0.7}, "weight": {"unit": "pounds", "value": 0.3125}, "height": {"unit": "inches", "value": 6.85}}, "pages": 272, "date_published": "1986-11-12", "subjects": ["Literature & Fiction', 'Poetry', 'Themes & Styles', 'Short Stories & Anthologies', 'Anthologies', 'Science Fiction & Fantasy', 'Fantasy', 'Epic', 'Historical', 'Sword & Sorcery'], 'authors": ["J.R.R. Tolkien'], 'title": "The Tolkien Reader", "isbn13": "9780345345066", "msrp": 6.93, 'binding": "Mass Market Paperback", "isbn": "0345345061", "isbn10": "0345345061"}}