{"book": {"publisher": "Ballantine Books", "synopsis": ""The meaning of The Vampire Chronicles is still unfolding for me, and is as much connected to God as to the Devil, as much connected to pleasure as to pain. That the books are entertainment seems a given, and for that I\"m grateful. That they can be seen as a religious journey is also clear. I am immersed in the questions, and praying for the answers. Lestat, c\"est moi. I want you to love all of my characters. I am, in the writing of these and other novels, as ambitious as Dickens. I want everybody to cry when Claudia dies, just like they did for Little Nell.'<br/><br/>-- Anne Rice<br/><br/>February 8, 1995<br/><br/>Interview with the Vampire. The Vampire Lestat. The Queen of the Damned. The Talc of the Body Thief Memnoch the Devil. With her bestselling, epic saga, Anne Rice has reinvented the legend and literature of one of fiction\'s most popular and captivating archetypes. Now, Katherine Ramsland, Anne Rice\'s biographer, has completely revised and updated the ultimate reference guide to the world, history, and adventures of these haunting characters, from the unforgettable Lestat to Rice\'s newest chilling creation, Memnoch the Devil.<br/><br/>Written with the full cooperation of Anne Rice -- and now with more than 1,200 entries -- The Vampire Companion offers an insightful exploration, appreciation, and interpretation of all the characters and events, names and places, symbols and themes in the five volumes of The Vampire Chronicles, including more than one hundred pages of new entries on Rice\'s latest vampire novel, Memnoch the Devil. Everything that readers might want to explore further is annotated and analyzed in this entertaining and enlightening work: the unforgettable characters of Louis, Lestat, Claudia, Akasha, Armand, and Memnoch; the important points of interest on Lestat\'s fascinating tour through Heaven and Hell; ancient lore; Rice\'s unique contributions to the mythos of vampires; the literary inspirations that echo through the novels; Rice\'s own reflections and revelations about her work and about the movie Interview with the Vampire; and much more.<br/><br/>Richly illustrated with new photos, drawings, maps, and a complete time line of events in The Chronicles, The Vampire Companion is as captivating as the phenomenal saga it explores. It is a guidebook that no visitor to the world of Anne Rice should be without.', 'language": "en", "image": "https://images.isbndb.com/covers/73/93/9780345397393.jpg", "title_long": "The Vampire Companion: The Official Guide to Anne Rice"s The Vampire Chronicles", 'edition": "Revised, Updated, Subsequent", "dimensions": "Height: 9.25 Inches, Length: 7.25 Inches, Weight: 1.8 Pounds, Width: 1.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.25}, "width": {"unit": "inches", "value": 1.5}, "weight": {"unit": "pounds", "value": 1.8}, "height": {"unit": "inches", "value": 9.25}}, "pages": 608, "date_published": "1995-08-01", "subjects": ["Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Movements & Periods', 'Genres & Styles', 'Reference', 'Science Fiction & Fantasy', 'Science Fiction', 'Self Service', 'Custom Stores'], 'authors": ["Katherine Ramsland', 'Anne Rice'], 'title": "The Vampire Companion: The Official Guide to Anne Rice"s The Vampire Chronicles", 'isbn13": "9780345397393", "msrp": 18.95, 'binding": "Paperback", "isbn": "0345397398", "isbn10": "0345397398"}}