{"book": {"publisher": "Ballantine Books", "synopsis": "“Huston writes dialogue so combustible it could fuel a bus and characters crazy enough to take it on the road.”—The New York Times Book Review<br/><br/>Reluctant hitman Henry Thompson has fallen on hard times. His grip on life is disintegrating, his pistol hand shaking, his body pinned to his living room couch by painkillers–and his boss, Russian mobster David Dolokhov, isn’t happy about any of it. So Henry is surprised when he’s handed a new assignment: keep tabs on a minor league baseball star named Miguel Arenas.<br/><br/>Henry has no pity for the slugger and the wicked gambling problem that got him in trouble, but he can’t help liking the guy. After all, Henry used to be just like him: a natural-born ball player with a bright future. But hell, that was long ago. Before Henry did some guy a favor and ended up running for his life. Before his girlfriend and buddies got gunned down by someone on his tail. Before he agreed to buy his parents’ safety with a life of violence.<br/><br/>And when Miguel gets drafted by the Mets and is sent to the Brooklyn Cyclones, Henry must head back to New York, back to the place where all his problems began—and where Henry might find a real reason to keep living, a reason that may just cost him his life.<br/><br/>Praise for A Dangerous Man<br/><br/>“Among the new voices in twenty-first-century crime fiction, Charlie Huston . . . is where it’s at.”—The Washington Post<br/><br/>“Huston reminds me of all my favorite writers–Pete Dexter, Robert Stone, Crumley. If there is such a thing as compassionate noir, Charlie has found it. He’s a true marvel.”—Ken Bruen, author of The Guards<br/><br/>“Charlie Huston is the real deal.”—Peter Straub", "language": "en", "image": "https://images.isbndb.com/covers/13/37/9780345481337.jpg", "title_long": "A Dangerous Man: A Novel (Henry Thompson)", "dimensions": "Height: 8 Inches, Length: 5.2 Inches, Weight: 0.5621787681 Pounds, Width: 0.68 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 0.68}, "weight": {"unit": "pounds", "value": 0.5621787681}, "height": {"unit": "inches", "value": 8}}, "pages": 286, "date_published": "2006-09-19", "subjects": ["Literature & Fiction', 'Genre Fiction', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Hard-Boiled', 'Thrillers & Suspense', 'Suspense', 'Crime', 'Self Service', 'Custom Stores'], 'authors": ["Charlie Huston'], 'title": "A Dangerous Man: A Novel (Henry Thompson)", "isbn13": "9780345481337", "msrp": 13.51, "binding": "Paperback", "related": {"Kindle Edition": "0345495659", "ePub": "0345495659"}, "isbn": "034548133X", "isbn10": "034548133X", "other_isbns": [{'isbn": "9780345495655", "binding": "printisbn"}]}}