{"book": {"publisher": "Ballantine Books", "synopsis": "On the day she turned seventy-seven, internationally acclaimed mystery writer P. D. James embarked on an endeavor unlike any other in her distinguished career: she decided to write a personal memoir in the form of a diary. Over the course of a year she set down not only the events and impressions of her extraordinarily active life, but also the memories, joys, discoveries, and crises of a lifetime. This enchantingly original volume is the result.<br/><br/>Time to Be in Earnest offers an intimate portrait of one of most accomplished women of our time. Here are vivid, revealing accounts of her school days in Cambridge in the 1920s and \"30s, her happy marriage and the tragedy of her husband\"s mental illness, and the thrill of publishing her first novel, Cover Her Face, in 1962. As she recounts the decades of her exceptional life, James holds forth with wit and candor on such diverse subjects as the evolution of the detective novel, her deep love of the English countryside, her views of author tours and television adaptations, and her life-long obsession with Jane Austen. Wise and frank, engaging and graceful, this "fragment of autobiography' will delight and surprise P. D. James\'s admirers the world over.', 'language": "en", "image": "https://images.isbndb.com/covers/21/23/9780345442123.jpg", "title_long": "Time to Be in Earnest: A Fragment of Autobiography", "edition": "First Ballantine Books Edition", "dimensions": "Height: 8.1 Inches, Length: 5.4 Inches, Weight: 0.625 Pounds, Width: 0.7 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.4}, "width": {"unit": "inches", "value": 0.7}, "weight": {"unit": "pounds", "value": 0.625}, "height": {"unit": "inches", "value": 8.1}}, "pages": 269, "date_published": "2001-02-27", "subjects": ["Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Community & Culture', 'Women', 'Memoirs', 'Literature & Fiction', 'Essays & Correspondence', 'Essays', 'Diaries & Journals', 'Reference', 'Writing, Research & Publishing Guides', 'Writing', 'Self Service', 'Custom Stores'], 'authors": ["P. D. James'], 'title": "Time to Be in Earnest: A Fragment of Autobiography", "isbn13": "9780345442123", "msrp": 17, "binding": "Paperback", "related": {"ePub": "0307417573"}, "isbn": "0345442121", "isbn10": "0345442121", "other_isbns": [{'isbn": "9780307417572", "binding": "printisbn"}]}}