{"book": {"publisher": "Ballantine Books", "synopsis": "I am Princess Meredith, heir to a throne of faerie. My day job, once upon a time, was as a private detective in Los Angeles. Unfortunately, princess has now become a full-time occupation.<br/><br/>My aunt, Queen Andais, will have it no other way. And so I am virtually a prisoner in faerie–trapped here with some of the realm’s most beautiful men to serve as my bodyguards . . . and my lovers. For I am compelled to conceive a child: an heir to succeed me on the throne. Yet after months of amazing sex with my consorts, there is still no baby. And no baby means no throne. The only certainty is death at the hands of my cousin Cel, or his followers, if I fail to conceive.<br/><br/>Now Mistral, Queen Andais’s new captain of the guard, has come to my bed–defying her and risking her terrible wrath in doing so. But even she will hesitate to punish him in jealous rage, because our joining has reawakened old magic, mystical power so ancient that no one stands against it and survives. Not even my strongest and most favored: my Darkness and my Killing Frost. Not even Mistral himself, my Storm Lord. But because Mistral has helped to bring this magic forth, he may live another day.<br/><br/>If I can reclaim control of the fey power that once was, there may be hope for me and my reign in faerie. I might yet quell the dark schemes and subterfuges surrounding me. Though shadows of obsession and conspiracy gather, I may survive.", "language": "en", "image": "https://images.isbndb.com/covers/35/88/9780345443588.jpg", "title_long": "Mistral"s Kiss (Meredith Gentry, Book 5)", "edition": "1st Edition, 1st Printing", "dimensions": "Height: 9.5 Inches, Length: 6.75 Inches, Weight: 1.1 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.75}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 1.1}, "height": {"unit": "inches", "value": 9.5}}, "pages": 224, "date_published": "2006-12-12", "subjects": ["Literature & Fiction', 'Romance', 'Fantasy', 'Science Fiction & Fantasy', 'Paranormal & Urban', 'Romantic'], 'authors": ["Laurell K. Hamilton'], 'title": "Mistral"s Kiss (Meredith Gentry, Book 5)", 'isbn13": "9780345443588", "msrp": "0.00", "binding": "Hardcover", "related": {"Kindle Edition": "0345495462", "ePub": "0345495462"}, "isbn": "0345443586", "isbn10": "0345443586", "other_isbns": [{'isbn": "9780345495464", "binding": "printisbn"}]}}