{"book": {"publisher": "Del Rey", "synopsis": "The return of a beloved classic, from the bestselling author of The Princess Bride!<br/><br/>“This inventive, offbeat fable has a touch of magic about it.”—Los Angeles Times<br/><br/>Once upon a time, the gondoliers of Venice possessed the finest voices in all the world. But, alas, few remember those days—and fewer still were ever blessed to hear such glorious singing.<br/><br/>No one since has discovered the secret behind the sudden silence of the golden-voiced gondoliers. No one, it seems, but S. Morgenstern. Now Morgenstern recounts the sad and noble story of the ambitions, frustrations, and eventual triumph of Luigi, the gondolier with the gooney smile.<br/><br/>Here, in this brilliantly illustrated exposition of the surprising facts behind this all-but-forgotten mystery, S. Morgenstern reveals the fascinating truths about John the Bastard, Laura Lorenzini, the centenarian Cristaldi the Pickle, Enrico Caruso, Porky XII, the Great Sorrento, the Queen of Corsica—and, of course, the one and only Luigi. His tale will captivate you as much as his song!<br/><br/>“Where The Princess Bride was lightheartedly brutal, this story is gently whimsical, well-complemented by Paul Giovanopoulos’s zany drawings.”—San Francisco Examiner-Chronicle", "language": "en", "image": "https://images.isbndb.com/covers/26/35/9780345442635.jpg", "title_long": "The Silent Gondoliers: A Novel", "edition": "NO-VALUE", "dimensions": "Height: 8.2 Inches, Length: 5.45 Inches, Weight: 0.2755778275 Pounds, Width: 0.37 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.45}, "width": {"unit": "inches", "value": 0.37}, "weight": {"unit": "pounds", "value": 0.2755778275}, "height": {"unit": "inches", "value": 8.2}}, "pages": 128, "date_published": "2001-01-02", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Mythology & Folk Tales', 'Folklore', 'Romance', 'Fantasy', 'Science Fiction & Fantasy', 'Humorous', 'Romantic'], 'authors": ["William Goldman'], 'title": "The Silent Gondoliers: A Novel", "isbn13": "9780345442635", "msrp": 8.13, 'binding": "Paperback", "isbn": "0345442636", "isbn10": "0345442636"}}