{"book": {"publisher": "Del Rey", "synopsis": "“A superb collection, a splendid and much-needed book. Anderson has cleared away the dross and shown us the golden roots of fantasy before it became a genre.”<br/>–Michael Moorcock, author of The Eternal Champion<br/><br/>Many of today’s top names in fantasy acknowledge J.R.R. Tolkien as the author whose work inspired them to create their own epics. But which writers influenced Tolkien himself? In a collection destined to become a classic in its own right, internationally recognized Tolkien expert Douglas A. Anderson, editor of The Annotated Hobbit, has gathered the fiction of the many gifted authors who sparked Tolkien’s imagination. Included are Andrew Lang’s romantic swashbuckler “The Story of Sigurd,” which features magic rings and a ferocious dragon; an excerpt from E. A. Wyke-Smith’s The Marvelous Land of Snergs, about creatures who were precursors to Tolkien’s hobbits; and a never-before-published gem by David Lindsay, author of A Voyage to Arcturus,a novel that Tolkien praised highly both as a thriller and as a work of philosophy, religion, and morality.<br/><br/>In stories packed with magical journeys, conflicted heroes, and terrible beasts, this extraordinary volume is one that no fan of fantasy or Tolkien should be without. These tales just might inspire a new generation of creative writers.", "language": "en", "image": "https://images.isbndb.com/covers/85/68/9780345458568.jpg", "title_long": "Tales Before Tolkien: The Roots of Modern Fantasy", "edition": "Reprint", "dimensions": "Height: 6.75 Inches, Length: 4 Inches, Weight: 0.55 Pounds, Width: 1.25 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 4}, "width": {"unit": "inches", "value": 1.25}, "weight": {"unit": "pounds", "value": 0.55}, "height": {"unit": "inches", "value": 6.75}}, "pages": 528, "date_published": "2005-11-29", "subjects": ["Literature & Fiction', 'Short Stories & Anthologies', 'Anthologies', 'United States', 'Science Fiction & Fantasy', 'Fantasy', 'Epic'], 'authors": [], "title": "Tales Before Tolkien: The Roots of Modern Fantasy", "isbn13": "9780345458568", "msrp": 7.99, 'binding": "Paperback", "isbn": "0345458567", "isbn10": "0345458567"}}