{"book": {"publisher": "Ballantine Books", "synopsis": "Essays on life that will resonate deeply as readers discover how universal insights can be found in ordinary events.<br/><br/>More than thirty years ago, Robert Fulghum published a simple credo—a credo that became the phenomenal #1 New York Times bestseller All I Really Need to Know I Learned in Kindergarten. Today, after being embraced around the world and selling more than seven million copies, Fulghum’s book retains the potency of a common though no less relevant piece of wisdom: that the most basic aspects of life bear its most important opportunities.<br/><br/>Here Fulghum engages us with musings on life, death, love, pain, joy, sorrow, and the best chicken-fried steak in the continental United States. The little seed in the Styrofoam cup offers a reminder about our own mortality and the delicate nature of life . . . a spider who catches (and loses) a full-grown woman in its web one fine morning teaches us about surviving catastrophe . . . the love story of Jean-Francois Pilatre and his hot-air balloon reminds us to be brave and unafraid to “fly” . . . life lessons hidden in the laundry pile . . . magical qualities found in a box of crayons . . . hide-and-seek vs. sardines—and how these games relate to the nature of God. All I Really Need to Know I Learned in Kindergarten is brimming with the very stuff of life and the significance found in the smallest details.<br/><br/>In the editions since the first publication of this book, Robert Fulghum has had some time to ponder, to reevaluate, and to reconsider, adding fresh thoughts on classic topics including a short new introduction.<br/><br/>Praise for All I Really Need to Know I Learned in Kindergarten<br/><br/>“A healthy antidote to the horrors that pummel us in this dicey age.”—Baltimore Sun<br/><br/>“Within simplicity lies the sublime.”—San Francisco Chronicle<br/><br/>“It is interesting how much of it applies not only to individuals, grown or small, but even to nations.”—New York Daily News<br/><br/>“As universal as fresh air and invigorating as the fragrance of a Douglas fir.”—Los Angeles Times", "language": "en", "image": "https://images.isbndb.com/covers/63/96/9780345466396.jpg", "title_long": "All I Really Need to Know I Learned in Kindergarten: Uncommon Thoughts", "edition": "15th Anniversary", "dimensions": "Weight: 0.45 Pounds", "dimensions_structured": {'weight": {"unit": "pounds", "value": 0.45}}, "pages": 221, "date_published": "2004", "subjects": ["Self-Help', 'Motivational', 'Personal Transformation', 'Self-Esteem', 'Success', 'Humor & Entertainment', 'Humor', 'Self-Help & Psychology', 'Health, Fitness & Dieting', 'Alternative Medicine', 'Meditation'], 'authors": ["Robert Fulghum'], 'title": "All I Really Need to Know I Learned in Kindergarten: Uncommon Thoughts", "isbn13": "9780345466396", "msrp": 12.98, "binding": "Paperback", "related": {"ePub": "0345479106"}, "isbn": "034546639X", "isbn10": "034546639X", "other_isbns": [{'isbn": "9780345479105", "binding": "printisbn"}]}}