{"book": {"publisher": "Presidio Press", "synopsis": "Each year, the Commandant of the U.S. Marine Corps selects one book that he believes is both relevant and timeless for reading by all Marines. The Commandant"s choice for 1993 was We Were Soldiers Once . . . and Young.<br/>In November 1965, some 450 men of the 1st Battalion, 7th Cavalry, under the command of Lt. Col. Hal Moore, were dropped by helicopter into a small clearing in the Ia Drang Valley. They were immediately surrounded by 2,000 North Vietnamese soldiers. Three days later, only two and a half miles away, a sister battalion was chopped to pieces. Together, these actions at the landing zones X-Ray and Albany constituted one of the most savage and significant battles of the Vietnam War.<br/>How these men persevered--sacrificed themselves for their comrades and never gave up--makes a vivid portrait of war at its most inspiring and devastating. General Moore and Joseph Galloway, the only journalist on the ground throughout the fighting, have interviewed hundreds of men who fought there, including the North Vietnamese commanders. This devastating account rises above the specific ordeal it chronicles to present a picture of men facing the ultimate challenge, dealing with it in ways they would have found unimaginable only a few hours earlier. It reveals to us, as rarely before, man"s most heroic and horrendous endeavor.", 'language": "en", "image": "https://images.isbndb.com/covers/58/17/9780345475817.jpg", "title_long": "We Were Soldiers Once...and Young: Ia Drang - The Battle That Changed the War in Vietnam", "edition": "Reprint", "dimensions": "Height: 9.2 Inches, Length: 6.1 Inches, Weight: 1.38 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.1}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 1.38}, "height": {"unit": "inches", "value": 9.2}}, "pages": 480, "date_published": "2004", "subjects": ["Biographies & Memoirs', 'Leaders & Notable People', 'Military', 'History', 'Americas', 'United States', 'Asia', 'Vietnam War', 'World'], 'authors": ["Harold G. Moore', 'Joseph L. Galloway'], 'title": "We Were Soldiers Once...and Young: Ia Drang - The Battle That Changed the War in Vietnam", "isbn13": "9780345475817", "msrp": 18, 'binding": "Paperback", "isbn": "034547581X", "isbn10": "034547581X"}}