{"book": {"publisher": "LucasBooks", "synopsis": "Never before has the incendiary mix of action, politics, and intrigue that has become Timothy Zahn’s trademark, been mmore evident that in this new Star Wars epic. On the heels of the stunning events chronicled in Star Wars: A New Hope, the newly minted heroes of the Rebellion–fledgling Jedi Luke Skywalker, smuggler turned reluctant freedom-fighter Han Solo, and Princess Leia Organa, a bold leader with a world to avenge–must face the harsh realities of the cataclysmic conflict into which they have so bravely plunged. From this point forward, legends will grow, treachery will abound, and lives will be irrevocably altered, in the long, hard fight to counter the fist of tyranny and restore hope to a galaxy too long in darkness.<br/><br/>The destruction of the Death Star by the Rebel Alliance was a decisive blow against the Empire, but Palpatine and his monstrous enforcer, Darth Vader, are no less of a threat. The brutal extermination of Alderaan not only demonstrated the magnitude of their murderous power, but served as a chilling testament to their resolve to crush the Rebel uprising. Standing against them, Skywalker, Solo, and the Princess remain uncertain opponents. Luke is gifted and brave, but unschooled in the power he possesses. Han has doubts about waging someone else’s war–and his contentiousness is one more burden for Leia to bear as she struggles to help keep the Rebellion alive. The three have been sent to mediate a dispute between Rebel Alliance factions in Shelsha Sector–agitating matters by forcing Han to deal not only with pirates, but with his more dreaded enemy, politics. At the same time, Mara Jade–all of eighteen and years away from her fateful meeting with Luke–is serving her evil master, Palpatine, well in her role as the Emperor’s Hand: tracking suspected treachery in the Empire to what may be high places–while trying to stay out of Darth Vader’s way.<br/><br/>But the Rebels will prove to be only one of the Empire’s concerns. For Imperial Stormtrooper Daric LaRone, his faith in the Empire shaken by the wanton destruction of Alderaan, will commit a sudden and violent act of defiance, and take four other enforcers with him, in a desperate bid to elude their masters’ wrath.<br/><br/>Each of these fateful actions, whether sanctioned, secret, or scandalous, will expose brutality and corruption, spur upheavals destined to shake the Empire to its core, and shape momentous events yet to come.", "language": "en", "image": "https://images.isbndb.com/covers/73/85/9780345477385.jpg", "title_long": "Star Wars: Allegiance", "edition": "First Edition first Printing", "dimensions": "Height: 9.5 Inches, Length: 6.75 Inches, Weight: 1.75 Pounds, Width: 1.5 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.75}, "width": {"unit": "inches", "value": 1.5}, "weight": {"unit": "pounds", "value": 1.75}, "height": {"unit": "inches", "value": 9.5}}, "pages": 336, "date_published": "2007-01-30", "subjects": ["Literature & Fiction', 'Genre Fiction', 'TV, Movie, Video Game Adaptations', 'United States', 'Science Fiction & Fantasy', 'Science Fiction', 'Adventure', 'Space Opera'], 'authors": ["Timothy Zahn'], 'title": "Star Wars: Allegiance", "isbn13": "9780345477385", "msrp": 25.95, 'binding": "Hardcover", "isbn": "0345477383", "isbn10": "0345477383"}}