{"book": {"publisher": "Ballantine Books", "synopsis": "The long-awaited story of the science, the business, the politics, the intrigue behind the scenes of the most ferocious competition in the history of modern science—the race to map the human genome.<br/>On May 10, 1998, biologist Craig Venter, director of the Institute for Genomic Research, announced that he was forming a private company that within three years would unravel the complete genetic code of human life—seven years before the projected finish of the U.S. government’s Human Genome Project. Venter hoped that by decoding the genome ahead of schedule, he would speed up the pace of biomedical research and save the lives of thousands of people. He also hoped to become very famous and very rich. Calling his company Celera (from the Latin for “speed”), he assembled a small group of scientists in an empty building in Rockville, Maryland, and set to work.<br/>At the same time, the leaders of the government program, under the direction of Francis Collins, head of the National Human Genome Research Institute at the National Institutes of Health, began to mobilize an unexpectedly unified effort to beat Venter to the prize—knowledge that had the potential to revolutionize medicine and society.<br/><br/>The stage was set for one of the most thrilling—and important—dramas in the history of science. The Genome War is the definitive account of that drama—the race for the greatest prize biology has had to offer, told by a writer with exclusive access to Venter’s operation from start to finish. It is also the story of how one man’s ambition created a scientific Camelot where, for a moment, it seemed that the competing interests of pure science and commercial profit might be gloriously reconciled—and the national repercussions that resulted when that dream went awry.", "language": "en", "image": "https://images.isbndb.com/covers/37/49/9780345433749.jpg", "title_long": "The Genome War: How Craig Venter Tried to Capture the Code of Life and Save the World", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.2 Inches, Weight: 0.7 Pounds, Width: 0.89 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 0.89}, "weight": {"unit": "pounds", "value": 0.7}, "height": {"unit": "inches", "value": 8}}, "pages": 416, "date_published": "2005-06-28", "subjects": ["Biographies & Memoirs', 'Professionals & Academics', 'Scientists', 'Health, Fitness & Dieting', 'Diseases & Physical Ailments', 'Genetic', 'Science & Math', 'Evolution', 'Genetics', 'History & Philosophy'], 'authors": ["James Shreeve'], 'title": "The Genome War: How Craig Venter Tried to Capture the Code of Life and Save the World", "isbn13": "9780345433749", "msrp": 18, "binding": "Paperback", "related": {"ePub": "0307417069"}, "isbn": "0345433742", "isbn10": "0345433742", "other_isbns": [{'isbn": "9780307417060", "binding": "printisbn"}]}}