{"book": {"publisher": "Del Rey", "synopsis": "“[A] solid start of a new series . . . fast-paced adventure.”—Publishers Weekly<br/><br/>Twin brother and sister Ronan and Murel are true children of Petaybee, the sentient planet that is their home. Like their father, they are changelings, able to converse telepathically with creatures and to transform into seals. The Petaybeans wish to protect the twins from curious scientists, but no one realizes that Ronan and Murel hunger to discover the origins of their shape-shifting talent—and that their search for knowledge will place them in the path of peril. Meanwhile, Petaybee is changing. To investigate its sudden evolution, the twins’ father heads out to the open water in his seal form—and is presumed lost. Only Ronan and Murel, with their remarkable talents of transformation, can hope to find him and bring him home . . . if they dare to risk exposure and face the dangers of the newly unstable sea.<br/><br/>“The story is exciting and generously laced with humor, but besides those qualities, the characters . . . and their interactions are so well realized as to utterly charm readers.”—Booklist", "language": "en", "image": "https://images.isbndb.com/covers/00/34/9780345470034.jpg", "title_long": "Changelings (The Twins of Petaybee, Book 1)", "edition": "Reprint", "dimensions": "Height: 6.84 Inches, Length: 4.24 Inches, Weight: 0.34 Pounds, Width: 0.86 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 4.24}, "width": {"unit": "inches", "value": 0.86}, "weight": {"unit": "pounds", "value": 0.34}, "height": {"unit": "inches", "value": 6.84}}, "pages": 320, "date_published": "2006-12-26", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Action & Adventure', 'Mystery, Thriller & Suspense', 'Classics', 'Science Fiction & Fantasy', 'Science Fiction', 'Adventure', 'Space Opera'], 'authors": ["Anne McCaffrey', 'Elizabeth Ann Scarborough'], 'title": "Changelings (The Twins of Petaybee, Book 1)", "isbn13": "9780345470034", "msrp": 7.99, 'binding": "Mass Market Paperback", "isbn": "0345470036", "isbn10": "0345470036"}}