{"book": {"publisher": "Ballantine Books", "synopsis": "In this superb novel by the beloved author of Talk Before Sleep, The Pull of the Moon, and Until the Real Thing Comes Along, a woman re-creates her life after divorce by opening up her house and her heart.<br/>Samantha"s husband has left her, and after a spree of overcharging at Tiffany"s, she settles down to reconstruct a life for herself and her eleven-year-old son. Her eccentric mother tries to help by fixing her up with dates, but a more pressing problem is money. To meet her mortgage payments, Sam decides to take in boarders. The first is an older woman who offers sage advice and sorely needed comfort; the second, a maladjusted student, is not quite so helpful. A new friend, King, an untraditional man, suggests that Samantha get out, get going, get work. But her real work is this: In order to emerge from grief and the past, she has to learn how to make her own happiness. In order to really see people, she has to look within her heart. And in order to know who she is, she has to remember--and reclaim--the person she used to be, long before she became someone else in an effort to save her marriage. Open House is a love story about what can blossom between a man and a woman, and within a woman herself.", 'language": "en", "image": "https://images.isbndb.com/covers/51/63/9780345435163.jpg", "title_long": "Open House: A Novel (Oprah"s Book Club)", 'dimensions": "Height: 8.22 Inches, Length: 5.47 Inches, Weight: 0.49 Pounds, Width: 0.58 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.47}, "width": {"unit": "inches", "value": 0.58}, "weight": {"unit": "pounds", "value": 0.49}, "height": {"unit": "inches", "value": 8.22}}, "pages": 272, "date_published": "2001-05-01", "subjects": ["Literature & Fiction', 'Contemporary', 'Self Service', 'Custom Stores'], 'authors": ["Elizabeth Berg'], 'title": "Open House: A Novel (Oprah"s Book Club)", 'isbn13": "9780345435163", "msrp": 17, 'binding": "Paperback", "isbn": "0345435168", "isbn10": "0345435168"}}