{"book": {"publisher": "Ballantine Books", "synopsis": "“Linda Howard is a superbly original storyteller.”—Iris Johansen<br/><br/>Blair Mallory has already survived one murder attempt. Now, while planning her wedding and dealing with holiday-season madness, Blair once again dodges a bullet. Or more precisely, a Buick. And though the driver’s identity remains a mystery, his or her murderous intentions are all too clear.<br/><br/>Or are they? After all, Blair’s homicidal ex-husband and his partner in crime/wife are safely behind bars. And even Wyatt Bloodsworth, her police detective groom-to-be, isn’t inclined to believe she’s being targeted again. All of which makes Blair wonder if her close call was simply a mishap. But the wondering stops when she narrowly cheats death again in another seemingly innocent accident. Two strikes is all it takes to convince Blair that she’s back in someone’ s crosshairs. And the only thing more frightening is that Wyatt still doubts her. That means this time, no one will be watching Blair’s back when she sets out to get the drop on her would-be killer–before whoever it is finally drops her.", "language": "en", "image": "https://images.isbndb.com/covers/65/85/9780345486585.jpg", "title_long": "Drop Dead Gorgeous: A Novel (Blair Mallory)", "edition": "First Edition", "dimensions": "Height: 6.76 Inches, Length: 4.2 Inches, Weight: 0.37 Pounds, Width: 0.94 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 4.2}, "width": {"unit": "inches", "value": 0.94}, "weight": {"unit": "pounds", "value": 0.37}, "height": {"unit": "inches", "value": 6.76}}, "pages": 352, "date_published": "2006-11-28", "subjects": ["Literature & Fiction', 'Genre Fiction', 'United States', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense', 'Crime', 'Romance', 'Contemporary', 'Romantic Suspense', 'Self Service', 'Custom Stores'], 'authors": ["Linda Howard'], 'title": "Drop Dead Gorgeous: A Novel (Blair Mallory)", "isbn13": "9780345486585", "msrp": 7.99, "binding": "Mass Market Paperback", "related": {"Kindle Edition": "0345495314", "ePub": "0345495314"}, "isbn": "0345486587", "isbn10": "0345486587", "other_isbns": [{'isbn": "9780345495310", "binding": "printisbn"}]}}