{"book": {"publisher": "Del Rey", "synopsis": "TERRY BROOKS<br/><br/>THE HERITAGE OF SHANNARA<br/>The Complete Series<br/><br/>After New York Times bestselling author Terry Brooks completed The Sword of Shannara trilogy, millions of fans around the world clamored to immerse themselves again in his dazzling world. Brooks answered with a quartet of beloved novels—The Heritage of Shannara. Now, for the first time in one handsome collector’s edition hardcover, here are: The Scions of Shannara, The Druid of Shannara, The Elf Queen of Shannara, and The Talismans of Shannara—the thrilling continuation of the saga<br/>that has become one of the most enduring fantasy epics of all time.<br/><br/>The Scions of Shannara<br/>Since the death of the Druid Allanon, magic has been strictly forbidden in the Four Lands. Yet Par still has limited use of the Wishsong. Then a dire message from Allanon sends Par and his brother Coll on an impossible task: to recover the long-lost Sword of Shannara—or all life in the Four Lands will be destroyed.<br/><br/>The Druid of Shannara<br/>Evil forces remain in control of the Four Lands. To restore the Keep of the Druid Allanon, Walker Boh sets out on a journey to find the black Elfstone. He must venture into perilous, unknown lands with a strange band of fellow travelers—one of whom is hatching his own sinister plot.<br/><br/>The Elf Queen of Shannara<br/>Ordered by the Druid Allanon to find the Elves and return them to the world of Men, Wren is carried away to an island where Elves might still exist. Even if by some miracle she locates the Elves, can she convince them to follow her back through a demon-haunted jungle to the safety of the shore?<br/><br/>The Talismans of Shannara<br/>The Shadowen still swarm over the Four Lands, poisoning everything with their dark magic. Their leader is determined to destroy all the Scions of Shannara. With traps cleverly laid, the charges are doomed to failure—unless Par can discover a way to harness the power of the Sword of Shannara.<br/><br/>So continues Terry Brooks’s enthralling Heritage of Shannara epic, a spellbinding saga that chronicles the ultimate battle of good vs. evil.", "language": "en", "image": "https://images.isbndb.com/covers/55/42/9780345465542.jpg", "title_long": "The Heritage of Shannara", "edition": "1", "dimensions": "Height: 9.53 Inches, Length: 6.68 Inches, Weight: 3.87 Pounds, Width: 2.22 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.68}, "width": {"unit": "inches", "value": 2.22}, "weight": {"unit": "pounds", "value": 3.87}, "height": {"unit": "inches", "value": 9.53}}, "pages": 1248, "date_published": "2003-08-26", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Action & Adventure', 'Fantasy', 'War & Military', 'United States', 'Science Fiction & Fantasy', 'Epic', 'Sword & Sorcery', 'Military', 'Science Fiction', 'Adventure'], 'authors": ["Terry Brooks'], 'title": "The Heritage of Shannara", "isbn13": "9780345465542", "msrp": 42, "binding": "Hardcover", "related": {"Kindle Edition": "0307530809", "ePub": "0307530809"}, "isbn": "0345465547", "isbn10": "0345465547", "other_isbns": [{'isbn": "9780307530806", "binding": "printisbn"}]}}