{"book": {"publisher": "Del Rey", "synopsis": "Twenty-five years ago, Piers Anthony fascinated us with the creation of Xanth–a wondrous land where magic rules supreme. Since then, the dazzling world of Xanth has delighted millions of readers. Now, here are the first three novels of this classic series to enthrall a whole new generation. . . .<br/><br/>A SPELL FOR CHAMELEON<br/>Winner of the British Fantasy Award for Best Novel of the Year<br/>Though every citizen of Xanth has a special spell only he or she can cast, Bink of North Village has no magic. But the Good Magician Humphrey and Beauregard the genie insist that Bink indeed is capable of enchantment– magic more powerful than the King himself, or even the evil magician Trent. Now if only Bink can find his magic . . . before he is forced into exile.<br/><br/>THE SOURCE OF MAGIC<br/>Curious about the source of Xanth’s magic, the King sends Bink on a daring quest for truth. From the beginning, Bink and his companions are harried by an unseen creature determined to thwart them. But when some allies become enemies, it will take all Bink’s ingenuity and luck to prevail on his mission, which takes an unexpectedly defiant turn.<br/><br/>CASTLE ROOGNA<br/>Millie had been a ghost for eight hundred years. But now, restored by the magic of Xanth, she is again a beautiful living woman. She can have any man she desires . . . except one: Jonathan the zombie. To help Millie, young Magician Dor embarks on a journey for the elixir that will restore Jonathan to full life–an adventure that will take him to the past, where his intentions are thwarted by a surprising encounter.<br/><br/>Discover a magical world of dazzling imagination!", "language": "en", "image": "https://images.isbndb.com/covers/32/80/9780345453280.jpg", "title_long": "Xanth: The Quest for Magic (A Spell for Chameleon; The Source of Magic; Castle Roogna)", "dimensions": "Height: 8.25 Inches, Length: 5 Inches, Weight: 1.3 Pounds, Width: 1.25 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 1.25}, "weight": {"unit": "pounds", "value": 1.3}, "height": {"unit": "inches", "value": 8.25}}, "pages": 784, "date_published": "2002-10-29", "subjects": ["Science Fiction & Fantasy', 'Fantasy', 'Teen & Young Adult', 'Science Fiction'], 'authors": ['Piers Anthony'], 'title": "Xanth: The Quest for Magic (A Spell for Chameleon; The Source of Magic; Castle Roogna)", "isbn13": "9780345453280", "msrp": "0.00", "binding": "Paperback", "isbn": "034545328X", "isbn10": "034545328X"}}