{"book": {"publisher": "Del Rey", "synopsis": "At last, it’s the ultimate history of the spectacular Star Warssaga, lavishly illustrated and in full color for the first time.<br/><br/>With the completion of Episodes I, II, and III, the epic story that’s captivated millions can now be told in its entirety, from the time of the primordial Knights of the Old Republic and the Clone Wars to the birth of the Empire, from the destruction of the Death Star to the adventures of the New Jedi Order.<br/><br/>Beautifully illustrated by Mark Chiarello, Tommy Lee Edwards, and John Van Fleet, Star Wars: The New Essential Chronologyoffers the comprehensive and official chronicle of that extraordinary galaxy so far, far away. Herein you’ll find<br/><br/>• the most exciting and climactic events from all epochs of Star Wars–those explosive turning points in the shaping of the galaxy<br/>• a gripping account of the controversial Clone Wars–the treachery that fueled them and the terrifying aftermath<br/>• profiles of the key players in the history of the Star Wars galaxy, along with all the most popular heroes and villains from every movie, book, comic, TV special, game, and cartoon<br/><br/>Follow Anakin Solo’s perilous journey as he wrestles with the dark side; behold the black soul of each Dark Lord of the Sith, from Darth Sidious to Darth Vader; experience the fiery space battles that decided the fates of entire planets; and witness the ferocious invasion of the seemingly invincible Yuuzhon Vong.<br/><br/>The training of Obi-Wan Kenobi, the invasion of Naboo, the capture of Princess Leia, the Battle of Yavin, the lightsaber death duel between Organa Solo and Beldorion the Hutt–all of the key events are captured and preserved for all time in this drama-filled Stars Wars chronicle.", "language": "en", "image": "https://images.isbndb.com/covers/90/16/9780345449016.jpg", "title_long": "The New Essential Chronology to Star Wars", "edition": "First Edition", "dimensions": "Height: 10.75 Inches, Length: 8.5 Inches, Weight: 2.15 Pounds, Width: 0.5 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 8.5}, "width": {"unit": "inches", "value": 0.5}, "weight": {"unit": "pounds", "value": 2.15}, "height": {"unit": "inches", "value": 10.75}}, "pages": 256, "date_published": "2005-10-25", "subjects": ["Humor & Entertainment', 'Movies', 'Guides & Reviews', 'History & Criticism', 'Science Fiction & Fantasy', 'Science Fiction', 'Space Opera'], 'authors": ["Daniel Wallace'], 'title": "The New Essential Chronology to Star Wars", "isbn13": "9780345449016", "msrp": 24.95, 'binding": "Paperback", "isbn": "0345449010", "isbn10": "0345449010"}}