{"book": {"publisher": "Del Rey", "synopsis": "Bestselling author Alan Dean Foster delivers a Pip and Flinx novel featuring a certain twenty-four-year-old with red hair, growing powers, and a loyal sidekick who just happens to be a flying mini-dragon. Flinx’s Folly follows Flinx on a thrilling quest to unravel the mysteries of his mind and body. It is a quest that forces him to confront a horror almost beyond human comprehension concealed somewhere in the universe . . . and coming closer.<br/><br/>It’s a good thing Flinx is no stranger to trouble, because he’s swimming in it. Even before the latest murderous attack by a new gang of assailants, there seems no end to people determined to arrest, examine, or kill him. To add insult to all that injury, Flinx has been spirited away and enlisted in a battle against a monstrous extra-galactic threat. Hidden behind the Great Emptiness, in a place where it seems matter and energy have never been, there is only evil. Pure evil that is approaching him, accelerating.<br/><br/>Against such a quintessence of colossal evil what can one puny human and a formidable mini-drag protector do? Flinx must tell someone or go out of his already addled mind. Choosing a confidant is easy: Clarity Held, a crush he hasn’t seen in six years. She is a young woman who has clearly gone on with her life in ways that (he soon learns) don’t necessarily include Flinx.<br/><br/>Whatever happens, Flinx makes up his mind to act quickly. His decision is the beginning of a terrifying, high-stakes adventure through perilous new realms that will rocket him into the very heart of danger–and into the arms of the only woman he’s ever loved. As he and Pip bravely travel to a place where no man or mini-drag has gone before, Flinx discovers he has a few more friends than he thought–and far more enemies than he ever imagined.", "language": "en", "image": "https://images.isbndb.com/covers/03/95/9780345450395.jpg", "title_long": "Flinx"s Folly (Adventures of Pip & Flinx)", "edition": "Reprint", "dimensions": "Height: 6.7 Inches, Length: 4.2 Inches, Weight: 0.33 Pounds, Width: 0.7 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.2}, "width": {"unit": "inches", "value": 0.7}, "weight": {"unit": "pounds", "value": 0.33}, "height": {"unit": "inches", "value": 6.7}}, "pages": 288, "date_published": "2004-09-28", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Science Fiction & Fantasy', 'Science Fiction', 'Adventure', 'Hard Science Fiction', 'Space Opera', 'First Contact', 'Galactic Empire', 'Exploration', 'Humorous'], 'authors": ["Alan Dean Foster'], 'title": "Flinx"s Folly (Adventures of Pip & Flinx)", 'isbn13": "9780345450395", "msrp": 7.99, 'binding": "Mass Market Paperback", "isbn": "0345450396", "isbn10": "0345450396"}}