{"book": {"publisher": "Del Rey", "synopsis": "Evil will not give up without a fight. . . .<br/><br/>Without the Sword of Shannara, the evil Warlock Lord cannot be defeated. Yet the quest for the mysterious talisman lies in ruins. The intrepid company of warriors assembled by the Druid Allanon to recover the magic Sword has been shattered, dispersed by the Dark Lord’s power. And young half-elf Shea Ohmsford, the last, best hope of all the races, is missing, perhaps captured . . . or worse.<br/><br/>The Warlock’s fearsome armies are on the march. Tens of thousands of bloodthirsty Gnomes and Trolls are poised to sweep down upon the border kingdom of Callahorn, gateway to the peaceful Southland. In mankind’s darkest hour, as Allanon desperately scours the war-ravaged countryside for a sign of the missing Shea, an extraordinary drama of hardship and courage unfolds on the desolate Streleheim Plains. There, his only companions a brash highwayman and a renegade Troll, Shea will find the Sword of Shannara tantalizingly close–and death terrifyingly near. . . .<br/><br/>The Sword of Shannara Part 2: The Druids’ Keep is the newest addition to the Del Rey Imagine program, which offers the best in classic fantasy and science fiction for readers 12 and up.", "language": "en", "image": "https://images.isbndb.com/covers/14/52/9780345461452.jpg", "title_long": "The Druid"s Keep (The Sword of Shannara, Part 2)", "dimensions": "Height: 7.5 Inches, Length: 5.25 Inches, Weight: 0.36 Pounds, Width: 0.75 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.25}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 0.36}, "height": {"unit": "inches", "value": 7.5}}, "pages": 240, "date_published": "2003-06-03", "subjects": ["Literature & Fiction', 'Action & Adventure', 'Fantasy', 'Science Fiction & Fantasy', 'Epic', 'Sword & Sorcery', 'Science Fiction', 'Adventure'], 'authors": ["Terry Brooks'], 'title": "The Druid"s Keep (The Sword of Shannara, Part 2)", 'isbn13": "9780345461452", "msrp": 6.99, 'binding": "Paperback", "isbn": "0345461452", "isbn10": "0345461452"}}