{"book": {"publisher": "One World", "synopsis": "She wanted to be a hip-hop star but the streets got in the way.<br/><br/>Have you ever laid down with a man and wasn’t sure if you’d ever get back up? Tossed the sheets with a bone-knocking fear that only a hard-core hustler could produce? Sexed him like your life depended on it, because in reality it did? You still with me? Then let’s roll over to my house. Harlem. 145th Street. Grab a seat and brace yourself as I show you the kind of pain that street life and so-called success can bring. . . .<br/><br/>Nineteen-year-old Candy Raye Montana, an ex—drug runner for the Gabriano crime family and a former foster child, dreams of becoming a hip-hop superstar, if only someone will discover her talents.<br/><br/>Someone does. Mega music producer and king thug of Harlem, Junius “Hurricane” Jackson, CEO of the House of Homicide recording studio, cuts a deal and puts Candy on the stage. Suddenly she is a hot new artist on the notorious Homicide Hitz record label. Her career takes off and she blazes the charts, but it’s not long before Candy realizes that the man she thought was her knight is nothing more than a cold-blooded nightmare.<br/><br/>Caught between the music and the madness, between the dollars and the deals, Candy belongs to Hurricane—body and soul—and must endure his sadistic bedroom desires while keeping his sexual secrets hidden from the world. But Candy has some strong desires of her own that simply cannot be denied, especially when she finds herself turned on by a brilliant investment baller who just happens to be Hurricane’s right-hand man. Candy longs for her freedom, but if Hurricane gets wind of her betrayal the blowback will be lethal—and not only will she risk losing her recording contract, she just might lose her life.", "language": "en", "image": "https://images.isbndb.com/covers/64/79/9780345486479.jpg", "title_long": "Candy Licker: An Urban Erotic Tale", "edition": "26230th", "dimensions": "Height: 7.96 Inches, Length: 5.18 Inches, Weight: 0.48 Pounds, Width: 0.65 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.18}, "width": {"unit": "inches", "value": 0.65}, "weight": {"unit": "pounds", "value": 0.48}, "height": {"unit": "inches", "value": 7.96}}, "pages": 304, "date_published": "2005-12-27", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Women's Fiction', 'Domestic Life', 'Contemporary', 'United States', 'Black & African American', 'Erotica', 'Urban', 'Self Service', 'Custom Stores'], 'authors": ["Noire'], 'title": "Candy Licker: An Urban Erotic Tale", "isbn13": "9780345486479", "msrp": 16, "binding": "Paperback", "related": {"Kindle Edition": "0307494330", "ePub": "0307494330"}, "isbn": "0345486471", "isbn10": "0345486471", "other_isbns": [{'isbn": "9780307494337", "binding": "printisbn"}]}}