{"book": {"publisher": "Ballantine Books", "synopsis": "If you open your house to strangers, who knows who might come in. And what they might be after. Or whom. Now, ponder the unthinkable and surrender to your darkest dread, as sinister storyteller extraordinaire John Saul weaves a heart-stopping tale of lurking terror and twisted intent.<br/><br/>Every parent’s nightmare becomes reality for Kara Marshall when her daughter, Lindsay, vanishes from her bedroom during the night. The police suspect that the girl is just another moody teenage runaway, angry over leaving behind her school and friends because her family is moving. But Lindsay’s recent eerie claim–that someone invaded her room when the house was opened to prospective buyers–drives Kara to fear the worst: a nameless, faceless stalker has walked the halls of her home in search of more than a place to live.<br/><br/>Patrick Shields recognizes Kara’s pain–and carries plenty of his own since he lost his wife and two children in a devastating house fire. But more than grief draws Patrick and Kara together. He, too, senses the hand of a malevolent stranger in this tragedy. And as more people go missing from houses up for sale, Patrick’s suspicion, like Kara’s, blooms into horrified certainty.<br/><br/>Someone is trolling this peaceful community–undetected and undeterred–harvesting victims for a purpose no sane mind can fathom. Someone Kara and Patrick, alone and desperate, are determined to unmask. Someone who is even now watching, plotting, keeping a demented diary of unspeakable deeds . . . and waiting until the time is ripe for another fateful visit.", "language": "en", "image": "https://images.isbndb.com/covers/73/24/9780345467324.jpg", "title_long": "Perfect Nightmare: A Novel", "edition": "Reprint", "dimensions": "Height: 6.75 Inches, Length: 4.2 Inches, Weight: 0.41 Pounds, Width: 0.95 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 4.2}, "width": {"unit": "inches", "value": 0.95}, "weight": {"unit": "pounds", "value": 0.41}, "height": {"unit": "inches", "value": 6.75}}, "pages": 384, "date_published": "2006-04-25", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Horror', 'Psychological', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Psychological Thrillers', 'Suspense', 'Self Service', 'Custom Stores'], 'authors": ["John Saul'], 'title": "Perfect Nightmare: A Novel", "isbn13": "9780345467324", "msrp": 7.99, 'binding": "Mass Market Paperback", "isbn": "0345467329", "isbn10": "0345467329"}}