{"book": {"publisher": "Ballantine Books", "synopsis": "Jeff Shaara dazzled readers with his bestselling novels Gods and Generals, The Last Full Measure, and Gone for Soldiers. Now the acclaimed author who illuminated the Civil War and the Mexican-American War brilliantly brings to life the American Revolution, creating a superb saga of the men who helped to forge the destiny of a nation.<br/><br/>In 1770, the fuse of revolution is lit by a fateful command—“Fire!”—as England’s peacekeeping mission ignites into the Boston Massacre. The senseless killing of civilians leads to a tumultuous trial in which lawyer John Adams must defend the very enemy who has assaulted and abused the laws he holds sacred.<br/><br/>The taut courtroom drama soon broadens into a stunning epic of war as King George III leads a reckless and corrupt government in London toward the escalating abuse of his colonies. Outraged by the increasing loss of their liberties, an extraordinary gathering of America’s most inspiring characters confronts the British presence with the ideals that will change history.<br/><br/>John Adams, the idealistic attorney devoted to the law, who rises to greatness by the power of his words . . . Ben Franklin, one of the most celebrated men of his time, the elderly and audacious inventor and philosopher who endures firsthand the hostile prejudice of the British government . . . Thomas Gage, the British general given the impossible task of crushing a colonial rebellion without starting an all-out war . . . George Washington, the dashing Virginian whose battle experience in the French and Indian War brings him the recognition that elevates him to command of a colonial army . . . and many other immortal names from the Founding Family of the colonial struggle—Abigail Adams, Thomas Jefferson, Joseph Warren, Samuel Adams, Richard Henry Lee— captured as never before in their full flesh-and-blood humanity.<br/><br/>More than a powerful portrait of the people and purpose of the revolution, Rise to Rebellion is a vivid account of history’s most pivotal events. The Boston Tea Party, the battles of Concord and Bunker Hill—all are recreated with the kind of breathtaking detail only a master like Jeff Shaara can muster. His most impressive achievement, Rise to Rebellion reveals with new immediacy how philosophers became fighters, ideas their ammunition, and how a scattered group of colonies became the United States of America.", "language": "en", "image": "https://images.isbndb.com/covers/75/40/9780345427540.jpg", "title_long": "Rise to Rebellion: A Novel of the American Revolution (The American Revolutionary War)", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.2 inches, Weight: 0.82452885988 Pounds, Width: 1 inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 0.82452885988}, "height": {"unit": "inches", "value": 8}}, "pages": 512, "date_published": "2004-06-29", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'Political', 'War', 'United States', 'Self Service', 'Custom Stores'], 'authors": ["Jeff Shaara'], 'title": "Rise to Rebellion: A Novel of the American Revolution (The American Revolutionary War)", "isbn13": "9780345427540", "msrp": 18, "binding": "Paperback", "related": {"ePub": "0345478509"}, "isbn": "0345427548", "isbn10": "0345427548", "other_isbns": [{'isbn": "9780345478504", "binding": "printisbn"}]}}