{"book": {"publisher": "Ballantine Books", "synopsis": "“A rollicking, adventure-filled story . . . packed [with] the human capacity for love.”<br/>–USA Today<br/><br/>“A superbly executed, good-hearted farce that is part romance and part mystery . . . With Tan’s many talents on display, it’s her idiosyncratic wit and sly observations . . . that make this book pure pleasure.”<br/>–San Francisco Chronicle<br/><br/>San Francisco art patron Bibi Chen has planned a journey of the senses along the famed Burma Road for eleven lucky friends. But after her mysterious death, Bibi watches aghast from her ghostly perch as the travelers veer off her itinerary and embark on a trail paved with cultural gaffes and tribal curses, Buddhist illusions and romantic desires. On Christmas morning, the tourists cruise across a misty lake and disappear.<br/><br/>With picaresque characters and mesmerizing imagery, Saving Fish from Drowning gives us a voice as idiosyncratic, sharp, and affectionate as the mothers of The Joy Luck Club. Bibi is the observant eye of human nature–the witness of good intentions and bad outcomes, of desperate souls and those who wish to save them. In the end, Tan takes her readers to that place in their own heart where hope is found.<br/><br/>“Amy Tan is among our great storytellers.”<br/>–The New York Times Book Review<br/><br/>“Amy Tan has created an almost magical adventure that, page by page, becomes a metaphor for human relationships.”<br/>–Isabel Allende<br/><br/>“With humor, ruthlessness, and wild imagination, Tan has reaped [a] fantastic tale of human longings and (of course) their consequences.”<br/>–Elle<br/><br/>“A book that’s easy to read and hard to forget.”<br/>–Newsweek", "language": "en", "image": "https://images.isbndb.com/covers/40/19/9780345464019.jpg", "title_long": "Saving Fish from Drowning", "edition": "~", "dimensions": "Height: 7.92 Inches, Length: 5.25 Inches, Weight: 0.95 Pounds, Width: 1.09 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.25}, "width": {"unit": "inches", "value": 1.09}, "weight": {"unit": "pounds", "value": 0.95}, "height": {"unit": "inches", "value": 7.92}}, "pages": 474, "date_published": "2006-09-26", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Metaphysical & Visionary', 'Women's Fiction', 'Friendship', 'United States', 'Asian American', 'Literary', 'Travel', 'Asia', 'Myanmar', 'Self Service', 'Custom Stores'], 'authors": ["Amy Tan'], 'title": "Saving Fish from Drowning", "isbn13": "9780345464019", "msrp": 17, 'binding": "Paperback", "isbn": "034546401X", "isbn10": "034546401X"}}