{"book": {"publisher": "Del Rey", "synopsis": "Celebrate the fortieth anniversary of Star Trek® with the original mission logs chronicling some of the crew’s most bizarre missions and strangest encounters with alien races across the galaxy . . . where no man has gone before™.<br/><br/>Beyond the Farthest Star<br/>Behind a negative star, the Enterprise finds some malevolent company: an alien of unimaginable power beams aboard–to destroy the crew and hijack the ship for its own deadly purpose.<br/><br/>Yesteryear<br/>Spock returns from a time-travel research project to find that no one on the Enterprise recognizes him. Now he must go back through the Time Gate to his Vulcan childhood—to save the life of the child he was.<br/><br/>One of Our Planets Is Missing<br/>A huge cosmic cloud that eats celestial objects has already consumed one planet and is on its way to another, where 82 million people will die. And Kirk and his crew find themselves in its voracious path.<br/><br/>The Survivor<br/>The crew rejoices when a drifting, damaged spaceship yields Carter Winston, the famous philanthropist missing and presumed dead. But Carter is not all that he seems.<br/><br/>The Lorelei Signal<br/>When Kirk, Spock, and McCoy beam down to a mysterious planet, they discover an exotic race of enchantingly beautiful women who seem ready to fulfill every fantasy—but a far deadlier fate awaits the Enterprise crew.<br/><br/>The Infinite Vulcan<br/>Keniclius 5, a 24-foot-tall clone of a demented scientist, kidnaps Spock to clone him into immortality. Unfortunately, to achieve this transformation, the real Spock must die . . .", "language": "en", "image": "https://images.isbndb.com/covers/58/15/9780345495815.jpg", "title_long": "Star Trek Logs One and Two", "dimensions": "Height: 7.94 Inches, Length: 5.11 Inches, Weight: 0.59083886216 Pounds, Width: 0.82 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.11}, "width": {"unit": "inches", "value": 0.82}, "weight": {"unit": "pounds", "value": 0.59083886216}, "height": {"unit": "inches", "value": 7.94}}, "pages": 384, "date_published": "2006-09-05", "subjects": ["Literature & Fiction', 'Genre Fiction', 'TV, Movie, Video Game Adaptations', 'United States', 'Science Fiction & Fantasy', 'Science Fiction', 'Adventure', 'Space Opera'], 'authors": ['Alan Dean Foster'], 'title": "Star Trek Logs One and Two", "isbn13": "9780345495815", "msrp": "0.00", "binding": "Paperback", "isbn": "0345495810", "isbn10": "0345495810"}}