{"book": {"publisher": "Ballantine Books", "synopsis": "“Fascinating . . . Alison Weir does full justice to the subject.”—The Philadelphia Inquirer<br/><br/>At his death in 1547, King Henry VIII left four heirs to the English throne: his only son, the nine-year-old Prince Edward; the Lady Mary, the adult daughter of his first wife Katherine of Aragon; the Lady Elizabeth, the teenage daughter of his second wife Anne Boleyn; and his young great-niece, the Lady Jane Grey. In this riveting account Alison Weir paints a unique portrait of these extraordinary rulers, examining their intricate relationships to each other and to history. She traces the tumult that followed Henry\"s death, from the brief intrigue-filled reigns of the boy king Edward VI and the fragile Lady Jane Grey, to the savagery of "Bloody Mary," and finally the accession of the politically adroit Elizabeth I.<br/><br/>As always, Weir offers a fresh perspective on a period that has spawned many of the most enduring myths in English history, combining the best of the historian\'s and the biographer\'s art.<br/><br/>“Like anthropology, history and biography can demonstrate unfamiliar ways of feeling and being. Alison Weir\'s sympathetic collective biography, The Children of Henry VIII does just that, reminding us that human nature has changed--and for the better. . . . Weir imparts movement and coherence while re-creating the suspense her characters endured and the suffering they inflicted.”—The New York Times Book Review', 'language": "en", "image": "https://images.isbndb.com/covers/78/63/9780345407863.jpg", "title_long": "The Children of Henry VIII", "edition": "Later Printing", "dimensions": "Height: 8.22 Inches, Length: 5.5 Inches, Weight: 0.825 Pounds, Width: 0.95 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.95}, "weight": {"unit": "pounds", "value": 0.825}, "height": {"unit": "inches", "value": 8.22}}, "pages": 432, "date_published": "1997-07-08", "subjects": ["Biographies & Memoirs', 'Historical', 'United States', 'Europe', 'Leaders & Notable People', 'Royalty', 'History', 'Great Britain', 'World', 'Self Service', 'Custom Stores'], 'authors": ["Alison Weir'], 'title": "The Children of Henry VIII", "isbn13": "9780345407863", "msrp": 18, "binding": "Paperback", "related": {"Kindle Edition": "0307806863", "ePub": "0307806863"}, "isbn": "0345407865", "isbn10": "0345407865", "other_isbns": [{'isbn": "9780307806864", "binding": "printisbn"}]}}