{"book": {"publisher": "Del Rey", "synopsis": "Horrified by the misuse of magic they had witnessed during the First War of the Races, the Druids at Paranor devoted themselves to the study of the old sciences, from the period before the collapse of civilization a thousand years before. Only the Bremen and a few trusted associates still studied the arcane arts. And for his persistence, Bremen found himself outcast, avoided by all but the few free-thinkers among the Druids.<br/><br/>But his removal from Paranor was not altogether a terrible thing, for Bremen learned that dark forces were on the move from the Northlands. That seemingly invincible armies of trolls were fast conquering all that lay to their south. That the scouts for the army--and its principal assassins--were Skull Bearers, disfigured and transformed Druids who had fallen prey to the seductions of the magic arts. And that at the heart of the evil tide was an archmage and former Druid named Brona!<br/><br/>Using the special skills he had acquired through his own study of Magic, Bremen was able to penetrate the huge camp of the Troll army and learn many of its secrets. And he immediately understood that if the peoples of the Four Lands were to escape eternal subjugation they would need to unite. But, even united, they would need a weapon, something so powerful that the evil magic of Brona, the Warlock Lord, would fail before its might...", "language": "en", "image": "https://images.isbndb.com/covers/65/32/9780345396532.jpg", "title_long": "First King of Shannara", "edition": "Reissue", "dimensions": "Height: 6.8 Inches, Length: 4.1 Inches, Weight: 0.49 Pounds, Width: 1.14 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 4.1}, "width": {"unit": "inches", "value": 1.14}, "weight": {"unit": "pounds", "value": 0.49}, "height": {"unit": "inches", "value": 6.8}}, "pages": 439, "date_published": "1997-01-29", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Action & Adventure', 'Fantasy', 'War & Military', 'Science Fiction & Fantasy', 'Epic', 'Sword & Sorcery', 'Military', 'Science Fiction', 'Adventure'], 'authors": ["Terry Brooks'], 'title": "First King of Shannara", "isbn13": "9780345396532", "msrp": 8.99, "binding": "Mass Market Paperback", "related": {"Kindle Edition": "0345444639"}, "isbn": "0345396537", "isbn10": "0345396537", "other_isbns": [{'isbn": "9780345444639", "binding": "printisbn"}]}}