{"book": {"publisher": "Ballantine Books", "synopsis": "I am Meredith Gentry, P.I., solving cases in Los Angeles, far from the peril and deception of my real home–because I am also Princess Meredith, heir to the darkest throne faerie has to offer. The Unseelie Court infuses me with its power. But at what price does such magic come? How much of my human side will I have to give up, and how much of the sinister side of faerie will I have to embrace? To sit on a throne that has ruled through bloodshed and violence for centuries, I might have to become that which I dread the most.<br/><br/>Enemies watch my every move. My cousin Cel strives to have me killed even now from his prison cell. But not all the assassination attempts are his. Some Unseelie nobles have waited centuries for my aunt Andais, Queen of Air and Darkness, to become weak enough that she might be toppled from her throne. Enemies unforeseen move against us–enemies who would murder the least among us.<br/><br/>The threat will drive us to allow human police into faerie for the first time in our history. I need my allies now more than ever, especially since fate will lead me into the arm of Mistral, Master of Storms, the queen’s new captain of her guard. Our passion will reawaken powers long forgotten among the warriors of the sidhe. Pain and pleasure await me–and danger, as well, for some at that court seek only death.<br/><br/>I will find new joys with the butterfly-winged demi-fey. My guards and I will show all of faerie that violence and sex are as popular among the sidhe as they are among the lesser fey of our court. The Darkness will weep, and Frost will comfort him. The gentlest of my guards will find new strength and break my heart. Passions undreamed of await us–and my enemies gather, for the future of both courts of faerie begins to unravel.", "language": "en", "image": "https://images.isbndb.com/covers/36/01/9780345443601.jpg", "title_long": "A Stroke of Midnight", "edition": "Reprinted Edition", "dimensions": "Height: 6.76 Inches, Length: 4.22 Inches, Weight: 0.43 Pounds, Width: 1.12 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 4.22}, "width": {"unit": "inches", "value": 1.12}, "weight": {"unit": "pounds", "value": 0.43}, "height": {"unit": "inches", "value": 6.76}}, "pages": 416, "date_published": "2006-11-28", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Romance', 'Paranormal', 'Vampires', 'Fantasy', 'Science Fiction & Fantasy', 'Romantic', 'Self Service', 'Custom Stores'], 'authors": ["Laurell K. Hamilton'], 'title": "A Stroke of Midnight", "isbn13": "9780345443601", "msrp": 7.99, 'binding": "Mass Market Paperback", "isbn": "0345443608", "isbn10": "0345443608"}}