{"book": {"publisher": "Del Rey", "synopsis": "Joe Pitt’s life sucks. He hasn’t had a case or a job in God knows how long and his stashes are running on empty. What stashes? The only ones that count to a guy like Joe: blood and money. The money he uses to buy blood; the blood he drinks. Hey, buddy, it’s that or your neck—you want to choose? The only way to lay his hands on both is to take a gig with the local Vampyre Clan. See, something new is on the streets, a new high, a high so strong it can send a Vampyre spazzing through Joe’s local watering hole. Till Joe sends him through a plate-glass window, that is.<br/><br/>So it’s time for Joe to gut up and swallow that pride and follow the leads wherever they go. It won’ t be long before he’s slapping stoolies, getting sapped, and being taken for a ride above 110th Street. Someone’s pulling Joe’s strings, and now he’s riding the A train, looking to find who it is. He’s gonna cut them when he finds them—the strings and the hands that hold them.", "language": "en", "image": "https://images.isbndb.com/covers/82/52/9780345478252.jpg", "title_long": "No Dominion: A Novel (Joe Pitt Casebooks)", "edition": "First Edition", "dimensions": "Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.5 Pounds, Width: 0.5 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.5}, "weight": {"unit": "pounds", "value": 0.5}, "height": {"unit": "inches", "value": 8.25}}, "pages": 272, "date_published": "2006-12-26", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Horror', 'Mystery, Thriller & Suspense', 'Mystery', 'Hard-Boiled', 'Supernatural', 'Thrillers & Suspense', 'Suspense'], 'authors": ["Charlie Huston'], 'title": "No Dominion: A Novel (Joe Pitt Casebooks)", "isbn13": "9780345478252", "msrp": 15, "binding": "Paperback", "related": {"Kindle Edition": "0345497147", "ePub": "0345497147"}, "isbn": "0345478258", "isbn10": "0345478258", "other_isbns": [{'isbn": "9780345497147", "binding": "printisbn"}]}}