{"book": {"publisher": "Del Rey", "synopsis": "In the second novel of the New York Times bestselling Temeraire series, the Napoleonic Wars take Captain Will Laurence and his dragon to China on a perilous mission.<br/><br/>“Full of wonderful characters with real heart.”—Peter Jackson<br/><br/>When Britain intercepted a French ship and its precious cargo—an unhatched dragon"s egg—Captain Will Laurence of HMS Reliant unexpectedly became master and commander of the noble dragon he named Temeraire. As new recruits in Britain’s Aerial Corps, man and dragon soon proved their mettle in daring combat against Napoleon Bonaparte’s invading forces.<br/><br/>Now China has discovered that its rare gift, intended for Napoleon, has fallen into British hands—and an angry Chinese delegation vows to reclaim the remarkable beast. A reluctant Laurence has no choice but to take Temeraire back to China—a long voyage fraught with peril, intrigue, and the untold terrors of the deep. Yet once the pair reaches the court of the Chinese emperor, even more shocking discoveries and darker dangers await.<br/><br/>“Readers with a penchant for both Patrick O’Brian and Anne McCaffrey may have found their perfect match. Naomi Novik beautifully renders an 1800s Europe in which naval buffs and dragon lovers will be keen to immerse themselves.”—Alan Dean Foster, author of the Pip & Flinx series<br/><br/>Don’t miss any of Naomi Novik’s magical Temeraire series<br/>HIS MAJESTY’S DRAGON • THRONE OF JADE • BLACK POWDER WAR • EMPIRE OF IVORY • VICTORY OF EAGLES • TONGUES OF SERPENTS • CRUCIBLE OF GOLD • BLOOD OF TYRANTS • LEAGUE OF DRAGONS", "language": "en", "image": "https://images.isbndb.com/covers/12/90/9780345481290.jpg", "title_long": "Throne of Jade (Temeraire, Book 2)", "edition": "First Edition", "dimensions": "Height: 7 Inches, Length: 4.2 Inches, Weight: 0.55 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.2}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 0.55}, "height": {"unit": "inches", "value": 7}}, "pages": 432, "date_published": "2006-04-25", "subjects": ["Science Fiction & Fantasy', 'Fantasy', 'Epic', 'Historical'], 'authors": ["Naomi Novik'], 'title": "Throne of Jade (Temeraire, Book 2)", "isbn13": "9780345481290", "msrp": 7.99, "binding": "Paperback", "related": {"Kindle Edition": "0345493443", "ePub": "0345493443"}, "isbn": "0345481291", "isbn10": "0345481291", "other_isbns": [{'isbn": "9780345493446", "binding": "printisbn"}]}}