{"book": {"publisher": "Del Rey", "synopsis": ""FASCINATING . . . May has cemented her position as one of this generation\"s foremost storytellers. . . .This satisfying end to a remarkable feat of the imagination is a necessary purchase."<br/>--Library Journal<br/><br/>By the mid-twenty-first century, humanity is beginning to enjoy membership in the Galactic Milieu. Human colonies are thriving on numerous planets, life on Earth is peaceful and prosperous, and as more humans are being born with metapsychic abilities, it will not be long before these gifted minds at last achieve total Unity.<br/><br/>But xenophobia is deeply rooted in the human soul. A growing corps of rebels plots to keep the people of Earth forever separate, led by a man obsessed with human superiority: Marc Remillard. Marc\'s goal is nothing less than the elevation of human metapsychics above all others, by way of artificial enhancement of mental faculties. His methods are unpalatable, his goal horrific. And so Marc and his coconspirators continue their work in secret.<br/><br/>Only the very Unity he fears and abhors can foil Marc\'s plans. And only his brother, Jack the Bodiless, and the young woman called Diamond Mask can hope to lead the metaconcert to destroy Marc, Unify humanity, and pave the way for the Golden Age of the Galactic Milieu to begin . . .<br/><br/>'A CERTAIN CROWD-PLEASER.'<br/>--Kirkus Reviews', 'language": "en", "image": "https://images.isbndb.com/covers/24/90/9780345362490.jpg", "title_long": "Magnificat (Galactic Milieu Trilogy)", "dimensions": "Height: 7 Inches, Length: 4.5 Inches, Weight: 0.45 Pounds, Width: 1.25 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.5}, "width": {"unit": "inches", "value": 1.25}, "weight": {"unit": "pounds", "value": 0.45}, "height": {"unit": "inches", "value": 7}}, "pages": 432, "date_published": "1997-06-29", "subjects": ["Science Fiction & Fantasy', 'Science Fiction'], 'authors": ["Julian May'], 'title": "Magnificat (Galactic Milieu Trilogy)", "isbn13": "9780345362490", "msrp": 6.99, "binding": "Paperback", "related": {"ePub": "0307776107"}, "isbn": "0345362497", "isbn10": "0345362497", "other_isbns": [{'isbn": "9780307776105", "binding": "printisbn"}]}}