{"book": {"publisher": "Ballantine Books", "synopsis": "Yes, humans and canines are different species, but current research provides fascinating, irrefutable evidence that what we share with our dogs is greater than how we vary. As behaviorist and zoologist Dr. Patricia McConnell tells us in this remarkable new book about emotions in dogs and in people, more and more scientists accept the premise that dogs have rich emotional lives, exhibiting a wide range of feelings including fear, anger, surprise, sadness, and love.<br/><br/>In For the Love of a Dog, McConnell suggests that one of the reasons we love dogs so much is that they express emotions in ways similar to humans. After all, who can communicate joy better than a puppy? But not all emotional expressions are obvious, and McConnell teaches both beginning dog owners and experienced dog lovers how to read the more subtle expressions hidden behind fuzzy faces and floppy ears.<br/><br/>For those of us who deeply cherish our dogs but are sometimes baffled by their behavior, For the Love of a Dog will come as a revelation–a treasure trove of useful facts, informed speculation, and intriguing accounts of man’s best friend at his worst and at his very best. Readers will discover how fear, anger, and happiness underlie the lives of both people and dogs and, most important, how understanding emotion in both species can improve the relationship between them. Thus McConnell introduces us to the possibility of a richer, more rewarding relationship with our dogs.<br/><br/>While we may never be absolutely certain what our dogs are feeling, with the help of this riveting book we can understand more than we ever thought possible. Those who consider their dogs part of the family will find For the Love of a Dog engaging, enlightening, and utterly engrossing.", "language": "en", "image": "https://images.isbndb.com/covers/71/49/9780345477149.jpg", "title_long": "For the Love of a Dog: Understanding Emotion in You and Your Best Friend", "edition": "First Edition", "dimensions": "Height: 9.75 Inches, Length: 7 Inches, Weight: 1.6 Pounds, Width: 1.25 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 7}, "width": {"unit": "inches", "value": 1.25}, "weight": {"unit": "pounds", "value": 1.6}, "height": {"unit": "inches", "value": 9.75}}, "pages": 368, "date_published": "2006-08-29", "subjects": ["Crafts, Hobbies & Home', 'Pets & Animal Care', 'Dogs', 'Science & Math', 'Behavioral Sciences', 'Biological Sciences', 'Zoology'], 'authors": ["Patricia B. McConnell'], 'title": "For the Love of a Dog: Understanding Emotion in You and Your Best Friend", "isbn13": "9780345477149", "msrp": 24.95, 'binding": "Hardcover", "isbn": "0345477146", "isbn10": "0345477146"}}