{"book": {"publisher": "Abacus Books", "synopsis": "In his final book before his death, Primo Levi returns once more to his time at Auschwitz in a moving meditation on memory, resiliency, and the struggle to comprehend unimaginable tragedy.<br/><br/>Drawing on history, philosophy, and his own personal experiences, Levi asks if we have already begun to forget about the Holocaust. His last book before his death, Levi returns to the subject that would define his reputation as a writer and a witness.<br/><br/>Levi breaks his book into eight essays, ranging from topics like the unreliability of memory to how violence twists both the victim and the victimizer. He shares how difficult it is for him to tell his experiences with his children and friends. He also debunks the myth that most of the Germans were in the dark about the Final Solution or that Jews never attempted to escape the camps. As the Holocaust recedes into the past and fewer and fewer survivors are left to tell their stories, The Drowned and the Saved is a vital first-person testament.<br/><br/>Along with Elie Wiesel and Hannah Arendt, Primo Levi is remembered as one of the most powerful and perceptive writers on the Holocaust and the Jewish experience during World War II. This is an essential book both for students and literary readers. Reading Primo Levi is a lesson in the resiliency of the human spirit.", "language": "en", "image": "https://images.isbndb.com/covers/04/70/9780349100470.jpg", "title_long": "The Drowned and the Saved", "edition": "New Ed", "dimensions": "Height: 7.71652 Inches, Length: 4.96062 Inches, Weight: 0.3527396192 Pounds, Width: 0.27559 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 4.96062}, "width": {"unit": "inches", "value": 0.27559}, "weight": {"unit": "pounds", "value": 0.3527396192}, "height": {"unit": "inches", "value": 7.71652}}, "pages": 192, "date_published": "1991", "subjects": ["Literature & Fiction'], 'authors": ["Primo Levi'], 'title": "The Drowned and the Saved", "isbn13": "9780349100470", "msrp": 16.5, 'binding": "Paperback", "isbn": "0349100470", "isbn10": "0349100470"}}