{"book": {"publisher": "Farrar, Straus and Giroux", "synopsis": "In Cross-X, journalist Joe Miller follows the Kansas City Central High School’s debate squad through the 2002 season that ends with a top-ten finish at the national championships in Atlanta.<br/><br/>By almost all measures, Central is just another failing inner-city school. Ninety-nine percent of the students are minorities. Only one in three graduate. Test scores are so low that Missouri bureaucrats have declared the school “academically deficient.” But week after week, a crew of Central kids heads off to debate tournaments in suburbs across the Midwest and South, where they routinely beat teams from top-ranked schools. In a game of fast-talking, wit, and sheer brilliance, these students close the achievement gap between black and white students—an accomplishment that educators and policy makers across the country have been striving toward for years.<br/><br/>Here is the riveting and poignant story of four debaters and their coach as they battle formidable opponents from elite prep schools, bureaucrats who seem maddeningly determined to hold them back, friends and family who are mired in poverty and drug addiction, and—perhaps most daunting—their own self-destructive choices. In the end, Miller finds himself on a campaign to change debate itself, certain that these students from the Eastside of Kansas City may be the saviors of a game that is intrinsic to American democracy.", "language": "en", "image": "https://images.isbndb.com/covers/19/44/9780374131944.jpg", "title_long": "Cross-X: The Amazing True Story of How the Most Unlikely Team from the Most Unlikely of Places Overcame Staggering Obstacles at Home and at School to ... Community on Race, Power, and Education", "dimensions": "Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.8 Pounds, Width: 1.5 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.25}, "width": {"unit": "inches", "value": 1.5}, "weight": {"unit": "pounds", "value": 1.8}, "height": {"unit": "inches", "value": 9.25}}, "pages": 496, "date_published": "2006-10-03", "subjects": ["Politics & Social Sciences', 'Sociology'], 'authors": ["Joe Miller'], 'title": "Cross-X: The Amazing True Story of How the Most Unlikely Team from the Most Unlikely of Places Overcame Staggering Obstacles at Home and at School to ... Community on Race, Power, and Education", "isbn13": "9780374131944", "msrp": 26, "binding": "Hardcover", "isbn": "0374131945", "isbn10": "0374131945", "other_isbns": [{'isbn": "9781429923163", "binding": "print"}]}}