{"book": {"publisher": "Farrar, Straus and Giroux", "synopsis": "A short, powerful new novel by one of the greatest writers in the German language<br/><br/>On a Dark Night I Left My Silent House is Peter Handke"s evocative, moving, often fantastic, novel about one man"s conflict with himself and his journey toward resolution. During one night shift, an unnamed, middle-aged pharmacist in Taxham, an isolated suburb of Salzburg, tells his story to a narrator. The pharmacist is known and well-respected, but lonely and estranged from his wife. He feels most comfortable wandering about in nature, collecting and eating hallucinogenic mushrooms. One day he receives a blow to the head that leaves him unable to speak, and the narrative is transformed from ironic description into a collection of sensual impressions, observations and reflections. The pharmacist, who is now called the driver, sets out on a quest, travelling into the Alps with two companions--a former Olympic skiing champion and a formerly famous poet--where he is beaten and later stalked by a woman. He drives through a tunnel and has a premonition of death, then finds himself in a surreal, foreign land. In a final series of bizarre, cathartic events, the driver regains his speech and is taken back to his pharmacy--back to his former life, but forever changed. A powerful, poetic exploration of language, longing and dislocation in the human experience, On a Dark Night I Left My Silent House reveals Handke at his magical best.", 'language": "en", "image": "https://images.isbndb.com/covers/54/74/9780374175474.jpg", "title_long": "On a Dark Night I Left My Silent House", "edition": "First Edition", "dimensions": "Height: 8.75 Inches, Length: 5.75 Inches, Weight: 0.75398093604 Pounds, Width: 0.75 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.75}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 0.75398093604}, "height": {"unit": "inches", "value": 8.75}}, "pages": 186, "date_published": "2000-11-08", "subjects": ["Literature & Fiction', 'Contemporary', 'Literary', 'Mystery, Thriller & Suspense'], 'authors": ["Peter Handke'], 'title": "On a Dark Night I Left My Silent House", "isbn13": "9780374175474", "msrp": 1.99, "binding": "Hardcover", "isbn": "0374175470", "isbn10": "0374175470", "other_isbns": [{'isbn": "9781466895393", "binding": "printisbncanonical"}]}}