{"book": {"publisher": "Farrar, Straus and Giroux", "synopsis": "If Turkey lived up to its potential, it could rule the world - but will it? A passionate report from the front lines<br/><br/>For centuries few terrors were more vivid in the West than fear of "the Turk," and many people still think of Turkey as repressive, wild, and dangerous. Crescent and Star is Stephen Kinzer\"s compelling report on the truth about this nation of contradictions - poised between Europe and Asia, caught between the glories of its Ottoman past and its hopes for a democratic future, between the dominance of its army and the needs of its civilian citizens, between its secular expectations and its Muslim traditions.<br/><br/>Kinzer vividly describes Turkey\'s captivating delights as he smokes a water pipe, searches for the ruins of lost civilizations, watches a camel fight, and discovers its greatest poet. But he is also attuned to the political landscape, taking us from Istanbul\'s elegant cafes to wild mountain outposts on Turkey\'s eastern borders, while along the way he talks to dissidents and patriots, villagers and cabinet ministers. He reports on political trials and on his own arrest by Turkish soldiers when he was trying to uncover secrets about the army\'s campaigns against Kurdish guerillas. He explores the nation\'s hope to join the European Union, the human-rights abuses that have kept it out, and its difficult relations with Kurds, Armenians, and Greeks.<br/><br/>Will this vibrant country, he asks, succeed in becoming a great democratic state? He makes it clear why Turkey is poised to become 'the most audacious nation of the twenty-first century.'', 'language": "en", "image": "https://images.isbndb.com/covers/86/69/9780374528669.jpg", "title_long": "Crescent and Star: Turkey Between Two Worlds", "edition": "1", "dimensions": "Height: 8.26 Inches, Length: 5.42 Inches, Weight: 0.55 Pounds, Width: 0.735 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.42}, "width": {"unit": "inches", "value": 0.735}, "weight": {"unit": "pounds", "value": 0.55}, "height": {"unit": "inches", "value": 8.26}}, "pages": 272, "date_published": "2002-09-04", "subjects": ["History', 'Middle East', 'Turkey', 'Politics & Social Sciences', 'Social Sciences', 'Customs & Traditions', 'Politics & Government', 'International & World Politics'], 'authors": ["Stephen Kinzer'], 'title": "Crescent and Star: Turkey Between Two Worlds", "isbn13": "9780374528669", "msrp": 16, 'binding": "Paperback", "isbn": "0374528667", "isbn10": "0374528667"}}