{"book": {"publisher": "Farrar, Straus and Giroux", "synopsis": "On a winter night on a remote Nebraska road, 27-year-old Mark Schluter flips his truck in a near-fatal accident. His older sister Karin, his only near kin, returns reluctantly to their hometown to nurse Mark back from a traumatic head injury. But when he emerges from a protracted coma, Mark believes that this woman–who looks, acts, and sounds just like his sister–is really an identical impostor. Shattered by her brother"s refusal to recognize her, Karin contacts the cognitive neurologist Gerald Weber, famous for his case histories describing the infinitely bizarre worlds of brain disorder. Weber recognizes Mark as a rare case of Capgras Syndrome, a doubling delusion, and eagerly investigates. What he discovers in Mark slowly undermines even his own sense of being. Meanwhile, Mark, armed only with a note left by an anonymous witness, attempts to learn what happened the night of his inexplicable accident. The truth of that evening will change the lives of all three beyond recognition.<br/>Set against the Platte River"s massive spring migrations–one of the greatest spectacles in nature–The Echo Maker is a gripping mystery that explores the improvised human self and the even more precarious brain that splits us from and joins us to the rest of creation.<br/>The Echo Maker is the winner of the 2006 National Book Award for Fiction.", 'language": "en", "image": "https://images.isbndb.com/covers/63/51/9780374146351.jpg", "title_long": "The Echo Maker: A Novel", "edition": "First Edition", "dimensions": "Height: 8.999982 Inches, Length: 6 Inches, Weight: 1.75 Pounds, Width: 1.19 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1.19}, "weight": {"unit": "pounds", "value": 1.75}, "height": {"unit": "inches", "value": 8.999982}}, "pages": 464, "date_published": "2006-10-17", "subjects": ["Literature & Fiction', 'United States', 'Literary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Psychological Thrillers', 'Suspense', 'Self Service', 'Custom Stores'], 'authors": ["Richard Powers'], 'title": "The Echo Maker: A Novel", "isbn13": "9780374146351", "msrp": 25, "binding": "Hardcover", "isbn": "0374146357", "isbn10": "0374146357", "other_isbns": [{'isbn": "9780374706548", "binding": "printisbncanonical"}]}}