{"book": {"publisher": "Pantheon", "synopsis": "ISABEL DALHOUSIE - Book 2<br/><br/>Nothing captures the charm of Edinburgh like the bestselling Isabel Dalhousie series of novels featuring the insatiably curious philosopher and woman detective. Whether investigating a case or a problem of philosophy, the indefatigable Isabel Dalhousie, one of fiction’s most richly developed amateur detectives, is always ready to pursue the answers to all of life’s questions, large and small.<br/><br/>In this delightful second installment in Alexander McCall Smith’s best-selling new detective series, the irrepressibly curious Isabel Dalhousie, editor of the Review of Applied Ethics, gets caught up in an affair of the heart—this one a transplant.<br/><br/>When Isabel’s niece, Cat, asks Isabel to run her delicatessen while she attends a wedding in Italy, Isabel meets a man with a most interesting problem. He recently had a heart transplant and is suddenly plagued with memories of events that never happened to him. The situation appeals to Isabel as a philosophical question: Is the heart truly the seat of the soul? And it piques her insatiable curiosity: Could the memories be connected with the donor’s demise? Of course, Grace—Isabel’s no-nonsense housekeeper—and Isabel’s friend Jamie think it is none of Isabel’s business. Meanwhile, Cat brings home an Italian lothario, who, in accordance with all that Isabel knows about Italian lotharios, shouldn’t be trusted . . . but, goodness, he is charming.<br/><br/>That makes two mysteries of the heart to be solved—just the thing for Isabel Dalhousie.", "language": "en", "image": "https://images.isbndb.com/covers/29/97/9780375422997.jpg", "title_long": "Friends, Lovers, Chocolate (An Isabel Dalhousie Novel)", "dimensions": "Height: 8.52 Inches, Length: 5.81 Inches, Weight: 0.92 Pounds, Width: 0.96 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.81}, "width": {"unit": "inches", "value": 0.96}, "weight": {"unit": "pounds", "value": 0.92}, "height": {"unit": "inches", "value": 8.52}}, "pages": 261, "date_published": "2005-09-20", "subjects": ["Literature & Fiction', 'Women's Fiction', 'Contemporary', 'Mystery, Thriller & Suspense', 'Mystery', 'Traditional Detectives', 'Women Sleuths', 'Self Service', 'Custom Stores'], 'authors": ["Alexander McCall Smith'], 'title": "Friends, Lovers, Chocolate (An Isabel Dalhousie Novel)", "isbn13": "9780375422997", "msrp": 21.95, "binding": "Hardcover", "related": {"Kindle Edition": "0375423923", "ePub": "0375423923"}, "isbn": "0375422994", "isbn10": "0375422994", "other_isbns": [{'isbn": "9780375423925", "binding": "printisbn"}]}}