{"book": {"publisher": "Vintage", "synopsis": "<p>Richard Pevear and Larissa Volokhonsky’s masterful translation of <b>The Idiot</b> is destined to stand with their versions of <b>Crime and Punishment, The Brothers Karamazov</b><i>, </i>and <b>Demons</b> as the definitive Dostoevsky in English.<br><br>After his great portrayal of a guilty man in <b>Crime and Punishment</b><i>,</i> Dostoevsky set out in <b>The Idiot</b> to portray a man of pure innocence. The twenty-six-year-old Prince Myshkin, following a stay of several years in a Swiss sanatorium, returns to Russia to collect an inheritance and “be among people.” Even before he reaches home he meets the dark Rogozhin, a rich merchant’s son whose obsession with the beautiful Nastasya Filippovna eventually draws all three of them into a tragic denouement. In Petersburg the prince finds himself a stranger in a society obsessed with money, power, and manipulation. Scandal escalates to murder as Dostoevsky traces the surprising effect of this “positively beautiful man” on the people around him, leading to a final scene that is one of the most powerful in all of world literature.</p>", "language": "en", "image": "https://images.isbndb.com/covers/22/42/9780375702242.jpg", "title_long": "The Idiot (Vintage Classics)", "edition": "Reprint", "dimensions": "Height: 7.9 Inches, Length: 5.12 Inches, Weight: 1.05 Pounds, Width: 1.1 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.12}, "width": {"unit": "inches", "value": 1.1}, "weight": {"unit": "pounds", "value": 1.05}, "height": {"unit": "inches", "value": 7.9}}, "pages": 656, "date_published": "2003-07-08", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Family Saga', 'World Literature', 'Russian & Soviet', 'Literary', 'Teen & Young Adult', 'Self Service', 'Custom Stores'], 'authors": ["Fyodor Dostoevsky'], 'title": "The Idiot (Vintage Classics)", "isbn13": "9780375702242", "msrp": 16.95, "binding": "Paperback", "related": {"Kindle Edition": "0553901893"}, "isbn": "0375702245", "isbn10": "0375702245", "other_isbns": [{'isbn": "9780553901894", "binding": "printisbn"}]}}