{"book": {"publisher": "Knopf Books for Young Readers", "synopsis": "PUBLISHED IN 40 COUNTRIES, with over 5 million copies in print in North America alone, Philip Pullman"s His Dark Materials trilogy -The Golden Compass, The Subtle Knife, and The Amber Spyglass - has graced the New York Times, Wall Street Journal, San Francisco Chronicle, Book Sense, and Publishers Weekly bestseller lists.<br/><br/>For these deluxe editions, Philip Pullman has created new material: papers of Lord Asrial for The Golden Compass (15 new pages), papers of Colonel John Parry for the 10-year anniversary of The Subtle Knife (15 new pages), and letters of Mary Malone from secret Magisterium files for The Amber Spyglass (10 new pages). In each book, the new material has been illustrated and handlettered by renowned artist Ian Beck and will be included in the backmatter.<br/><br/>Each deluxe edition also features a ribbon bookmark, rough-edged pages, and Pullman"s own chapter-opening spot art. These volumes form a gorgeous collectible set of the trilogy - a perfect gift for loyal Pullman readers and new fans alike.", 'language": "en", "image": "https://images.isbndb.com/covers/67/31/9780375846731.jpg", "title_long": "The Amber Spyglass, Deluxe 10th Anniversary Edition (His Dark Materials, Book 3)(Rough-cut)", "edition": "Deluxe", "dimensions": "Height: 9.26 Inches, Length: 6.37 Inches, Weight: 1.8 Pounds, Width: 1.71 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.37}, "width": {"unit": "inches", "value": 1.71}, "weight": {"unit": "pounds", "value": 1.8}, "height": {"unit": "inches", "value": 9.26}}, "pages": 560, "date_published": "2007-08-28", "subjects": ["Teen & Young Adult', 'Literature & Fiction', 'Action & Adventure', 'Science Fiction & Fantasy', 'Fantasy'], 'authors": ["Philip Pullman'], 'title": "The Amber Spyglass, Deluxe 10th Anniversary Edition (His Dark Materials, Book 3)(Rough-cut)", "isbn13": "9780375846731", "msrp": 22.99, 'binding": "Hardcover", "isbn": "0375846735", "isbn10": "0375846735"}}