{"book": {"publisher": "Knopf Books for Young Readers", "synopsis": "A hilarious, high-stakes adventure involving crooked casino boats, floating fish, toxic beaches, and one kid determined to get justice. This is Carl Hiaasen"s Florida—where the creatures are wild and the people are wilder!<br/><br/>You know it"s going to be a rough summer when you spend Father"s Day visiting your dad in the local lockup.<br/><br/>Noah's dad is sure that the owner of the Coral Queen casino boat is flushing raw sewage into the harbor–which has made taking a dip at the local beach like swimming in a toilet. He can't prove it though, and so he decides that sinking the boat will make an effective statement. Right. The boat is pumped out and back in business within days and Noah's dad is stuck in the clink.<br/><br/>Now Noah is determined to succeed where his dad failed. He will prove that the Coral Queen is dumping illegally . . . somehow. His allies may not add up to much–his sister Abbey, an unreformed childhood biter; Lice Peeking, a greedy sot with poor hygiene; Shelly, a bartender and a woman scorned; and a mysterious pirate–but Noah's got a plan to flush this crook out into the open. A plan that should sink the crooked little casino, once and for all.', 'language": "en", "image": "https://images.isbndb.com/covers/18/20/9780375821820.jpg", "title_long": "Flush", "edition": "First Edition", "dimensions": "Height: 8.53 Inches, Length: 5.87 Inches, Weight: 0.6 Pounds, Width: 0.95 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.87}, "width": {"unit": "inches", "value": 0.95}, "weight": {"unit": "pounds", "value": 0.6}, "height": {"unit": "inches", "value": 8.53}}, "pages": 272, "date_published": "2005-09-13", "subjects": ["Children's Books', 'Growing Up & Facts of Life', 'Family Life', 'Science, Nature & How It Works', 'Nature', 'Recycling & Green Living', 'Humor', 'Mysteries & Detectives'], 'authors": ["Carl Hiaasen'], 'title": "Flush", "isbn13": "9780375821820", "msrp": 16.95, 'binding": "Hardcover", "isbn": "0375821821", "isbn10": "0375821821"}}