{"book": {"publisher": "Vintage", "synopsis": "In Masters of Death, Pulitzer Prize-winning author Rhodes gives full weight, for the first time, to the Einsatzgruppen’s role in the Holocaust. These “special task forces,” organized by Heinrich Himmler to follow the German army as it advanced into eastern Poland and Russia, were the agents of the first phase of the Final Solution. They murdered more than 1.5 million men, women, and children between 1941 and 1943, often by shooting them into killing pits, as at Babi Yar.<br/><br/>These massive crimes have been generally overlooked or underestimated by Holocaust historians, who have focused on the gas chambers. In this painstaking account, Pulitzer Prize-winning author Richard Rhodes profiles the eastern campaign’s architects as well as its “ordinary” soldiers and policemen, and helps us understand how such men were conditioned to carry out mass murder. Marshaling a vast array of documents and the testimony of perpetrators and survivors, this book is an essential contribution to our understanding of the Holocaust and World War II.", "language": "en", "image": "https://images.isbndb.com/covers/82/20/9780375708220.jpg", "title_long": "Masters of Death: The SS-Einsatzgruppen and the Invention of the Holocaust", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.24 Inches, Weight: 0.8 Pounds, Width: 0.8 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.24}, "width": {"unit": "inches", "value": 0.8}, "weight": {"unit": "pounds", "value": 0.8}, "height": {"unit": "inches", "value": 8}}, "pages": 368, "date_published": "2003-08-12", "subjects": ["History', 'Europe', 'Germany', 'Military', 'World War II', 'World', 'Jewish'], 'authors": ["Richard Rhodes'], 'title": "Masters of Death: The SS-Einsatzgruppen and the Invention of the Holocaust", "isbn13": "9780375708220", "msrp": 17.95, "binding": "Paperback", "related": {"Kindle Edition": "0307426807", "ePub": "0307426807"}, "isbn": "0375708227", "isbn10": "0375708227", "other_isbns": [{'isbn": "9780307426802", "binding": "printisbn"}]}}