{"book": {"publisher": "Vintage", "synopsis": "In this landmark work of history, the National Book Award—winning author of American Sphinx explores how a group of greatly gifted but deeply flawed individuals–Hamilton, Burr, Jefferson, Franklin, Washington, Adams, and Madison–confronted the overwhelming challenges before them to set the course for our nation.<br/><br/>The United States was more a fragile hope than a reality in 1790. During the decade that followed, the Founding Fathers–re-examined here as Founding Brothers–combined the ideals of the Declaration of Independence with the content of the Constitution to create the practical workings of our government. Through an analysis of six fascinating episodes–Hamilton and Burr’s deadly duel, Washington’s precedent-setting Farewell Address, Adams’ administration and political partnership with his wife, the debate about where to place the capital, Franklin’s attempt to force Congress to confront the issue of slavery and Madison’s attempts to block him, and Jefferson and Adams’ famous correspondence–Founding Brothers brings to life the vital issues and personalities from the most important decade in our nation’s history.", "language": "en", "image": "https://images.isbndb.com/covers/52/43/9780375705243.jpg", "title_long": "Founding Brothers: The Revolutionary Generation", "edition": "Reprint", "dimensions": "Height: 7.98 Inches, Length: 5.13 Inches, Weight: 0.51 Pounds, Width: 0.64 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.13}, "width": {"unit": "inches", "value": 0.64}, "weight": {"unit": "pounds", "value": 0.51}, "height": {"unit": "inches", "value": 7.98}}, "pages": 304, "date_published": "2002-02-05", "subjects": ["Biographies & Memoirs', 'Historical', 'United States', 'Leaders & Notable People', 'Military', 'History', 'Americas', 'Politics & Social Sciences', 'Politics & Government', 'Political Science', 'Self Service', 'Custom Stores'], 'authors": ["Joseph J. Ellis'], 'title": "Founding Brothers: The Revolutionary Generation", "isbn13": "9780375705243", "msrp": 11.99, "binding": "Paperback", "related": {"Kindle Edition": "1400077680", "ePub": "1400077680"}, "isbn": "0375705244", "isbn10": "0375705244", "other_isbns": [{'isbn": "9781400077687", "binding": "print"}]}}