{"book": {"publisher": "Vintage", "synopsis": "The Pulitzer Prize–winning author of American Pastoral delivers the astonishing story of the rise and fall of an American man whose life is destroyed in the McCarthy witchhunt of the 1950s.<br/><br/>"Gripping.... A masterly, often unnerving, blend of tenderness, harshness, insight and wit." —The New York Times Book Review<br/><br/>I Married a Communist is the story of Ira Ringold, a big American roughneck who begins life as a teenage ditch-digger in 1930s Newark, becomes a big-time 1940s radio star, and is destroyed, as both a performer and a man, in the McCarthy witchhunt.<br/><br/>In his heyday as a star—and as a zealous, bullying supporter of "progressive' political causes—Ira marries Hollywood\'s beloved silent-film star, Eve Frame. Their glamorous honeymoon in her Manhattan townhouse is short-lived, however, and it is the publication of Eve\'s scandalous bestselling exposé that identifies him as 'an American taking his orders from Moscow.'<br/><br/>In this story of cruelty, betrayal, and revenge spilling over into the public arena from their origins in Ira\'s turbulent personal life, Philip Roth—who Commonweal calls the 'master chronicler of the American twentieth century”—has written a brilliant fictional protrayal of that treacherous postwar epoch when the anti-Communist fever not only infected national politics but traumatized the intimate, innermost lives of friends and families, husbands and wives, parents and children.', 'language": "en", "image": "https://images.isbndb.com/covers/72/16/9780375707216.jpg", "title_long": "I Married a Communist: American Trilogy (2)", "edition": "1st Vintage International Edition", "dimensions": "Height: 7.96 Inches, Length: 5.25 Inches, Weight: 0.63 Pounds, Width: 0.77 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.25}, "width": {"unit": "inches", "value": 0.77}, "weight": {"unit": "pounds", "value": 0.63}, "height": {"unit": "inches", "value": 7.96}}, "pages": 323, "date_published": "1999-11-02", "subjects": ["Literature & Fiction', 'Contemporary', 'Literary', 'Politics & Social Sciences', 'Politics & Government', 'Specific Topics', 'Self Service', 'Custom Stores'], 'authors": ["Philip Roth'], 'title": "I Married a Communist: American Trilogy (2)", "isbn13": "9780375707216", "msrp": 16.95, 'binding": "Paperback", "isbn": "0375707212", "isbn10": "0375707212"}}