{"book": {"publisher": "Alfred A. Knopf", "synopsis": "***** THE BOOK OF DUST, the long-awaited new novel from Philip Pullman set in the world of His Dark Materials, has been hailed by the New York Times as "A stunning achievement"*****<br/><br/>The Golden Compass, The Subtle Knife, and The Amber Spyglass are available together in one volume perfect for any fan or newcomer to this modern fantasy classic series that has graced the New York Times, Wall Street Journal, San Francisco Chronicle, Book Sense, and Publishers Weekly bestseller lists.<br/><br/>These thrilling adventures tell the story of Lyra and Will—two ordinary children on a perilous journey through shimmering haunted otherworlds. They will meet witches and armored bears, fallen angels and soul-eating specters. And in the end, the fate of both the living—and the dead—will rely on them.<br/><br/>Phillip Pullman’s spellbinding His Dark Materials trilogy has captivated readers for over twenty years and won acclaim at every turn. It will have you questioning everything you know about your world and wondering what really lies just out of reach.<br/><br/>Honors and Praise for His Dark Materials:<br/>An Entertainment Weekly All-Time Greatest Novel<br/>A Newsweek Top 100 Book of All Time<br/><br/>"Arguably the best juvenile fantasy novel of the past twenty years.' —The Washington Post<br/><br/>'Very grand indeed.' —The New York Times<br/><br/>“Pullman is quite possibly a genius.” —Newsweek', 'language": "es", "image": "https://images.isbndb.com/covers/72/26/9780375847226.jpg", "title_long": "His Dark Materials", "dimensions": "Weight: 0.7936641432 Pounds", "dimensions_structured": {"weight": {"unit": "pounds", "value": 0.7936641432}}, "pages": 933, "date_published": "2007", "subjects": ["Teen & Young Adult', 'Literature & Fiction', 'Classics', 'Short Stories', 'Action & Adventure', 'Science Fiction & Fantasy', 'Fantasy'], 'authors": ["Philip Pullman'], 'title": "His Dark Materials", "isbn13": "9780375847226", "msrp": 21.99, "binding": "Paperback", "related": {"Kindle Edition": "0307808203", "ePub": "0307808203"}, "isbn": "0375847227", "isbn10": "0375847227", "other_isbns": [{'isbn": "9780307808202", "binding": "printisbn"}]}}