{"book": {"publisher": "Villard", "synopsis": "The lawyer turned on the tape recorder, handed his client a cigarette, and lit it for him. Black drew hard, squinting as the smoke rushed into his lungs.<br/>"Where do you want to start?"the lawyer said, lighting a cigarette of his own.<br/>"I guess there’s only one place to start; at Broad and Erie.'<br/><br/>Johnny Podres, a politician whose record against corruption had been propelling him straight to the mayor’s office, is found murdered in a North Philly crack house.<br/><br/>Enter Samuel Jackson, a.k.a. Black, a drug addict who knows better, a man embittered by the fact that he can’t seem to escape from his addiction to crack cocaine or, for that matter, from himself. Though he was once a family man with a wife and son, Black’s only concern these days is getting his next high, that is, until he stumbles across a friend and fellow addict, Leroy, and both become prime suspects in the Podres murder. Black and Leroy hook up with two female pipers: Clarisse, a registered nurse who is slowly losing to crack any semblance of a respectable life, and Pookie, who already has lost it. Soon the hunt is on for all four as they try to stay one step ahead of a police department under tremendous pressure to solve the case—because if a killer isn’t found soon, this could blow up into one of the biggest scandals in Philadelphia history.<br/><br/>Solomon Jones weaves a suspenseful story against the backdrop of corruption in the Philadelphia police department and centers it on a group of drug addicts who, in the process of fleeing the law, come to terms with their own addiction, leading to some devastating consequences.', 'language": "en", "image": "https://images.isbndb.com/covers/66/03/9780375756603.jpg", "title_long": "Pipe Dream: A Novel (Strivers Row)", "edition": "First Edition", "dimensions": "Height: 8 Inches, Length: 5.2 Inches, Weight: 0.63713593718 Pounds, Width: 0.7 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 0.7}, "weight": {"unit": "pounds", "value": 0.63713593718}, "height": {"unit": "inches", "value": 8}}, "pages": 352, "date_published": "2001-07-31", "subjects": ["Literature & Fiction', 'Action & Adventure', 'Mystery, Thriller & Suspense', 'United States', 'Contemporary', 'Mystery', 'Self Service', 'Custom Stores'], 'authors": ["Solomon Jones'], 'title": "Pipe Dream: A Novel (Strivers Row)", "isbn13": "9780375756603", "msrp": 15, "binding": "Paperback", "related": {"ePub": "0375506594"}, "isbn": "0375756604", "isbn10": "0375756604", "other_isbns": [{'isbn": "9780375506598", "binding": "printisbn"}]}}