{"book": {"publisher": "Random House Large Print", "synopsis": "An Italian village on a hilltop near the Adriatic coast, a decaying palazzo facing the sea, and in the basement, cobwebbed and dusty, lit by a single bulb, an archive unknown to scholars. Here, a young graduate student from Rome, Francesca Cappelletti, makes a discovery that inspires a search for a work of art of incalculable value, a painting lost for almost two centuries.<br/><br/>The artist was Caravaggio, a master of the Italian Baroque. He was a genius, a revolutionary painter, and a man beset by personal demons. Four hundred years ago, he drank and brawled in the taverns and streets of Rome, moving from one rooming house to another, constantly in and out of jail, all the while painting works of transcendent emotional and visual power. He rose from obscurity to fame and wealth, but success didn’t alter his violent temperament. His rage finally led him to commit murder, forcing him to flee Rome a hunted man. He died young, alone, and under strange circumstances.<br/><br/>Caravaggio scholars estimate that between sixty and eighty of his works are in existence today. Many others–no one knows the precise number–have been lost to time. Somewhere, surely, a masterpiece lies forgotten in a storeroom, or in a small parish church, or hanging above a fireplace, mistaken for a mere copy.<br/><br/>Prizewinning author Jonathan Harr embarks on an spellbinding journey to discover the long-lost painting known as The Taking of Christ–its mysterious fate and the circumstances of its disappearance have captivated Caravaggio devotees for years. After Francesca Cappelletti stumbles across a clue in that dusty archive, she tracks the painting across a continent and hundreds of years of history. But it is not until she meets Sergio Benedetti, an art restorer working in Ireland, that she finally manages to assemble all the pieces of the puzzle.<br/><br/>Told with consummate skill by the writer of the bestselling, award-winning A Civil Action, The Lost Painting is a remarkable synthesis of history and detective story. The fascinating details of Caravaggio’s strange, turbulent career and the astonishing beauty of his work come to life in these pages. Harr’s account is not unlike a Caravaggio painting: vivid, deftly wrought, and enthralling.<br/>". . . Jonathan Harr has gone to the trouble of writing what will probably be a bestseller . . . rich and wonderful. . .in truth, the book reads better than a thriller because, unlike a lot of best-selling nonfiction authors who write in a more or less novelistic vein (Harr\"s previous book, A Civil Action, was made into a John Travolta movie), Harr doesn\"t plump up hi tale. He almost never foreshadows, doesn\'t implausibly reconstruct entire conversations and rarely throws in litanies of clearly conjectured or imagined details just for color\'s sake. . .if you\'re a sucker for Rome, and for dusk. . .[you\'ll] enjoy Harr\'s more clearly reported details about life in the city, as when--one of my favorite moments in the whole book--Francesca and another young colleague try to calm their nerves before a crucial meeting with a forbidding professor by eating gelato. And who wouldn\'t in Italy? The pleasures of travelogue here are incidental but not inconsiderable.' --The New York Times Book Review<br/><br/>'Jonathan Harr has taken the story of the lost painting, and woven from it a deeply moving narrative about history, art and taste--and about the greed, envy, covetousness and professional jealousy of people who fall prey to obsession. It is as perfect a work of narrative nonfiction as you could ever hope to read.' --The Economist', 'language": "en", "image": "https://images.isbndb.com/covers/15/31/9780375431531.jpg", "title_long": "The Lost Painting (Random House Large Print)", "edition": "First Edition", "dimensions": "Height: 6.4 Inches, Length: 9.54 Inches, Weight: 1.35 Pounds, Width: 1.18 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 9.54}, "width": {"unit": "inches", "value": 1.18}, "weight": {"unit": "pounds", "value": 1.35}, "height": {"unit": "inches", "value": 6.4}}, "pages": 368, "date_published": "2005-11-01", "subjects": ["Arts & Photography', 'Individual Artists', 'History & Criticism', 'History'], 'authors": ["Jonathan Harr'], 'title": "The Lost Painting (Random House Large Print)", "isbn13": "9780375431531", "msrp": 26.95, 'binding": "Hardcover", "isbn": "0375431535", "isbn10": "0375431535"}}