{"book": {"publisher": "Random House", "synopsis": "Beachy Head is a bit of quintessential England–a seaside promontory where green pastures roll to the edge of chalk cliffs, a place of sheep and wind and ineffable beauty. But it is also a major landmark on the map of self-inflicted death. Since 1965, some five hundred people have ended their lives by jumping or driving or simply walking off the 535-foot cliffs, making Beachy Head one of the most popular suicide spots in the world. And still they come, every week another one or two–the young and the old, the terminally ill and the vigorously healthy, the bereft, the insane, the despairing. Why here? Why so many? One chilly English spring, American writer and teacher Tom Hunt left his home and family and journeyed to this bucolic landscape to find out.<br/>In a narrative that seamlessly weaves together personal memoir, history, travelogue, and investigative journalism, Hunt recounts a season of disturbing revelations (including that Princess Diana allegedly came here intending to jump). Still reeling from a suicide in his own family, Hunt arrives in England obsessed with Beachy Head’s grisly mystique, yet utterly unsure of what he would discover.<br/>Gradually, with typical English reserve, the people who haunt this extraordinary place release their secrets. Servers in the local tavern–known among residents as the Last Stop Pub–whisper about their encounters with hollow-eyed men and women in their final hours. The celebrated local witch asserts his belief that the place was once used for human sacrifice. The kindly coroner provides access to suicide notes, photographs, and the Sudden Death file. “It’s a very cold solution,” confides a wheelchair-bound ex-hippie who miraculously survived his own jump.<br/>In the course of wrenching interviews with bereft family members, watchful taxi drivers, and brave rescue workers, it dawns on Hunt that in each of us is a will to die every bit as tenacious and unyielding as the desire to live–and that Beachy Head stiffens and heightens this death wish. It’s a stage that all but begs to be leapt from. A work of terrible sadness and harrowing revelations, Cliffs of Despair is the account of an unforgettable journey to a place where beauty and death collide.", "language": "en", "image": "https://images.isbndb.com/covers/71/51/9780375507151.jpg", "title_long": "Cliffs of Despair: A Journey to the Edge", "edition": "First Edition", "dimensions": "Height: 8.53 Inches, Length: 5.85 Inches, Weight: 1.8 Pounds, Width: 0.9 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.85}, "width": {"unit": "inches", "value": 0.9}, "weight": {"unit": "pounds", "value": 1.8}, "height": {"unit": "inches", "value": 8.53}}, "pages": 256, "date_published": "2006-01-24", "subjects": ["Self-Help', 'Death & Grief', 'Suicide', 'Biographies & Memoirs', 'Health, Fitness & Dieting', 'Psychology & Counseling', 'History', 'Europe'], 'authors": ["Tom Hunt'], 'title": "Cliffs of Despair: A Journey to the Edge", "isbn13": "9780375507151", "msrp": 24.95, "binding": "Hardcover", "related": {"ePub": "0307430812"}, "isbn": "0375507159", "isbn10": "0375507159", "other_isbns": [{'isbn": "9780307430816", "binding": "printisbn"}]}}