{"book": {"publisher": "Random House", "synopsis": "“A riveting account that reaches beyond the market landscape to say something universal about risk and triumph, about hubris and failure.”—The New York Times<br/><br/>NAMED ONE OF THE BEST BOOKS OF THE YEAR BY BUSINESSWEEK<br/><br/>In this business classic—now with a new Afterword in which the author draws parallels to the recent financial crisis—Roger Lowenstein captures the gripping roller-coaster ride of Long-Term Capital Management. Drawing on confidential internal memos and interviews with dozens of key players, Lowenstein explains not just how the fund made and lost its money but also how the personalities of Long-Term’s partners, the arrogance of their mathematical certainties, and the culture of Wall Street itself contributed to both their rise and their fall.<br/><br/>When it was founded in 1993, Long-Term was hailed as the most impressive hedge fund in history. But after four years in which the firm dazzled Wall Street as a $100 billion moneymaking juggernaut, it suddenly suffered catastrophic losses that jeopardized not only the biggest banks on Wall Street but the stability of the financial system itself. The dramatic story of Long-Term’s fall is now a chilling harbinger of the crisis that would strike all of Wall Street, from Lehman Brothers to AIG, a decade later. In his new Afterword, Lowenstein shows that LTCM’s implosion should be seen not as a one-off drama but as a template for market meltdowns in an age of instability—and as a wake-up call that Wall Street and government alike tragically ignored.<br/><br/>Praise for When Genius Failed<br/><br/>“[Roger] Lowenstein has written a squalid and fascinating tale of world-class greed and, above all, hubris.”—BusinessWeek<br/><br/>“Compelling . . . The fund was long cloaked in secrecy, making the story of its rise . . . and its ultimate destruction that much more fascinating.”—The Washington Post<br/><br/>“Story-telling journalism at its best.”—The Economist", "language": "hi", "image": "https://images.isbndb.com/covers/82/56/9780375758256.jpg", "title_long": "When Genius Failed", "edition": "Family Edition", "dimensions": "Height: 1 Inches, Length: 11 Inches, Weight: 0.52 Pounds, Width: 9 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 11}, "width": {"unit": "inches", "value": 9}, "weight": {"unit": "pounds", "value": 0.52}, "height": {"unit": "inches", "value": 1}}, "pages": 304, "date_published": "2000", "subjects": ["Business & Money', 'Biography & History', 'Company Profiles', 'Economics', 'Free Enterprise & Capitalism', 'Theory', 'Banks & Banking', 'Finance', 'Financial Risk Management', 'Investing'], 'authors": ["Roger Lowenstein'], 'title": "When Genius Failed", "isbn13": "9780375758256", "msrp": 18, "binding": "Paperback", "related": {"ePub": "0375506446"}, "isbn": "0375758259", "isbn10": "0375758259", "other_isbns": [{'isbn": "9780375506444", "binding": "print"}]}}