{"book": {"publisher": "Random House Audio", "synopsis": "Product Description      Read by Ed AsnerSix Cassettes, 9 hoursContains: Tourist SeasonStormy WeatherStrip TeaseThis collection contains three classic Hiaasen titles.\xa0\xa0The set is 40% off the individual retail price of the audiobook.Tourist SeasonThe only trace of the first victim was his Shriner\"s fez washed up on the Miami Beach. The second victim, the head of the city\"s chamber of commerce, was found dead with a toy alligator lodged in his throat. And that was just the beginning ...Now Brian Keyes, reporter turned private eye, must move from muckraking to rooting out murder ... in a caper that will mix football players, politicians, and police with a group of anti-development fanatics and a very, hungry crocodile.Stormy WeatherWhen a ferocious hurricane rips through Southern Florida, the con artists and carpetbaggers waste no time swarming over the disaster area.Among the predators are Edie Marsh, an entrepreneurial young woman whose scheme to sleep with a Palm Beach Kennedy has fizzled, freeing her to concoct a colossal insurance rip-off; Lester Maddox Parsons, a murderous ex-con whose violent encounter with a game warden has left him with the fitting nickname of "Snapper'; and Avila, a crooked building inspector-turned-roofer, who dabbles somewhat unsuccessfully in the occult.Caught in the middle are Max and Bonnie Lamb, newlyweds torn in wildly different directions by the storm. It is Max\'s fateful decision to abort their Disney World honeymoon and race to Dade County to see the terrible devastation. Armed with a video camera, the ambitious young advertising executive can\'t wait to show his hurricane tapes to his buddies back in New York. Over Bonnie\'s objections, Max eagerly sets out through the rubble, debris, and mayhem -- and promptly vanishes. The only clue to his whereabouts: a runaway monkey. But there\'s also a man called Skink who has devoted his very strange existence to saving Florida from the kinds of people blown in by the hurricane. It is he, crazed and determined, who prowls the swath of the storm and forever changes the lives of Max, Bonnie, Edie, and the others.Their paths -- tangled before they even know it -- come together in a novel that continues the hilarious and scathing muckraking tradition that Carl Hiaasen has so mercilessly made his own. In Stormy Weather, there is no calm eye.Strip TeaseOnly in America could the guest of honor at a bachelor party become a mortal threat to Big Stoney and Big Government. Only in South Florida could a virtuous topless dancer join forces with a cool but clueless cop. And only in a work by Carl Hiaasen could we get riveting suspense, razor-sharp characters, and the most wicked humor imaginable.      From Library Journal      The Hiaasen formula for madness and mayhem in Florida becomes apparent in listening to these three novels in succession. A not-too-bright guy meets up with a feisty, smart, pretty woman who has a problemDor who wants to help the good guy solve his dilemma. The 'problem' involves powerful and dangerous Florida bad guys who are usually crazy. In their innocence, the good guy/girl find a way to overcome the odds and foil the plans of these men. The lengths to which good guys and bad guys will go to gain their end and the ludicrous positions in which they find themselves as a result are what makes these stories humorous. Drugs, sex, politics, natural disasters, petty crime, bloody violence, and lunatics galoreDHiaasen includes it all. Ed Asner reads life into all these zany characters. Recommended.DJoanna M. Burkhardt, Univ. of Rhode Island Coll. of Continuing Education Lib., Providence Copyright 2000 Reed Business Information, Inc.      From the Inside Flap      Read by Ed AsnerSix Cassettes, 9 hoursContains: Tourist SeasonStormy WeatherStrip TeaseThis collection contains three classic Hiaasen titles.\xa0\xa0The set is 40% off the individual retail price of the audiobook.Tourist SeasonThe only trace of the first victim was his Shriner\'s fez washed up on t', 'language": "en", "image": "https://images.isbndb.com/covers/04/68/9780375410468.jpg", "title_long": "A Carl Hiaasen Collection", "edition": "Abridged", "dimensions": "Height: 6.13 Inches, Length: 4.18 Inches, Width: 2.66 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.18}, "width": {"unit": "inches", "value": 2.66}, "height": {"unit": "inches", "value": 6.13}}, "pages": 9, "date_published": "2000", "subjects": ["Literature & Fiction', 'Literary'], 'authors": ["Carl Hiaasen'], 'title": "A Carl Hiaasen Collection", "isbn13": "9780375410468", "msrp": 14.94, 'binding": "Audio Cassette", "isbn": "0375410465", "isbn10": "0375410465"}}