{"book": {"publisher": "Vintage", "synopsis": "Anna Karenina left her husband for a dashing officer. Lady Chatterley left hers for the gamekeeper. Now Alice Coombs has her boyfriend for nothing … nothing at all. Just how that should have come to pass and what Philip Engstrand, Alice’s spurned boyfriend, can do about it is the premise for this vertiginous speculative romance by the acclaimed author of Gun, with Occasional Music.<br/>Alice Coombs is a particle physicist, and she and her colleagues have created a void, a hole in the universe, that they have taken to calling Lack. But Lack is a nullity with taste—tastes; it absorbs a pomegranate, light bulbs, an argyle sock; it disdains a bow tie, an ice ax, and a scrambled duck egg. To Alice, this selectivity translates as an irresistible personality. To Philip, it makes Lack an unbeatable rival, for how can he win Alice back from something that has no flaws—because it has no qualities? Ingenious, hilarious, and genuinely mind-expanding, As She Climbed Across the Table is the best boy-meets-girl-meets-void story ever written.", "language": "en", "image": "https://images.isbndb.com/covers/01/25/9780375700125.jpg", "title_long": "As She Climbed Across the Table: A Novel", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.2 Inches, Weight: 0.39903669422 Pounds, Width: 0.5 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 0.5}, "weight": {"unit": "pounds", "value": 0.39903669422}, "height": {"unit": "inches", "value": 8}}, "pages": 224, "date_published": "1998-02-24", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Literary', 'Romance', 'Contemporary', 'Science Fiction & Fantasy', 'Science Fiction', 'Hard Science Fiction', 'Humorous'], 'authors": ["Jonathan Lethem'], 'title": "As She Climbed Across the Table: A Novel", "isbn13": "9780375700125", "msrp": 15, "binding": "Paperback", "related": {"Kindle Edition": "0307791491", "ePub": "0307791491"}, "isbn": "0375700129", "isbn10": "0375700129", "other_isbns": [{'isbn": "9780307791498", "binding": "printisbn"}]}}