{"book": {"publisher": "Schwartz & Wade", "synopsis": "“A bit like the great movie Toy Story and a bit like the wonderful Kate DiCamillo book The Miraculous Journey of Edward Tulane. This is a great family book.” —The Washington Post<br/><br/>Here is the first book in the highly acclaimed Toys trilogy, which includes the companion books Toy Dance Party and Toys Come Home and chronicles the unforgettable adventures of three brave and loving toys.<br/><br/>In these six linked stories from Emily Jenkins, and illustrated by Caldecott Medal winner Paul O. Zelinsky, readers will meet three extraordinary friends. Lumphy is a stuffed buffalo. StingRay is a stuffed stingray. And Plastic... well, Plastic isn"t quite sure what she is. They all belong to the Little Girl who lives on the high bed with the fluffy pillows. A very nice person to belong to.<br/><br/>Together is best for these three best friends. Together they look things up in the dictionary, explore the basement, and argue about the meaning of life. And together they face dogs, school, television commercials, the vastness of the sea, and the terrifying bigness of the washing machine.<br/><br/>A Parents" Choice Silver Honor Winner, an ALA-ALSC Notable Children"s Book, and an Oppenheim Toy Portfolio Platinum Book Award Winner, Toys Go Out is truly a modern classic.', 'language": "en", "image": "https://images.isbndb.com/covers/60/46/9780375836046.jpg", "title_long": "Toys Go Out: Being the Adventures of a Knowledgeable Stingray, a Toughy Little Buffalo, and Someone Called Plastic", "edition": "First Edition", "dimensions": "Height: 8.51 Inches, Length: 7.1 Inches, Weight: 0.9 Pounds, Width: 0.68 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.1}, "width": {"unit": "inches", "value": 0.68}, "weight": {"unit": "pounds", "value": 0.9}, "height": {"unit": "inches", "value": 8.51}}, "pages": 128, "date_published": "2006-09-12", "subjects": ["Children's Books', 'Growing Up & Facts of Life', 'Friendship, Social Skills & School Life', 'Literature & Fiction', 'Short Story Collections', 'Humor'], 'authors": ["Emily Jenkins'], 'title": "Toys Go Out: Being the Adventures of a Knowledgeable Stingray, a Toughy Little Buffalo, and Someone Called Plastic", "isbn13": "9780375836046", "msrp": 16.95, 'binding": "Hardcover", "isbn": "0375836047", "isbn10": "0375836047"}}