{"book": {"publisher": "Knopf", "synopsis": "In 1995, the physical and social landscape of Japan was transformed by two events: the Kobe earthquake, in January, which destroyed thousands of lives, and the poison-gas attacks in the Tokyo subways in March, during the morning rush hour. Following these twin disasters, Haruki Murakami abandoned his life abroad and returned home to confront his country’s grief. The subway attack led to his recent Underground. And out of the quake come these six stories, set in the months between natural catastrophe and man-made terrorism. His characters find their resolutely normal everyday lives undone by events even more surreal (yet somehow believable) than we have come to expect in his fiction.<br/><br/>An electronics salesman, abruptly deserted by his wife, is entrusted to deliver a mysterious package but gets more than he bargained for at the receiving end; a Thai chauffeur takes his troubled charge to a seer, who penetrates her deepest sorrow; and, in the unforgettable title story, a boy acknowledges a shattering secret about his past that will change his life forever.<br/><br/>But the most compelling character of all is the earthquake itself—slipping into and out of view almost imperceptibly, but nonetheless reaching deep into the lives of these forlorn citizens of the apocalypse. The terrible damage visible all around is, in fact, less extreme than the inconsolable howl of a nation indelibly scarred—an experience in which Murakami discovers many truths about compassion, courage, and the nature of human suffering.", "language": "en", "image": "https://images.isbndb.com/covers/39/02/9780375413902.jpg", "title_long": "After the Quake: Stories", "edition": "F First American Edition", "dimensions": "Height: 7.25 Inches, Length: 5 Inches, Weight: 0.26 Pounds, Width: 0.75 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 0.26}, "height": {"unit": "inches", "value": 7.25}}, "pages": 192, "date_published": "2002-08-13", "subjects": ["Literature & Fiction', 'Short Stories & Anthologies', 'Short Stories', 'Contemporary', 'Literary'], 'authors": ["Haruki Murakami'], 'title": "After the Quake: Stories", "isbn13": "9780375413902", "msrp": 21, 'binding": "Hardcover", "isbn": "0375413901", "isbn10": "0375413901"}}