{"book": {"publisher": "Pantheon", "synopsis": "A beautiful album that will dazzle fans of Charlie Brown and the whole gang, providing an unprecedented look at the work of the most brilliant and beloved cartoonist of the twentieth century.<br/><br/>Here is Charlie Brown, Lucy, Linus, Snoopy, Peppermint Patty, Schroeder, Pig-Pen, and all the others from the original Peanuts strips.<br/><br/>More than five hundred comic strips are reproduced, as well as such rare or never-before-seen items as a sketchbook from Schulz"s army days in the early 1940s; his very first printed strip, Just Keep Laughing; his private scrapbook of pre-Peanuts Li"l Folks strips; developmental sketches for the first versions of Charlie Brown and the other Peanuts characters; a sketchbook from 1963; and many more materials gathered from the Schulz archives in Santa Rosa, California.<br/><br/>The art has been stunningly photographed by Geoff Spear in full color, capturing the subtle textures of paper, ink, and line. The strips–which were shot only from the original art or vintage newsprint–reveal how, from the 1950s through 2000, Schulz"s style and the Peanuts world evolved. The book features an introduction by Jean Schulz and has been designed and edited by renowned graphic artist Chip Kidd, who also provides an informed and appreciative commentary.<br/><br/>This celebration of the genius of the most revered cartoonist of our time is a must for anyone who has ever come under the spell of Peanuts.', 'language": "en", "image": "https://images.isbndb.com/covers/46/34/9780375714634.jpg", "title_long": "Peanuts: The Art of Charles M. Schulz", "edition": "Reprint,Subsequent", "dimensions": "Height: 7.01 Inches, Length: 8.59 Inches, Weight: 2.1775 Pounds, Width: 0.95 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.59}, "width": {"unit": "inches", "value": 0.95}, "weight": {"unit": "pounds", "value": 2.1775}, "height": {"unit": "inches", "value": 7.01}}, "pages": 368, "date_published": "2003-10-28", "subjects": ["Comics & Graphic Novels', 'Comic Strips', 'Graphic Novels', 'Literary', 'Biographies & History', 'Art of Comics and Manga', 'Humor & Entertainment', 'Humor', 'Literature & Fiction', 'Humor & Satire', 'Satire'], 'authors": ["Charles M. Schulz'], 'title": "Peanuts: The Art of Charles M. Schulz", "isbn13": "9780375714634", "msrp": 17.95, 'binding": "Paperback", "isbn": "0375714634", "isbn10": "0375714634"}}