{"book": {"publisher": "Vintage", "synopsis": "From the Nobel Prize winner comes a captivating novel about an idealistic Icelandic farmer who journeys to Mormon Utah and back in search of paradise. • "Full of an earthy poetry...a style wonderfully wise and entirely Scandinavian in its combination of magic and reality." —The New York Times Book Review • With an introduction by the Pulitzer Prize-winning author of A Thousand Acres.<br/><br/>The quixotic hero of this long-lost classic is Steinar of Hlidar, a generous but very poor man who lives peacefully on a tiny farm in nineteenth-century Iceland with his wife and two adoring young children. But when he impulsively offers his children\"s beloved pure-white pony to the visiting King of Denmark, he sets in motion a chain of disastrous events that leaves his family in ruins and himself at the other end of the earth, optimistically building a home for them among the devout polygamists in the Promised Land of Utah. By the time the broken family is reunited, Laxness has spun his trademark blend of compassion and comically brutal satire into a moving and spellbinding enchantment, composed equally of elements of fable and folkore and of the most humble truths.', 'language": "en", "image": "https://images.isbndb.com/covers/75/80/9780375727580.jpg", "title_long": "Paradise Reclaimed", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.1 Inches, Weight: 0.57540650382 Pounds, Width: 0.7 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.1}, "width": {"unit": "inches", "value": 0.7}, "weight": {"unit": "pounds", "value": 0.57540650382}, "height": {"unit": "inches", "value": 8}}, "pages": 320, "date_published": "2002-04-02", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'Family Life', 'Humor & Satire', 'Satire', 'Literary', 'Science Fiction & Fantasy', 'Fantasy'], 'authors": ["Halldor Laxness'], 'title": "Paradise Reclaimed", "isbn13": "9780375727580", "msrp": 16.95, "binding": "Paperback", "related": {"ePub": "0307427234"}, "isbn": "0375727582", "isbn10": "0375727582", "other_isbns": [{'isbn": "9780307427236", "binding": "printisbn"}]}}