{"book": {"publisher": "Random House Audio", "synopsis": "Product Description      Eight Cassettes, 10 hoursContains: Andromeda Strain, Jurassic Park, and THE Lost WorldThe collection is sure to please avid Crichton fans and new listeners alike.\xa0\xa0These three audios are offered at 40% off the indivial retail price.ANDROMEDA STRAINRead by Chris NorthThe Andromeda Strain sets forth the story of Project Wildfire - the crash mobilization of the nations highest scientific and medical resources when an unmanned research satellite returns to earth mysteriously and lethally contaminated. Four American scientists are summoned under conditions of total news blackout and utmost urgency to Wildfire\"s secret laboratory five stories below the Nevada desert. There - surrounded by the most sophisticated computer equipment, and sealed off from the outside world - they work against the threat of a worldwide epidemic. Step by step they begin to unravel the puzzle of the Andromeda Strain until, terrifyingly, their microbacterial adversary ruptures the hypersterile seal of the lab and their already desperate search for a biomedical answer becomes a split second race against time.JURASSIC PARKRead by John HeardA shroud of secrecy covers a privately-owned island off the coast of the Dominican Republic where an American bioengineering firm is quietly building a resort theme park. Even the expert consultants on the project don\"t know exactly what it is. And local doctors are mystified when an injured park worker arrives at the hospital with gashes on his body, as if he\"s been mauled by an animal of monstrous proportions. A year later, when the first invited guests to 'Jurassic Park' attend a 4-day preview, the amazement, the shock, and finally, the terror they experience there offer a horrifying solution to this disturbing puzzle.Riveting scientific detail ad a driving, suspenseful narrative make this an unforgettable story - one of advanced technology versus prehistoric monsters . . . and of an extraordinary good idea gone extraordinary bad.THE LOST WORLDRead by Anthony HealdThe sequel to Michael Crichton\'s bestselling Jurassic Park.It is now six years since the secret disaster at Jurassic Park: six years since that extraordinary dream of science and imagination came to a crashing end - the dinosaurs destroyed, the part dismantled, the island indefinitely closed to the public.There are rumors that something has survived.      From the Inside Flap      tes, 10 hoursContains: Andromeda Strain, Jurassic Park, and THE Lost WorldThe collection is sure to please avid Crichton fans and new listeners alike.\xa0\xa0These three audios are offered at 40% off the indivial retail price.ANDROMEDA STRAINRead by Chris NorthThe Andromeda Strain sets forth the story of Project Wildfire - the crash mobilization of the nations highest scientific and medical resources when an unmanned research satellite returns to earth mysteriously and lethally contaminated. Four American scientists are summoned under conditions of total news blackout and utmost urgency to Wildfire\'s secret laboratory five stories below the Nevada desert. There - surrounded by the most sophisticated computer equipment, and sealed off from the outside world - they work against the threat of a worldwide epidemic. Step by step they begin to unravel the puzzle of the Andromeda Strain until, terrifyingly, their microbacterial a      About the Author      Michael Crichton was born in Chicago, in 1942. His novels include The Andromeda Strain, The Great Train Robbery, Congo, Jurassic Park, and Disclosure. He is also the creator of the television series ER.', 'language": "en", "image": "https://images.isbndb.com/covers/58/07/9780375415807.jpg", "title_long": "Michael Crichton Value Collection: Andromeda Strain, Jurassic Park, and The Lost World (The Michael Crichton Collection)", "dimensions": "height: 155 mm, length: 105 mm, width: 67 mm, weight: 295 g", "dimensions_structured": {"length": {"unit": "mm", "value": 105}, "width": {"unit": "mm", "value": 67}, "weight": {"unit": "g", "value": 295}, "height": {"unit": "mm", "value": 155}}, "date_published": "2000-05-02", "subjects": ["Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Science Fiction & Fantasy', 'Science Fiction', 'Hard Science Fiction'], 'authors": ["Michael Crichton'], 'title": "Michael Crichton Value Collection: Andromeda Strain, Jurassic Park, and The Lost World (The Michael Crichton Collection)", "isbn13": "9780375415807", "msrp": 34.95, 'binding": "Audio Cassette", "isbn": "0375415807", "isbn10": "0375415807"}}