{"book": {"publisher": "Knopf", "synopsis": "Here, brought vividly to life, is an icon of Japanese culture and custom—the geisha in her role as human work of art and perfect woman.<br/><br/>A hundred years ago geisha numbered eighty thousand; today there are a thousand at most. Happily, Jodi Cobb is able to show us—before they vanish—both the ceremonial world of the geisha in Tokyo and Kyoto and their private world as few outsiders have ever seen it.<br/><br/>Many of the older women we meet here were forced into this world by hardship; the young women were drawn to it by their dream of a<br/>romantic life or their love of traditional arts. We see geisha in their daytime routines: fine-tuning their breathtakingly lavish wardrobes; perfecting the art of makeup; training maikos (apprentices); and preparing for annual dance performances.<br/><br/>But as we watch the geisha at night, as they entertain (for huge sums) at private parties, their art takes a different form. Their purpose is to provide a dream—of luxury, romance and exclusivity. As the men sit at dinner, geisha position themselves at their elbows to serve them sake and delicacies and practice a brilliantly honed art of conversation. As the alcohol flows and the guests relax, geisha play party tricks and sing songs. Geisha have for centuries studied the male ego. They tend it like a garden—and we watch men bloom.<br/><br/>This long-hidden world is revealed here both in superlative photographs and in a fascinating text that includes the voices of the geisha themselves. These women have created a life of beauty, making themselves an embodiment of Japanese culture, tradition and refinement—a life that is captured exquisitely in this remarkable book.", "language": "en", "image": "https://images.isbndb.com/covers/18/01/9780375701801.jpg", "title_long": "Geisha: The Life, the Voices, the Art", "edition": "Revised", "dimensions": "Height: 10.25 Inches, Length: 11.25 Inches, Weight: 1.45 Pounds, Width: 0.25 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 11.25}, "width": {"unit": "inches", "value": 0.25}, "weight": {"unit": "pounds", "value": 1.45}, "height": {"unit": "inches", "value": 10.25}}, "pages": 128, "date_published": "1998-10-27", "subjects": ["Arts & Photography', 'Photography & Video', 'Photojournalism & Essays', 'Biographies & Memoirs', 'Travelers & Explorers', 'Health, Fitness & Dieting', 'Psychology & Counseling', 'Sexuality', 'Politics & Social Sciences', 'Social Sciences', 'Customs & Traditions'], 'authors": ["Jodi Cobb'], 'title": "Geisha: The Life, the Voices, the Art", "isbn13": "9780375701801", "msrp": 35, 'binding": "Paperback", "isbn": "037570180X", "isbn10": "037570180X"}}