{"book": {"publisher": "Random House Trade Paperbacks", "synopsis": "NEW YORK TIMES BESTSELLER • “The finest book on France in recent years.”—Alain de Botton, The New York Times Book Review<br/><br/>In 1995, Adam Gopnik, his wife, and their infant son left the familiar comforts and hassles of New York City for the urbane glamour of Paris. In the grand tradition of Stein, Hemingway, Baldwin, and Liebling, Gopnik set out to enjoy the storied existence of an American in Paris—walks down the paths of the Tuileries, philosophical discussions in cafés, and afternoon jaunts to the Musée d’Orsay.<br/><br/>But as readers of Gopnik’s beloved and award-winning “Paris Journal” in The New Yorker know, there was also the matter of raising a child and carrying on with la vie quotidienne—the daily, slightly less fabled life. As Gopnik discovers in this tender account, the dual processes of navigating a foreign city and becoming a parent are not completely dissimilar—both promise new routines, new languages, and a new set of rules by which each day is to be lived. With singular wit and insight, Gopnik manages to weave the magical with the mundane in this wholly delightful book that Entertainment Weekly deemed “magisterial.”", "language": "en", "image": "https://images.isbndb.com/covers/82/32/9780375758232.jpg", "title_long": "Paris to the Moon", "edition": "Reprint", "dimensions": "Height: 7.93 Inches, Length: 5.18 Inches, Weight: 0.59 Pounds, Width: 0.81 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.18}, "width": {"unit": "inches", "value": 0.81}, "weight": {"unit": "pounds", "value": 0.59}, "height": {"unit": "inches", "value": 7.93}}, "pages": 368, "date_published": "2001-09-11", "subjects": ["Biographies & Memoirs', 'Memoirs', 'Professionals & Academics', 'Journalists', 'Travelers & Explorers', 'Reference', 'Writing, Research & Publishing Guides', 'Writing', 'Travel', 'Europe', 'France', 'Travel Writing', 'Politics & Social Sciences', 'Social Sciences', 'Customs & Traditions', 'Self Service', 'Custom Stores'], 'authors": ["Adam Gopnik'], 'title": "Paris to the Moon", "isbn13": "9780375758232", "msrp": 12.98, "binding": "Paperback", "related": {"ePub": "1588361381"}, "isbn": "0375758232", "isbn10": "0375758232", "other_isbns": [{'isbn": "9781588361387", "binding": "printisbn"}]}}