{"book": {"publisher": "Random House Trade Paperbacks", "synopsis": "WINNER OF THE PULITZER PRIZE AND THE NATIONAL BOOK AWARD • One of Modern Library’s 100 best nonfiction books of all time • One of Esquire’s 50 best biographies of all time<br/><br/>“A towering biography . . . a brilliant chronicle.”—Time<br/><br/>This classic biography is the story of seven men—a naturalist, a writer, a lover, a hunter, a ranchman, a soldier, and a politician—who merged at age forty-two to become the youngest President in history.<br/><br/>The Rise of Theodore Roosevelt begins at the apex of his international prestige. That was on New Year’s Day, 1907, when TR, who had just won the Nobel Peace Prize, threw open the doors of the White House to the American people and shook 8,150 hands. One visitor remarked afterward, “You go to the White House, you shake hands with Roosevelt and hear him talk—and then you go home to wring the personality out of your clothes.”<br/><br/>The rest of this book tells the story of TR’s irresistible rise to power. During the years 1858–1901, Theodore Roosevelt transformed himself from a frail, asthmatic boy into a full-blooded man. Fresh out of Harvard, he simultaneously published a distinguished work of naval history and became the fist-swinging leader of a Republican insurgency in the New York State Assembly. He chased thieves across the Badlands of North Dakota with a copy of Anna Karenina in one hand and a Winchester rifle in the other. Married to his childhood sweetheart in 1886, he became the country squire of Sagamore Hill on Long Island, a flamboyant civil service reformer in Washington, D.C., and a night-stalking police commissioner in New York City. As assistant secretary of the navy, he almost single-handedly brought about the Spanish-American War. After leading “Roosevelt’s Rough Riders” in the famous charge up San Juan Hill, Cuba, he returned home a military hero, and was rewarded with the governorship of New York. In what he called his “spare hours” he fathered six children and wrote fourteen books. By 1901, the man Senator Mark Hanna called “that damned cowboy” was vice president. Seven months later, an assassin’s bullet gave TR the national leadership he had always craved.<br/><br/>His is a story so prodigal in its variety, so surprising in its turns of fate, that previous biographers have treated it as a series of haphazard episodes. This book, the only full study of TR’s pre-presidential years, shows that he was an inevitable chief executive. “It was as if he were subconsciously aware that he was a man of many selves,” the author writes, “and set about developing each one in turn, knowing that one day he would be President of all the people.”", "language": "en", "image": "https://images.isbndb.com/covers/67/88/9780375756788.jpg", "title_long": "The Rise of Theodore Roosevelt (Modern Library (Paperback))", "edition": "Reprint", "dimensions": "Height: 7.94 Inches, Length: 5.12 Inches, Weight: 1.15081300764 Pounds, Width: 1.4 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.12}, "width": {"unit": "inches", "value": 1.4}, "weight": {"unit": "pounds", "value": 1.15081300764}, "height": {"unit": "inches", "value": 7.94}}, "pages": 920, "date_published": "2001-11", "subjects": ["Biographies & Memoirs', 'Historical', 'United States', 'Europe', 'Leaders & Notable People', 'Military', 'Presidents & Heads of State', 'History', 'Politics & Social Sciences', 'Politics & Government', 'Public Affairs & Policy', 'Self Service', 'Custom Stores'], 'authors": ["Edmund Morris'], 'title": "The Rise of Theodore Roosevelt (Modern Library (Paperback))", "isbn13": "9780375756788", "msrp": "0.00", "binding": "Paperback", "related": {"Kindle Edition": "0307777820", "ePub": "0307777820"}, "isbn": "0375756787", "isbn10": "0375756787", "other_isbns": [{'isbn": "9780307777829", "binding": "printisbn"}]}}