{"book": {"publisher": "Pantheon", "synopsis": "NEW YORK TIMES BESTSELLER • Wise, funny, and heartbreaking, Persepolis is Marjane Satrapi’s acclaimed graphic memoir of growing up in Iran during the Islamic Revolution.<br/><br/>“A wholly original achievement.... Satrapi evokes herself and her schoolmates coming of age in a world of protests and disappearances.... A stark, shocking impact.” —The New York Times: "The 50 Best Memoirs of the Past 50 Years"<br/><br/>In powerful black-and-white comic strip images, Satrapi tells the coming-of-age story of her life in Tehran from ages six to fourteen, years that saw the overthrow of the Shah’s regime, the triumph of the Islamic Revolution, and the devastating effects of war with Iraq. The intelligent and outspoken only child of committed Marxists and the great-granddaughter of one of Iran’s last emperors, Marjane bears witness to a childhood uniquely entwined with the history of her country.<br/><br/>Persepolis paints an unforgettable portrait of daily life in Iran and of the bewildering contradictions between home life and public life. Marjane’s child’s-eye view of dethroned emperors, state-sanctioned whippings, and heroes of the revolution allows us to learn as she does the history of this fascinating country and of her own extraordinary family. Intensely personal, profoundly political, and wholly original, Persepolis is at once a story of growing up and a reminder of the human cost of war and political repression. It shows how we carry on, with laughter and tears, in the face of absurdity. And, finally, it introduces us to an irresistible little girl with whom we cannot help but fall in love.", 'language": "en", "image": "https://images.isbndb.com/covers/45/73/9780375714573.jpg", "title_long": "Persepolis: The Story of a Childhood", "edition": "Reprint", "dimensions": "Height: 8.85825 Inches, Length: 5.9055 Inches, Weight: 0.57761112644 Pounds, Width: 0.51181 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.9055}, "width": {"unit": "inches", "value": 0.51181}, "weight": {"unit": "pounds", "value": 0.57761112644}, "height": {"unit": "inches", "value": 8.85825}}, "pages": 160, "date_published": "2004-06-01", "subjects": ["Arts & Photography', 'Biographies & Memoirs', 'Community & Culture', 'Women', 'Historical', 'Middle East', 'Memoirs', 'Comics & Graphic Novels', 'Graphic Novels', 'Biographies & History', 'History', 'Iran', 'World', 'Women in History', 'Politics & Social Sciences', 'Politics & Government', 'Specific Topics', 'Self Service', 'Custom Stores'], 'authors": ["Marjane Satrapi'], 'title": "Persepolis: The Story of a Childhood", "isbn13": "9780375714573", "msrp": 14.95, 'binding": "Paperback", "isbn": "037571457X", "isbn10": "037571457X"}}