{"book": {"publisher": "Knopf Books for Young Readers", "synopsis": "High in the Transylvanian woods, at the castle Piscul Draculi, live five daughters and their doting father. It"s an idyllic life for Jena, the second eldest, who spends her time exploring the mysterious forest with her constant companion, a most unusual frog. But best by far is the castle"s hidden portal, known only to the sisters. Every Full Moon, they alone can pass through it into the enchanted world of the Other Kingdom. There they dance through the night with the fey creatures of this magical realm.<br/><br/>But their peace is shattered when Father falls ill and must go to the southern parts to recover, for that is when cousin Cezar arrives. Though he"s there to help the girls survive the brutal winter, Jena suspects he has darker motives in store. Meanwhile, Jena's sister has fallen in love with a dangerous creature of the Other Kingdom--an impossible union it's up to Jena to stop.<br/><br/>When Cezar's grip of power begins to tighten, at stake is everything Jena loves: her home, her family, and the Other Kingdom she has come to cherish. To save her world, Jena will be tested in ways she can't imagine--tests of trust, strength, and true love.', 'language": "en", "image": "https://images.isbndb.com/covers/36/49/9780375833649.jpg", "title_long": "Wildwood Dancing", "edition": "First Edition", "dimensions": "Height: 8.52 Inches, Length: 5.57 Inches, Weight: 1.28 Pounds, Width: 1.36 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.57}, "width": {"unit": "inches", "value": 1.36}, "weight": {"unit": "pounds", "value": 1.28}, "height": {"unit": "inches", "value": 8.52}}, "pages": 416, "date_published": "2007-01-23", "subjects": ["Children's Books', 'Growing Up & Facts of Life', 'Family Life', 'Friendship, Social Skills & School Life', 'Teen & Young Adult', 'Literature & Fiction', 'Girls & Women', 'Social & Family Issues', 'Science Fiction & Fantasy', 'Fantasy'], 'authors": ['Juliet Marillier'], 'title": "Wildwood Dancing", "isbn13": "9780375833649", "msrp": "0.00", "binding": "Hardcover", "isbn": "0375833641", "isbn10": "0375833641"}}