{"book": {"publisher": "Pantheon", "synopsis": "Utterly eschewing the general bonhomie surrounding the newly-minted contemporary regard for the comic strip medium as a language of complicated personal expression and artistic sophistication, professional colorist and award-winning letterer F. C. Ware returns to the book trade with “The ACME Novelty Library,” a hardcover distillation of all his surviving one-page cartoon jokes with which he tuckpointed the holes of his regular comic book periodical over the past decade.<br/><br/>Sometimes claimed to be his “best work” by those who really don’t know any better, this definitive congestion of stories of the future, the old west, and even of modern life nonetheless tries to stay interesting by including a luminescent map of the heavens, a chart of the general structure of the universe, assorted cut-out activitites, and a complete history of The ACME Novelty Company itself, decorated by rare photographs, early business ventures, not to mention the smallest example of a Comic Strip ever before offered to the general public. All in all, it will likely prove a rather mild disappointment, but at least it catches the light in a nice way and may force a smile here and there before being shelved for the next generation’s ultimate disregard and/or disposal.", "language": "en", "image": "https://images.isbndb.com/covers/29/59/9780375422959.jpg", "title_long": "The Acme Novelty Library (Pantheon Graphic Library)", "dimensions": "Height: 15.25 Inches, Length: 9.4 Inches, Weight: 1 Pounds, Width: 0.75 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 9.4}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 1}, "height": {"unit": "inches", "value": 15.25}}, "pages": 108, "date_published": "2005-09-20", "subjects": ["Arts & Photography', 'Comics & Graphic Novels', 'Graphic Novels', 'Anthologies', 'Literary', 'Historical & Biographical Fiction', 'Humor & Entertainment', 'Pop Culture', 'Art'], 'authors": ["Chris Ware'], 'title": "The Acme Novelty Library (Pantheon Graphic Library)", "isbn13": "9780375422959", "msrp": 19.47, 'binding": "Hardcover", "isbn": "0375422951", "isbn10": "0375422951"}}