{"book": {"publisher": "Vintage", "synopsis": "By the New York Times bestselling author of The Bone Clocks and Cloud Atlas<br/><br/>A gallery attendant at the Hermitage. A young jazz buff in Tokyo. A crooked British lawyer in Hong Kong. A disc jockey in Manhattan. A physicist in Ireland. An elderly woman running a tea shack in rural China. A cult-controlled terrorist in Okinawa. A musician in London. A transmigrating spirit in Mongolia. What is the common thread of coincidence or destiny that connects the lives of these nine souls in nine far-flung countries, stretching across the globe from east to west? What pattern do their linked fates form through time and space?<br/><br/>A writer of pyrotechnic virtuosity and profound compassion, a mind to which nothing human is alien, David Mitchell spins genres, cultures, and ideas like gossamer threads around and through these nine linked stories. Many forces bind these lives, but at root all involve the same universal longing for connection and transcendence, an axis of commonality that leads in two directions—to creation and to destruction. In the end, as lives converge with a fearful symmetry, Ghostwritten comes full circle, to a point at which a familiar idea—that whether the planet is vast or small is merely a matter of perspective—strikes home with the force of a new revelation. It marks the debut of a writer of astonishing gifts.", "language": "en", "image": "https://images.isbndb.com/covers/45/03/9780375724503.jpg", "title_long": "Ghostwritten", "edition": "Reprint", "dimensions": "Height: 7.99 Inches, Length: 5.16 inches, Weight: 0.6875 Pounds, Width: 0.93 inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.16}, "width": {"unit": "inches", "value": 0.93}, "weight": {"unit": "pounds", "value": 0.6875}, "height": {"unit": "inches", "value": 7.99}}, "pages": 426, "date_published": "2001-10-09", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Metaphysical & Visionary', 'Literary', 'Science Fiction & Fantasy', 'Fantasy', 'Magical Realism', 'Self Service', 'Custom Stores'], 'authors": ["David Mitchell'], 'title": "Ghostwritten", "isbn13": "9780375724503", "msrp": 11.99, "binding": "Paperback", "related": {"Kindle Edition": "0307426025", "ePub": "0307426025"}, "isbn": "0375724508", "isbn10": "0375724508", "other_isbns": [{'isbn": "9780307426024", "binding": "printisbn"}]}}