{"book": {"publisher": "Random House Books for Young Readers", "synopsis": "It’s 50 years before the settlement of the city of Ember, and the world is in crisis. War looms on the horizon as 11-year-old Nickie and her aunt travel to the small town of Yonwood, North Carolina. There, one of the town’s respected citizens has had a terrible vision of fire and destruction. Her garbled words are taken as prophetic instruction on how to avoid the coming disaster. If only they can be interpreted correctly. . . .<br/><br/>As the people of Yonwood scramble to make sense of the woman’s mysterious utterances, Nickie explores the oddities she finds around town—her great-grandfather’s peculiar journals and papers, a reclusive neighbor who studies the heavens, a strange boy who is fascinated with snakes—all while keeping an eye out for ways to help the world. Is this vision her chance? Or is it already too late to avoid a devastating war?<br/><br/>In this prequel to the acclaimed The City of Ember and The People of Sparks, Jeanne DuPrau investigates how, in a world that seems out of control, hope and comfort can be found in the strangest of places.", "language": "en", "image": "https://images.isbndb.com/covers/52/67/9780375875267.jpg", "title_long": "The Prophet of Yonwood (Ember, Book 3)", "edition": "1", "dimensions": "Height: 8.61 Inches, Length: 5.8 Inches, Weight: 1 Pounds, Width: 1.02 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.8}, "width": {"unit": "inches", "value": 1.02}, "weight": {"unit": "pounds", "value": 1}, "height": {"unit": "inches", "value": 8.61}}, "pages": 3289, "date_published": "2006-05-09", "subjects": ["Children's Books', 'Growing Up & Facts of Life', 'Literature & Fiction', 'Religious Fiction', 'Science Fiction & Fantasy', 'Fantasy & Magic'], 'authors": ["Jeanne DuPrau'], 'title": "The Prophet of Yonwood (Ember, Book 3)", "isbn13": "9780375875267", "msrp": 16.99, 'binding": "Hardcover", "isbn": "0375875263", "isbn10": "0375875263"}}