{"book": {"publisher": "Pantheon", "synopsis": "THE EISNER AWARD-WINNING, NATIONALLY BEST-SELLING MYTHOLOGY IS HERE IN PAPERBACK, IN AN EXPANDED EDITION WITH 32 NEW PAGES.<br/><br/>Mythology returns, in a newly expanded paperback edition of the book Entertainment Weekly awarded a grade of A, saying: “Alex Ross brings to his work an unparalleled sense of the real. His heroes–both super and mortal–have weight; they exist in space, and that space is affected by them in ways never before seen on the page.” And so here they are, the incomparable cast of the DC Comics universe: Superman, Batman, Wonder Woman, the Flash, Aquaman, the Green Lantern, and the rest of the Justice League as you’ve never seen them before. Mythology brings together the best loved comic characters in the world, brought to life by Alex Ross, one of the most astonishing young artists working in the medium today. The award-winning designer/writer Chip Kidd and photographer Geoff Spear have teamed up to create a book like no other, with an introduction by M. Night Shyamalan, the acclaimed director of The Village and The Sixth Sense.<br/><br/>Ross has often been called the Norman Rockwell of comics, and this book reveals not only his lifelong love of these classic superheroes but also his vision: Mythology takes you into the studio for a behind-the-scenes look at his fascinating creative process. The combination of Ross’s dynamic art and Kidd’s kinetic design makes images from his most memorable stories–including Kingdom Come, Superman: Peace on Earth, Batman: War on Crime, and Uncle Sam–soar off the more than 300 pages.<br/><br/>The new material centers on Ross’s startling new comic book series, Justice, including sketches, preliminary art, prototype figures, and more. Mythology is a book in which every page explodes with the power of the icons it celebrates.", "language": "en", "image": "https://images.isbndb.com/covers/46/27/9780375714627.jpg", "title_long": "Mythology: The DC Comics Art of Alex Ross (Pantheon Graphic Library)", "edition": "Reprint", "dimensions": "Height: 12 Inches, Length: 9.1 Inches, Weight: 3.48 Pounds, Width: 0.8 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 9.1}, "width": {"unit": "inches", "value": 0.8}, "weight": {"unit": "pounds", "value": 3.48}, "height": {"unit": "inches", "value": 12}}, "pages": 320, "date_published": "2005-11-08", "subjects": ["Arts & Photography', 'Individual Artists', 'Comics & Graphic Novels', 'Graphic Novels', 'Biographies & History', 'History & Price Guides', 'How To Create Comics & Manga', 'Comics', 'Art of Comics and Manga', 'Literature & Fiction', 'History & Criticism', 'Genres & Styles'], 'authors": ["Alex Ross'], 'title": "Mythology: The DC Comics Art of Alex Ross (Pantheon Graphic Library)", "isbn13": "9780375714627", "msrp": 35, 'binding": "Paperback", "isbn": "0375714626", "isbn10": "0375714626"}}