{"book": {"publisher": "Random House Books for Young Readers", "synopsis": "Magic. Mystery. Time-travel. Take a trip back to the first Thankgiving with Jack and Annie and the Magic Tree House-- the #1 bestselling chapter book series of all time!<br/><br/>It"s a time for giving thanks when the Magic Tree House whisks Jack and Annie back to 1621 on the first Thanksgiving Day. The Pilgrims ask them to help get things ready. But whether it"s cooking or clamming, Jack and Annie don"t know how to do anything the Pilgrim way. Will they ruin the holiday forever? Or will the feast go on?<br/><br/>The Magic Tree House series has been a favorite for over 25 years and is sure to inspire a love of reading—and adventure—in every child who joins Jack and Annie!<br/><br/>Did you know that there’s a Magic Tree House book for every kid?<br/>• Magic Tree House: Adventures with Jack and Annie, perfect for readers who are just beginning chapter books<br/>• Magic Tree House Graphic Novels: Jack and Annie's original adventures come to life with full-color, vibrant art, perfect for graphic novel fans and reluctant readers<br/>• Merlin Missions: More challenging adventures for the experienced reader<br/>• Super Edition: A longer and more dangerous adventure<br/>• Fact Trackers: Nonfiction companions to your favorite Magic Tree House adventures', 'language": "en", "image": "https://images.isbndb.com/covers/61/55/9780375806155.jpg", "title_long": "Thanksgiving on Thursday (Magic Tree House #27)", "edition": "First Edition", "dimensions": "Height: 7.63 Inches, Length: 5.12 Inches, Weight: 0.1625 Pounds, Width: 0.27 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.12}, "width": {"unit": "inches", "value": 0.27}, "weight": {"unit": "pounds", "value": 0.1625}, "height": {"unit": "inches", "value": 7.63}}, "pages": 96, "date_published": "2002-09-24", "subjects": ["Children's Books', 'Literature & Fiction', 'Historical Fiction', 'Chapter Books & Readers', 'Action & Adventure', 'Science Fiction & Fantasy', 'Fantasy & Magic', 'Holidays & Celebrations', 'Thanksgiving', 'Self Service', 'Custom Stores'], 'authors": ["Mary Pope Osborne'], 'title": "Thanksgiving on Thursday (Magic Tree House #27)", "isbn13": "9780375806155", "msrp": 5.99, "binding": "Paperback", "related": {"ePub": "0375894845"}, "isbn": "0375806156", "isbn10": "0375806156", "other_isbns": [{'isbn": "9780375894848", "binding": "printisbn"}]}}