{"book": {"publisher": "Vintage", "synopsis": "A magnificently humane novel from the acclaimed Icelandic Nobel Prize winner: as an unloved foster child on a farm in rural Iceland, Olaf Karason has only one consolation, the belief that one day he will be a great poet.<br/><br/>The indifference and contempt of most of the people around him only reinforces his sense of destiny, for in Iceland poets are as likely to be scorned as they are to be revered. Over the ensuing years, Olaf comes to lead the paradigmatic poet’s life of poverty, loneliness, ruinous love affairs and sexual scandal. But he will never attain anything like greatness.<br/><br/>As imagined by Nobel Prize winner Halldor Laxness in this extraordinary novel, what might be cruel farce achieves pathos and genuine exaltation. For as Olaf’s ambition drives him onward—and into the orbits of an unstable spiritualist, a shady entrepreneur, and several susceptible women—World Light demonstrates how the creative spirit can survive in even the most crushing environment and even the most unpromising human vessel.", "language": "en", "image": "https://images.isbndb.com/covers/75/73/9780375727573.jpg", "title_long": "World Light", "edition": "Reprint", "dimensions": "Height: 7.95 Inches, Length: 5.25 Inches, Weight: 0.98767093376 Pounds, Width: 1.1 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.25}, "width": {"unit": "inches", "value": 1.1}, "weight": {"unit": "pounds", "value": 0.98767093376}, "height": {"unit": "inches", "value": 7.95}}, "pages": 624, "date_published": "2002-10-08", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'Coming of Age', 'Small Town & Rural', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Halldor Laxness'], 'title": "World Light", "isbn13": "9780375727573", "msrp": 17, "binding": "Paperback", "related": {"ePub": "0307430316"}, "isbn": "0375727574", "isbn10": "0375727574", "other_isbns": [{'isbn": "9780307430311", "binding": "printisbn"}]}}