{"book": {"publisher": "Vintage", "synopsis": "The internationally acclaimed author of the L.A. Quartet and The Underworld USA Trilogy, James Ellroy, presents another literary noir masterpiece of historical paranoia.<br/><br/>In this savagely audacious novel, James Ellroyplants a pipe bomb under the America in the 1960s, lights the fuse, and watches the shrapnel fly. On November 22, 1963 three men converge in Dallas. Their job: to clean up the JFK hit’s loose ends and inconvenient witnesses. They are Wayne Tedrow, Jr., a Las Vegas cop with family ties to the lunatic right; Ward J. Littell, a defrocked FBI man turned underworld mouthpiece; and Pete Bondurant, a dope-runner and hit-man who serves as the mob’s emissary to the anti-Castro underground.<br/><br/>It goes bad from there. For the next five years these night-riders run a whirlwind of plots and counter-plots: Howard Hughes’s takeover of Vegas, J. Edgar Hoover’s war against the civil rights movement, the heroin trade in Vietnam, and the murders of Martin Luther King, Jr. and Bobby Kennedy. Wilder than L. A. Confidential, more devastating than American Tabloid, The Cold Six Thousand establishes Ellroy as one of our most fearless novelists.", "language": "en", "image": "https://images.isbndb.com/covers/74/05/9780375727405.jpg", "title_long": "The Cold Six Thousand", "edition": "~", "dimensions": "Height: 8 Inches, Length: 5.2 Inches, Weight: 1.09 Pounds, Width: 1.4 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 1.4}, "weight": {"unit": "pounds", "value": 1.09}, "height": {"unit": "inches", "value": 8}}, "pages": 688, "date_published": "2002-06-11", "subjects": ["Literature & Fiction', 'Genre Fiction', 'United States', 'Literary', 'Mystery, Thriller & Suspense', 'Mystery', 'Hard-Boiled', 'Thrillers & Suspense', 'Spies & Politics', 'Crime', 'Self Service', 'Custom Stores'], 'authors": ["James Ellroy'], 'title": "The Cold Six Thousand", "isbn13": "9780375727405", "msrp": 15.38, "binding": "Paperback", "related": {"ePub": "0307798453"}, "isbn": "037572740X", "isbn10": "037572740X", "other_isbns": [{'isbn": "9780307798459", "binding": "printisbn"}]}}