{"book": {"publisher": "Vintage", "synopsis": "For readers who can’t get enough of the hit Broadway musical Hamilton, Gore Vidal’s stunning novel about Aaron Burr, the man who killed Alexander Hamilton in a duel—and who served as a successful, if often feared, statesman of our fledgling nation.<br/><br/>Here is an extraordinary portrait of one of the most complicated—and misunderstood—figures among the Founding Fathers. In 1804, while serving as vice president, Aaron Burr fought a duel with his political nemesis, Alexander Hamilton, and killed him. In 1807, he was arrested, tried, and acquitted of treason. In 1833, Burr is newly married, an aging statesman considered a monster by many. But he is determined to tell his own story, and he chooses to confide in a young New York City journalist named Charles Schermerhorn Schuyler. Together, they explore both Burr"s past—and the continuing civic drama of their young nation.<br/><br/>Burr is the first novel in Gore Vidal"s Narratives of Empire series, which spans the history of the United States from the Revolution to post-World War II. With their broad canvas and sprawling cast of fictional and historical characters, these novels present a panorama of American politics and imperialism, as interpreted by one of our most incisive and ironic observers.", 'language": "en", "image": "https://images.isbndb.com/covers/87/32/9780375708732.jpg", "title_long": "Burr: A Novel", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.2 Inches, Weight: 0.73 Pounds, Width: 0.91 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 0.91}, "weight": {"unit": "pounds", "value": 0.73}, "height": {"unit": "inches", "value": 8}}, "pages": 448, "date_published": "2000-02-15", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'Political', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Gore Vidal'], 'title": "Burr: A Novel", "isbn13": "9780375708732", "msrp": 16.95, "binding": "Paperback", "related": {"Kindle Edition": "0307798410", "ePub": "0307798410"}, "isbn": "0375708731", "isbn10": "0375708731", "other_isbns": [{'isbn": "9780307798411", "binding": "printisbn"}]}}