{"book": {"publisher": "Villard", "synopsis": "The author of the New York Times bestseller The Idiot Girls’ Action-Adventure Club tackles her biggest challenge yet: grown-up life.<br/><br/>In Autobiography of a Fat Bride, Laurie Notaro tries painfully to make the transition from all-night partyer and bar-stool regular to mortgagee with plumbing problems and no air-conditioning. Laurie finds grown-up life just as harrowing as her reckless youth, as she meets Mr. Right, moves in, settles down, and crosses the toe-stubbing threshold of matrimony. From her mother"s grade-school warning to avoid kids in tie-dyed shirts because their hippie parents spent their food money on drugs and art supplies; to her night-before-the-wedding panic over whether her religion is the one where you step on the glass; to her unfortunate overpreparation for the mandatory drug-screening urine test at work; to her audition as a Playboy centerfold as research for a newspaper story, Autobiography of a Fat Bride has the same zits-and-all candor and outrageous humor that made Idiot Girls an instant cult phenomenon.<br/><br/>In Autobiography of a Fat Bride, Laurie contemplates family, home improvement, and the horrible tyrannies of cosmetic saleswomen. She finds that life doesn"t necessarily get any easier as you get older. But it does get funnier.", 'language": "en", "image": "https://images.isbndb.com/covers/09/21/9780375760921.jpg", "title_long": "Autobiography of a Fat Bride: True Tales of a Pretend Adulthood", "edition": "First Edition", "dimensions": "Height: 7.95 Inches, Length: 5.22 Inches, Weight: 0.50044933474 Pounds, Width: 0.6 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.22}, "width": {"unit": "inches", "value": 0.6}, "weight": {"unit": "pounds", "value": 0.50044933474}, "height": {"unit": "inches", "value": 7.95}}, "pages": 272, "date_published": "2003-07-08", "subjects": ["Self-Help', 'Relationships', 'Marriage', 'Biographies & Memoirs', 'Community & Culture', 'Women', 'Memoirs', 'Humor & Entertainment', 'Humor', 'Essays', 'Parenting & Families', 'Literature & Fiction', 'Short Stories & Anthologies', 'Anthologies'], 'authors": ["Laurie Notaro'], 'title": "Autobiography of a Fat Bride: True Tales of a Pretend Adulthood", "isbn13": "9780375760921", "msrp": "0.00", "binding": "Paperback", "isbn": "037576092X", "isbn10": "037576092X", "other_isbns": [{'isbn": "9781588362445", "binding": "printisbn"}]}}