{"book": {"publisher": "Everyman"s Library", "synopsis": "Nobel Prize-winner Naguib Mahfouz’s magnificent epic trilogy of colonial Egypt—Palace Walk, Palace of Desire, and Sugar Street—together for the first time in one beautiful hardcover volume.<br/><br/>The masterwork of the Nobel Prize-winning author, the three novels of The Cairo Trilogy trace three generations of the family of tyrannical patriarch Al-Sayyid Ahmad Abd al-Jawad, who rules his household with a strict hand while living a secret life of self-indulgence. Palace Walk introduces us to his gentle, oppressed wife, Amina, his cloistered daughters, Aisha and Khadija, and his three sons–the tragic and idealistic Fahmy, the dissolute hedonist Yasin, and the soul-searching intellectual Kamal. Al-Sayyid Ahmad’s rebellious children struggle to move beyond his domination in Palace of Desire, as the world around them opens to the currents of modernity and political and domestic turmoil brought by the 1920s. Sugar Street brings Mahfouz’s vivid tapestry of an evolving Egypt to a dramatic climax as the aging patriarch sees one grandson become a Communist, one a Muslim fundamentalist, and one the lover of a powerful politician.<br/><br/>Throughout the trilogy, the family’s trials mirror those of their turbulent country during the years spanning the two World Wars, as change comes to a society that has resisted it for centuries. Filled with compelling drama, earthy humor, and remarkable insight, “The Cairo Trilogy extends our knowledge of life; it also confirms it” (The Boston Globe).<br/><br/>Everyman"s Library pursues the highest production standards, printing on acid-free cream-colored paper, with full-cloth cases with two-color foil stamping, decorative endpapers, silk ribbon markers, European-style half-round spines, and a full-color illustrated jacket. Contemporary Classics include an introduction, a select bibliography, and a chronology of the author"s life and times.', 'language": "en", "image": "https://images.isbndb.com/covers/33/15/9780375413315.jpg", "title_long": "The Cairo Trilogy: Palace Walk, Palace of Desire, Sugar Street (Everyman"s Library)", 'edition": "First Edition", "dimensions": "Height: 8.3 Inches, Length: 5.5 Inches, Weight: 2.55074837134 Pounds, Width: 2.45 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 2.45}, "weight": {"unit": "pounds", "value": 2.55074837134}, "height": {"unit": "inches", "value": 8.3}}, "pages": 1368, "date_published": "2001-10-16", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Family Saga', 'Family Life', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Naguib Mahfouz'], 'title": "The Cairo Trilogy: Palace Walk, Palace of Desire, Sugar Street (Everyman"s Library)", 'isbn13": "9780375413315", "msrp": 36, "binding": "Hardcover", "related": {"ePub": "0525432027"}, "isbn": "0375413316", "isbn10": "0375413316", "other_isbns": [{'isbn": "9780525432029", "binding": "printisbn"}]}}