{"book": {"publisher": "Random House Books for Young Readers", "synopsis": "The #1 bestselling chapter book series of all time celebrates 25 years with new covers and a new, easy-to-use numbering system! Getting the facts behind the fiction has never looked better. Track the facts with Jack and Annie!!<br/><br/>When Jack and Annie got back from their adventure in Magic Tree House #16: Hour of the Olympics, they had lots of questions. What did the ancient Greeks wear? What did they do for fun? Where were the very first Olympics held? How are our modern Olympics similar to the ancient Olympics? Find out the answers to these questions and more as Jack and Annie track the facts. Filled with up-to-date information, photos, illustrations, and fun tidbits from Jack and Annie, the Magic Tree House Fact Trackers are the perfect way for kids to find out more about the topics they discovered in their favorite Magic Tree House adventures. And teachers can use Fact Trackers alongside their Magic Tree House fiction companions to meet common core text pairing needs.<br/><br/>Did you know that there’s a Magic Tree House book for every kid?<br/><br/>Magic Tree House: Adventures with Jack and Annie, perfect for readers who are just beginning chapter books<br/>Merlin Missions: More challenging adventures for the experienced reader<br/>Super Edition: A longer and more dangerous adventure<br/>Fact Trackers: Nonfiction companions to your favorite Magic Tree House adventures<br/><br/>Have more fun with Jack and Annie at MagicTreeHouse.com!", "language": "en", "image": "https://images.isbndb.com/covers/37/87/9780375823787.jpg", "title_long": "Ancient Greece and the Olympics: A Nonfiction Companion to Magic Tree House (Magic Tree House Fact Tracker)", "edition": "First Edition", "dimensions": "Height: 7.62 Inches, Length: 5.2 Inches, Weight: 0.29982867632 Pounds, Width: 0.3 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 0.3}, "weight": {"unit": "pounds", "value": 0.29982867632}, "height": {"unit": "inches", "value": 7.62}}, "pages": 128, "date_published": "2004-06-08", "subjects": ["Children's Books', 'History', 'Ancient', 'Literature & Fiction', 'Chapter Books & Readers', 'Sports & Outdoors', 'Olympics', 'Self Service', 'Custom Stores'], 'authors": ["Mary Pope Osborne', 'Natalie Pope Boyce'], 'title": "Ancient Greece and the Olympics: A Nonfiction Companion to Magic Tree House (Magic Tree House Fact Tracker)", "isbn13": "9780375823787", "msrp": 6.99, "binding": "Paperback", "related": {"ePub": "0307975282"}, "isbn": "0375823786", "isbn10": "0375823786", "other_isbns": [{'isbn": "9780307975287", "binding": "printisbn"}]}}