{"book": {"publisher": "Modern Library", "synopsis": "Nominated as one of America’s best-loved novels by PBS’s The Great American Read<br/><br/>Widely regarded as the world"s first modern novel, Don Quixote chronicles the famous picaresque adventures of the noble knight-errant Don Quixote de la Mancha and his faithful squire, Sancho Panza, as they wend their way across sixteenth-century Spain. Milan Kundera calls Cervantes “the founder of the Modern Era and Lionel Trilling “observes that it can be said that all prose fiction is a variation on the theme of Don Quixote.”<br/><br/>This Modern Library Paperback Classics edition reproduces the acclaimed Tobias Smollett translation; as Salman Rushdie declares, “To my mind, this is the only English rendering of the Quixote that reads like a great novel, a novel of immense daring, much wildness and many colours. It releases Don Quixote from the grey academic prison of many more recent translations, unleashing him upon the English language in all his brilliant, foolish glory.” This edition also contains new endnotes.", "language": "en", "image": "https://images.isbndb.com/covers/69/93/9780375756993.jpg", "title_long": "Don Quixote (Modern Library Classics)", "dimensions": "Height: 8 Inches, Length: 5.25 Inches, Weight: 1.8 Pounds, Width: 1.75 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.25}, "width": {"unit": "inches", "value": 1.75}, "weight": {"unit": "pounds", "value": 1.8}, "height": {"unit": "inches", "value": 8}}, "pages": 1168, "date_published": "2001-04-10", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Action & Adventure', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Miguel de Cervantes'], 'title": "Don Quixote (Modern Library Classics)", "isbn13": "9780375756993", "msrp": "0.00", "binding": "Paperback", "related": {"ePub": "067964122X"}, "isbn": "037575699X", "isbn10": "037575699X", "other_isbns": [{'isbn": "9780679641223", "binding": "print"}]}}