{"book": {"publisher": "Random House Trade Paperbacks", "synopsis": "“Pollan shines a light on our own nature as well as on our implication in the natural world.” —The New York Times<br/><br/>“A wry, informed pastoral.” —The New Yorker<br/><br/>The book that helped make Michael Pollan, the New York Times bestselling author of How to Change Your Mind, Cooked and The Omnivore’s Dilemma, one of the most trusted food experts in America<br/><br/>Every schoolchild learns about the mutually beneficial dance of honeybees and flowers: The bee collects nectar and pollen to make honey and, in the process, spreads the flowers’ genes far and wide. InThe Botany of Desire, Michael Pollan ingeniously demonstrates how people and domesticated plants have formed a similarly reciprocal relationship. He masterfully links four fundamental human desires—sweetness, beauty, intoxication, and control—with the plants that satisfy them: the apple, the tulip, marijuana, and the potato. In telling the stories of four familiar species, Pollan illustrates how the plants have evolved to satisfy humankind’s most basic yearnings. And just as we’ve benefited from these plants, we have also done well by them. So who is really domesticating whom?", "language": "en", "image": "https://images.isbndb.com/covers/03/96/9780375760396.jpg", "title_long": "The Botany of Desire: A Plant"s-Eye View of the World", "dimensions": "Height: 7.96 Inches, Length: 5.2 Inches, Weight: 0.5 Pounds, Width: 0.65 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 0.65}, "weight": {"unit": "pounds", "value": 0.5}, "height": {"unit": "inches", "value": 7.96}}, "pages": 271, "date_published": "2002-05-28", "subjects": ["Crafts, Hobbies & Home', 'Gardening & Landscape Design', 'Science & Math', 'Agricultural Sciences', 'Horticulture', 'Biological Sciences', 'Botany', 'Ecology', 'Plants', 'Sports & Outdoors', 'Self Service', 'Custom Stores'], 'authors": ["Michael Pollan'], 'title": "The Botany of Desire: A Plant"s-Eye View of the World", 'isbn13": "9780375760396", "msrp": 16, "binding": "Paperback", "related": {"Unbound": "1588360083", "ePub": "1588360083"}, "isbn": "0375760393", "isbn10": "0375760393", "other_isbns": [{'isbn": "9781588360083", "binding": "print"}]}}