{"book": {"publisher": "Vintage", "synopsis": "From the Nobel Prize-winning author comes a classic of modern travel writing—a deft portrait of Trinidad and the four adjacent Caribbean societies still haunted by the legacies of slavery and colonialism.<br/><br/>“Belongs in the same category of travel writing as Lawrence’s books on Italy, Greene’s on West Africa and Pritchett’s on Spain.” —New Statesman<br/><br/>In 1960 the government of Trinidad invited V. S. Naipaul to revisit his native country and record his impressions. In The Middle Passage, Naipaul watches a Trinidadian movie audience greeting Humphrey Bogart’s appearance with cries of “That is man!” He ventures into a Trinidad slum so insalubrious that the locals call it the Gaza Strip. He follows a racially charged election campaign in British Guiana (now Guyana) and marvels at the Gallic pretension of Martinique society, which maintains the fiction that its roads are extensions of France’s routes nationales. And throughout he relates the ghastly episodes of the region’s colonial past and shows how they continue to inform its language, politics, and values. The result is a work of novelistic vividness and dazzling perspicacity that displays Naipaul at the peak of his powers.", "language": "en", "image": "https://images.isbndb.com/covers/83/43/9780375708343.jpg", "title_long": "The Middle Passage: The Caribbean Revisited", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.23 Inches, Weight: 0.5 Pounds, Width: 0.55 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.23}, "width": {"unit": "inches", "value": 0.55}, "weight": {"unit": "pounds", "value": 0.5}, "height": {"unit": "inches", "value": 8}}, "pages": 256, "date_published": "2002", "subjects": ["Literature & Fiction', 'World Literature', 'Caribbean & Latin American', 'Reference', 'Writing, Research & Publishing Guides', 'Writing', 'Travel', 'Caribbean', 'General', 'Travel Writing'], 'authors": ["V. S. Naipaul'], 'title": "The Middle Passage: The Caribbean Revisited", "isbn13": "9780375708343", "msrp": "0.00", "binding": "Paperback", "related": {"ePub": "0307776530"}, "isbn": "0375708340", "isbn10": "0375708340", "other_isbns": [{'isbn": "9780307776532", "binding": "printisbn"}]}}