{"book": {"publisher": "Vintage", "synopsis": "In this potent collage of stories, essays, and testimony, Williams makes a stirring case for the preservation of America’s Redrock Wilderness in the canyon country of southern Utah.<br/><br/>As passionate as she is persuasive, Williams, the beloved author of Refuge, is one of the country’s most eloquent and imaginative writers. The desert is her blood. Here she writes lyrically about the desert’s power and vulnerability, describing wonders that range from an ancient Puebloan sash of macaw feathers found in Canyonlands National Park to the desert tortoise–an animal that can “teach us the slow art of revolutionary patience” as it extends our notion of kinship with all life. She examines the civil war being waged in the West today over public and private uses of land–an issue that divides even her own family. With grace, humor, and compassionate intelligence, Williams reminds us that the preservation of wildness is not simply a political process but a spiritual one.", "language": "en", "image": "https://images.isbndb.com/covers/51/80/9780375725180.jpg", "title_long": "Red: Passion and Patience in the Desert", "dimensions": "Height: 8 Inches, Length: 5.1 Inches, Weight: 0.47 Pounds, Width: 0.61 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.1}, "width": {"unit": "inches", "value": 0.61}, "weight": {"unit": "pounds", "value": 0.47}, "height": {"unit": "inches", "value": 8}}, "pages": 288, "date_published": "2002-10-08", "subjects": ["History', 'Americas', 'United States', 'Science & Math', 'Biological Sciences', 'Ecology', 'Nature & Ecology', 'Conservation', 'Ecosystems', 'Nature Writing & Essays', 'Environment', 'Environmentalism', 'Travel', 'Specialty Travel', 'Ecotourism', 'West'], 'authors": ["Terry Tempest Williams'], 'title": "Red: Passion and Patience in the Desert", "isbn13": "9780375725180", "msrp": 15.95, "binding": "Paperback", "related": {"ePub": "0307559408"}, "isbn": "0375725180", "isbn10": "0375725180", "other_isbns": [{'isbn": "9780307559401", "binding": "printisbn"}]}}