{"book": {"publisher": "Everyman"s Library", "synopsis": "The first novel of Samuel Beckett"s mordant and exhilarating midcentury trilogy introduces us to Molloy, who has been mysteriously incarcerated, and who subsequently escapes to go discover the whereabouts of his mother. In the latter part of this curious masterwork, a certain Jacques Moran is deputized by anonymous authorities to search for the aforementioned Molloy. In the trilogy"s second novel, Malone, who might or might not be Molloy himself, addresses us with his ruminations while in the act of dying. The third novel consists of the fragmented monologue–delivered, like the monologues of the previous novels, in a mournful rhetoric that possesses the utmost splendor and beauty–of what might or might not be an armless and legless creature living in an urn outside an eating house. Taken together, these three novels represent the high-water mark of the literary movement we call Modernism. Within their linguistic terrain, where stories are taken up, broken off, and taken up again, where voices rise and crumble and are resurrected, we can discern the essential lineaments of our modern condition, and encounter an awesome vision, tragic yet always compelling and always mysteriously invigorating, of consciousness trapped and struggling inside the boundaries of nature.', 'language": "en", "image": "https://images.isbndb.com/covers/07/04/9780375400704.jpg", "title_long": "Molloy, Malone Dies, The Unnamable (Everyman"s Library)", 'dimensions": "Height: 8.5 Inches, Length: 5.5 Inches, Weight: 1.2 Pounds, Width: 1.25 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 1.25}, "weight": {"unit": "pounds", "value": 1.2}, "height": {"unit": "inches", "value": 8.5}}, "pages": 512, "date_published": "1997-09-16", "subjects": ["Literature & Fiction', 'Classics', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Samuel Beckett'], 'title": "Molloy, Malone Dies, The Unnamable (Everyman"s Library)", 'isbn13": "9780375400704", "msrp": 24, 'binding": "Hardcover", "isbn": "0375400702", "isbn10": "0375400702"}}