{"book": {"publisher": "Modern Library", "synopsis": "Selected by the Modern Library as one of the 100 best novels of all time<br/><br/>With a new Introduction by Geoff Dyer<br/>Commentary by Anthony Burgess, Jessie Chambers, Frieda Lawrence, V.S. Pritchett, Kate Millett, and Alfred Kazin<br/><br/>Of all Lawrence\"s work, Sons and Lovers tells us most about the emotional source of his ideas," observed Diana Trilling. "The famous Lawrence theme of the struggle for sexual power--and he is sure that all the struggles of civilized life have their root in this primary contest--is the constantly elaborated statement of the fierce battle which tore Lawrence\'s family.'<br/><br/>Sons and Lovers is one of the landmark novels of the twentieth century. When it appeared in 1913, it was immediately recognized as the first great modern restatement of the oedipal drama, and it is now widely considered the major work of D. H. Lawrence\'s early period. This intensely autobiographical novel recounts the story of Paul Morel, a young artist growing to manhood in a British working-class family rife with conflict. The author\'s vivid evocation of the all-consuming nature of possessive love and sexual attraction makes this one of his most powerful novels.<br/><br/>For the critic Kate Millett, 'Sons and Lovers is a great novel because it has the ring of something written from deeply felt experience. The past remembered, it conveys more of Lawrence\'s own knowledge of life than anything else he wrote. His other novels appear somehow artificial beside it.'', 'language": "en", "image": "https://images.isbndb.com/covers/37/32/9780375753732.jpg", "title_long": "Sons and Lovers (Modern Library 100 Best Novels)", "edition": "Reprint", "dimensions": "Height: 7.98 Inches, Length: 5.2 Inches, Weight: 1.3999353637 Pounds, Width: 1.68 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 1.68}, "weight": {"unit": "pounds", "value": 1.3999353637}, "height": {"unit": "inches", "value": 7.98}}, "pages": 752, "date_published": "1999-08-17", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Psychological', 'Literary', 'Romance', 'Historical', '20th Century', 'Self Service', 'Custom Stores'], 'authors": ["D.H. Lawrence'], 'title": "Sons and Lovers (Modern Library 100 Best Novels)", "isbn13": "9780375753732", "msrp": 11.95, "binding": "Paperback", "related": {"ePub": "0679641653"}, "isbn": "0375753737", "isbn10": "0375753737", "other_isbns": [{'isbn": "9780679641650", "binding": "printisbn"}]}}