{"book": {"publisher": "Random House", "synopsis": "“Shakespeare’s Kitchen not only reveals, sometimes surprisingly, what people were eating in Shakespeare’s time but also provides recipes that today’s cooks can easily re-create with readily available ingredients.”<br/>—from the Foreword by Patrick O’Connell<br/><br/>Francine Segan introduces contemporary cooks to the foods of William Shakespeare’s world with recipes updated from classic sixteenth- and seventeenth-century cookbooks. Her easy-to-prepare adaptations shatter the myth that the Bard’s primary fare was boiled mutton. In fact, Shakespeare and his contemporaries dined on salads of fresh herbs and vegetables; fish, fowl, and meats of all kinds; and delicate broths. Dried Plums with Wine and Ginger-Zest Crostini, Winter Salad with Raisin and Caper Vinaigrette, and Lobster with Pistachio Stuffing and Seville Orange Butter are just a few of the delicious, aromatic, and gorgeous dishes that will surprise and delight. Segan’s delicate and careful renditions of these recipes have been thoroughly tested to ensure no-fail, standout results.<br/><br/>The tantalizing Renaissance recipes in Shakespeare’s Kitchen are enhanced with food-related quotes from the Bard, delightful morsels of culinary history, interesting facts on the customs and social etiquette of Shakespeare’s time, and the texts of the original recipes, complete with antiquated spellings and eccentric directions. Fifty color images by award-winning food photographer Tim Turner span the centuries with both old-world and contemporary treatments. Patrick O’Connell provides an enticing Foreword to this edible history from which food lovers and Shakespeare enthusiasts alike will derive nourishment. Want something new for dinner? Try something four hundred years old.", "language": "en", "image": "https://images.isbndb.com/covers/91/79/9780375509179.jpg", "title_long": "Shakespeare"s Kitchen: Renaissance Recipes for the Contemporary Cook", "edition": "1", "dimensions": "Height: 10.33 Inches, Length: 8.15 Inches, Weight: 2.51988365466 Pounds, Width: 0.97 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.15}, "width": {"unit": "inches", "value": 0.97}, "weight": {"unit": "pounds", "value": 2.51988365466}, "height": {"unit": "inches", "value": 10.33}}, "pages": 288, "date_published": "2003-10-14", "subjects": ["Cookbooks, Food & Wine'], 'authors": ["Francine Segan'], 'title": "Shakespeare"s Kitchen: Renaissance Recipes for the Contemporary Cook", 'isbn13": "9780375509179", "msrp": 24.38, "binding": "Hardcover", "related": {"ePub": "0679644989"}, "isbn": "0375509178", "isbn10": "0375509178", "other_isbns": [{'isbn": "9780679644989", "binding": "printisbn"}]}}