{"book": {"publisher": "Modern Library", "synopsis": "Selected by the Modern Library as one of the 100 best novels of all time<br/><br/>From the Modern Library’s new set of beautifully repackaged hardcover classics by William Faulkner—also available are Snopes, The Sound and the Fury, Light in August, Absalom, Absalom!, and Selected Short Stories<br/><br/>One of William Faulkner’s finest novels, As I Lay Dying, originally published in 1930, remains a captivating and stylistically innovative work. The story revolves around a grim yet darkly humorous pilgrimage, as Addie Bundren’s family sets out to fulfill her last wish: to be buried in her native Jefferson, Mississippi, far from the miserable backwater surroundings of her married life. Told through multiple voices, As I Lay Dying vividly brings to life Faulkner’s imaginary South, one of literature’s great invented landscapes, and is replete with the poignant, impoverished, violent, and hypnotically fascinating characters that were his trademark. Along with a new Foreword by E. L. Doctorow, this edition reproduces the corrected text of As I Lay Dying as established in 1985 by Faulkner expert Noel Polk.", "language": "en", "image": "https://images.isbndb.com/covers/45/25/9780375504525.jpg", "title_long": "As I Lay Dying (Modern Library 100 Best Novels)", "edition": "1", "dimensions": "Height: 8.27 Inches, Length: 5.57 Inches, Weight: 0.87523518014 Pounds, Width: 0.86 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.57}, "width": {"unit": "inches", "value": 0.86}, "weight": {"unit": "pounds", "value": 0.87523518014}, "height": {"unit": "inches", "value": 8.27}}, "pages": 256, "date_published": "2000-11-28", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Small Town & Rural', 'United States', 'Literary', 'Reference', 'Teen & Young Adult', 'Self Service', 'Custom Stores'], 'authors": ["William Faulkner'], 'title": "As I Lay Dying (Modern Library 100 Best Novels)", "isbn13": "9780375504525", "msrp": 22, "binding": "Hardcover", "isbn": "0375504524", "isbn10": "0375504524", "other_isbns": [{'isbn": "9780307792167", "binding": "print"}]}}