{"book": {"publisher": "Harper Voyager", "synopsis": "It has been a century since a small group of humans was marooned on a distant planet. Now their descendants struggle with rising infertility, infant mortality, and mysterious birth defects for which no cause--or cure--can be found. Reproduction has become essential, and those who cannot produce children are scorned. Anais, a brilliant female doctor born with inexplicable physical abnormalities, falls victim to this severe treatment.<br/>But then comes a startling revelation during an examination of a remarkably preserved corpse, a member of the planet"s long extinct native race. With horror, Anais discovers that the ancient creature has deformities nearly identical to her own. There must be some link between the planet"s past and the plight of the present-day humans, and Anais must find it before she is exiled forever--thwarting her society"s last chance for survival. It has been a century since a small group of humans was marooned on a distant planet. Now their descendants struggle with rising infertility, infant mortality, and mysterious birth defects for which no cause--or cure--can be found. Reproduction has become essential, and those who cannot produce children are scorned. Anais, a brilliant female doctor born with inexplicable physical abnormalities, falls victim to this severe treatment.<br/>But then comes a startling revelation during an examination of a remarkably preserved corpse, a member of the planets long extinct native race. With horror, Anais discovers that the ancient creature has deformities nearly identical to her own. There must be some link between the planets past and the plight of the present-day humans, and Anais must find it before she is exiled forever--thwarting her societys last chance for survival.', 'language": "en", "image": "https://images.isbndb.com/covers/47/82/9780380794782.jpg", "title_long": "Dark Water"s Embrace", 'dimensions": "Height: 6.75 Inches, Length: 4.25 Inches, Weight: 1 Pounds, Width: 0.75 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.25}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 1}, "height": {"unit": "inches", "value": 6.75}}, "pages": 331, "date_published": "1998-03-01", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Science Fiction & Fantasy', 'Fantasy', 'Science Fiction'], 'authors": ["Stephen Leigh'], 'title": "Dark Water"s Embrace", 'isbn13": "9780380794782", "msrp": 3.99, 'binding": "Mass Market Paperback", "isbn": "0380794780", "isbn10": "0380794780"}}