{"book": {"publisher": "Avon Books", "synopsis": "There is no accolade or major mystery award that has not already been bestowed upon Lawrence Block. His acclaimed crime novels are asintelligent, provocative, and emotionally complex as they are nerve-tighteningly intense. And perhaps the most respected of his myriad works are the Matthew Scudder books -- masterworks of suspenseful invention featuring a remarkable protagonist rich in conscience and character, with all the flaws that his humanity entails. This is the detective novel as high art. A Dance At The Slaughterhouse<br/>In Matt Scudder"s mind, money, power, and position elevate nobody above morality and the law. Now the ex-cop and unlicensed p.i. has been hired to prove that socialite Richard Thurman orchestrated the brutal murder of his beautiful, pregnant wife. During Scudder"s hard drinking years, he left a piece of his soul on every seedy corner of the Big Apple. But this case is more depraved and more potentially devastating than anything he experienced while floundering in the urban depths. Because this investigation is leading Scudder on a frightening grand tour of New York"s sex-for-sale underworld -- where an innocent young life is simply a commodity to be bought and perverted ... and then destroyed.', 'language": "en", "image": "https://images.isbndb.com/covers/37/35/9780380813735.jpg", "title_long": "A Dance at the Slaughterhouse (Matthew Scudder)", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 0.75 Pounds, Width: 0.66 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 0.66}, "weight": {"unit": "pounds", "value": 0.75}, "height": {"unit": "inches", "value": 8}}, "pages": 294, "date_published": "2000-07-03", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Mystery, Thriller & Suspense', 'Mystery', 'Hard-Boiled', 'Private Investigators', 'Amateur Sleuths', 'Thrillers & Suspense', 'Crime', 'Self Service', 'Custom Stores'], 'authors": ["Lawrence Block'], 'title": "A Dance at the Slaughterhouse (Matthew Scudder)", "isbn13": "9780380813735", "msrp": 13.99, "binding": "Paperback", "related": {"Kindle Edition": "0061806676", "ePub": "0061806676"}, "isbn": "0380813734", "isbn10": "0380813734", "other_isbns": [{'isbn": "9780061806674", "binding": "print"}]}}