{"book": {"publisher": "William Morrow Paperbacks", "synopsis": "New York Times bestselling author Dennis Lehane\"s classic novel featuring beloved P.I.\"s Kenzie and Gennaro captures the dark realism of Boston\"s gritty blue-collar streets<br/>When Patrick first meets Karen Nichols, she strikes him as a naive woman from a protected upbringing, untouched by tragedy. But six months later Karen commits suicide by leaping from one of Boston\'s monuments. Patrick finds himself wondering what can alter someone so drastically, so quickly, that suicide seems her only option. Yet Patrick soon suspects that tragic events that befell Karen during the last months of her life--an 'accident' that destroyed her fiance; the loss of her job, her apartment, and eventually her mind-- may not have been as random as they first appeared.<br/>Enlisting the aid of his ex-partner and ex-flame, Angela Gennaro, as well as that of his friend, the lethally unbalanced Bubba Rogowski, Patrick enters into a treacherous game of cat-and-mouse with a man who, instead of merely killing his victims, prefers to make them wish they were dead. As Patrick, Angie, and Bubba wage psychological warfare with this brilliant, depraved sociopath, they soon discover they might be fighting a losing battle against an enemy who is determined to tear their worlds apart.', 'language": "en", "image": "https://images.isbndb.com/covers/03/60/9780380730360.jpg", "title_long": "Prayers for Rain", "edition": "Reissue", "dimensions": "Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.45 Pounds, Width: 1.04 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.19}, "width": {"unit": "inches", "value": 1.04}, "weight": {"unit": "pounds", "value": 0.45}, "height": {"unit": "inches", "value": 6.75}}, "pages": 416, "date_published": "2000-05-02", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Psychological', 'Mystery, Thriller & Suspense', 'Mystery', 'Police Procedurals', 'Hard-Boiled', 'Private Investigators', 'Amateur Sleuths', 'Thrillers & Suspense', 'Psychological Thrillers', 'Self Service', 'Custom Stores'], 'authors": ["Dennis Lehane'], 'title": "Prayers for Rain", "isbn13": "9780380730360", "msrp": 7.99, 'binding": "Mass Market Paperback", "isbn": "0380730367", "isbn10": "0380730367"}}