{"book": {"publisher": "Dial Press Trade Paperback", "synopsis": "Hilarious, sexy, and deeply tender, Kissing in Manhattan was one of the most celebrated debuts in recent years. Acclaimed author David Schickler’s collection of linked stories follows a troupe of love-hungry urbanites through a charmed metropolis and into the Preemption--a mythic Manhattan apartment building. The Preemption sets the stage for a romantic fantasy as exuberant, dark, and dazzling as the city it occupies. Behind closed doors, the paths of an improbable cast of tenants--a seductive perfume heiress; a crabby, misunderstood actor; a preternaturally sharp-sighted priest--tangle and cross, while a perilous love triangle builds around three characters:<br/><br/>James Branch, a shy young accountant with an unusual love for the Preemption’s antique elevator, and a strange destiny...<br/><br/>Patrick Rigg, a Wall Street lothario who soothes his pain by seducing<br/>beautiful women, carrying a gun, and attending the nightly sermons of a foreboding priest...<br/><br/>Rally McWilliams, a fetching, hopeful young writer who roams the city at night, searching for the soulmate she believes in but can’t find...<br/><br/>Charged with joy and a deadly sense of humor, Kissing in Manhattan is a daring new writer’s vision of a world where men and women, good and evil, love and sex, meet, battle, and embrace on every street corner.", "language": "en", "image": "https://images.isbndb.com/covers/56/76/9780385335676.jpg", "title_long": "Kissing in Manhattan: Stories", "dimensions": "Height: 8.3 Inches, Length: 5.5 Inches, Weight: 0.53 Pounds, Width: 0.6 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.6}, "weight": {"unit": "pounds", "value": 0.53}, "height": {"unit": "inches", "value": 8.3}}, "pages": 274, "date_published": "2002-08-27", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Urban Life', 'Short Stories & Anthologies', 'Anthologies', 'Short Stories', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["David Schickler'], 'title": "Kissing in Manhattan: Stories", "isbn13": "9780385335676", "msrp": 11.66, 'binding": "Paperback", "isbn": "0385335679", "isbn10": "0385335679"}}