{"book": {"publisher": "Anchor", "synopsis": "East Side, West Side, from the Little Red Lighthouse to Battery Park City, the wonders of Manhattan’s waterfront are both celebrated and secret–hidden in plain sight. In his brilliant exploration of this defining yet neglected shoreline, personal essayist Philip Lopate also recovers a part of the city’s soul.<br/>A native New Yorker, Lopate has embraced Manhattan by walking every inch of its perimeter, telling stories on the way of pirates (Captain Kidd) and power brokers (Robert Moses), the lowly shipworm and Typhoid Mary, public housing in Harlem and the building of the Brooklyn Bridge. He evokes the magic of the once bustling old port from Melville’s and Whitman’s day to the era of the longshoremen in On the Waterfront, while appraising today’s developers and environmental activists, and probing new plans for parks and pleasure domes with river views. Whether escorting us into unfamiliar, hazardous crannies or along a Beaux Arts esplanade, Waterfront is a grand literary ramble and defense of urban life by one of our most perceptive observers.", "language": "en", "image": "https://images.isbndb.com/covers/71/45/9780385497145.jpg", "title_long": "Waterfront: A Walk Around Manhattan", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.26 Inches, Weight: 0.9 Pounds, Width: 1.1 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.26}, "width": {"unit": "inches", "value": 1.1}, "weight": {"unit": "pounds", "value": 0.9}, "height": {"unit": "inches", "value": 8}}, "pages": 448, "date_published": "2005-05-10", "subjects": ["Literature & Fiction', 'Essays & Correspondence', 'Essays', 'Short Stories & Anthologies', 'Anthologies', 'United States', 'Reference', 'Writing, Research & Publishing Guides', 'Writing', 'Travel', 'Northeast', 'Travel Writing'], 'authors": ["Phillip Lopate'], 'title": "Waterfront: A Walk Around Manhattan", "isbn13": "9780385497145", "msrp": "0.00", "binding": "Paperback", "related": {"Kindle Edition": "0307492966", "ePub": "0307492966"}, "isbn": "0385497148", "isbn10": "0385497148", "other_isbns": [{'isbn": "9780307492968", "binding": "printisbn"}]}}