{"book": {"publisher": "Anchor", "synopsis": "#1 NEW YORK TIMES BESTSELLER • They call themselves the Brethren: three disgraced former judges doing time in a Florida federal prison. One was sent up for tax evasion. Another, for skimming bingo profits. The third for a career-ending drunken joyride.<br/><br/>Meeting daily in the prison law library, taking exercise walks in their boxer shorts, these judges-turned-felons can reminisce about old court cases, dispense a little jailhouse justice, and contemplate where their lives went wrong. Or they can use their time in prison to get very rich—very fast.<br/><br/>And so they sit, sprawled in the prison library, furiously writing letters, fine-tuning a wickedly brilliant extortion scam—while events outside their prison walls begin to erupt. A bizarre presidential election is holding the nation in its grips, and a powerful government figure is pulling some very hidden strings. For the Brethren, the timing couldn’t be better. Because they’ve just found the perfect victim.<br/><br/>Don’t miss John Grisham’s new book, THE EXCHANGE: AFTER THE FIRM!", "language": "en", "image": "https://images.isbndb.com/covers/96/74/9780385339674.jpg", "title_long": "The Brethren", "edition": "Reprint", "dimensions": "Height: 7.99 Inches, Length: 5.26 Inches, Weight: 0.65 Pounds, Width: 0.82 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.26}, "width": {"unit": "inches", "value": 0.82}, "weight": {"unit": "pounds", "value": 0.65}, "height": {"unit": "inches", "value": 7.99}}, "pages": 384, "date_published": "2005-12-27", "subjects": ["Literature & Fiction', 'Genre Fiction', 'United States', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Legal', 'Spies & Politics', 'Suspense', 'Self Service', 'Custom Stores'], 'authors": ["John Grisham'], 'title": "The Brethren", "isbn13": "9780385339674", "msrp": 17, "binding": "Paperback", "related": {"Kindle Edition": "0307575977", "ePub": "0307575977"}, "isbn": "0385339674", "isbn10": "0385339674", "other_isbns": [{'isbn": "9780307575975", "binding": "printisbn"}]}}