{"book": {"publisher": "Dell", "synopsis": "NEW YORK TIMES BESTSELLER • The fourth book in Diana Gabaldon’s acclaimed Outlander saga, the basis for the Starz original series.<br/><br/>“Unforgettable characters . . . richly embroidered with historical detail.”—The Cincinnati Post<br/><br/>What if you knew someone you loved was going to die? What if you thought you could save them? How much would you risk to try?<br/><br/>Claire Randall has gone to find Jamie Fraser, the man she loved more than life, and has left half her heart behind with their daughter, Brianna. Claire gave up Jamie to save Brianna, and now Bree has sent her mother back to the mysterious Scottish warrior who was willing to give his life to save them both. But a chilling discovery in the pages of history suggests that Jamie and Claire’s story doesn’t have a happy ending.<br/><br/>Brianna dares a terrifying leap into the unknown in search of her mother and the father she has never met, risking her own future to try to change history . . . and to save their lives. But as Brianna plunges into an uncharted wilderness, a heartbreaking encounter may strand her forever in the past . . . or root her in the place she should be, where her heart and soul belong.", "language": "en", "image": "https://images.isbndb.com/covers/59/80/9780385335980.jpg", "title_long": "Drums of Autumn (Outlander)", "edition": "Later Printing Used", "dimensions": "Height: 9.2 Inches, Length: 6.12 Inches, Weight: 1.8375 Pounds, Width: 1.53 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.12}, "width": {"unit": "inches", "value": 1.53}, "weight": {"unit": "pounds", "value": 1.8375}, "height": {"unit": "inches", "value": 9.2}}, "pages": 928, "date_published": "2001-08-07", "subjects": ["Literature & Fiction', 'United States', 'Romance', 'Historical', 'Scottish', 'Time Travel', 'Science Fiction & Fantasy', 'Fantasy', 'Romantic'], 'authors": ["Diana Gabaldon'], 'title": "Drums of Autumn (Outlander)", "isbn13": "9780385335980", "msrp": 18, 'binding": "Paperback", "isbn": "0385335989", "isbn10": "0385335989"}}