{"book": {"publisher": "Doubleday", "synopsis": "In partnership with the New York Public Library, Doubleday is proud to introduce a very special collector"s series of literary masterpieces. Lavishly illustrated with rare archival material from the library"s extensive resources, including the renowned Berg collection, these editions will bring the classics to life for a new generation of readers. In addition to original artwork, each volume contains a fascinating selection of unique materials such as handwritten diaries, letters, manuscripts, and notebooks. Simply put, this series presents the work of our most beloved authors in what may well be their most beautiful editions, perfect to own or to give. Published on the occasion of Doubleday"s 100th birthday, the New York Public Library Collector's Editions are sure to become an essential part of the modern book lover's private library.<br/><br/>This collection of Emily Dickinson's poems, compiled by the librarians most familiar with her work and complemented by several of the poet's handwritten letters, is illustrated with lithographs by Will Barnet and pen-and-ink drawings by Stephen Tennant, artists who have drawn inspiration from Dickinson's poetry. It is a beautiful and affordable celebration of the work of one of our favorite poets.', 'language": "en", "image": "https://images.isbndb.com/covers/71/84/9780385487184.jpg", "title_long": "Selected Poetry of Emily Dickinson (New York Public Library Collector"s Editions)", 'edition": "1", "dimensions": "Height: 7.75 Inches, Length: 5.75 Inches, Weight: 0.9 Pounds, Width: 1.25 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.75}, "width": {"unit": "inches", "value": 1.25}, "weight": {"unit": "pounds", "value": 0.9}, "height": {"unit": "inches", "value": 7.75}}, "pages": 336, "date_published": "1997-04-14", "subjects": ["Literature & Fiction', 'Classics', 'Poetry', 'Regional & Cultural', 'United States'], 'authors": ["Emily Dickinson'], 'title": "Selected Poetry of Emily Dickinson (New York Public Library Collector"s Editions)", 'isbn13": "9780385487184", "msrp": 15, 'binding": "Hardcover", "isbn": "0385487185", "isbn10": "0385487185"}}