{"book": {"publisher": "Dell", "synopsis": "NEW YORK TIMES BESTSELLER • The second book in Diana Gabaldon’s acclaimed Outlander saga, the basis for the Starz original series.<br/><br/>“A triumph! A powerful tale layered in history and myth. I loved every page.”—Nora Roberts<br/><br/>With her classic novel Outlander, Diana Gabaldon introduced two unforgettable characters—Claire Randall and Jamie Fraser—delighting readers with a story of adventure and love that spanned two centuries. Now Gabaldon returns to that extraordinary time and place in this vivid, powerful sequel to Outlander.<br/><br/>For twenty years, Claire Randall has kept her secrets. But now she is returning with her grown daughter to the mysteries of Scotland’s mist-shrouded Highlands. Here Claire plans to reveal a truth as shocking as the events that gave it birth: the secret of an ancient circle of standing stones, the secret of a love that transcends centuries, and the truth of a man named Jamie Fraser—a Highland warrior whose gallantry once drew the young Claire from the security of her century to the dangers of his.<br/><br/>Claire’s spellbinding journey continues through the intrigue-ridden French court and the menace of Jacobite plots, to the Highlands of Scotland, through war and death in a desperate fight to save both the child and the man she loves.", "language": "en", "image": "https://images.isbndb.com/covers/59/73/9780385335973.jpg", "title_long": "Dragonfly in Amber (Outlander, Book 2)", "dimensions": "Height: 9.22 Inches, Length: 6.19 Inches, Weight: 1.6 Pounds, Width: 1.47 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.19}, "width": {"unit": "inches", "value": 1.47}, "weight": {"unit": "pounds", "value": 1.6}, "height": {"unit": "inches", "value": 9.22}}, "pages": 768, "date_published": "2001-08-07", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'British & Irish', 'Contemporary', 'Romance', 'Time Travel', 'Science Fiction & Fantasy', 'Fantasy', 'Romantic'], 'authors": ["Diana Gabaldon'], 'title": "Dragonfly in Amber (Outlander, Book 2)", "isbn13": "9780385335973", "msrp": 8.99, 'binding": "Paperback", "isbn": "0385335970", "isbn10": "0385335970"}}