{"book": {"publisher": "Anchor", "synopsis": "NATIONAL BESTSELLER • From the Pulitzer Prize-winning author of A Thousand Acres comes a “smashing...fascinating” novel (The New York Times Book Review) that conjures all the American obsessions of the 1980s: sex, greed, envy, real estate, and the American dream.<br/><br/>In her subversively funny and genuinely moving new novel, Jane Smiley nails down several American preoccupations with the expertise of a master carpenter.<br/><br/>Forthright, likable Joe Stratford is the kind of local businessman everybody trusts, for good reason. But it’s 1982, and even in Joe’s small town, values are in upheaval: not just property values, either. Enter Marcus Burns, a would-be master of the universe whose years with the IRS have taught him which rules are meant to be broken. Before long he and Joe are new best friends—and partners in an investment venture so complex that no one may ever understand it. Add to this Joe’s roller coaster affair with his mentor’s married daughter. The result is as suspenseful and entertaining as any of Jane Smiley’s fiction.", "language": "en", "image": "https://images.isbndb.com/covers/10/59/9780385721059.jpg", "title_long": "Good Faith", "edition": "Reprint", "dimensions": "Height: 7.99 Inches, Length: 5.18 Inches, Weight: 0.69 Pounds, Width: 0.88 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.18}, "width": {"unit": "inches", "value": 0.88}, "weight": {"unit": "pounds", "value": 0.69}, "height": {"unit": "inches", "value": 7.99}}, "pages": 432, "date_published": "2004-05-11", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Coming of Age', 'Psychological', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Jane Smiley'], 'title": "Good Faith", "isbn13": "9780385721059", "msrp": 12.72, "binding": "Paperback", "related": {"Kindle Edition": "1400040655", "ePub": "1400040655"}, "isbn": "0385721056", "isbn10": "0385721056", "other_isbns": [{'isbn": "9781400040650", "binding": "printisbn"}]}}