{"book": {"publisher": "Dial Press Trade Paperback", "synopsis": "Crow Lake is that rare find, a first novel so quietly assured, so emotionally pitch perfect, you know from the opening page that this is the real thing—a literary experience in which to lose yourself, by an author of immense talent.<br/><br/>Here is a gorgeous, slow-burning story set in the rural “badlands” of northern Ontario, where heartbreak and hardship are mirrored in the landscape. For the farming Pye family, life is a Greek tragedy where the sins of the fathers are visited on the sons, and terrible events occur—offstage.<br/><br/>Centerstage are the Morrisons, whose tragedy looks more immediate if less brutal, but is, in reality, insidious and divisive. Orphaned young, Kate Morrison was her older brother Matt’s protegee, her fascination for pond life fed by his passionate interest in the natural world. Now a zoologist, she can identify organisms under a microscope but seems blind to the state of her own emotional life. And she thinks she’s outgrown her siblings—Luke, Matt, and Bo—who were once her entire world.<br/><br/>In this universal drama of family love and misunderstandings, of resentments harbored and driven underground, Lawson ratchets up the tension with heartbreaking humor and consummate control, continually overturning one’s expectations right to the very end. Tragic, funny, unforgettable, Crow Lake is a quiet tour de force that will catapult Mary Lawson to the forefront of fiction writers today.", "language": "en", "image": "https://images.isbndb.com/covers/76/32/9780385337632.jpg", "title_long": "Crow Lake (Today Show Book Club #7)", "edition": "Today Show Book Club", "dimensions": "Height: 8.2 Inches, Length: 5.5 Inches, Weight: 0.55 Pounds, Width: 0.68 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.68}, "weight": {"unit": "pounds", "value": 0.55}, "height": {"unit": "inches", "value": 8.2}}, "pages": 320, "date_published": "2003-01-13", "subjects": ["Literature & Fiction', 'Dramas & Plays', 'Tragedy', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Mary Lawson'], 'title": "Crow Lake (Today Show Book Club #7)", "isbn13": "9780385337632", "msrp": 1.99, 'binding": "Paperback", "isbn": "0385337639", "isbn10": "0385337639"}}