{"book": {"publisher": "Anchor", "synopsis": "NATIONAL BESTSELLER • From the author of the widely acclaimed The Book of Ruth comes a harrowing, heartbreaking drama about a rural American family and a disastrous event that forever changes their lives.<br/><br/>"It takes a writer of rare power and discipline to carry off an achievement like A Map of the World. Hamilton proves here that she is one of the best." —Newsweek<br/><br/>The Goodwins, Howard, Alice, and their little girls, Emma and Claire, live on a dairy farm in Wisconsin. Although suspiciously regarded by their neighbors as "that hippie couple' because of their well-educated, urban background, Howard and Alice believe they have found a source of emotional strength in the farm, he tending the barn while Alice works as a nurse in the local elementary school.<br/><br/>But their peaceful life is shattered one day when a neighbor\'s two-year-old daughter drowns in the Goodwins\' pond while under Alice\'s care. Tormented by the accident, Alice descends even further into darkness when she is accused of sexually abusing a student at the elementary school. Soon, Alice is arrested, incarcerated, and as good as convicted in the eyes of a suspicious community. As a child, Alice designed her own map of the world to find her bearings. Now, as an adult, she must find her way again, through a maze of lies, doubt and ill will.<br/><br/>A vivid human drama of guilt and betrayal, A Map of the World chronicles the intricate geographies of the human heart and all its mysterious, uncharted terrain. The result is a piercing drama about family bonds and a disappearing rural American life.', 'language": "en", "image": "https://images.isbndb.com/covers/01/06/9780385720106.jpg", "title_long": "A Map of the World: A Novel (Oprah"s Book Club)", 'edition": "1st Anchor Books Edition", "dimensions": "Height: 7.98 Inches, Length: 5.12 Inches, Weight: 0.64 Pounds, Width: 0.83 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.12}, "width": {"unit": "inches", "value": 0.83}, "weight": {"unit": "pounds", "value": 0.64}, "height": {"unit": "inches", "value": 7.98}}, "pages": 400, "date_published": "1999-12-03", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Family Saga', 'Small Town & Rural', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Jane Hamilton'], 'title": "A Map of the World: A Novel (Oprah"s Book Club)", 'isbn13": "9780385720106", "msrp": 15.95, "binding": "Paperback", "related": {"ePub": "0307764060"}, "isbn": "0385720106", "isbn10": "0385720106", "other_isbns": [{'isbn": "9780307764065", "binding": "printisbn"}]}}