{"book": {"publisher": "Anchor Books", "synopsis": "NATIONAL BESTSELLER • An extraordinary book that reveals how the themes and symbols of ancient narratives continue to bring meaning to birth, death, love, and war.<br/><br/>The Power of Myth launched an extraordinary resurgence of interest in Joseph Campbell and his work. A preeminent scholar, writer, and teacher, he has had a profound influence on millions of people—including Star Wars creator George Lucas. To Campbell, mythology was the “song of the universe, the music of the spheres.” With Bill Moyers, one of America’s most prominent journalists, as his thoughtful and engaging interviewer, The Power of Myth touches on subjects from modern marriage to virgin births, from Jesus to John Lennon, offering a brilliant combination of intelligence and wit.<br/><br/>From stories of the gods and goddesses of ancient Greece and Rome to traditions of Buddhism, Hinduism and Christianity, a broad array of themes are considered that together identify the universality of human experience across time and culture. An impeccable match of interviewer and subject, a timeless distillation of Campbell’s work, The Power of Myth continues to exert a profound influence on our culture.", "language": "es", "image": "https://images.isbndb.com/covers/88/67/9780385418867.jpg", "title_long": "Power of myth, The", "edition": "Reissue", "dimensions": "Weight: 4.629707502 Pounds", "dimensions_structured": {'weight": {"unit": "pounds", "value": 4.629707502}}, "pages": 293, "date_published": "1991", "subjects": ["Literature & Fiction', 'History & Criticism', 'Genres & Styles', 'Religion & Spirituality', 'Religious Studies', 'Philosophy', 'Comparative Religion', 'Sociology', 'Politics & Social Sciences', 'Religious', 'Social Sciences', 'Folklore & Mythology', 'Anthropology', 'Cultural'], 'authors": ["Joseph Campbell'], 'title": "Power of myth, The", "isbn13": "9780385418867", "msrp": 11.99, "binding": "Paperback", "related": {"ePub": "0307794725"}, "isbn": "0385418868", "isbn10": "0385418868", "other_isbns": [{'isbn": "9780307794727", "binding": "printisbn"}]}}