{"book": {"publisher": "Nan A. Talese", "synopsis": "Margaret Atwood isacknowledged as one of the foremost writers of our time. In Moral Disorder, she has created a series of interconnected stories that trace the course of a life and also the lives intertwined with it—those of parents, of siblings, of children, of friends, of enemies, of teachers, and even of animals. As in a photograph album, time is measured in sharp, clearly observed moments. The ’30s, the ’40s, the ’50s, the ’60s, the ’70s, the ’80s, the ’90s, and the present —all are here. The settings vary: large cities, suburbs, farms, northern forests.<br/><br/>“The Bad News” is set in the present, as a couple no longer young situate themselves in a larger world no longer safe. The narrative then switches time as the central character moves through childhood and adolescence in “The Art of Cooking and Serving,” “The Headless Horseman,” and “My Last Duchess.” We follow her into young adulthood in “The Other Place” and then through a complex relationship, traced in four of the stories: “Monopoly,” “Moral Disorder,” “White Horse,” and “The Entities.” The last two stories, "The Labrador Fiasco" and "The Boys at the Lab,' deal with the heartbreaking old age of parents but circle back again to childhood, to complete the cycle.<br/><br/>By turns funny, lyrical, incisive, tragic, earthy, shocking, and deeply personal, Moral Disorder displays Atwood’s celebrated storytelling gifts and unmistakable style to their best advantage. As the New York Times has said: "The reader has the sense that Atwood has complete access to her people\"s emotional histories, complete understanding of their hearts and imaginations.”', 'language": "en", "image": "https://images.isbndb.com/covers/38/46/9780385503846.jpg", "title_long": "Moral Disorder: and Other Stories", "edition": "First Edition", "dimensions": "Height: 8.46 Inches, Length: 5.99 Inches, Weight: 0.885 Pounds, Width: 0.87 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.99}, "width": {"unit": "inches", "value": 0.87}, "weight": {"unit": "pounds", "value": 0.885}, "height": {"unit": "inches", "value": 8.46}}, "pages": 240, "date_published": "2006-09-19", "subjects": ["Literature & Fiction', 'Short Stories & Anthologies', 'Short Stories', 'Contemporary'], 'authors": ["Margaret Atwood'], 'title": "Moral Disorder: and Other Stories", "isbn13": "9780385503846", "msrp": 23.95, 'binding": "Hardcover", "isbn": "0385503849", "isbn10": "0385503849"}}