{"book": {"publisher": "Main Street Books", "synopsis": "From the #1 New York Times bestselling author of Astrophysics for People in a Hurry comes a fascinating guide to the most popular questions about the universe.<br/><br/>In Neil de Grasse Tyson\"s delightful tour of the galaxies, his fictional character Merlin responds to popular astronomy questions asked by adults and children alike. Merlin, a visitor from Planet Omniscia in the Andromeda Galaxy, has been friends with many of the most important scientific figures of the past, including da Vinci, Magellan, Doppler, Einstein, and Hubble—and he often recounts his conversations with these historical figures in his explanations. Merlin\"s illuminating answers feature a unique combination of wit and poetry along with serious science explained in refreshingly clear, reader-friendly language.<br/><br/>Dear Merlin: Can a person cross our galaxy in a spaceship during one human lifespan?<br/><br/>Merlin: In 1905, Merlin\"s good friend Albert Einstein introduced the 'Special Theory of Relativity,' which predicts that time will tick slower and slower the faster you travel. Were you to embark on such an adventure you could conceivably age as little as you wish, depending of course, on your exact speed. The problem arises when you return to Earth, which will have moved several hundred thousand years into the future and everyone will have forgotten about you.<br/><br/>A timeless book for lovers of the universe by one of its greatest lights.', 'language": "en", "image": "https://images.isbndb.com/covers/83/58/9780385488358.jpg", "title_long": "Merlin"s Tour of the Universe: A Skywatcher"s Guide to Everything from Mars and Quasars to Comets, Planets, Blue Moons, and Werewolves', 'edition": "Illustrated", "dimensions": "Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.7 Pounds, Width: 0.7 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.7}, "weight": {"unit": "pounds", "value": 0.7}, "height": {"unit": "inches", "value": 8.5}}, "pages": 320, "date_published": "1997-07-14", "subjects": ["Science & Math', 'Astronomy & Space Science', 'Astronomy', 'Astrophysics & Space Science', 'Comets, Meteors & Asteroids', 'Mars', 'Evolution', 'Travel', 'Polar Regions', 'Antarctica', 'Specialty Travel', 'Ecotourism'], 'authors": ["Neil deGrasse Tyson'], 'title": "Merlin"s Tour of the Universe: A Skywatcher"s Guide to Everything from Mars and Quasars to Comets, Planets, Blue Moons, and Werewolves', 'isbn13": "9780385488358", "msrp": 19, "binding": "Paperback", "related": {"ePub": "0307784088"}, "isbn": "0385488351", "isbn10": "0385488351", "other_isbns": [{'isbn": "9780307784087", "binding": "printisbn"}]}}