{"book": {"publisher": "Main Street Books", "synopsis": "From the #1 New York Times bestselling author of Astrophysics for People in a Hurry comes a follow-up guide to more of the most popular questions about the universe.<br/><br/>In this companion volume to Merlin"s Tour of the Universe, Neil de Grasse Tyson presents a completely new collection of questions and answers about the cosmos for stargazers of all ages. Whether waxing about Earth and its environs, the Sun and its stellar siblings, the world of light, physical laws, or galaxies near and far, Merlin--a fictional visitor from Planet Omniscia and our guide to the universe--is easy to understand, often humorous, and always entertaining.<br/><br/>Merlin fields a wide range of questions from many curious mortals, and in so doing draws on his own vast knowledge as well as the expertise of many close friends, including Archimedes, Galileo, Einstein, and Santa. Merlin hasn"t been stumped yet, responding to questions including:<br/><br/>If aliens exploded our moon, what effect would it have on us?<br/>What are your thoughts on the theory that a star named Nemesis is circling our solar system and was responsible for killing off the dinosaurs?<br/>Is it true that if I leave a container on my roof for a period of time, I can actually collect space particles from outer space?<br/><br/>Delightfully illustrated throughout, Just Visiting This Planet is a timeless book for lovers of the universe by one of its brightest lights.", 'language": "en", "image": "https://images.isbndb.com/covers/83/72/9780385488372.jpg", "title_long": "Just Visiting This Planet: Merlin Answers More Questions about Everything under the Sun, Moon, and Stars", "edition": "1", "dimensions": "Height: 8.55 Inches, Length: 5.6 Inches, Weight: 0.98 Pounds, Width: 0.7 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.6}, "width": {"unit": "inches", "value": 0.7}, "weight": {"unit": "pounds", "value": 0.98}, "height": {"unit": "inches", "value": 8.55}}, "pages": 352, "date_published": "1998-07-13", "subjects": ["Science & Math', 'Astronomy & Space Science', 'Astronomy', 'Astrophysics & Space Science'], 'authors": ["Neil de Grasse Tyson'], 'title": "Just Visiting This Planet: Merlin Answers More Questions about Everything under the Sun, Moon, and Stars", "isbn13": "9780385488372", "msrp": 14.99, "binding": "Paperback", "related": {"ePub": "0307784096"}, "isbn": "0385488378", "isbn10": "0385488378", "other_isbns": [{'isbn": "9780307784094", "binding": "printisbn"}]}}