{"book": {"publisher": "Anchor", "synopsis": ""A collection of wistful, witty stories." --Esquire<br/>"Hilarious, deep and a little bit dirty.' --Harper\'s Bazaar<br/><br/>A grief-stricken librarian decides to have sex with every man who enters her library. A half-mad, unbearably beautiful heiress follows a strange man home, seeking total sexual abandon: He only wants to watch game shows. A woman falls in love with a hunchback; when his deformity turns out to be a prosthesis, she leaves him. A wife whose husband has just returned from the war struggles with the heartrending question: Can she still love a man who has no lips?<br/><br/>Aimee Bender\'s stories portray a world twisted on its axis, a place of unconvention that resembles nothing so much as real life, in all its grotesque, beautiful glory. From the first line of each tale she lets us know she is telling a story, but the moral is never quite what we expect. Bender\'s prose is glorious: musical and colloquial, inimitable and heartrending.<br/><br/>Here are stories of men and women whose lives are shaped--and sometimes twisted--by the power of extraordinary desires, erotic and otherwise. The Girl in the Flammable Skirt is the debut of a major American writer.<br/><br/>A 1998 New York Times Notable Book of the Year. Selected by the Los Angeles Times as one of the best works of fiction of 1998.', 'language": "en", "image": "https://images.isbndb.com/covers/21/64/9780385492164.jpg", "title_long": "The Girl in the Flammable Skirt: Stories", "edition": "33558th", "dimensions": "Height: 8 Inches, Length: 5.2 Inches, Weight: 0.36 Pounds, Width: 0.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 0.5}, "weight": {"unit": "pounds", "value": 0.36}, "height": {"unit": "inches", "value": 8}}, "pages": 192, "date_published": "1999-08-17", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Short Stories & Anthologies', 'Anthologies', 'Short Stories', 'Women's Fiction', 'United States', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Aimee Bender'], 'title": "The Girl in the Flammable Skirt: Stories", "isbn13": "9780385492164", "msrp": 15.95, "binding": "Paperback", "related": {"Kindle Edition": "0307804461", "ePub": "0307804461"}, "isbn": "0385492162", "isbn10": "0385492162", "other_isbns": [{'isbn": "9780307804464", "binding": "printisbn"}]}}