{"book": {"publisher": "Anchor", "synopsis": "NATIONAL BESTSELLER • A book in the best tradition of popular history—the untold story of Ireland\"s role in maintaining Western culture while the Dark Ages settled on Europe. • The perfect St. Patrick\"s Day gift!<br/><br/>Every year millions of Americans celebrate St. Patrick\"s Day, but they may not be aware of how great an influence St. Patrick was on the subsequent history of civilization. Not only did he bring Christianity to Ireland, he instilled a sense of literacy and learning that would create the conditions that allowed Ireland to become 'the isle of saints and scholars'—and thus preserve Western culture while Europe was being overrun by barbarians.<br/><br/>In this entertaining and compelling narrative, Thomas Cahill tells the story of how Europe evolved from the classical age of Rome to the medieval era. Without Ireland, the transition could not have taken place. Not only did Irish monks and scribes maintain the very record of Western civilization -- copying manuscripts of Greek and Latin writers, both pagan and Christian, while libraries and learning on the continent were forever lost—they brought their uniquely Irish world-view to the task.<br/><br/>As Cahill delightfully illustrates, so much of the liveliness we associate with medieval culture has its roots in Ireland. When the seeds of culture were replanted on the European continent, it was from Ireland that they were germinated.<br/><br/>In the tradition of Barbara Tuchman\'s A Distant Mirror, How The Irish Saved Civilization reconstructs an era that few know about but which is central to understanding our past and our cultural heritage. But it conveys its knowledge with a winking wit that aptly captures the sensibility of the unsung Irish who relaunched civilization.', 'language": "en", "image": "https://images.isbndb.com/covers/84/92/9780385418492.jpg", "title_long": "How the Irish Saved Civilization: The Untold Story of Ireland"s Heroic Role From the Fall of Rome to the Rise of Medieval Europe (The Hinges of History)", 'edition": "First Edition", "dimensions": "Height: 8 Inches, Length: 5.19 Inches, Weight: 0.4739938633 Pounds, Width: 0.56 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.19}, "width": {"unit": "inches", "value": 0.56}, "weight": {"unit": "pounds", "value": 0.4739938633}, "height": {"unit": "inches", "value": 8}}, "pages": 246, "date_published": "1996-02-01", "subjects": ["Christian Books & Bibles', 'Churches & Church Leadership', 'Church History', 'History', 'Europe', 'World', 'Civilization & Culture', 'Religious', 'Religion & Spirituality'], 'authors": ["Thomas Cahill'], 'title": "How the Irish Saved Civilization: The Untold Story of Ireland"s Heroic Role From the Fall of Rome to the Rise of Medieval Europe (The Hinges of History)", 'isbn13": "9780385418492", "msrp": 16, "binding": "Paperback", "related": {"Kindle Edition": "0307755134", "ePub": "0307755134"}, "isbn": "0385418493", "isbn10": "0385418493", "other_isbns": [{'isbn": "9780307755131", "binding": "printisbn"}]}}