{"book": {"publisher": "Delta", "synopsis": "The unforgettable memoir of a woman at the front lines of the civil rights movement—a harrowing account of black life in the rural South and a powerful affirmation of one person’s ability to affect change.<br/><br/>“Anne Moody’s autobiography is an eloquent, moving testimonial to her courage.”—Chicago Tribune<br/><br/>Born to a poor couple who were tenant farmers on a plantation in Mississippi, Anne Moody lived through some of the most dangerous days of the pre-civil rights era in the South. The week before she began high school came the news of Emmet Till’s lynching. Before then, she had “known the fear of hunger, hell, and the Devil. But now there was . . . the fear of being killed just because I was black.” In that moment was born the passion for freedom and justice that would change her life.<br/><br/>A straight-A student who realized her dream of going to college when she won a basketball scholarship, she finally dared to join the NAACP in her junior year. Through the NAACP and later through CORE and SNCC, she experienced firsthand the demonstrations and sit-ins that were the mainstay of the civil rights movement—and the arrests and jailings, the shotguns, fire hoses, police dogs, billy clubs, and deadly force that were used to destroy it.<br/><br/>A deeply personal story but also a portrait of a turning point in our nation’s destiny, this autobiography lets us see history in the making, through the eyes of one of the footsoldiers in the civil rights movement.<br/><br/>Praise for Coming of Age in Mississippi<br/><br/>“A history of our time, seen from the bottom up, through the eyes of someone who decided for herself that things had to be changed . . . a timely reminder that we cannot now relax.”—Senator Edward Kennedy, The New York Times Book Review<br/><br/>“Something is new here . . . rural southern black life begins to speak. It hits the page like a natural force, crude and undeniable and, against all principles of beauty, beautiful.”—The Nation<br/><br/>“Engrossing, sensitive, beautiful . . . so candid, so honest, and so touching, as to make it virtually impossible to put down.”—San Francisco Sun-Reporter", "language": "en", "image": "https://images.isbndb.com/covers/78/16/9780385337816.jpg", "title_long": "Coming of Age in Mississippi: The Classic Autobiography of a Young Black Girl in the Rural South", "edition": "Reprint", "dimensions": "Height: 8.22 Inches, Length: 5.12 Inches, Weight: 0.8 Pounds, Width: 0.95 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.12}, "width": {"unit": "inches", "value": 0.95}, "weight": {"unit": "pounds", "value": 0.8}, "height": {"unit": "inches", "value": 8.22}}, "pages": 432, "date_published": "2004-02-03", "subjects": ["Biographies & Memoirs', 'Community & Culture', 'Black & African American', 'Women', 'Memoirs', 'History', 'Americas', 'United States', 'Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies', 'Sociology', 'Race Relations', 'Politics & Government', 'Specific Topics', 'Self Service', 'Custom Stores'], 'authors": ["Anne Moody'], 'title": "Coming of Age in Mississippi: The Classic Autobiography of a Young Black Girl in the Rural South", "isbn13": "9780385337816", "msrp": 18, "binding": "Paperback", "related": {"Kindle Edition": "0307803589", "ePub": "0307803589"}, "isbn": "0385337817", "isbn10": "0385337817", "other_isbns": [{'isbn": "9780307803580", "binding": "print"}]}}