{"book": {"publisher": "Bantam", "synopsis": "With translation rights sold in twenty-five countries, Gordon Dahlquist’s spectacular and extraordinary debut novel was one of the most-talked-about acquisitions of 2005. Now this monumental Victorian thriller is destined to be the publishing sensation of 2006.<br/><br/>It began with a simple note: a letter of rejection from Miss Temple’s fiancé, written on crisp Ministry paper and delivered on her maid’s silver tray. But for Miss Temple, Roger Bascombe’s cruel rejection will ignite a harrowing quest for answers, plunging her into a mystery as dizzying as a hall of mirrors—and a remote estate where danger abounds and all inhibitions are stripped bare.…Thus begins Gordon Dahlquist’s debut novel of Victorian suspense—at once a dazzling feast for the senses and a beguiling, erotic literary adventure.<br/><br/>Nothing could have prepared Miss Temple for where her pursuit of Roger Bascombe would take her—or for the shocking things she would find behind the closed doors of forbidding Harschmort Manor: men and women in provocative disguise, acts of licentiousness and violence, heroism and awakening. But she will also find two allies: Cardinal Chang, a brutal assassin with the heart of a poet, and a royal doctor named Svenson, at once fumbling and heroic—both of whom, like her, lost someone at Harschmort Manor. As the unlikely trio search for answers—hurtling them from elegant brothels to gaslit alleyways to shocking moments of self-discovery-- they are confronted by puzzles within puzzles. And the closer they get to the truth, the more their lives are in danger. For the conspiracy they face—an astonishing alchemy of science, perverted religion, and lust for power—is so terrifying as to be beyond belief.<br/><br/>In a novel that shatters conventions and seethes with danger and eroticism, Gordon Dahlquist has made a spectacular literary debut. And in Miss Temple he has created an unforgettable guide through a disturbing, seductive, and all-too-real world. By turns brutal and tender, shocking and deliciously romantic, The Glass Books of The Dream Eaters is a novel for the ages, a bold and brilliant work of the imagination", "language": "en", "image": "https://images.isbndb.com/covers/03/59/9780385340359.jpg", "title_long": "The Glass Books of the Dream Eaters", "edition": "First Edition", "dimensions": "Height: 9.4 Inches, Length: 6.4 Inches, Weight: 1 Pounds, Width: 2.2 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.4}, "width": {"unit": "inches", "value": 2.2}, "weight": {"unit": "pounds", "value": 1}, "height": {"unit": "inches", "value": 9.4}}, "pages": 768, "date_published": "2006-08-01", "subjects": ["Literature & Fiction', 'Action & Adventure', 'Mystery, Thriller & Suspense', 'United States', 'Thrillers & Suspense', 'Suspense'], 'authors": ["Gordon Dahlquist'], 'title": "The Glass Books of the Dream Eaters", "isbn13": "9780385340359", "msrp": 26, "binding": "Hardcover", "related": {"ePub": "0553902938"}, "isbn": "0385340354", "isbn10": "0385340354", "other_isbns": [{'isbn": "9780553902938", "binding": "printisbn"}]}}