{"book": {"publisher": "Currency", "synopsis": "IDEO, the widely admired, award-winning design and development firm that brought the world the Apple mouse, Polaroid\"s I-Zone instant camera, the Palm V, and hundreds of other cutting-edge products and services, reveals its secrets for fostering a culture and process of continuous innovation.<br/><br/>There isn\"t a business in America that doesn\"t want to be more creative in its thinking, products, and processes. At many companies, being first with a concept and first to market are critical just to survive. In The Art of Innovation, Tom Kelley, general manager of the Silicon Valley based design firm IDEO, takes readers behind the scenes of this wildly imaginative and energized company to reveal the strategies and secrets it uses to turn out hit after hit.<br/><br/>IDEO doesn\'t buy into the myth of the lone genius working away in isolation, waiting for great ideas to strike. Kelley believes everyone can be creative, and the goal at his firm is to tap into that wellspring of creativity in order to make innovation a way of life. How does it do that? IDEO fosters an atmosphere conducive to freely expressing ideas, breaking the rules, and freeing people to design their own work environments. IDEO\'s focus on teamwork generates countless breakthroughs, fueled by the constant give-and-take among people ready to share ideas and reap the benefits of the group process. IDEO has created an intense, quick-turnaround, brainstorm-and-build process dubbed 'the Deep Dive.'<br/><br/>In entertaining anecdotes, Kelley illustrates some of his firm\'s own successes (and joyful failures), as well as pioneering efforts at other leading companies. The book reveals how teams research and immerse themselves in every possible aspect of a new product or service, examining it from the perspective of clients, consumers, and other critical audiences.<br/><br/>Kelley takes the reader through the IDEO problem-solving method:<br/><br/>> Carefully observing the behavior or 'anthropology' of the people who will be using a product or service<br/><br/>> Brainstorming with high-energy sessions focused on tangible results<br/><br/>> Quickly prototyping ideas and designs at every step of the way<br/><br/>> Cross-pollinating to find solutions from other fields<br/><br/>> Taking risks, and failing your way to success<br/><br/>> Building a 'Greenhouse' for innovation<br/><br/>IDEO has won more awards in the last ten years than any other firm of its kind, and a full half-hour Nightline presentation of its creative process received one of the show\'s highest ratings. The Art of Innovation will provide business leaders with the insights and tools they need to make their companies the leading-edge, top-rated stars of their industries.', 'language": "en", "image": "https://images.isbndb.com/covers/98/42/9780385499842.jpg", "title_long": "The Art of Innovation: Lessons in Creativity from IDEO, America"s Leading Design Firm", 'edition": "Hardcover Edition", "dimensions": "Height: 9.52 Inches, Length: 6.6 Inches, Weight: 1.9 Pounds, Width: 1.1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.6}, "width": {"unit": "inches", "value": 1.1}, "weight": {"unit": "pounds", "value": 1.9}, "height": {"unit": "inches", "value": 9.52}}, "pages": 320, "date_published": "2001-01-16", "subjects": ["Arts & Photography', 'Decorative Arts & Design', 'Industrial & Product Design', 'Business & Money', 'Biography & History', 'Company Profiles', 'Management & Leadership', 'Decision-Making & Problem Solving', 'Management', 'Systems & Planning', 'Education & Reference', 'Processes & Infrastructure', 'Operations Research', 'Research & Development', 'Skills', 'Decision Making', 'Science & Math', 'Technology', 'History of Technology'], 'authors": ["Tom Kelley', 'Jonathan Littman'], 'title": "The Art of Innovation: Lessons in Creativity from IDEO, America"s Leading Design Firm", 'isbn13": "9780385499842", "msrp": 29.95, "binding": "Hardcover", "related": {"Kindle Edition": "0307423867", "ePub": "0307423867"}, "isbn": "0385499841", "isbn10": "0385499841", "other_isbns": [{'isbn": "9780307423863", "binding": "print"}]}}