{"book": {"publisher": "Image", "synopsis": "G.K. Chesterton\"s brilliant sketch of the life and thought of Thomas Aquinas is as relevant today as when it was published in 1933. Then it earned the praise of such distinguished writers as Etienne Gilson, Jacques Martain, and Anton Pegis as the best book ever written on the great thirteenth-century Dominican. Today Chesterton\"s classic stands poised to reveal Thomas to a new generation.<br/><br/>Chesterton\"s Aquinas is a man of mystery. Born into a noble Neapolitan family, Thomas chose the life of a mendicant friar. Lumbering and shy -- his classmates dubbed him 'the Dumb Ox' -- he led a revolution in Christian thought. Possessed of the rarest brilliance, he found the highest truth in the humblest object. Having spent his life amid the vast intricacies of reason, he asked on his deathbed to have read aloud the Song of Songs, the most passionate book in the Bible.<br/><br/>As Albert the Great, Thomas\'s teacher, predicted, the Dumb Ox has bellowed down the ages to our own day. Chesterton\'s book will enlighten those who would consign Thomas to the obscurity of medieval times. It will confound those who would use Thomas to bolster arid schemes of Christian rationalism. Rather, it will introduce the wondrous mystery of the man who, after a life of unparalleled genius, was seized by a vision of the Unknown and said, 'I can write no more. I have seen things which make all my writings like straw.'', 'language": "en", "image": "https://images.isbndb.com/covers/00/25/9780385090025.jpg", "title_long": "Saint Thomas Aquinas: The Dumb Ox", "edition": "Reissue", "dimensions": "Height: 8.2 Inches, Length: 5.5 Inches, Weight: 0.44974301448 Pounds, Width: 0.55 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.55}, "weight": {"unit": "pounds", "value": 0.44974301448}, "height": {"unit": "inches", "value": 8.2}}, "pages": 208, "date_published": "1974-02-15", "subjects": ["Christian Books & Bibles', 'Catholicism', 'Saints', 'Churches & Church Leadership', 'Church History', 'History', 'Biographies & Memoirs', 'Leaders & Notable People', 'Religious', 'World', 'Religion & Spirituality'], 'authors": ["G. K. Chesterton'], 'title": "Saint Thomas Aquinas: The Dumb Ox", "isbn13": "9780385090025", "msrp": 9.39, 'binding": "Paperback", "isbn": "0385090021", "isbn10": "0385090021"}}