{"book": {"publisher": "Doubleday & Co.", "synopsis": "II Maccabees continues the chronicle of the "Time of the Troubles" (167-64 B.C.E.), begun in I Maccabees. It recounts the stories of conflict between militant Jews, led by Judas Maccabaeus, and their Hellenistic oppressors. Aside from the story of the struggle to control the temple and the holy city of Jerusalem, though, II Maccabees shares little in common with I Maccabees. The second volume of reflections of Jewry in the generation following the Maccabaean revolt presents and evaluates the experience from its own unique perspective.<br/><br/>How these events came to be written, who told the stories, and what reasons motivated such divergent yet parallel interpretations are the questions Jonathan A. Goldstein, translator and commentator on both Maccabaean histories, addresses here. Goldstein utilizes the full array of scholarly tools to examine the critical issues raised by II Maccabees. By examining its language and style, its Hellenic yet Jewish flavor, its comparison and relationship to I Maccabees, its use of sacred writings (Torah and Prophets), its historical context, and the role of the miraculous, Goldstein thoroughly elucidates this powerful account of a pivotal period in Jewish history.<br/><br/>As the commentary makes clear, II Maccabees focuses on certain themes: miracles as God\"s tools for shaping history; the holiness of the Jerusalem temple; the dynamic relationship between the Hasmonaean rulers and their pious opponents; praise of martyrdom; the doctrine of resurrection. An abridgment of Jason of Cyrene\'s work, II Maccabees advances its own theological perspective to its Greek-speaking audience, refuting the Hasmonaean partisan\'s view that pervades I Maccabees.<br/><br/>Jonathan A. Goldstein, author of I Maccabees, is Professor of History and Classics at the University of Iowa. He earned bachelor\'s and master\'s degrees at Harvard, and a doctorate at Columbia University.', 'language": "en", "image": "https://images.isbndb.com/covers/86/44/9780385048644.jpg", "title_long": "II Maccabees (The Anchor Bible, Vol. 41A)", "edition": "First Edition", "dimensions": "Height: 9.75 Inches, Length: 6.5 Inches, Weight: 2 Pounds, Width: 1.25 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.5}, "width": {"unit": "inches", "value": 1.25}, "weight": {"unit": "pounds", "value": 2}, "height": {"unit": "inches", "value": 9.75}}, "pages": 595, "date_published": "1983-10-11", "subjects": ["Christian Books & Bibles', 'Bible Study & Reference', 'Commentaries', 'Additional Texts', 'Religion & Spirituality'], 'authors": ["Jonathan A. Goldstein'], 'title": "II Maccabees (The Anchor Bible, Vol. 41A)", "isbn13": "9780385048644", "msrp": 29, 'binding": "Hardcover", "isbn": "0385048645", "isbn10": "0385048645"}}