{"book": {"publisher": "Delta", "synopsis": "“I come from a long line of midwives,” narrates Elizabeth Whitely. “I was expected to follow Mama, follow Granny, follow Great-granny. In the end, I didn’t disappoint them.<br/><br/>Or perhaps I did. After all, there were no more midwives after me.”For generations, the women in Elizabeth’s family have brought life to Kettle Valley, West Virginia, heeding a destiny to tend its women with herbals, experience, and wisdom. But Elizabeth, who has comforted so many, has lost her heart to the one man who cannot reciprocate, even when she moves into his home to share his bed and raise his child.<br/><br/>Then Lauren Denniker, Elizabeth’s adopted daughter, begins to display a miraculous gift--just as Elizabeth learns that she herself is unable to have a child. How Elizabeth comes to free herself from a loveless relationship, grapple with Lauren’s astonishing abilities, and come to terms with her own emptiness is the compelling heart of this remarkable tale. Incorporating the spirited mountain mythology of prewar Appalachia, Gretchen Laskas has crafted a story as true to our time as its own, and a cast of characters as poignant as they are entirely original.", "language": "en", "image": "https://images.isbndb.com/covers/55/46/9780385335546.jpg", "title_long": "The Midwife"s Tale: A Novel", "edition": "Reprint", "dimensions": "Height: 8.22 Inches, Length: 5.47 Inches, Weight: 0.64 Pounds, Width: 0.55 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.47}, "width": {"unit": "inches", "value": 0.55}, "weight": {"unit": "pounds", "value": 0.64}, "height": {"unit": "inches", "value": 8.22}}, "pages": 256, "date_published": "2004-03-02", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'United States', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Gretchen Moran Laskas'], 'title": "The Midwife"s Tale: A Novel", 'isbn13": "9780385335546", "msrp": 17, "binding": "Paperback", "related": {"ePub": "0307488233"}, "isbn": "0385335547", "isbn10": "0385335547", "other_isbns": [{'isbn": "9780307488237", "binding": "printisbn"}]}}