{"book": {"publisher": "Anchor", "synopsis": "Winner of the Nobel Prize for Literature in 1988, Naguib Mahfouz is perhaps the best-known living Arab writer. His books have had great success in this country, particularly The Cairo Trilogy. Fans of the famed trilogy will be delighted with The Harafish, an epic novel that chronicles the dramatic history of the al-Nagi family -- a family that moves, over many generations, from the height of power and glory to the depths of decadence and decay. The Harafish begins with the tale of Ashur al-Nagi, a man who grows from humble beginnings to become a great leader, a legend among his people. Generation after generation, however, Ashur\"s descendants grow further from his legendary example. They lose touch with their origins as they amass and then squander large fortunes, marry prostitutes when they marry at all, and develop rivalries that end in death. The community\"s upper class keeps a watchful eye on the descendants of al-Nagi for fear of losing their privileges, but they find no threat of another such as Ashur. Not, that is, until the al-Nagi who, like his noble ancestor, finds his power once again from among The Harafish, or the common people. Through the strength of their numbers and their passion, the glory of the name of al-Nagi is restored. "Of all [Mahfouz\'s] experiments in recent decades, this is the one which owes least to western inspiration and is probably the most successful. The Harafish, fluently translated by Catherine Cobham, makes accessible and engrossing reading.' -- The Washington Post Book World.', 'language": "en", "image": "https://images.isbndb.com/covers/33/59/9780385423359.jpg", "title_long": "The Harafish", "edition": "1st Anchor Books ed", "dimensions": "Height: 9.21 Inches, Length: 6.06 Inches, Weight: 1.01192178258 Pounds, Width: 0.89 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.06}, "width": {"unit": "inches", "value": 0.89}, "weight": {"unit": "pounds", "value": 1.01192178258}, "height": {"unit": "inches", "value": 9.21}}, "pages": 416, "date_published": "1997-09-17", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Family Saga', 'Historical', 'History & Criticism', 'Criticism & Theory', 'Short Stories & Anthologies', 'Anthologies', 'World Literature', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Naguib Mahfouz'], 'title": "The Harafish", "isbn13": "9780385423359", "msrp": 14.6, "binding": "Paperback", "related": {"ePub": "0525431624"}, "isbn": "0385423357", "isbn10": "0385423357", "other_isbns": [{'isbn": "9780525431626", "binding": "printisbn"}]}}