{"book": {"publisher": "Anchor", "synopsis": "#1 NEW YORK TIMES BEST SELLER • Grisham returns to the courtroom and weaves a riveting tale of legal intrigue and corporate greed.<br/><br/>Grisham\"s sixth spellbinding novel of legal intrigue and corporate greed displays all of the intricate plotting, fast-paced action, humor, and suspense that have made him the most popular author of our time.<br/><br/>In his first courtroom thriller since A Time To Kill, John Grisham tells the story of a young man barely out of law school who finds himself taking on one of the most powerful, corrupt, and ruthless companies in America -- and exposing a complex, multibillion-dollar insurance scam. In his final semester of law school Rudy Baylor is required to provide free legal advice to a group of senior citizens, and it is there that he meets his first "clients," Dot and Buddy Black.<br/><br/>Their son, Donny Ray, is dying of leukemia, and their insurance company has flatly refused to pay for his medical treatments. While Rudy is at first skeptical, he soon realizes that the Blacks really have been shockingly mistreated by the huge company, and that he just may have stumbled upon one of the largest insurance frauds anyone\'s ever seen -- and one of the most lucrative and important cases in the history of civil litigation. The problem is, Rudy\'s flat broke, has no job, hasn\'t even passed the bar, and is about to go head-to-head with one of the best defense attorneys -- and powerful industries -- in America.<br/><br/>Don’t miss John Grisham’s new book, THE EXCHANGE: AFTER THE FIRM!', 'language": "en", "image": "https://images.isbndb.com/covers/96/05/9780385339605.jpg", "title_long": "The Rainmaker: A Novel", "edition": "Reprint", "dimensions": "Height: 7.98 Inches, Length: 5.12 Inches, Weight: 0.95 Pounds, Width: 1.22 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.12}, "width": {"unit": "inches", "value": 1.22}, "weight": {"unit": "pounds", "value": 0.95}, "height": {"unit": "inches", "value": 7.98}}, "pages": 576, "date_published": "2005-09-27", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Action & Adventure', 'United States', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Legal', 'Spies & Politics', 'Suspense', 'Self Service', 'Custom Stores'], 'authors": ["John Grisham'], 'title": "The Rainmaker: A Novel", "isbn13": "9780385339605", "msrp": 16, "binding": "Paperback", "related": {"Kindle Edition": "0307576051", "ePub": "0307576051"}, "isbn": "0385339607", "isbn10": "0385339607", "other_isbns": [{'isbn": "9780307576057", "binding": "printisbn"}]}}