{"book": {"publisher": "Anchor", "synopsis": "NATIONAL BESTSELLER • The bestselling author of How the Irish Saved Civilization takes us on a journey through the landmarks of art and bloodshed that defined Greek culture nearly three millennia ago.<br/><br/>“A triumph of popularization: extraordinarily knowledgeable, informal in tone, amusing, wide ranging, smartly paced.” —The New York Times Book Review<br/><br/>In the city-states of Athens and Sparta and throughout the Greek islands, honors could be won in making love and war, and lives were rife with contradictions. By developing the alphabet, the Greeks empowered the reader, demystified experience, and opened the way for civil discussion and experimentation—yet they kept slaves. The glorious verses of the Iliad recount a conflict in which rage and outrage spur men to action and suggest that their “bellicose society of gleaming metals and rattling weapons” is not so very distant from more recent campaigns of “shock and awe.” And, centuries before Zorba, Greece was a land where music, dance, and freely flowing wine were essential to the high life. Granting equal time to the sacred and the profane, Cahill rivets our attention to the legacies of an ancient and enduring worldview.", "language": "en", "image": "https://images.isbndb.com/covers/55/47/9780385495547.jpg", "title_long": "Sailing the Wine-Dark Sea: Why the Greeks Matter (The Hinges of History)", "edition": "Reprint", "dimensions": "Height: 7.97 Inches, Length: 5.24 Inches, Weight: 0.81 Pounds, Width: 0.76 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.24}, "width": {"unit": "inches", "value": 0.76}, "weight": {"unit": "pounds", "value": 0.81}, "height": {"unit": "inches", "value": 7.97}}, "pages": 352, "date_published": "2004-07-27", "subjects": ["History', 'Ancient Civilizations', 'Greece', 'World', 'Civilization & Culture', 'Politics & Social Sciences', 'Philosophy', 'Greek & Roman', 'Movements'], 'authors": ["Thomas Cahill'], 'title": "Sailing the Wine-Dark Sea: Why the Greeks Matter (The Hinges of History)", "isbn13": "9780385495547", "msrp": 13.98, "binding": "Paperback", "related": {"ePub": "0307755126"}, "isbn": "0385495544", "isbn10": "0385495544", "other_isbns": [{'isbn": "9780307755124", "binding": "print"}]}}