{"book": {"publisher": "Penguin Books", "synopsis": ""My favorite novel." —Chimamanda Ngozi Adichie<br/><br/>“A magical writer—one of the greatest of the twentieth century.” —Margaret Atwood<br/><br/>“African literature is incomplete and unthinkable without the works of Chinua Achebe.” —Toni Morrison<br/><br/>The second novel in Chinua Achebe’s masterful African trilogy, following Things Fall Apart and preceding No Longer at Ease<br/><br/>When Things Fall Apart ends, colonial rule has been introduced to Umuofia, and the character of the nation, its values, freedoms, religious and socio-political foundations have substantially and irrevocably been altered. Arrow of God, the second novel in Chinua Achebe’s The African Trilogy, moves the historical narrative forward. This time, the action revolves around Ezeulu, the headstrong chief priest of the god Ulu, which is worshipped by the six villages of Umuaro. The novel is a meditation on the nature, uses, and responsibility of power and leadership. Ezeulu finds that his authority is increasingly under threat from rivals within his nation and functionaries of the newly established British colonial government. Yet he sees himself as untouchable. He is forced, with tragic consequences, to reconcile conflicting impulses in his own nature—a need to serve the protecting deity of his Umuaro people; a desire to retain control over their religious observances; and a need to gain increased personal power by pushing his authority to the limits. He ultimately fails as he leads his people to their own destruction, and consequently, his personal tragedy arises. Arrow of God is an unforgettable portrayal of the loss of faith, and the downfall of a man in a society forever altered by colonialism.", 'language": "en", "image": "https://images.isbndb.com/covers/48/09/9780385014809.jpg", "title_long": "Arrow of God", "edition": "Reissue", "dimensions": "Height: 7.99 Inches, Length: 5.2 Inches, Weight: 0.45 Pounds, Width: 0.65 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 0.65}, "weight": {"unit": "pounds", "value": 0.45}, "height": {"unit": "inches", "value": 7.99}}, "pages": 230, "date_published": "2016-08-16", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'World Literature', 'African', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Chinua Achebe'], 'title": "Arrow of God", "isbn13": "9780385014809", "msrp": 11.04, "binding": "Paperback", "related": {"ePub": "1101666382"}, "isbn": "0385014805", "isbn10": "0385014805", "other_isbns": [{'isbn": "9781101666388", "binding": "print"}]}}