{"book": {"publisher": "Delacorte Press", "synopsis": "Olympia Crawford Rubinstein has a busy legal career, a solid marriage, and a way of managing her thriving family with grace, humor, and boundless energy. With twin daughters finishing high school, a son at Dartmouth, and a kindergartner from her second marriage, there seems to be no challenge to which Olympia cannot rise. Until one sunny day in May, when she opens an invitation for her daughters to attend the most exclusive coming-out ball in New York–and chaos erupts all around her. One twin’s excitement is balanced by the other’s outrage; her previous husband’s profound snobbism is in sharp contrast to her current husband’s flat refusal to attend.<br/><br/>For Olympia’s husband, Harry, whose parents survived the Holocaust, the idea of a blue-blood debutante ball is abhorrent. Her daughter Veronica, a natural-born rebel, agrees– while Veronica’s identical twin, Virginia, is already shopping for the perfect dress. Then there’s Olympia’s ex, an insufferable snob, who sees the ball as the perfect opportunity for a family feud. And amid all the hubbub, Olympia’s college-age son, Charlie, is facing a turning point in his life–and may need his mother more than ever. But despite it all, Olympia is determined to steer her family through the event until, just days before the cotillion, things begin to unravel with alarming speed.<br/><br/>From a son’s crisis to a daughter’s heartbreak, from a case of the chicken pox to a political debate raging in her household, Olympia is on the verge of surrender. And that is when, in a series of startling choices and changes of heart, family, friends, and even a blue-haired teenager all find a way to turn a night of calamity into an evening of magic. As old wounds are healed, barriers are shattered and new traditions are born, and a debutante ball becomes a catalyst for change, revelation, acceptance, and love.<br/><br/>In a novel that is by turns profound, poignant, moving, and warmly funny, Danielle Steel tells the story of an extraordinary family–finding new ways of letting go, stepping up, and coming out...in the ways that matter most.", "language": "en", "image": "https://images.isbndb.com/covers/83/25/9780385338325.jpg", "title_long": "Coming Out", "edition": "First Edition", "dimensions": "Height: 8.75 Inches, Length: 6.25 Inches, Weight: 0.8 Pounds, Width: 1 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.25}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 0.8}, "height": {"unit": "inches", "value": 8.75}}, "pages": 208, "date_published": "2006-06-27", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Family Saga', 'Women's Fiction', 'Domestic Life', 'Contemporary', 'Romance'], 'authors": ['Danielle Steel'], 'title": "Coming Out", "isbn13": "9780385338325", "msrp": "0.00", "binding": "Hardcover", "isbn": "0385338325", "isbn10": "0385338325"}}