{"book": {"publisher": "W. W. Norton & Company", "synopsis": "A cause for international celebration―the most important Sherlock Holmes publication in four decades. This monumental edition promises to be the most important new contribution to Sherlock Holmes literature since William Baring-Gould"s 1967 classic work. In this boxed set, Leslie Klinger, a leading world authority, reassembles Arthur Conan Doyle"s 56 classic short stories in the order in which they appeared in late nineteenth- and early twentieth-century book editions. Inside, readers will find a cornucopia of insights: beginners will benefit from Klinger"s insightful biographies of Holmes, Watson, and Conan Doyle; history lovers will revel in the wealth of Victorian literary and cultural details; Sherlockian fanatics will puzzle over tantalizing new theories; art lovers will thrill to the 800-plus illustrations, which make this the most lavishly illustrated edition of the Holmes tales ever produced. The New Annotated Sherlock Holmes illuminates the timeless genius of Arthur Conan Doyle for an entirely new generation of readers. Two-color text throughout; 800+ illustrations', 'language": "en", "image": "https://images.isbndb.com/covers/91/68/9780393059168.jpg", "title_long": "The New Annotated Sherlock Holmes: The Complete Short Stories (2 Vol. Set)", "edition": "Slipcased", "dimensions": "Height: 10.8 Inches, Length: 9.1 Inches, Weight: 10.53148225574 Pounds, Width: 4.3 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 9.1}, "width": {"unit": "inches", "value": 4.3}, "weight": {"unit": "pounds", "value": 10.53148225574}, "height": {"unit": "inches", "value": 10.8}}, "pages": 1700, "date_published": "2004-11-17", "subjects": ["Literature & Fiction', 'Classics', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Traditional Detectives'], 'authors": ["Sir Arthur Conan Doyle'], 'title": "The New Annotated Sherlock Holmes: The Complete Short Stories (2 Vol. Set)", "isbn13": "9780393059168", "msrp": 95, 'binding": "Hardcover", "isbn": "0393059162", "isbn10": "0393059162"}}