{"book": {"publisher": "W. W. Norton & Company", "synopsis": "Maria Tatar redefines the Grimm canon with this authoritative and entertaining collection. The Annotated Brothers Grimm celebrates the richness and dramatic power of the legendary fables in the most spectacular and unusual Grimm volume in decades. Containing forty stories in new translations by Maria Tatar―including "Little Red Riding Hood," "Cinderella,' 'Snow White,' and 'Rapunzel'―the book also features 150 illustrations, many of them in color, by legendary painters such as George Cruikshank and Arthur Rackham; hundreds of annotations that explore the historical origins, cultural complexities, and psychological effects of these tales; and a biographical essay on the lives of Jacob and Wilhelm Grimm. Perhaps most noteworthy is Tatar\'s decision to include tales that were previously excised, including a few bawdy stories and others that were removed after the Grimms learned that parents were reading the book to their children―stories about cannibalism in times of famine and stories in which children die at the end. Enchanting and magical, The Annotated Brothers Grimm will cast its spell on children and adults alike for decades to come. 75 color and 75 black-and-white illustrations', 'language": "en", "image": "https://images.isbndb.com/covers/84/82/9780393058482.jpg", "title_long": "The Annotated Brothers Grimm (The Annotated Books)", "edition": "First Edition", "dimensions": "Height: 10.2999794 Inches, Length: 8.999982 Inches, Weight: 3.3620494955 Pounds, Width: 1.499997 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.999982}, "width": {"unit": "inches", "value": 1.499997}, "weight": {"unit": "pounds", "value": 3.3620494955}, "height": {"unit": "inches", "value": 10.2999794}}, "pages": 512, "date_published": "2004-09-17", "subjects": ["Literature & Fiction', 'History & Criticism', 'Genres & Styles', 'Mythology & Folk Tales', 'Folklore', 'Reference', 'Teen & Young Adult', 'Classics', 'Politics & Social Sciences', 'Social Sciences', 'Folklore & Mythology'], 'authors": ["Jacob Grimm', 'Wilhelm Grimm'], 'title": "The Annotated Brothers Grimm (The Annotated Books)", "isbn13": "9780393058482", "msrp": 35, 'binding": "Hardcover", "isbn": "0393058484", "isbn10": "0393058484"}}