{"book": {"publisher": "W. W. Norton & Company", "synopsis": "A sumptuous annotated edition of the great American novel. "All modern American literature comes from one book by Mark Twain called Huckleberry Finn," Ernest Hemingway once declared. First published in 1885, the book has delighted millions of readers, while simultaneously riling contemporary sensibilities, and is still banned in many schools and libraries. Now, Michael Patrick Hearn, author of the best-selling The Annotated Wizard of Oz, thoroughly reexamines the 116-year heritage of that archetypal American boy, Huck Finn, and follows his adventures along every bend of the mighty Mississippi River. Hearn\"s copious annotations draw on primary sources including the original manuscript, Twain\'s revisions and letters, and period accounts. Reproducing the original E. W. Kemble illustrations from the first edition, as well as countless archival photographs and drawings, some of them previously unpublished, The Annotated Huckleberry Finn is a book no family\'s library can do without; it may well prove to be the classic edition of the great American novel. 274 illustrations, two-color throughout', 'language": "en", "image": "https://images.isbndb.com/covers/03/97/9780393020397.jpg", "title_long": "The Annotated Huckleberry Finn (The Annotated Books)", "edition": "Annotated", "dimensions": "Height: 10.3 Inches, Length: 9.1 Inches, Weight: 4.51506712576 Pounds, Width: 2 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 9.1}, "width": {"unit": "inches", "value": 2}, "weight": {"unit": "pounds", "value": 4.51506712576}, "height": {"unit": "inches", "value": 10.3}}, "pages": 656, "date_published": "2001-10-17", "subjects": ["Children's Books', 'Classics', 'Literature & Fiction', 'Genre Fiction', 'Coming of Age', 'History & Criticism', 'Criticism & Theory', 'United States', 'Literary'], 'authors": ["Mark Twain'], 'title": "The Annotated Huckleberry Finn (The Annotated Books)", "isbn13": "9780393020397", "msrp": 45, 'binding": "Hardcover", "isbn": "0393020398", "isbn10": "0393020398"}}