{"book": {"publisher": "W. W. Norton & Company", "synopsis": "The million-copy bestseller, now fully up-to-date and ready for post-dot-com investors. Using the dot-com crash as an object lesson in how not to manage your portfolio, here is the best-selling, gimmick-free, irreverent, and vastly informative guide to navigating the turbulence of the market and managing investments with confidence. A Random Walk Down Wall Street is well established as a staple of the business shelf, the first book any investor should read before taking the plunge and starting a portfolio. With its life-cycle guide to investing, it matches the needs of investors at any age bracket. Malkiel shows how to analyze the potential returns, not only for stocks and bonds, but for the full range of investment opportunities, from money-market accounts and real estate investment trusts to insurance, home ownership, and tangible assets such as gold and collectibles. Whether you want to brief yourself on the ways of the market before talking to a broker or follow Malkiel"s easy steps to managing your own portfolio, this books remains the best investing guide money can buy.", "language": "en", "image": "https://images.isbndb.com/covers/78/29/9780393057829.jpg", "title_long": "A Random Walk Down Wall Street: The Time-Tested Strategy for Successful Investing", "edition": "Eighth", "dimensions": "Height: 9.6 Inches, Length: 6.5 Inches, Weight: 1.6093745126 Pounds, Width: 1.4 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.5}, "width": {"unit": "inches", "value": 1.4}, "weight": {"unit": "pounds", "value": 1.6093745126}, "height": {"unit": "inches", "value": 9.6}}, "pages": 416, "date_published": "2003-04-17", "subjects": ["Business & Money', 'Economics', 'Investing', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Burton G. Malkiel'], 'title": "A Random Walk Down Wall Street: The Time-Tested Strategy for Successful Investing", "isbn13": "9780393057829", "msrp": 29.95, 'binding": "Hardcover", "isbn": "0393057828", "isbn10": "0393057828"}}