{"book": {"publisher": "W. W. Norton & Company", "synopsis": ""An American storyteller, like Ray Bradbury, like O. Henry."―Neil Gaiman With an unparalleled eye for stories and expressive illustration, Will Eisner, the master and pioneer of American comics art, presents graphic fiction\"s greatest celebration of the Big Apple. No illustrator evoked the melancholy duskiness of New York City as expressively as Eisner, who knew the city from the bottom up. This new hardcover presents a quartet of graphic works (New York, The Building, City People Notebook, and Invisible People) and features what Neil Gaiman describes as 'tales as brutal, as uncaring as the city itself.' From ancient buildings 'barnacled with laughter and stained with tears' to the subways, 'humorless iron reptiles, clacking stupidly on a webbing of graceful steel rails,' Will Eisner\'s New York includes cameo appearances by the author himself; several new illustrations sketched by Eisner, posthumously inked by Peter Poplaski; and three previously unpublished 'out-takes'―a treasure for any Eisner fan, and sure to become a collectible. Introduction by Neil Gaiman.', 'language": "en", "image": "https://images.isbndb.com/covers/10/62/9780393061062.jpg", "title_long": "Will Eisner"s New York: Life in the Big City", 'edition": "First Edition", "dimensions": "Height: 10.3 Inches, Length: 7.4 Inches, Weight: 2.14509780926 Pounds, Width: 1.2 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.4}, "width": {"unit": "inches", "value": 1.2}, "weight": {"unit": "pounds", "value": 2.14509780926}, "height": {"unit": "inches", "value": 10.3}}, "pages": 448, "date_published": "2006-10-17", "subjects": ["Comics & Graphic Novels', 'Graphic Novels', 'Literary', 'Literature & Fiction', 'Reference', 'Encyclopedias & Subject Guides', 'Antiques & Collectibles'], 'authors": ["Will Eisner'], 'title": "Will Eisner"s New York: Life in the Big City", 'isbn13": "9780393061062", "msrp": 39.95, 'binding": "Hardcover", "isbn": "039306106X", "isbn10": "039306106X"}}