{"book": {"publisher": "FisicalBook", "synopsis": "This Second Edition of a perennial favorite in the Norton Critical Edition series represents an extensive revision of its predecessor. The text is that of the first edition of the novel, published by Herbert S. Stone in 1899. It has been annotated by the editor and includes translations of French phrases and information about New Orleans locales, customs, and lore, the Bayou region, and Creole culture. "Bibliographical and Historical Contexts", expanded and introduced by a new Editor’s Note, presents biographical, historical, and cultural documents contemporary with the novel’s publication. Included are a biographical essay by the acclaimed Chopin biographer Emily Toth, "An Etiquette/Advice Book Sampler' with selections from the conduct books of the period in which Chopin lived and wrote, and period fashion plates from Harper’s Bazar. A comprehensive 'Criticism' section, introduced by a new Editor’s Note, contains expanded selections from hard-to-find contemporary reviews of the novel; two letters of mysterious origin written in response to the novel; and Chopin’s 'Retraction,' which followed The Awakening’s negative reception. These are followed by twenty-seven interpretive essays, twelve of them new to the Second Edition, that provide a variety of perspectives on The Awakening, including essays by Cynthia Griffin Wolff, Nancy Walker, Elizabeth Fox-Genovese, Paula A. Treichler, Sandra M. Gilbert, Lee R. Edwards, Patricia S. Yaeger, Elizabeth Ammons, and Elaine Showalter. A Chronology of Chopin’s life and an updated Selected Bibliography are also included.', 'language": "en", "image": "https://images.isbndb.com/covers/05/70/9780393960570.jpg", "title_long": "The Awakening By Chopin Kate Culley Margo EDT", "edition": "Standard Edition", "dimensions": "Weight: 0.71 Pounds", "dimensions_structured": {"weight": {"unit": "pounds", "value": 0.71}}, "pages": 336, "date_published": "1993", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Historical', 'History & Criticism', 'Criticism & Theory', 'Regional & Cultural', 'United States', 'Contemporary', 'Literary', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ['Kate Chopin'], 'title": "The Awakening By Chopin Kate Culley Margo EDT", "isbn13": "9780393960570", "msrp": "0.00", "binding": "Library Binding", "isbn": "0393960579", "isbn10": "0393960579"}}