{"book": {"publisher": "W. W. Norton & Company", "synopsis": "The most entertaining and enlightening writings by the beloved paleontologist, evolutionary biologist, and celebrant of the wonder of life. "Nature is so wondrously complex and varied that almost anything possible does happen....I rejoice in [its] multifariousness and leave the chimera of certainty to politicians and preachers."―from Ever Since Darwin<br/><br/>Upon his death in 2002, Stephen Jay Gould stood at the pinnacle among observers of the natural world, recognized by Congress as a "living legend.' His prodigious legacy―sixteen best-selling and prize-winning books, dozens of scientific papers, an unbroken series of three hundred essays in Natural History―combined to make Gould the most widely read science writer of our time. This indispensable collection of forty-eight pieces from his brilliant oeuvre includes selections from classics such as Ever Since Darwin and The Mismeasure of Man, plus articles and speeches never before published in book form.<br/><br/>This volume, the last that will bear his name, spotlights his elegance, depth, and sheer pleasure in our world―a true celebration of an extraordinary mind. 20 illustrations', 'language": "en", "image": "https://images.isbndb.com/covers/49/88/9780393064988.jpg", "title_long": "The Richness of Life: The Essential Stephen Jay Gould", "edition": "1", "dimensions": "Height: 9.6 Inches, Length: 6.6 Inches, Weight: 2.25 Pounds, Width: 1.8 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.6}, "width": {"unit": "inches", "value": 1.8}, "weight": {"unit": "pounds", "value": 2.25}, "height": {"unit": "inches", "value": 9.6}}, "pages": 672, "date_published": "2007-05-17", "subjects": ["Science & Math', 'Biological Sciences', 'Biology', 'Evolution', 'History & Philosophy', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Stephen Jay Gould'], 'title": "The Richness of Life: The Essential Stephen Jay Gould", "isbn13": "9780393064988", "msrp": 35, 'binding": "Hardcover", "isbn": "0393064980", "isbn10": "0393064980"}}