{"book": {"publisher": "W. W. Norton & Company", "synopsis": "The Norton Critical Edition of Macbeth, Shakespeare"s terrifying depiction of a man and woman"s fall into evil, derives from the First Folio (1623), the only authoritative text of the play. The edition includes an introduction, annotations, and textual notes. A rich “Sources and Contexts” section provides readers with an understanding of Macbeth’s origins from earlier texts, specifically the works of the Roman playwright Seneca, the Tudor historian Raphael Holinshed, and a medieval drama The Slaughter of the Holy Innocents and the Death of Herod. The contexts for the play include contemporary debates on predestination vs. free will (Martin Luther vs. Erasmus), witchcraft as fiction or fact (Reginald Scot vs. King James I), the ethics of regicide (an Elizabethan homily vs. Juan de Mariana, S.J.), and a treatise on equivocation (Henry Garnet, S.J.). This edition also features adaptations--Davenant"s moralistic Macbeth, some travesties, and Welcome Msomi's recent South African retelling, uMabatha.<br/><br/>Seventeen carefully chosen essays represent four hundred years of critical and theatrical interpretations, from the early observations of Simon Forman and Samuel Johnson to the Romantic readings of Samuel Taylor Coleridge, William Hazlitt, and Thomas De Quincey, to recent essays by Janet Adelman and Stephen Orgel. Sarah Siddons and Derek Jacobi remember performing Macbeth, and Peter Holland surveys film interpretations.<br/><br/>A Selected Bibliography is also included.', 'language": "en", "image": "https://images.isbndb.com/covers/78/68/9780393977868.jpg", "title_long": "Macbeth (Norton Critical Editions)", "edition": "A Norton Critical Edition", "dimensions": "Height: 8.4 Inches, Length: 5.1 Inches, Weight: 0.881849048 Pounds, Width: 0.9 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.1}, "width": {"unit": "inches", "value": 0.9}, "weight": {"unit": "pounds", "value": 0.881849048}, "height": {"unit": "inches", "value": 8.4}}, "pages": 416, "date_published": "2003-11-26", "subjects": ["Literature & Fiction', 'Dramas & Plays', 'History & Criticism', 'Regional & Cultural'], 'authors": ['William Shakespeare'], 'title": "Macbeth (Norton Critical Editions)", "isbn13": "9780393977868", "msrp": "0.00", "binding": "Paperback", "isbn": "0393977862", "isbn10": "0393977862"}}