{"book": {"publisher": "W. W. Norton & Company", "synopsis": "The fifteenth installment in Patrick O"Brian"s widely claimed series of Aubrey-Maturin novels is equal parts mystery, adventure, and psychological drama.<br/>A British whaler has been captured by an ambitious chief in the sandwich islands at French instigation, and Captain Aubrey, R. N., Is dispatched with the Surprise to restore order. But stowed away in the cable-tier is an escaped female convict. To the officers, Clarissa Harvill is an object of awkward courtliness and dangerous jealousies. Aubrey himself is won over and indeed strongly attracted to this woman who will not speak of her past. But only Aubrey"s friend, Dr. Stephen Maturin, can fathom Clarissa's secrets: her crime, her personality, and a clue identifying a highly placed English spy in the pay of Napoleon's intelligence service.<br/>In a thrilling finale, Patrick O'Brian delivers all the excitement his many readers expect: Aubrey and the crew of the Surprise impose a brutal pax Britannica upon the islanders in a pitched battle against a band of headhunting cannibals.', 'language": "en", "image": "https://images.isbndb.com/covers/01/60/9780393310160.jpg", "title_long": "The Truelove (Aubrey / Maturin Novels, Vol. 15) (Book 15)", "edition": "Reprint", "dimensions": "Height: 8.3 Inches, Length: 5.5 Inches, Weight: 0.55 Pounds, Width: 0.6 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.6}, "weight": {"unit": "pounds", "value": 0.55}, "height": {"unit": "inches", "value": 8.3}}, "pages": 304, "date_published": "1993-07-17", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'Sea Stories', 'Action & Adventure', 'Sea Adventures', 'British & Irish'], 'authors": ["Patrick O'Brian'], 'title": "The Truelove (Aubrey / Maturin Novels, Vol. 15) (Book 15)", "isbn13": "9780393310160", "msrp": 15.95, "binding": "Paperback", "isbn": "0393310167", "isbn10": "0393310167", "other_isbns": [{'isbn": "9780393088571", "binding": "print"}]}}