{"book": {"publisher": "W. W. Norton & Company", "synopsis": "Winner of the 2017 Nobel Prize in Physics<br/><br/>Ever since Albert Einstein"s general theory of relativity burst upon the world in 1915 some of the most brilliant minds of our century have sought to decipher the mysteries bequeathed by that theory, a legacy so unthinkable in some respects that even Einstein himself rejected them.<br/>Which of these bizarre phenomena, if any, can really exist in our universe? Black holes, down which anything can fall but from which nothing can return; wormholes, short spacewarps connecting regions of the cosmos; singularities, where space and time are so violently warped that time ceases to exist and space becomes a kind of foam; gravitational waves, which carry symphonic accounts of collisions of black holes billions of years ago; and time machines, for traveling backward and forward in time.<br/>Kip Thorne, along with fellow theorists Stephen Hawking and Roger Penrose, a cadre of Russians, and earlier scientists such as Oppenheimer, Wheeler and Chandrasekhar, has been in the thick of the quest to secure answers. In this masterfully written and brilliantly informed work of scientific history and explanation, Dr. Thorne, a Nobel Prize-winning physicist and the Feynman Professor of Theoretical Physics Emeritus at Caltech, leads his readers through an elegant, always human, tapestry of interlocking themes, coming finally to a uniquely informed answer to the great question: what principles control our universe and why do physicists think they know the things they think they know? Stephen Hawking"s A Brief History of Time has been one of the greatest best-sellers in publishing history. Anyone who struggled with that book will find here a more slowly paced but equally mind-stretching experience, with the added fascination of a rich historical and human component.<br/>Winner of the Phi Beta Kappa Award in Science.", 'language": "en", "image": "https://images.isbndb.com/covers/27/68/9780393312768.jpg", "title_long": "Black Holes and Time Warps: Einstein"s Outrageous Legacy (Commonwealth Fund Book Program)", 'edition": "Reprint", "dimensions": "Height: 9.3 Inches, Length: 6.1 Inches, Weight: 1.26324876126 Pounds, Width: 1.1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.1}, "width": {"unit": "inches", "value": 1.1}, "weight": {"unit": "pounds", "value": 1.26324876126}, "height": {"unit": "inches", "value": 9.3}}, "pages": 624, "date_published": "1995-01-17", "subjects": ["Science & Math', 'Astronomy & Space Science', 'Astrophysics & Space Science', 'History & Philosophy', 'Physics', 'Relativity', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Kip S. Thorne'], 'title": "Black Holes and Time Warps: Einstein"s Outrageous Legacy (Commonwealth Fund Book Program)", 'isbn13": "9780393312768", "msrp": 18.95, "binding": "Paperback", "related": {"Kindle Edition": "0393247473", "ePub": "0393247473"}, "isbn": "0393312763", "isbn10": "0393312763", "other_isbns": [{'isbn": "9780393247473", "binding": "print"}]}}