{"book": {"publisher": "W. W. Norton & Company", "synopsis": "Finally! A book about economics that won"t put you to sleep. In fact, you won"t be able to put this one down. Naked Economics makes up for all of those Econ 101 lectures you slept through (or avoided) in college, demystifying key concepts, laying bare the truths behind the numbers, and answering those questions you have always been too embarrassed to ask. For all the discussion of Alan Greenspan in the media, does anyone know what the Fed actually does? And what about those blackouts in California? Were they a conspiracy on the part of the power companies? Economics is life. There"s no way to understand the important issues without it. Now, with Charles Wheelan's breezy tour, there's no reason to fear this highly relevant subject. With the commonsensical examples and brilliantly acerbic commentary we've come to associate with The Economist, Wheelan brings economics to life. Amazingly, he does so with nary a chart, graph, or mathematical equation in sight―certainly a feat to be witnessed firsthand.<br/><br/>Economics is a crucial subject. There's no way to understand the important issues without it. Now, with Charles Wheelan's breezy tour, there's also no reason to fear it.', 'language": "en", "image": "https://images.isbndb.com/covers/48/60/9780393324860.jpg", "title_long": "Naked Economics: Undressing the Dismal Science", "edition": "Reprint", "dimensions": "Height: 8.1999836 Inches, Length: 5.499989 Inches, Weight: 0.50044933474 Pounds, Width: 0.7999984 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.499989}, "width": {"unit": "inches", "value": 0.7999984}, "weight": {"unit": "pounds", "value": 0.50044933474}, "height": {"unit": "inches", "value": 8.1999836}}, "pages": 260, "date_published": "2003-09-17", "subjects": ["Business & Money', 'Economics', 'Macroeconomics', 'Microeconomics', 'Theory', 'Education & Reference', 'Reference', 'Encyclopedias & Subject Guides', 'Business'], 'authors": ["Charles Wheelan'], 'title": "Naked Economics: Undressing the Dismal Science", "isbn13": "9780393324860", "msrp": 15.95, 'binding": "Paperback", "isbn": "0393324869", "isbn10": "0393324869"}}