{"book": {"publisher": "W. W. Norton", "synopsis": "Nobelist Eric Kandel"s account of how his personal quest to understand memory intersected with the emergence of a new science.<br/><br/>In Search of Memory relates the astonishing story of how four different and distinct disciplines\x97behaviorist psychology, cognitive psychology, neuroscience, and molecular biology\x97converged into a powerful new science of mind. Through its profound insights into thought, perception, action, recollection, and mental illness, this new science is revolutionizing our understanding of learning and memory while simultaneously showing great promise for more effective healing.<br/><br/>The narrative follows Eric R. Kandel through the last five decades, focusing on Vienna, where he became fascinated with memory. With intrepid scientific ardor, Kandel was captivated first by history and psychoanalysis, then by neurobiology, and finally by the biological processes of memory. His resulting, multifaceted perspective was the foundation for his path-breaking research that will continue to dominate modern thought\x97not only in science but in culture at large. 50 illustrations.", "language": "en", "image": "https://images.isbndb.com/covers/86/35/9780393058635.jpg", "title_long": "In Search of Memory: The Emergence of a New Science of Mind", "edition": "1", "dimensions": "Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.90479394368 Pounds, Width: 1.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.25}, "width": {"unit": "inches", "value": 1.5}, "weight": {"unit": "pounds", "value": 1.90479394368}, "height": {"unit": "inches", "value": 9.25}}, "pages": 352, "date_published": "2006-03-13", "subjects": ["Health, Fitness & Dieting', 'Mental Health', 'Psychology & Counseling', 'Science & Math', 'Biological Sciences', 'Biology', 'Research', 'Medical Books'], 'authors": ["Eric R. Kandel'], 'title": "In Search of Memory: The Emergence of a New Science of Mind", "isbn13": "9780393058635", "msrp": 29.95, "binding": "Hardcover", "isbn": "0393058638", "isbn10": "0393058638", "other_isbns": [{'isbn": "9780393070514", "binding": "print"}]}}