{"book": {"publisher": "W. W. Norton & Company", "synopsis": "With the Christmas season upon him, Detective Sergeant Bruce Robertson of Edinburgh\"s finest is gearing up socially―kicking things off with a week of sex and drugs in Amsterdam. There are some sizable flies in the ointment, though: a missing wife and child, a nagging cocaine habit, some painful below-the-belt eczema, and a string of demanding extramarital affairs. The last thing Robertson needs is a messy, racially fraught murder, even if it means overtime―and the opportunity to clinch the promotion he craves. Then there\"s that nutritionally demanding (and psychologically acute) intestinal parasite in his gut. Yes, things are going badly for this utterly corrupt tribune of the law, but in an Irvine Welsh novel nothing is ever so bad that it can\"t get a whole lot worse. . . .In Bruce Robertson Welsh has created one of the most compellingly misanthropic characters in contemporary fiction, in a dark and disturbing and often scabrously funny novel about the abuse of everything and everybody.<br/><br/>'Welsh writes with a skill, wit and compassion that amounts to genius. He is the best thing that has happened to British writing in decades.'―Sunday Times [London] '[O]ne of the most significant writers in Britain. He writes with style, imagination, wit, and force, and in a voice which those alienated by much current fiction clearly want to hear.'―Times Literary Supplement 'Welsh writes with such vile, relentless intensity that he makes Louis-Ferdinand Céline, the French master of defilement, look like Little Miss Muffet. '―Courtney Weaver, The New York Times Book Review 'The corrupt Edinburgh cop-antihero of Irvine Welsh\'s best novel since Trainspotting is an addictive personality in another sense: so appallingly powerful is his character that it\'s hard to put the book down....[T]he rapid-fire rhythm and pungent dialect of the dialogue carry the reader relentlessly toward the literally filthy denouement. '―Village Voice Literary Supplement, 'Our 25 Favorite Books of 1998' 'Welsh excels at making his trash-spewing bluecoat peculiarly funny and vulnerable―and you will never think of the words \'Dame Judi Dench\' in the same way ever again. [Grade:] A-. '―Charles Winecoff, Entertainment Weekly', 'language": "en", "image": "https://images.isbndb.com/covers/86/85/9780393318685.jpg", "title_long": "Filth", "edition": "1", "dimensions": "Height: 8.3 Inches, Length: 5.5 Inches, Weight: 0.82 Pounds, Width: 1.2 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 1.2}, "weight": {"unit": "pounds", "value": 0.82}, "height": {"unit": "inches", "value": 8.3}}, "pages": 416, "date_published": "1998-09-17", "subjects": ["Literature & Fiction', 'British & Irish', 'Contemporary', 'Mystery, Thriller & Suspense', 'Mystery', 'Police Procedurals'], 'authors": ["Irvine Welsh'], 'title": "Filth", "isbn13": "9780393318685", "msrp": 16.95, "binding": "Paperback", "isbn": "0393318680", "isbn10": "0393318680", "other_isbns": [{'isbn": "9780393350982", "binding": "printisbncanonical"}]}}