{"book": {"publisher": "W. W. Norton & Company", "synopsis": "A landmark work by twelve leading critics and community leaders―essential reading for anyone interested in the history of American race relations. Ignited by the infamous shooting of Amadou Diallo, unarmed and innocent, at the hands of New York City police officers, journalist Jill Nelson was moved to assemble this landmark anthology on the topic of police violence and brutality: an indispensable collection of twelve "groundbreaking" (Ebony) essays by a range of contributors―among them academics, historians, social critics, a congressman, and an ex-New York City police detective. This "important and valuable book' (Emerge) places a centuries-old issue in much-needed historical and intellectual context, and underscores the profound influence police brutality has had in shaping the American identity. '[S]hould be read by anyone concerned about ending brutality, and should be required reading in police academies throughout America!'―Charles J. Ogletree, Jr., Harvard Law School 'Without hysteria or hyperbole, [Nelson] examines the issue of police abuse in literary form.'―Emerge 'A memorable and useful contribution to an increasingly volatile national dialogue.'―Publishers Weekly '[N]ot only timely, but explores and exposes the sickness of this unbalanced, uncivilized Western pastime thoroughly.'―Chuck D of Public Enemy, author of Fight the Power: Rap, Race, and Reality', 'language": "en", "image": "https://images.isbndb.com/covers/16/30/9780393321630.jpg", "title_long": "Police Brutality: An Anthology", "edition": "Reprint", "dimensions": "Height: 8.3 Inches, Length: 5.5 Inches, Weight: 0.75618555866 Pounds, Width: 0.7 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.7}, "weight": {"unit": "pounds", "value": 0.75618555866}, "height": {"unit": "inches", "value": 8.3}}, "pages": 266, "date_published": "2001-05-17", "subjects": ["Law', 'Criminal Law', 'Law Enforcement', 'Politics & Social Sciences', 'Social Sciences', 'Violence in Society', 'Ethnic Studies', 'Sociology', 'Race Relations', 'Politics & Government', 'Specific Topics', 'Public Affairs & Policy', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": [], "title": "Police Brutality: An Anthology", "isbn13": "9780393321630", "msrp": 14.95, "binding": "Paperback", "related": {"ePub": "0393249417"}, "isbn": "0393321630", "isbn10": "0393321630", "other_isbns": [{'isbn": "9780393249415", "binding": "print"}]}}