{"book": {"publisher": "W. W. Norton & Company", "synopsis": ""For eliciting the menace that lurks in familiar surroundings, there\"s no one like Patricia Highsmith." ―Time<br/>The world of Patricia Highsmith has always been filled with ordinary people, all of whom are capable of very ordinary crimes. This theme was present from the beginning, when her debut, Strangers on a Train, galvanized the reading public. Here we encounter Guy Haines and Charles Anthony Bruno, passengers on the same train. But while Guy is a successful architect in the midst of a divorce, Bruno turns out to be a sadistic psychopath who manipulates Guy into swapping murders with him. 'Some people are better off dead,' Bruno remarks, 'like your wife and my father, for instance.' As Bruno carries out his twisted plan, Guy is trapped in Highsmith\'s perilous world, where, under the right circumstances, anybody is capable of murder.<br/>The inspiration for Alfred Hitchcock\'s classic 1951 film, Strangers on a Train launched Highsmith on a prolific career of noir fiction, proving her a master at depicting the unsettling forces that tremble beneath the surface of everyday contemporary life.', 'language": "en", "image": "https://images.isbndb.com/covers/19/82/9780393321982.jpg", "title_long": "Strangers on a Train", "edition": "Reprint", "dimensions": "Height: 8.3 Inches, Length: 5.5 Inches, Weight: 0.5 Pounds, Width: 0.8 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.8}, "weight": {"unit": "pounds", "value": 0.5}, "height": {"unit": "inches", "value": 8.3}}, "pages": 288, "date_published": "2001-08-17", "subjects": ["Mystery, Thriller & Suspense', 'Mystery', 'Thrillers & Suspense', 'Psychological Thrillers', 'Suspense', 'Crime'], 'authors": ["Patricia Highsmith'], 'title": "Strangers on a Train", "isbn13": "9780393321982", "msrp": 14.95, "binding": "Paperback", "related": {"ePub": "039334469X"}, "isbn": "0393321983", "isbn10": "0393321983", "other_isbns": [{'isbn": "9780393344691", "binding": "print"}]}}