{"book": {"publisher": "W. W. Norton", "synopsis": "The four classic novels of Sherlock Holmes, heavily illustrated and annotated with extensive scholarly commentary, in an attractive and elegant slipcase. The publication of Leslie S. Klinger"s brilliant new annotations of Sir Arthur Conan Doyle"s four classic Holmes novels in 2005 created a Holmes sensation. Klinger reassembles Doyle"s four seminal novels in their original order, with over 1,000 notes, 350 illustrations and period photographs, and tantalizing new Sherlockian theories. Inside, readers will find: A Study in Scarlet (1887)―a tale of murder and revenge that tells of Holmes and Dr. Watson's first meeting; The Sign of Four (1889)―a chilling tale of lost treasure...and of how Watson met his wife; The Hound of the Baskervilles (1901)―hailed as the greatest mystery novel of all time; and The Valley of Fear (1914)―a fresh murder scene that leads Holmes to solve a long-forgotten mystery.<br/>Whether as a stand-alone volume or as a companion to the short stories, this classic work illuminates the timeless genius of Conan Doyle for an entirely new generation. Two-color text; 300 illustrations', 'language": "en", "image": "https://images.isbndb.com/covers/80/00/9780393058000.jpg", "title_long": "The New Annotated Sherlock Holmes: The Novels", "edition": "Slipcased", "dimensions": "Height: 10.7 Inches, Length: 9.2 Inches, Weight: 5.3462098535 Pounds, Width: 2.3 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 9.2}, "width": {"unit": "inches", "value": 2.3}, "weight": {"unit": "pounds", "value": 5.3462098535}, "height": {"unit": "inches", "value": 10.7}}, "pages": 992, "date_published": "2005-11-17", "subjects": ["Mystery, Thriller & Suspense', 'Mystery', 'Traditional Detectives'], 'authors": ["Arthur Conan Doyle'], 'title": "The New Annotated Sherlock Holmes: The Novels", "isbn13": "9780393058000", "msrp": 57.58, "binding": "Hardcover", "related": {"ePub": "0393254216"}, "isbn": "039305800X", "isbn10": "039305800X", "other_isbns": [{'isbn": "9780393254211", "binding": "print"}]}}