{"book": {"publisher": "W. W. Norton & Company", "synopsis": "The Second Edition of the Norton Critical Edition of Robinson Crusoe is based on the Shakespeare Head Press reprint of the first edition copy in the British Museum, with the "errata" listed by Defoe’s publisher, William Taylor, incorporated into the text. Michael Shinagel has collated the reprint with all six authorized editions published by Taylor in 1719 to achieve a text that is faithful to Defoe\"s original edition. Annotations assist the reader with obscure words and idioms, biblical references, and nautical terms.<br/><br/>'Contexts' helps the reader understand the novel’s historical and religious significance. Included are four contemporary accounts of marooned men, Defoe’s autobiographical passages on the novel’s allegorical foundation, and aspects of the Puritan emblematic tradition essential for understanding the novel’s religious aspects.<br/><br/>'Eighteenth-and Nineteenth-Century Opinions' is a comprehensive study of early estimations by prominent literary and political figures, including Alexander Pope, Jean-Jacques Rousseau, Samuel Johnson, Samuel Taylor Coleridge, William Wordsworth, Edgar Allen Poe, Thomas Babington Macaulay, Charles Dickens, Karl Marx, and John Stuart Mill.<br/><br/>'Twentieth-Century Criticism' is a collection of fourteen essays (five of them new to the Second Edition) that presents a variety of perspectives on Robinson Crusoe by Virginia Woolf, Ian Watt, Eric Berne, Maximillian E. Novak, Frank Budgen, James Joyce, George A. Starr, J. Paul Hunter, James Sutherland, John J. Richetti, Leopold Damrosch, Jr., John Bender, Michael McKeon, and Carol Houlihan Flynn.<br/><br/>A Chronology of Defoe’s life and work and an updated Selected Bibliography are also included.', 'language": "en", "image": "https://images.isbndb.com/covers/45/23/9780393964523.jpg", "title_long": "Robinson Crusoe (Norton Critical Editions)", "edition": "Second", "dimensions": "Height: 8.4 Inches, Length: 5.1 Inches, Weight: 0.9479866 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.1}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 0.9479866}, "height": {"unit": "inches", "value": 8.4}}, "pages": 448, "date_published": "1993-12-17", "subjects": ["Literature & Fiction', 'Classics', 'History & Criticism', 'Regional & Cultural', 'Action & Adventure', 'British & Irish'], 'authors": ["Daniel Defoe'], 'title": "Robinson Crusoe (Norton Critical Editions)", "isbn13": "9780393964523", "msrp": 12.8, 'binding": "Paperback", "isbn": "0393964523", "isbn10": "0393964523"}}