{"book": {"publisher": "Random House Books for Young Readers", "synopsis": "Just in time for the holidays, enjoy this wintry classic about the joys of playing in the snow. the perfect read aloud for a snow day--or any day this winter!<br/><br/>This classic Beginner Book edited by Dr. Seuss is a delightful ode to winter. Brrrrr—it snowed! From snowball fights and skiing to fort building and snowman-making, P. D. Eastman and Roy McKie’s Snow will have young readers eager for the kind of fun only a wintry-white day can bring. Perfect for enjoying with a cup of hot cocoa, it makes an ideal gift for the holidays, and happy occasions of all kinds!<br/><br/>Beginner Books are fun, funny, and easy to read! Launched by Dr. Seuss in 1957 with the publication of The Cat in the Hat, this beloved early reader series motivates children to read on their own by using simple words with illustrations that give clues to their meaning. Featuring a combination of kid appeal, supportive vocabulary, and bright, cheerful art, Beginner Books will encourage a love of reading in children ages 3–7.<br/><br/>"Joyful verse relates the many ways to enjoy snow. First graders will love it." —Chicago Tribune", 'language": "en", "image": "https://images.isbndb.com/covers/02/71/9780394800271.jpg", "title_long": "Snow (I Can Read It All By Myself)", "dimensions": "Height: 9.25 Inches, Length: 6.75 Inches, Weight: 0.55 Pounds, Width: 0.39 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.75}, "width": {"unit": "inches", "value": 0.39}, "weight": {"unit": "pounds", "value": 0.55}, "height": {"unit": "inches", "value": 9.25}}, "pages": 61, "date_published": "1962-10-12", "subjects": ["Children's Books', 'Literature & Fiction', 'Poetry', 'Chapter Books & Readers', 'Science, Nature & How It Works', 'Nature', 'Holidays & Celebrations', 'Christmas', 'Early Learning', 'Basic Concepts', 'Beginner Readers', 'Self Service', 'Custom Stores'], 'authors": ["P.D. Eastman', 'Roy Mc Kie'], 'title": "Snow (I Can Read It All By Myself)", "isbn13": "9780394800271", "msrp": 7.19, "binding": "Hardcover", "related": {"ePub": "0553509063"}, "isbn": "0394800273", "isbn10": "0394800273", "other_isbns": [{'isbn": "9780553509069", "binding": "printisbn"}]}}