{"book": {"publisher": "Pantheon", "synopsis": "In a brilliant series of books about social behavior, including The Presentation of Self in Everyday Life, Asylums, and Stigma, Erving Goffman has exposed all that is at stake when people meet face to face. Goffman’s work, once of the great intellectual achievements of our time, is an endlessly fascinating commentary on how we enact ourselves by our responses to and our readings of other people.<br/><br/>From the exemplary opening essay of Interaction Ritual, “On Face-Work,” —a full account of the extraordinary repertoire of maneuvers we employ in social encounters in order to “save face”—to the final, and classic, essay “Where the Action Is,”—an examination of people in risky occupations and situations: gamblers, criminals, coal miners, stock speculators—Goffman astounds us with the unexpected richness and complexity of brief encounters between people. For Goffman, as for Freud, the extreme cases are of interest because of the light they shed on the normal: The study of the trapeze artist is worthwhile because each of us is on the wire from time to time.", "language": "en", "image": "https://images.isbndb.com/covers/63/13/9780394706313.jpg", "title_long": "Interaction Ritual - Essays on Face-to-Face Behavior", "edition": "1st Pantheon Books ed", "dimensions": "Height: 7.2 Inches, Length: 4.2 Inches, Weight: 0.54 Pounds, Width: 0.7 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 4.2}, "width": {"unit": "inches", "value": 0.7}, "weight": {"unit": "pounds", "value": 0.54}, "height": {"unit": "inches", "value": 7.2}}, "pages": 288, "date_published": "1982-01-12", "subjects": ["Health, Fitness & Dieting', 'Psychology & Counseling', 'Social Psychology & Interactions', 'Science & Math', 'Behavioral Sciences', 'Evolution', 'Medical Books', 'Psychology', 'Politics & Social Sciences', 'Social Sciences', 'Poverty', 'Women's Studies', 'Feminist Theory', 'Anthropology', 'Cultural', 'General', 'Sociology', 'Social Theory'], 'authors": ["Erving Goffman'], 'title": "Interaction Ritual - Essays on Face-to-Face Behavior", "isbn13": "9780394706313", "msrp": 10.4, 'binding": "Paperback", "isbn": "0394706315", "isbn10": "0394706315"}}