{"book": {"publisher": "Vintage", "synopsis": "In this classic work, distinguished French economic historian, Marc Bloch, discusses the techniques of historical observation, analysis, and criticism, and the reestablishment of historical causation in assessing events. What is the value of history? What is the use of history? How do scholars attempt to unpack it and make connections in a responsible manner?<br/><br/>While the topics of historiography and historical methodology have become increasingly popular, Bloch remains an authority. He argues that history is a whole; no period and no topic can be understood except in relation to other periods and topics. And what is unique about Bloch is that he puts his theories into practice; for example, calling upon both his experience serving in WWI as well as his many years spent in peaceful study and reflection. He also argues that written records are not enough; a historian must draw upon maps, place-names, ancient tools, aerial surveys, folklore, and everything that is available.<br/><br/>This is a work that argues constantly for a wider, more human history. For a history that describes how and why people live and work together. There is a living, breathing connection between the past and the present and it is the historian’s responsibility to do it justice.", "language": "en", "image": "https://images.isbndb.com/covers/51/25/9780394705125.jpg", "title_long": "The Historian"s Craft: Reflections on the Nature and Uses of History and the Techniques and Methods of Those Who Write It.", "edition": "59500th", "dimensions": "Height: 6.68 Inches, Length: 4.18 Inches, Weight: 0.25 Pounds, Width: 0.6 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.18}, "width": {"unit": "inches", "value": 0.6}, "weight": {"unit": "pounds", "value": 0.25}, "height": {"unit": "inches", "value": 6.68}}, "pages": 197, "date_published": "1964-03-12", "subjects": ["History', 'Historical Study & Educational Resources', 'Historiography', 'Study & Teaching', 'Education & Teaching', 'Schools & Teaching', 'Instruction Methods'], 'authors": ["Marc Bloch'], 'title": "The Historian"s Craft: Reflections on the Nature and Uses of History and the Techniques and Methods of Those Who Write It.", 'isbn13": "9780394705125", "msrp": 11.96, 'binding": "Mass Market Paperback", "isbn": "0394705122", "isbn10": "0394705122"}}