{"book": {"publisher": "William Morrow", "synopsis": "The final part of The History of The Lord of the Rings, Sauron Defeated: The End Of The Third Age is J.R.R. Tolkien"s enthralling account of the writing of the Book of the Century which contains many additional scenes and includes the unpublished Epilogue in its entirety.<br/>In the first section of Sauron Defeated Christopher Tolkien completes his fascinating study of The Lord of the Rings. Beginning with Sam’s rescue of Frodo from the Tower of Cirith Ungol, and giving a very different account of the Scouring of the Shire, this section ends with versions of the hitherto unpublished Epilogue, in which, years after the departure of Bilbo and Frodo from the Grey Havens, Sam attempts to answer his children’s questions.<br/>The second section is an edition of The Notion Club Papers. These mysterious papers, discovered in the early years of the twenty-first century, report the discussions of an Oxford club in the years 1986-7, in which after a number of topics, the centre of interest turns to the legend of Atlantis, the strange communications received by other members of the club from the past, and the violent irruption of the legend into the North-west of Europe.", "language": "en", "image": "https://images.isbndb.com/covers/64/90/9780395606490.jpg", "title_long": "Sauron Defeated: The End Of The Third Age: The History of the Lord of the Rings, part four (History of Middle-earth, 9)", "edition": "1", "dimensions": "Height: 8.5 Inches, Length: 5.5 Inches, Weight: 1.44 Pounds, Width: 1.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 1.5}, "weight": {"unit": "pounds", "value": 1.44}, "height": {"unit": "inches", "value": 8.5}}, "pages": 496, "date_published": "1992-10-27", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Mythology & Folk Tales', 'Folklore', 'Science Fiction & Fantasy', 'Fantasy', 'Epic', 'Sword & Sorcery'], 'authors": ["J.R.R. Tolkien'], 'title": "Sauron Defeated: The End Of The Third Age: The History of the Lord of the Rings, part four (History of Middle-earth, 9)", "isbn13": "9780395606490", "msrp": 29.09, "binding": "Hardcover", "isbn": "0395606497", "isbn10": "0395606497", "other_isbns": [{'isbn": "9780358726838", "binding": "printisbncanonical"}]}}