{"book": {"publisher": "Hachette Books", "synopsis": "In this "vivid and inspiring" New York Times bestseller (Newsweek), the Red Hot Chili Peppers\" lead singer and songwriter shares a searingly honest account of life in the rock scene\'s fast lane—from the darkness into the light.<br/><br/>In 1983, four self-described 'knuckleheads' burst out of the mosh-pitted mosaic of the neo-punk rock scene in L.A. with their own unique brand of cosmic hardcore mayhem funk. Over twenty years later, the Red Hot Chili Peppers, against all odds, have become one of the most successful bands in the world. Though the band has gone through many incarnations, Anthony Kiedis, the group\'s lyricist and dynamic lead singer, has been there for the whole roller-coaster ride. In Scar Tissue, Kiedis delivers a compelling life story from a man 'in love with everything'—the darkness, the death, the disease. Even his descent into drug addiction was a part of that journey, another element transformed into art.<br/><br/>Whether he\'s honoring the influence of the beautiful, strong women who have been his muses or remembering the roaring crowds of Woodstock and the Dalai Lama\'s humble compound, Kiedis shares a compelling story about the price of success and excess. Scar Tissue is a story of dedication and debauchery, of intrigue and integrity, of recklessness and redemption—a story that could only have come out of the world of rock.', 'language": "en", "image": "https://images.isbndb.com/covers/10/19/9781401301019.jpg", "title_long": "Scar Tissue", "edition": "First Edition", "dimensions": "Height: 9.5 Inches, Length: 6.5 Inches, Weight: 1.8 Pounds, Width: 1.25 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.5}, "width": {"unit": "inches", "value": 1.25}, "weight": {"unit": "pounds", "value": 1.8}, "height": {"unit": "inches", "value": 9.5}}, "pages": 480, "date_published": "2004-10-06", "subjects": ["Arts & Photography', 'Music', 'Musical Genres', 'Biographies & Memoirs', 'Arts & Literature', 'Actors & Entertainers', 'Composers & Musicians', 'Memoirs', 'Humor & Entertainment'], 'authors": ["Anthony Kiedis', 'Larry Sloman'], 'title": "Scar Tissue", "isbn13": "9781401301019", "msrp": 29, "binding": "Hardcover", "related": {"ePub": "1401381766"}, "isbn": "1401301010", "isbn10": "1401301010", "other_isbns": [{'isbn": "9781401381769", "binding": "saleableprint"}]}}