{"book": {"publisher": "St. Martin"s Press", "synopsis": "Strawberry Days tells the vivid and moving tale of the creation and destruction of a Japanese immigrant community. Before World War II, Bellevue, the now-booming "edge city" on the outskirts of Seattle, was a prosperous farm town renowned for its strawberries. Many of its farmers were recent Japanese immigrants who, despite being rejected by white society, were able to make a living cultivating the rich soil. Yet the lives they created for themselves through years of hard work vanished almost instantly after the bombing of Pearl Harbor. David Neiwert combines compelling story-telling with first-hand interviews and newly uncovered documents to weave together the history of this community and the racist schemes that prevented the immigrants from reclaiming their land after the war. Ultimately, Strawberry Days represents more than one community\'s story, reminding us that bigotry\'s roots are deeply entwined in the very fiber of American society.', 'language": "en", "image": "https://images.isbndb.com/covers/79/23/9781403967923.jpg", "title_long": "Strawberry Days: How Internment Destroyed a Japanese American Community", "edition": "First Edition", "dimensions": "Height: 9.68 Inches, Length: 6.03 Inches, Weight: 1.22 Pounds, Width: 0.875 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.03}, "width": {"unit": "inches", "value": 0.875}, "weight": {"unit": "pounds", "value": 1.22}, "height": {"unit": "inches", "value": 9.68}}, "pages": 288, "date_published": "2005-06-04", "subjects": ["History', 'Americas', 'United States', 'Historical Study & Educational Resources', 'Military', 'World War II', 'Politics & Social Sciences', 'Sociology', 'Race Relations'], 'authors": ["David A. Neiwert'], 'title": "Strawberry Days: How Internment Destroyed a Japanese American Community", "isbn13": "9781403967923", "msrp": 29.95, "binding": "Hardcover", "isbn": "140396792X", "isbn10": "140396792X", "other_isbns": [{'isbn": "9781466888937", "binding": "printisbncanonical"}]}}