{"book": {"publisher": "Tyndale House Publishers", "synopsis": "Book 2 of the 3-book prequel to the best-selling Christian fiction series that sold over 63 million copies!<br/><br/>“The Left Behind series . . . is among the best-selling fiction books of our times―right up there with Tom Clancy and Stephen King.” ―Time<br/><br/>Get a glimpse into the lives of your favorite characters before they were left behind. What was life like before the Rapture for Rayford, Irene, and Chloe Steele, Bruce Barnes, Buck Williams, and Tsion Ben Judah? Why does Viv Ivins play such a pivotal role in Nicolae Carpathia’s life? What were the events surrounding Nicolae’s sudden rise to power? How did he become filled with evil? You will find all these answers and more in this exciting series!<br/><br/>The Regime: Evil Advances<br/>Dynamic Romanian multimillionaire Nicolae Carpathia’s sphere of influence steadily grows as he parlays his looks, charm, charisma, and intellectual brilliance into success in business and politics. But is it mere coincidence that those who oppose or offend him suffer to the point of death?<br/><br/>Meanwhile, a young Buck Williams begins his journalistic career. Pilot Rayford Steele gains more responsibility at work and at home. Scientist Chaim Rosenzweig begins work on a secret formula that could change the world. All three go about their daily lives, unaware of each other or of the powerful young man from Romania. Around the world, the stage is being set for the cataclysmic event that will change the world forever.", "language": "en", "image": "https://images.isbndb.com/covers/57/76/9781414305776.jpg", "title_long": "The Regime: Evil Advances (Before They Were Left Behind, Book 2)", "edition": "0", "dimensions": "Height: 8.1 Inches, Length: 5.4 Inches, Weight: 1 Pounds, Width: 1.1 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.4}, "width": {"unit": "inches", "value": 1.1}, "weight": {"unit": "pounds", "value": 1}, "height": {"unit": "inches", "value": 8.1}}, "pages": 389, "date_published": "2006-04-01", "subjects": ["Christian Books & Bibles', 'Literature & Fiction', 'Mystery & Suspense', 'Science Fiction', 'Religion & Spirituality', 'Science Fiction & Fantasy', 'Post-Apocalyptic'], 'authors": ['Tim LaHaye', 'Jerry B. Jenkins'], 'title": "The Regime: Evil Advances (Before They Were Left Behind, Book 2)", "isbn13": "9781414305776", "msrp": "0.00", "binding": "Paperback", "isbn": "141430577X", "isbn10": "141430577X"}}