{"book": {"publisher": "Atria", "synopsis": "In his sensational novel The Descent, Jeff Long created a world of stunning terror and adventure, "an imaginative tour de force" (Jon Krakauer). Now he imagines a scenario so vivid, so haunting, it anchors his place among storytelling masters.<br/><br/>YEAR ZERO<br/><br/>An archaeological manhunt is raging in the holy land -- a hunt for the historical Jesus. For Nathan Lee Swift, a young American field researcher and expectant father, the line between noble discovery and the plunder of ruins is sacred -- until the night he crosses it. At a Roman landfill beneath the crucifixion grounds known as Golgotha, Nathan Lee yields to his professor\"s greed and turns common grave robber. His world -- his unborn daughter -- seems lost to him.<br/><br/>Hundreds of miles away, on the remote Greek island of Corfu, a wealthy collector pries open his latest black-market purchase -- a fourteen-inch holy relic containing a vial of blood dating back to the first century -- and unleashes a two-thousand-year-old plague. As the pandemic explodes from the Mediterranean basin and threatens to devour humankind, Nathan Lee gets a chance at redemption. He embarks on an Odyssean journey back to the United States to find his family.<br/><br/>Skirting the edges of the world, Nathan Lee\'s path finally leads him to New Mexico, where the greatest minds of science have converged at Los Alamos to find a vaccine. There Nathan Lee meets Miranda Abbot, a nineteen-year-old prodigy. As the cure continues to elude them, Miranda launches a desperate final strategy: the use of human lab rats cloned from the year zero. Nathan Lee, the thief of bones, comes face-to-face with men made from the very relics he looted, one of whom claims to be Jesus Christ, but may also be Patient Zero.<br/><br/>Combining the scientific precision of The Andromeda Strain with the intensity of classic adventure epics, Jeff Long takes readers on a riveting voyage through the rubble of earthquake-torn Jerusalem, the serenity of the high Himalayas, and the eerie sanctuary of Los Alamos. With Long\'s characteristic originality, Year Zero races against the apocalyptic clock, creating a maze of twists, astonishing atmosphere, and the clash of science and faith.', 'language": "en", "image": "https://images.isbndb.com/covers/44/26/9781416534426.jpg", "title_long": "Year Zero", "dimensions": "Weight: 1.05 Pounds", "dimensions_structured": {"weight": {"unit": "pounds", "value": 1.05}}, "pages": 416, "date_published": "2006", "subjects": ["Literature & Fiction', 'Action & Adventure', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense'], 'authors": ["Jeff Long'], 'title": "Year Zero", "isbn13": "9781416534426", "msrp": 15.95, 'binding": "Paperback", "isbn": "1416534423", "isbn10": "1416534423"}}