{"book": {"publisher": "Gallery Books", "synopsis": "He’s Just Not That Into You—based on a popular episode of Sex and the City—is tough love advice for otherwise smart women on how to tell when a guy just doesn’t like them enough, so they can stop wasting time making excuses for a dead-end relationship. It’s the best relationship advice you’ll ever receive.<br/><br/>For ages, women have come together over coffee, cocktails, or late-night phone chats to analyze the puzzling behavior of men.<br/><br/>He’s afraid to get hurt again.<br/>Maybe he doesn’t want to ruin the friendship.<br/>Maybe he’s intimidated by me.<br/>He just got out of a relationship.<br/><br/>Greg Behrendt and Liz Tuccillo are here to say that—despite good intentions—you’re wasting your time. Men are not complicated, although they’d like you to think they are. And there are no mixed messages.<br/><br/>The truth may be, He’s just not that into you.<br/><br/>Unfortunately, guys are too terrified to ever directly tell a woman, “You"re not the one.” But their actions absolutely show how they feel.<br/><br/>Reexamining familiar scenarios and classic mindsets that keep us in unsatisfying relationships, Behrendt and Tuccillo’s wise and wry understanding of the sexes spares women hours of waiting by the phone, obsessing over the details with sympathetic girlfriends, and hoping his mixed messages really mean, “I’m in love with you and want to be with you.”<br/><br/>He’s Just Not That Into You is provocative, hilarious, and, above all, intoxicatingly liberating. It deserves a place on every woman’s night table. It knows you’re a beautiful, smart, funny woman who deserves better. The next time you feel the need to start “figuring him out,” consider the glorious thought that maybe, He’s just not that into you. And then set yourself loose to go find the one who is.<br/><br/>This NEWLY EXPANDED EDITION includes: a new foreword from Greg Behrendt; a new chapter—providing an honest look at the stages of life after He"s Just Not That Into You, according to Liz, including exaltation, loneliness, temptation, and balance; and Greg and Liz address the most frequently asked reader questions.", 'language": "en", "image": "https://images.isbndb.com/covers/74/00/9781416947400.jpg", "title_long": "He"s Just Not That Into You: The No-Excuses Truth to Understanding Guys (The Newly Expanded Edition)", 'edition": "Expanded", "dimensions": "Height: 8.2499835 Inches, Length: 5.499989 Inches, Weight: 0.65 Pounds, Width: 0.7999984 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.499989}, "width": {"unit": "inches", "value": 0.7999984}, "weight": {"unit": "pounds", "value": 0.65}, "height": {"unit": "inches", "value": 8.2499835}}, "pages": 208, "date_published": "2006-12-26", "subjects": ["Self-Help', 'Relationships', 'Interpersonal Relations', 'Love & Romance', 'Happiness', 'Emotions', 'Humor & Entertainment', 'Humor', 'Love, Sex & Marriage', 'Self-Help & Psychology', 'Health, Fitness & Dieting', 'Parenting & Relationships', 'Teen & Young Adult', 'Romance'], 'authors": ["Greg Behrendt', 'Liz Tuccillo'], 'title": "He"s Just Not That Into You: The No-Excuses Truth to Understanding Guys (The Newly Expanded Edition)", 'isbn13": "9781416947400", "msrp": 21.95, 'binding": "Hardcover", "isbn": "141694740X", "isbn10": "141694740X"}}