{"book": {"publisher": "Simon & Schuster", "synopsis": "New York Times bestselling author Jeffery Deaver has famously thrilled and chilled fans with tales of masterful villains and the brilliant minds who bring them to justice. Now the author of the Lincoln Rhyme series (The Cold Moon and The Bone Collector, among others) has compiled a second volume of his award-winning, spine-tingling short stories of suspense.<br/>While best known for his twenty-four novels, Jeffery Deaver is also a short story master -- he is a three-time recipient of the Ellery Queen Reader\"s Award for Best Short Story, and he won the Short Story Dagger from the Crime Writers Association for a piece that appeared in his first short story collection, Twisted. The New York Times said of that book: "A mystery hit for those who like their intrigue short and sweet . . . [The stories] feature tight, bare-bones plotting and the sneaky tricks that Mr. Deaver\"s title promises.' The sneaky tricks are here in spades, and Deaver even gives his fans a new Lincoln Rhyme and Amelia Sachs story.<br/>Deaver is back with sixteen stories in the tradition of O. Henry and Edgar Allan Poe. His subjects range from a Westchester commuter to a brilliant Victorian England caper. With these intricately plotted, bone-chilling stories, Jeffery Deaver is at the top of his crime-writing game.', 'language": "en", "image": "https://images.isbndb.com/covers/11/89/9781416541189.jpg", "title_long": "More Twisted: Collected Stories, Vol. II", "dimensions": "Height: 9.75 Inches, Length: 6.5 Inches, Weight: 1.4 Pounds, Width: 1.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.5}, "width": {"unit": "inches", "value": 1.5}, "weight": {"unit": "pounds", "value": 1.4}, "height": {"unit": "inches", "value": 9.75}}, "pages": 448, "date_published": "2006-12-26", "subjects": ["Literature & Fiction', 'Short Stories & Anthologies', 'Short Stories', 'United States', 'Contemporary'], 'authors": ['Jeffery Deaver'], 'title": "More Twisted: Collected Stories, Vol. II", "isbn13": "9781416541189", "msrp": "0.00", "binding": "Hardcover", "isbn": "1416541187", "isbn10": "1416541187"}}