{"book": {"publisher": "Gallery Books", "synopsis": "USA Today bestselling author Julie Leto launches a caliente new series featuring a sexy, Latina bounty hunter with an appetite for danger and an insatiable thirst for the man she"s hunting down: her ex.<br/>When Marisela Morales sets out to stop her ex-boyfriend Francisco Vega from skipping out on bail, she has a secret agenda: revenge. She hasn"t seen Frankie in ten years, and back then, he broke her heart, choosing his gang over his girl. So when she tracks him down in their old haunt, a hot dance club in Tampa, she sets about seducing him into her trap.<br/>Frankie has a secret agenda, too, and Marisela soon faces a tough choice: continue drifting through her twentysomething life -- hitting the same town with the same girlfriends every weekend while struggling to find a job and pay the rent -- or dive headfirst into danger with her ex. Frankie operates in a treacherous underworld full of arms dealers, assassins, and sinister agendas -- a world overrun with people keeping dirty little secrets -- and only Marisela has the cojones to fight her way to the truth.<br/>Sexy, sultry, and action-packed, Dirty Little Secrets is a thrilling adventure in manhunting of the most dangerous kind.", 'language": "en", "image": "https://images.isbndb.com/covers/16/26/9781416501626.jpg", "title_long": "Dirty Little Secrets", "edition": "Original", "dimensions": "Height: 8.25 Inches, Length: 5.31 Inches, Weight: 0.98767093376 Pounds, Width: 0.9 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 0.9}, "weight": {"unit": "pounds", "value": 0.98767093376}, "height": {"unit": "inches", "value": 8.25}}, "pages": 352, "date_published": "2005-05-31", "subjects": ["Literature & Fiction', 'United States', 'Hispanic', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense', 'Romance', 'Romantic Suspense'], 'authors": ["Julie Leto'], 'title": "Dirty Little Secrets", "isbn13": "9781416501626", "msrp": 12, 'binding": "Paperback", "isbn": "1416501622", "isbn10": "1416501622"}}