{"book": {"publisher": "Simon & Schuster", "synopsis": "Brad Thor\"s national best-selling debut, The Lions of Lucerne, was hailed as "high-voltage entertainment reminiscent of Robert Ludlum" (Literary Journal). Now, he again delivers a non-stop action as one man\'s quest for revenge thrusts him into a battle to save his country....<br/><br/>After rescuing the President from kidnappers, Navy SEAL turned Secret Service agent Scot Harvath shifts his attentions to rooting out, capturing, or killing all those responsible for the plot. As he prepares to close out his list, a bloody and twisted trail of clues points toward one man -- the world\'s most feared, most ruthless terrorist, Hashim Nidal. Having assembled an international league of Islamic terrorist networks in an ingenious plot to topple both Israel and America, Harvath and his CIA-led team must reach Nidal before it\'s too late. One problem remains -- they have no idea what the man looks like. With no alternative, Harvath is forced to recruit a civilian -- a woman who has survived a brutal hijacking and is now the only person who can positively identify their quarry.<br/><br/>From the burning deserts of North Africa to the winding streets of Rome, Harvath must brave a maelstrom of bloodshed and deception -- before a madman\'s twisted vision engulfs the world in the fires of all-out war....', 'language": "en", "image": "https://images.isbndb.com/covers/63/16/9781416516316.jpg", "title_long": "Path of the Assassin", "edition": "Reprint", "dimensions": "Height: 8.25 Inches, Length: 5.3125 Inches, Weight: 0.92 Pounds, Width: 1.4 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.3125}, "width": {"unit": "inches", "value": 1.4}, "weight": {"unit": "pounds", "value": 0.92}, "height": {"unit": "inches", "value": 8.25}}, "pages": 503, "date_published": "2003-08-01", "subjects": ["Literature & Fiction', 'United States', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Spies & Politics'], 'authors": ["Brad Thor'], 'title": "Path of the Assassin", "isbn13": "9781416516316", "msrp": 15, 'binding": "Paperback", "isbn": "141651631X", "isbn10": "141651631X"}}