{"book": {"publisher": "Atria Books", "synopsis": "Jennifer Weiner\"s talent shines like never before in this collection of short stories, following the tender, and often hilarious, progress of love and relationships over the course of a lifetime. From a teenager coming to terms with her father\"s disappearance to a widow accepting two young women into her home, Weiner\"s eleven stories explore those transformative moments in our every day.<br/>We meet Marlie Davidow, home alone with her new baby late one Friday night, when she wanders onto her ex\'s online wedding registry and wonders what if she had wound up with the guy not taken. We stumble on Good in Bed\'s Bruce Guberman, liquored-up and ready for anything on the night of his best friend\'s bachelor party, until stealing his girlfriend\'s tiny rat terrier becomes more complicated than he\'d planned. We find Jessica Norton listing her beloved New York City apartment in the hope of winning her broker\'s heart. And we follow an unlikely friendship between two very different new mothers, and the choices that bring them together -- and pull them apart.<br/>The Guy Not Taken demonstrates Weiner\'s amazing ability to create characters who 'feel like they could be your best friend' (Janet Maslin) and to find hope and humor, longing and love in the hidden corners of our common experiences.', 'language": "en", "image": "https://images.isbndb.com/covers/52/01/9781416535201.jpg", "title_long": "The Guy Not Taken: Stories", "edition": "First Edition", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 1 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 1}, "height": {"unit": "inches", "value": 9}}, "pages": 304, "date_published": "2006-09-05", "subjects": ["Literature & Fiction', 'Short Stories & Anthologies', 'Short Stories', 'Women's Fiction', 'Single Women', 'Contemporary', 'United States', 'Literary'], 'authors": ["Jennifer Weiner'], 'title": "The Guy Not Taken: Stories", "isbn13": "9781416535201", "msrp": 24.95, 'binding": "Hardcover", "isbn": "1416535209", "isbn10": "1416535209"}}