{"book": {"publisher": "Simon & Schuster Books for Young Readers", "synopsis": "Be careful or you\"ll get burned.<br/><br/>The three hottest au pairs in history are back, and this time they\"re ready to rule the Hamptons. Mara has all the VIPs in the hottest clubs hanging on her every word. Eliza\"s family is back from financial ruin; and she\'s got the platinum charge cards to prove it. Jacqui is newly single and ready for some steamy summer hook-ups. The girls seem to have it all this summer...but looks, as we all know, can be deceiving.<br/><br/>Mara\'s living every girl\'s dream: playing house with her boyfriend, Ryan Perry, on his parents\' luxury yacht while writing a column about night-life in the Hamptons. With a press pass to every hot event, Mara\'s ready to hit the red carpet and scoop even the most seasoned journalists. If only she could get a pass from Ryan, who just wants her to stay home and cuddle.<br/><br/>Last summer\'s 'No boys!' mantra is a distant memory for Jacqui. While the new au pair, Shannon, handles the Perry kids, Jacqui searches for some serious fun. And she doesn\'t have to look far: Three dot.com boy millionaires have moved in next door and are more than happy to compete for her affections. Thus Jacqui\'s new mantra is, 'Why have just one when you can have them all?'<br/><br/>Eliza and Jeremy are in total relationship bliss. She\'s decided to take the next step with Jeremy and nothing\'s going to stop her this time. Unfortunately, what she thought would be a cakewalk internship for a famous fashion designer turns out to be more hours of hard labor than she, or her relationship, are ready for. Too bad Jeremy won\'t stop questioning her work ethic long enough for Eliza to get back in the mood.<br/><br/>The Au Pairs: Sun-kissed. Because it\'s soooo much more than just a job.', 'language": "en", "image": "https://images.isbndb.com/covers/74/65/9781416917465.jpg", "title_long": "Sun-kissed (Au Pairs)", "edition": "First Edition", "dimensions": "Height: 9 Inches, Length: 6.25 Inches, Weight: 1 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.25}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 1}, "height": {"unit": "inches", "value": 9}}, "pages": 320, "date_published": "2006-05-23", "subjects": ["Romance', 'Contemporary', 'Teen & Young Adult', 'Literature & Fiction', 'Social & Family Issues'], 'authors": ["Melissa de la Cruz'], 'title": "Sun-kissed (Au Pairs)", "isbn13": "9781416917465", "msrp": 15.95, 'binding": "Hardcover", "isbn": "1416917462", "isbn10": "1416917462"}}