{"book": {"publisher": "Thomas Nelson Inc", "synopsis": "In the never-ending quest for fulfillment, we sometimes convince ourselves that life would be better if we just had a different career . . . more education . . . a new spouse . . . a fresh start in another location. The solution to life\"s challenges, we think, is just around the corner, a few steps ahead?always just out of reach.<br/>Living on the Ragged Edge Workbook opens the pages of an ancient journal?the Old Testament book of Ecclesiastes. In this very personal, unbelievably honest book, King Solomon chronicles his search for satisfaction, experiencing everything the world offered. The wisest man who ever lived, he certainly had the intelligence and the vast resources to pursue whatever his heart desired?from personal riches to sexual pleasures. Solomon had it all. He did it all with abandon. And he came to the end of his days with the ultimate secret for the "good life."<br/>Do you want to know the secret? Do you want to know how to find joy and peace in this world gone mad? In this bestseller Charles Swindoll delivers his characteristic insights and wisdom in an exploration of the book of Ecclesiastes and brings home to you Solomon\'s powerful message for living at its best.', 'language": "en", "image": "https://images.isbndb.com/covers/34/68/9781418503468.jpg", "title_long": "Living On The Ragged Edge Workbook: Coming to Terms with Reality", "edition": "Workbook ed.", "dimensions": "Height: 9 Inches, Length: 7.5 Inches, Weight: 1.01 Pounds, Width: 0.75 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.5}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 1.01}, "height": {"unit": "inches", "value": 9}}, "pages": 268, "date_published": "2005", "subjects": ["Reference'], 'authors": ["Charles R. Swindoll'], 'title": "Living On The Ragged Edge Workbook: Coming to Terms with Reality", "isbn13": "9781418503468", "msrp": 17.99, "binding": "Paperback", "related": {"ePub": "1418559385"}, "isbn": "1418503460", "isbn10": "1418503460", "other_isbns": [{'isbn": "9781418559380", "binding": "print"}]}}