{"book": {"publisher": "VIZ Media LLC", "synopsis": "The hulking cyborg counterterrorist Batou doesn\"t have a family; his electronic brain never dreams. So why did he dream the other night--and dream that he has a son?At one time, Batou had a human love for his partner, the legendary Major, before he witnessed her transfiguration into something beyond humanity. Now he has only his job, and his beloved basset hound, Gabriel. But when Batou has a near-death experience in an arranged car "accident," he returns home to find Gabriel has gone missing--perhaps, to go look for her owner\'s lost soul.Batou\'s desperate search for Gabriel leads him down surreal streets where homeless men fight tanks and yakuza racing hounds chase rabbits downloaded into their heads. Batou fears his poor dog has made a horrible mistake out of innocence--for Batou has taken a cold look inside himself...and decided that he never truly had a soul...Innocence, After The Long Goodbye is the prequel to the Ghost In The Shell 2: Innocence film, also available as a four-volume Ani-Manga box set from VIZ Media. The Innocence novel contains a special bonus discussion between the director, Mamoru Oshii, and the author, Masaki Yamada.', 'language": "en", "image": "https://images.isbndb.com/covers/15/67/9781421501567.jpg", "title_long": "Ghost in the Shell 2: Innocence - After the Long Goodbye", "edition": "First Edition", "dimensions": "Height: 7.75 Inches, Length: 5.25 Inches, Weight: 0.7 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.25}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 0.7}, "height": {"unit": "inches", "value": 7.75}}, "pages": 196, "date_published": "2005-10-11", "subjects": ["Comics & Graphic Novels', 'Manga', 'Science Fiction', 'Media Tie-In'], 'authors": ["Masaki Yamada'], 'title": "Ghost in the Shell 2: Innocence - After the Long Goodbye", "isbn13": "9781421501567", "msrp": 19.99, 'binding": "Hardcover", "isbn": "1421501562", "isbn10": "1421501562"}}