{"book": {"publisher": "VIZ Media LLC", "synopsis": "When Light Yagami finds a notebook giving him power over death, will he use it for good—or evil?<br/><br/>Light Yagami is an ace student with great prospects--and he"s bored out of his mind. But all that changes when he finds the Death Note, a notebook dropped by a rogue Shinigami death god. Any human whose name is written in the notebook dies, and now Light has vowed to use the power of the Death Note to rid the world of evil. But when criminals begin dropping dead, the authorities send the legendary detective L to track down the killer. With L hot on his heels, will Light lose sight of his noble goal...or his life?<br/><br/>With Near openly suspecting the new L of being Kira and sowing doubt in the hearts of the task force members, Light is once again forced to pass the Death Note on to another to take the heat off himself. But this time, Kira chooses a disciple from among his true believers. With no way to contact his successor directly, Light must rely on his faithful follower"s adherence to Kira"s goals. Will this newest move bring Light's ideal world closer to reality? Or will losing control of the Death Note spell Light's doom?', 'language": "en", "image": "https://images.isbndb.com/covers/15/59/9781421511559.jpg", "title_long": "Death Note, Vol. 10", "dimensions": "Height: 7.5 Inches, Length: 5 Inches, Weight: 0.36596692 Pounds, Width: 0.7 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 0.7}, "weight": {"unit": "pounds", "value": 0.36596692}, "height": {"unit": "inches", "value": 7.5}}, "pages": 192, "date_published": "2007-03-06", "subjects": ["Comics & Graphic Novels', 'Manga', 'Fantasy', 'Mystery, Thriller & Crime', 'Media Tie-In', 'Shonen', 'Teen & Young Adult', 'Literature & Fiction', 'Politics & Social Sciences', 'Politics & Government', 'Specific Topics'], 'authors": ["Tsugumi Ohba'], 'title": "Death Note, Vol. 10", "isbn13": "9781421511559", "msrp": 7.19, 'binding": "Paperback", "isbn": "142151155X", "isbn10": "142151155X"}}