{"book": {"publisher": "VIZ Media LLC", "synopsis": "When Light Yagami finds a notebook giving him power over death, will he use it for good—or evil?<br/><br/>Light Yagami is an ace student with great prospects--and he"s bored out of his mind. But all that changes when he finds the Death Note, a notebook dropped by a rogue Shinigami death god. Any human whose name is written in the notebook dies, and now Light has vowed to use the power of the Death Note to rid the world of evil. But when criminals begin dropping dead, the authorities send the legendary detective L to track down the killer. With L hot on his heels, will Light lose sight of his noble goal...or his life?<br/><br/>Although they"ve collected plenty of evidence tying the seven Yotsuba members to the newest Kira, Light, L and the rest of the task force are no closer to discovering which one actually possesses the Death Note. Desperate for some headway, L recruits Misa to infiltrate the group and feed them information calculated to bring Kira into the open. But the Shinigami Rem reveals to Misa who the Kiras really are, and, armed with this knowledge, Misa will do anything to help Light. But what will that mean for L...?", 'language": "en", "image": "https://images.isbndb.com/covers/62/72/9781421506272.jpg", "title_long": "Death Note, Vol. 6", "edition": "1", "dimensions": "Height: 7.5 Inches, Length: 5 Inches, Weight: 0.44533376924 Pounds, Width: 0.7 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 0.7}, "weight": {"unit": "pounds", "value": 0.44533376924}, "height": {"unit": "inches", "value": 7.5}}, "pages": 224, "date_published": "2006-07-05", "subjects": ["Comics & Graphic Novels', 'Manga', 'Fantasy', 'Horror', 'Mystery, Thriller & Crime', 'Media Tie-In', 'Shonen', 'Teen & Young Adult', 'Literature & Fiction', 'Politics & Social Sciences', 'Politics & Government', 'Specific Topics'], 'authors": ["Tsugumi Ohba'], 'title": "Death Note, Vol. 6", "isbn13": "9781421506272", "msrp": 9.99, 'binding": "Paperback", "isbn": "1421506270", "isbn10": "1421506270"}}