{"book": {"publisher": "Kumon Publishing Group", "synopsis": "After a summer spent trying to prevent a catastrophic war among the Greek gods, Percy Jackson finds his seventh-grade school year unnervingly quiet. His biggest problem is dealing with his new friend, Tyson\x97a six-foot-three, mentally challenged homeless kid who follows Percy everywhere, making it hard for Percy to have any “normal” friends.<br/><br/>But things don’t stay quiet for long. Percy soon discovers there is trouble at Camp Half-Blood: the magical borders which protect Half-Blood Hill have been poisoned by a mysterious enemy, and the only safe haven for demigods is on the verge of being overrun by mythological monsters. To save the camp, Percy needs the help of his best friend, Grover, who has been taken prisoner by the Cyclops Polyphemus on an island somewhere in the Sea of Monsters, the dangerous waters Greek heroes have sailed for millennia\x97only today, the Sea of Monsters goes by a new name…the Bermuda Triangle.<br/><br/>Now Percy and his friends\x97Grover, Annabeth, and Tyson\x97must retrieve the Golden Fleece from the Island of the Cyclopes by the end of the summer or Camp Half-Blood will be destroyed. But first, Percy will learn a stunning new secret about his family\x97one that makes him question whether being claimed as Poseidon’s son is an honor or simply a cruel joke.", "language": "en", "image": "https://images.isbndb.com/covers/33/49/9781423103349.jpg", "title_long": "My Book of Addition", "edition": "Reprint", "dimensions": "Height: 11.69289 Inches, Length: 8.34644 Inches, Weight: 0.7826410301 Pounds, Width: 0.27559 inches", "dimensions_structured": {'length": {"unit": "inches", "value": 8.34644}, "width": {"unit": "inches", "value": 0.27559}, "weight": {"unit": "pounds", "value": 0.7826410301}, "height": {"unit": "inches", "value": 11.69289}}, "pages": 80, "date_published": "2009", "subjects": ["Children's Books', 'Action & Adventure', 'Fairy Tales, Folk Tales & Myths', 'Greek & Roman', 'Science Fiction & Fantasy', 'Fantasy & Magic'], 'authors": ["Kumon'], 'title": "My Book of Addition", "isbn13": "9781423103349", "msrp": 4.59, 'binding": "Paperback", "isbn": "1423103343", "isbn10": "1423103343"}}