{"book": {"publisher": "Douglas & McIntyre", "synopsis": "Full of surprises and insights, Souvenir of Canada presents us as we have never seen ourselves before in an irresistible flow of text and image.<br/><br/>Douglas Coupland offers new ways of seeing and experiencing Canada-looking at how it feels to be a Canadian right now and speculating what it might feel like in the future. From collective memories, he locates objects like stubbie beer bottles and ookpiks, Kraft dinner and maple walnut ice cream. And with the same unique sensibility, he considers significant events and relevant issues, like the flq crisis, Canada\"s relationship with the United States, medicare and the landscape itself.<br/><br/>In the section humbly titled "Cheese," he writes: "When you assemble them together, foods that feel intuitively Canadian look more like camping trip provisions than actual groceries...Canada is a cold and northern country...from a biological standpoint, it is imperative that Canadians stockpile concentrated forms of sugars, carbohydrates, fats and salt."<br/><br/>The 50 personal categories of the 30,000-word text are arranged alphabetically and matched with 100 illustrations (50 in colour)-new luscious photos taken by Coupland himself, images of Canadian ephemera and icons, historical photos and pictures from other quite startling sources. Included are photos of cultural installations created by Coupland himself.', 'language": "en", "image": "https://images.isbndb.com/covers/91/71/9781550549171.jpg", "title_long": "Souvenir of Canada", "edition": "First Edition", "dimensions": "Height: 9.5 inches, Length: 8.5 inches, Weight: 1.35 Pounds, Width: 0.5 inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.5}, "width": {"unit": "inches", "value": 0.5}, "weight": {"unit": "pounds", "value": 1.35}, "height": {"unit": "inches", "value": 9.5}}, "pages": 160, "date_published": "2004-03-19", "subjects": ["Travel', 'Canada', 'General', 'Politics & Social Sciences', 'Social Sciences', 'Popular Culture'], 'authors": ["Douglas Coupland'], 'title": "Souvenir of Canada", "isbn13": "9781550549171", "msrp": 24.38, 'binding": "Paperback", "isbn": "1550549170", "isbn10": "1550549170"}}