{"book": {"publisher": "Douglas & McIntyre", "synopsis": "Douglas Coupland returns to re-inventing Canada following his best-seller that made it clear, Canada is way more than slightly cool.<br/><br/>Douglas Coupland gets Canada. Better, he has set out to re-invent his country with his particular brand of insight, humor, and visual acuity.<br/><br/>Souvenir of Canada created a sensation when it was first published, dominating Canada’s best-seller lists for months, and made the front pages of every major Canadian newspaper. Eh?<br/><br/>Souvenir of Canada 2 picks up where its predecessor left off. As with the best jazz, the riffs are fresh, never quite predictable, and full of delicious rhythm and subtle humor. This book is packed full of powerfully resonant images, and unexpected juxtapositions, that reveal a new Canada, one at home in a new century. No lighthouses, grain elevators, or teepees here.<br/><br/>In addition to his trademark visual revelations, Coupland has created new works of art & design specifically for the book which further evoke the Canadian identity: quilts and cabinets and lamps and tables of startling beauty and subtlety. Each of these objects mirror his personal relationship to Canada in a way which, ultimately, speaks for all Canadians.", "language": "en", "image": "https://images.isbndb.com/covers/04/30/9781553650430.jpg", "title_long": "Souvenir of Canada 2", "dimensions": "Height: 9.75 Inches, Length: 8.75 Inches, Weight: 1.4 Pounds, Width: 0.25 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 8.75}, "width": {"unit": "inches", "value": 0.25}, "weight": {"unit": "pounds", "value": 1.4}, "height": {"unit": "inches", "value": 9.75}}, "pages": 144, "date_published": "2004-11-24", "subjects": ["History', 'Americas', 'Canada', 'Travel', 'General', 'Travel Writing'], 'authors": ["Douglas Coupland'], 'title": "Souvenir of Canada 2", "isbn13": "9781553650430", "msrp": 18.23, 'binding": "Paperback", "isbn": "1553650433", "isbn10": "1553650433"}}