{"book": {"publisher": "Copper Canyon Press", "synopsis": "A Zen-Taoist poetry classic, in a handsome Chinese-English format<br/>This definitive translation of Han Shan’s poetry appears in a bilingual Chinese-English format. Included are extensive notes, a preface by renowned translator Red Pine, a findings list, and photographs of the cave and surrounding area where Han Shan (\x93Cold Mountain”) lived.<br/>Cold Mountain is one of the most revered poets in China. He was a Taoist/Buddhist hermit who begged for food at temples, often sang and drank with cowherds, and became an immortal figure in the history of Chinese literature and Zen. His poems were written twelve-hundred years ago on the rocks, trees, and temple walls of China’s Tientai Mountains. This revised edition also includes poems by Han Shan’s colleagues, Pickup (Shih-te) and Big Stick (Feng-kan), translated here for the first time.<br/>As Red Pine begins his Preface, \x93If China’s literary critics were put in charge of organizing a tea for their country’s greatest poets of the past, Cold Mountain would not be on many invitation lists. Yet no other poet occupies the altars of China’s temples and shines, where his statue often stands alongside immortals and bodhisattvas. He is equally revered in Korea and Japan. And when Jack Kerouac dedicated The Dharma Bums to him in 1958, Cold Mountain became the guardian angel of a generation of Westerners as well.”<br/>Reviews of Red Pine\"s Collected Songs of Cold Mountain:<br/>”The translator’s preface describes his rendition of the life of Cold Mountain, offering an excellent historical and philosophical context for the simple yet profound poems attributed to the poet."\x97Library Journal<br/>\x93These are poems one must taste fully and drink whole... The poems of Han-shan read like a journal or memoir, and they often work as Zen koans, challenging the mind to go beyond the words and reason.”\x97Parabola<br/>\x93Red Pine... has given us the first full collection of Han Shan’s songs in an idiom that is clear, graceful, and neutral enough to last... His translations are accurate and mirror the music of the originals... The Collected Songs of Cold Mountain is a considerable performance and a truly valuable book. Thanks to Copper Canyon\"s high standards of bookmaking, it is beautiful to hold and behold; thanks to Red Pine’s care, it will survive as the definitive text of Han Shan in English for many years. It belongs on the shelf of everyone with an interest in poetry and... should be opened often.'\x97The Bloomsbury Review<br/>\x93An exquisite publication that captures the Taoist practice of passionate attention, of being still inside and relaxed in the comforts and discomforts around you, going nowhere else... We discover this in the poet’s vision and spirit, in the precision and balance of the translator’s scholarship and heart, and in the elegant wilderness of the bookmaker’s art around them. On every level this is a beautiful book.”\x97Judges’ comments on awarding the WESTAF Award in Translation<br/>\x93Cold Mountain’s colloquial poetry...sound like inspired raps\x97marvelously direct, with skips, jumps, verbal nudges and abrupt revelations... The volume is beautifully produced, with a long and careful introduction... This is an indispensable book.”\x97The Berkeley Monthly<br/>\x93More than anyone else, Red Pine has made [Han Shan’s] spontaneous poems accessible to Western readers... In this new, expanded edition, invaluable notes and an extensive new critical preface provide a contextual awareness, not just for the poems, but for their sources in Buddhist and Confucian culture.”\x97Inquiring Mind<br/>Red Pine is one of the world’s leading translators of Chinese literary and religious texts. His other translations include Lao-tzu’s Taoteching (isbn 9781556592904) and Poems of the Masters: China’s Classic Anthology of T’ang and Sung Dynasty Verse (isbn 9781556591952).', 'language": "zh", "image": "https://images.isbndb.com/covers/14/02/9781556591402.jpg", "title_long": "The Collected Songs of Cold Mountain (Mandarin Chinese and English Edition)", "edition": "Revised and Expanded ed.", "dimensions": "Height: 9.1 Inches, Length: 6.1 Inches, Weight: 1.06042348022 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.1}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 1.06042348022}, "height": {"unit": "inches", "value": 9.1}}, "pages": 320, "date_published": "2000-06-01", "subjects": ["Literature & Fiction', 'Poetry', 'Regional & Cultural', 'Themes & Styles', 'World Literature', 'Asian', 'Religion & Spirituality', 'Buddhism', 'Sacred Writings', 'Politics & Social Sciences', 'Philosophy', 'Eastern'], 'authors": ["Cold Mountain (Han Shan)'], 'title": "The Collected Songs of Cold Mountain (Mandarin Chinese and English Edition)", "isbn13": "9781556591402", "msrp": 17, 'binding": "Paperback", "isbn": "1556591403", "isbn10": "1556591403"}}