{"book": {"publisher": "Newmarket", "synopsis": "A lighthearted companion to the best-reviewed film of the year\x97a pocket-sized illustrated guide to the locations and wines featured in Sideways including maps, winery listings, tips for drinking wine, and Oscar®-winning dialogue.<br/><br/>Yesterday, you didn"t know Pinot Noir from film noir.<br/><br/>Now, after seeing the marvelous movie Sideways, you are living the life uncorked, and this is the perfect little book to celebrate your own sideways journey. Inside you will find:<br/>\x95 Wine recommendations, tips for tasting wine, and a list of bottles featured in the film<br/>\x95 Places and wineries to visit in the Santa Ynez Valley in Santa Barbara County that were featured in the movie<br/>\x95 Excerpts from the Oscar®-winning screenplay<br/>\x95 Web sites and information for planning your own trip.<br/><br/>This hilarious and useful guide is fully illustrated in color with movie stills, location stills, and delightful drawings by artist Robert Neubecker, who created the film"s poster.<br/><br/>Originally created as a specialty item for wineries and tourist sites, The Sideways Guide to Wine and Life has been featured widely in articles (USA Today, The New York Times, and Wine Spectator) about the Sideways phenomenon and the surge in Pinot Noir"s popularity across the country. Now available in an expanded trade edition for the first time, this is a terrific gift and countertop book year round.', 'language": "en", "image": "https://images.isbndb.com/covers/68/64/9781557046864.jpg", "title_long": "The Sideways Guide to Wine and Life", "dimensions": "Height: 5.25 Inches, Length: 5.5 Inches, Weight: 0.2 Pounds, Width: 0.25 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.25}, "weight": {"unit": "pounds", "value": 0.2}, "height": {"unit": "inches", "value": 5.25}}, "pages": 64, "date_published": "2005-06-05", "subjects": ["Arts & Photography', 'Performing Arts', 'Cookbooks, Food & Wine', 'Humor & Entertainment', 'Movies', 'Guides & Reviews'], 'authors": ['Alexander Payne', 'Jim Taylor'], 'title": "The Sideways Guide to Wine and Life", "isbn13": "9781557046864", "msrp": "0.00", "binding": "Paperback", "isbn": "1557046867", "isbn10": "1557046867"}}