{"book": {"publisher": "Newmarket", "synopsis": "A stunning visual companion to the highly anticipated new film from director Rob Marshall (Chicago), based on the international bestseller by Arthur Golden\x97a major holiday release from Columbia Pictures.<br/><br/>Featuring over 150 full-color photographs and drawings, this lavishly illustrated book captures the artistry and romance behind the exquisite new film from Rob Marshall, the director of the Oscar®-winning film Chicago, starring Ziyi Zhang (House of Flying Daggers) and Ken Watanabe (The Last Samurai).<br/><br/>Directed by Academy Award®-nominee Rob Marshall (Chicago) and produced by Lucy Fisher, Douglas Wick, and Steven Spielberg, from a screenplay by Robin Swicord and Doug Wright, Memoirs of a Geisha features an all-star Asian cast including Michelle Yeoh (Crouching Tiger, Hidden Dragon), Koji Yakusho (Shall We Dance?), Youki Kudoh (Snow Falling on Cedars), and Gong Li (Raise the Red Lantern).<br/><br/>Based on the internationally acclaimed novel by Arthur Golden, Memoirs of a Geisha is a sweeping romantic epic set in the mysterious and exotic world that still casts a potent spell today. The story begins in the years before WWII when a penniless Japanese child is torn from her family to work as a servant in a geisha house. Despite a treacherous rival who nearly breaks her spirit, the girl blossoms into the legendary geisha Sayuri (Ziyi Zhang). Beautiful and accomplished, Sayuri captivates the most powerful men of her day, but is haunted by her secret love for the one man who is out of her reach (Ken Watanabe).<br/><br/>The Newmarket Pictorial Moviebook explores the intricate process of re-creating the period and world of the geisha. Special sections showcase production design, makeup, choreography, and costumes, featuring kimonos created especially for the movie by five-time Oscar®-nominated costume designer Colleen Atwood. Sidebars throughout also provide fascinating historical background on the geisha culture.", "language": "en", "image": "https://images.isbndb.com/covers/68/33/9781557046833.jpg", "title_long": "Memoirs of a Geisha: Portrait of the Film", "edition": "First Edition", "dimensions": "Height: 9.25 Inches, Length: 12.5 Inches, Weight: 2.3 Pounds, Width: 1 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 12.5}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 2.3}, "height": {"unit": "inches", "value": 9.25}}, "pages": 144, "date_published": "2005-12-09", "subjects": ["Arts & Photography', 'Performing Arts', 'Humor & Entertainment', 'Movies'], 'authors": ["Peggy Mulloy'], 'title": "Memoirs of a Geisha: Portrait of the Film", "isbn13": "9781557046833", "msrp": 40, 'binding": "Hardcover", "isbn": "1557046832", "isbn10": "1557046832"}}