{"book": {"publisher": "University of Massachusetts Press", "synopsis": "Ever since the 1963 publication of her landmark book, The Feminine Mystique, Betty Friedan has insisted that her commitment to women\"s rights grew out of her experiences as an alienated suburban housewife. Yet as Daniel Horowitz persuasively demonstrates in this illuminating and provocative biography, the roots of Friedan\"s feminism run much deeper than she has led us to believe. Drawing on an impressive body of new research―including Friedan\"s own papers―Horowitz traces the development of Friedan\'s feminist outlook from her childhood in Peoria, Illinois, through her wartime years at Smith College and Berkeley, to her decade-long career as a writer for two of the period\'s most radical labor journals, the Federated Press and the United Electrical Workers\' UE News. He further shows that even after she married and began to raise a family, Friedan continued during the 1950s to write and work on behalf of a wide range of progressive social causes. By resituating Friedan within a broader cultural context, and by offering a fresh reading of The Feminine Mystique against that background, Horowitz not only overturns conventional ideas about 'second wave' feminism but also reveals long submerged links to its past.', 'language": "en", "image": "https://images.isbndb.com/covers/27/69/9781558492769.jpg", "title_long": "Betty Friedan and the Making of "The Feminine Mystique": The American Left, the Cold War, and Modern Feminism (Culture, Politics and the Cold War)', 'edition": "New edition", "dimensions": "Height: 9.34 Inches, Length: 6.24 Inches, Weight: 1.25883951602 Pounds, Width: 1.06 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.24}, "width": {"unit": "inches", "value": 1.06}, "weight": {"unit": "pounds", "value": 1.25883951602}, "height": {"unit": "inches", "value": 9.34}}, "pages": 388, "date_published": "2000-09-27", "subjects": ["Politics & Social Sciences', 'Social Sciences', 'Women's Studies', 'Feminist Theory', 'Politics & Government', 'Political Science'], 'authors": ["Daniel Horowitz'], 'title": "Betty Friedan and the Making of "The Feminine Mystique": The American Left, the Cold War, and Modern Feminism (Culture, Politics and the Cold War)', 'isbn13": "9781558492769", "msrp": 25.95, 'binding": "Paperback", "isbn": "1558492763", "isbn10": "1558492763"}}