{"book": {"publisher": "University of Massachusetts Press", "synopsis": "With more than thirty-five million copies in print, the Little House series, written in the 1930s and 1940s by Laura Ingalls Wilder and her daughter, Rose Wilder Lane, has been a spectacular commercial success. What is it about this eight-volume serial novel for children that accounts for its enduring power? And what does the popularity of these books tell us about the currents of American culture?<br/><br/>Ann Romines interweaves personal observation with scholarly analysis to address these questions. Writing from a feminist perspective and drawing on resources of gender studies, cultural studies, and new historicist reading, she examines both the content of the novels and the process of their creation. She explores the relationship between mother and daughter working as collaborative authors and calls into question our assumptions about plot, juvenile fiction, and constructions of gender on the nineteenth-century frontier and in the Depression years when the Little House books were written.<br/><br/>This is a book that will appeal both to scholars and to general readers who might welcome an engaging and accessible companion volume to the Little House novels.", "language": "en", "image": "https://images.isbndb.com/covers/12/29/9781558491229.jpg", "title_long": "Constructing the Little House: Gender, Culture, and Laura Ingalls Wilder", "edition": "First Edition", "dimensions": "Height: 9.5 Inches, Length: 6.25 Inches, Weight: 1.13978989454 Pounds, Width: 1 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.25}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 1.13978989454}, "height": {"unit": "inches", "value": 9.5}}, "pages": 304, "date_published": "1997-11-21", "subjects": ["Children's Books', 'Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Movements & Periods', 'Women Authors', 'Politics & Social Sciences', 'Social Sciences', 'Women's Studies', 'Feminist Theory', 'Women Writers'], 'authors": ["Ann Romines'], 'title": "Constructing the Little House: Gender, Culture, and Laura Ingalls Wilder", "isbn13": "9781558491229", "msrp": 25.95, 'binding": "Paperback", "isbn": "1558491228", "isbn10": "1558491228"}}