{"book": {"publisher": "Harvard Common Press", "synopsis": "You probably own a slow cooker - 80 percent of American households do. For more than thirty years, its unbeatable convenience and practicality have made it a staple of busy families, enabling anyone to return to a home-cooked meal at the end of a hectic day. Many slow cooker recipes, however, have relied on less-than-healthy convenience products. Now, Beth Hensperger and Julie Kaufmann"s Not Your Mother"sr Slow Cooker Cookbook takes a completely fresh look at cooking with this popular appliance. This comprehensive collection of 350 recipes combines the ease of slow cooking with the fresh, wholesome ingredients and exciting flavors of today"s kitchen. For days when there's just no time for prep, there's Orange and Honey Chicken Drumsticks or Country Ribs with Onions, Apples, and Sauerkraut. For (slightly!) less hectic days there's Tangy Tomato Brisket or Lentil and Red Pepper Soup. Stay out of the kitchen when guests arrive with Duck Breasts with Port Wine Sauce or wake up to breakfast with Hot Apple Granola Oatmeal. Hensperger and Kaufmann offer dishes for every time frame, without compromising on taste, quality, or variety. And Not Your Mother'sr Slow Cooker Cookbook showcases the best of home cooking while taking advantage of a global melting pot of flavors - so cooks can serve Chicken and Shrimp Jambalaya one day and Japanese Beef Curry Rice another. All the classic slow cooker recipes are here, plus many more adventuresome and innovative dishes. There is also practical information on the different types of slow cookers, their latest accessories, and what sizes are best for what purposes.', 'language": "en", "image": "https://images.isbndb.com/covers/24/55/9781558322455.jpg", "title_long": "Not Your Mother"s Slow Cooker Cookbook", 'edition": "12/26/04", "dimensions": "Height: 9 Inches, Length: 8 Inches, Weight: 2.10100535686 Pounds, Width: 1.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8}, "width": {"unit": "inches", "value": 1.5}, "weight": {"unit": "pounds", "value": 2.10100535686}, "height": {"unit": "inches", "value": 9}}, "pages": 528, "date_published": "2004-12-21", "subjects": ["Cookbooks, Food & Wine', 'Kitchen Appliances', 'Slow Cookers'], 'authors": ["Beth Hensperger', 'Julie Kaufmann'], 'title": "Not Your Mother"s Slow Cooker Cookbook", 'isbn13": "9781558322455", "msrp": 19.95, "binding": "Paperback", "related": {"ePub": "0760352577"}, "isbn": "1558322450", "isbn10": "1558322450", "other_isbns": [{'isbn": "9780760352571", "binding": "printisbncanonical"}]}}