{"book": {"publisher": "Audio Renaissance", "synopsis": "Product Description      <br/><br/>The New York Times bestselling author and Emmy Award-winning writer/producer sets his next action-packed thriller in the high stakes world he knows best: Hollywood<br/><br/>Back on the LAPD and hailed as a hero after taking down a deadly gang of rogue cops in The Viking Funeral, Shane Scully finds himself unwittingly involved in a criminal scheme to take over the movie business. Soon, he will have to go deep undercover to take down a Hollywood conspiracy.<br/><br/>At a glamorous party with his new wife, Alexandra, Shane hears a world famous director make an ominous remark about the strange deaths of his ex-wives. This is more than police business, it’s personal: Alexandra’s closest friend is engaged to the producer.<br/><br/><br/>When he looks closer, Scully discovers that the director’s mysterious past may hide deadly secrets. To uncover them, he must work alongside a former down-and-outer-turned-Hollywood impresario to infiltrate the movie business’s violent dark side, a world where deals are settled with handshakes but broken with the spilling of blood, and where the danger to Shane’s loved ones is all too real.<br/><br/><br/>      From Publishers Weekly      <br/>In his eighth novel, the third featuring L.A. supercop Shane Scully, veteran television writer and producer Cannell (The Rockford Files) takes readers on an entertaining, beneath-the-tinsel tour of Hollywood. His complex plot, clearly presented by narrator Michael, cleverly melds a Mafia move to infest film craft unions, a gangsta turf war and an LAPD sting operation that amusingly unspools into a multi-million-dollar runaway film fiasco. The mix of suspense and showbiz satire works well, but the author\"s most sterling achievement is his cast of full-blown, quirky, raffish characters. Michael employs an impressive array of dead-on accents to distinguish them. Wiseguy "Champagne" Dennis Valentine, who, between shootouts, delivers lectures on vegan dining, speaks in throaty Brooklynese; likable grifter Nicky Marcella\'s nervous whine is strictly from Jersey; and Farrell Champion, an A-list producer (who may have murdered a wife or two), speaks with an edgy bluster. Michael subtly handles the voices of women, Hispanics, African-Americans, obnoxious agents and arrogant superstars. Strangely, his invention wanes when it comes to the hero\'s voice; he uses his normal actor\'s locution. While it is well-suited for storytelling purposes, it\'s a bit refined for a knockabout guy like Shane.<br/>Copyright 2003 Reed Business Information, Inc.<br/>      Review      <br/><br/>'Cannell ... clearly knows the ins and outs of the entertainment industry, and the detective story, with its wry, subtle humor, doubles as a Hollywood satire.... The well-drawn characters and keen observations on the similarities between Hollywood and the mafia make this a winner.'<br/><br/><br/>--<br/>Publishers Weekly<br/><br/><br/>\xa0<br/><br/>'Once again, veteran writer/TV producer Cannell has concocted his special brand of reader candy.'<br/><br/>--<br/>Kirkus Reviews<br/><br/><br/>\xa0<br/><br/>'Cannell\'s brand of thriller is served straight up...and he knows how to cut to the chase.'<br/><br/>--<br/>The New York Times<br/><br/><br/>\xa0<br/><br/>'This is a mystery series I can strongly recommend.'<br/><br/>--The Mystery Reader<br/><br/>\xa0<br/><br/>'Cannell keeps the suspense level high ... making HOLLYWOOD TOUGH ...impossible to put down. Cannell ... continues to demonstrate that he is a master of whatever media he should choose to partake. Certainly the world of suspense literature is richer for his participation.'<br/><br/>--Bookreporter.com<br/><br/>\xa0<br/><br/>'An interesting and chill provoking read.'<br/><br/>--Reviewing the Evidence<br/><br/><br/><br/>      About the Author      <br/>Stephen J. Cannell, an Emmy Award–winning writer, has created over forty TV series including T<br/>he A-Team, 21 Jump Street, and<br/>The Greatest American Hero. His bestselling thrillers include<br/>The Tin Collectors and<br/>The Viking Funeral. He lives in Los Angeles, California, with his wife and children.<br/><br/><br/>      From AudioFile      <br/>At a Hollywood party, Detective Shane Scully overhears a remark by a famous producer who is engaged to a good', 'language": "en", "image": "https://images.isbndb.com/covers/82/25/9781559278225.jpg", "title_long": "Hollywood Tough (Shane Scully Novels)", "edition": "Unabridged", "dimensions": "Height: 6.22 Inches, Length: 4.24 Inches, Weight: 0.6 Pounds, Width: 2.71 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.24}, "width": {"unit": "inches", "value": 2.71}, "weight": {"unit": "pounds", "value": 0.6}, "height": {"unit": "inches", "value": 6.22}}, "date_published": "2003-01-07", "subjects": ["Literature & Fiction', 'Mystery, Thriller & Suspense', 'Mystery', 'Police Procedurals', 'Thrillers & Suspense'], 'authors": ["Stephen J. Cannell'], 'title": "Hollywood Tough (Shane Scully Novels)", "isbn13": "9781559278225", "msrp": 36.95, 'binding": "Audio Cassette", "isbn": "1559278226", "isbn10": "1559278226"}}