{"book": {"publisher": "Theatre Communications Group", "synopsis": "\x93David Lindsay-Abaire has crafted a drama that’s not just a departure but a revelation\x97an intensely emotional examination of grief, laced with wit, insightfulness, compassion and searing honesty.” \x96David Rooney, Variety<br/><br/>\x93A beautifully observed new play blessed with David Lindsay-Abaire’s customary grace and wit.” \x96Ben Brantley, New York Times<br/><br/>\x93With Rabbit Hole, David Lindsay-Abaire has crafted the most serious, simply told work of his career\x97a painstakingly beautiful, dramatically resourceful, exquisitely human new play.” \x96Backstage<br/><br/>A story of loss, heartbreak and forgiveness\x97told through daily moments and emotional hurdles\x97as a family moves on after the accidental death of their 4-year-old. After a critically acclaimed Broadway premier and successful film adaptation (starring Nicole Kidman, Aaron Eckhart, and Diane West), Rabbit Hole has been hailed as an artistic breakthrough for the highly regarded Lindsay-Abaire. A drama of what comes after tragedy, it captures \x93the awkwardness and pain of thinking people faced with an unthinkable situation\x97and eventually, their capacity for survival.” -USA Today<br/><br/>David Lindsay-Abaire is the Pulitzer-winning author of Rabbit Hole, which was made into a feature film. He is the author of Good People, Fuddy Meers, Wonder of the World, A Devil Inside and Kimberly Akimbo, as well as the book and lyrics to Shrek the Musical. He has written the screenplays for Rabbit Hole, Rise of the Guardians and Oz: The Great and Powerful. Born in South Boston, he now lives in Brooklyn.", "language": "en", "image": "https://images.isbndb.com/covers/29/00/9781559362900.jpg", "title_long": "Rabbit Hole", "edition": "1", "dimensions": "Height: 8.5 Inches, Length: 5.4 Inches, Weight: 0.53351867404 Pounds, Width: 0.4 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.4}, "width": {"unit": "inches", "value": 0.4}, "weight": {"unit": "pounds", "value": 0.53351867404}, "height": {"unit": "inches", "value": 8.5}}, "pages": 112, "date_published": "2006-09-01", "subjects": ["Literature & Fiction', 'Dramas & Plays', 'United States', 'Genre Fiction', 'Family Life', 'Parenting & Relationships', 'Politics & Social Sciences', 'Sociology', 'Death'], 'authors": ["David Lindsay-Abaire'], 'title": "Rabbit Hole", "isbn13": "9781559362900", "msrp": 14.95, 'binding": "Paperback", "isbn": "1559362901", "isbn10": "1559362901"}}