{'book': {'publisher': 'Penguin Classics', 'synopsis': "In the fourteenth century Geoffrey Chaucer, who served three kings as a customs official and special envoy, virtually invented English poetry. He did so by wedding the language of common speech to metrical verse, creating a medium that could accommodate tales of courtly romance, bawdy fabliaux, astute psychological portraiture, dramatic monologues, moral allegories, and its author’s astonishing learning in fields from philosophy to medicine and astrology. Chaucer’s accomplishment is unequalled by any poet before Shakespeare and—in The Canterbury Tales and Troilus and Cressida—ranks with that of the great English novelists.<br/><br/>Both The Canterbury Tales and Troilus and Cressida are presented complete in this anthology, in fresh modern translations by Theodore Morrison that convey both the gravity and gaiety of the Middle English originals. The Portable Chaucer also contains selections from The Book of Duchess, The House of Fame, The Bird's Parliament, and The Legend of Good Women, together with short poems. Morrison's introduction is vital for its insights into Chaucer as man and artist, and as a product of the Middle Ages whose shrewdness, humor, and compassion have a wonderfully contemporary ring.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/08/10/9780140150810.jpg', 'title_long': 'The Portable Chaucer: Revised Edition (Portable Library)', 'edition': 'Revised ed.', 'dimensions': 'Height: 7.72 Inches, Length: 5.05 Inches, Weight: 1.06262810284 Pounds, Width: 1.32 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.05}, 'width': {'unit': 'inches', 'value': 1.32}, 'weight': {'unit': 'pounds', 'value': 1.06262810284}, 'height': {'unit': 'inches', 'value': 7.72}}, 'pages': 624, 'date_published': '1977-05-26', 'subjects': ['Literature & Fiction', 'Classics', 'Poetry', 'Regional & Cultural', 'Themes & Styles', 'Short Stories & Anthologies', 'Anthologies', 'Contemporary', 'Ancient & Medieval Literature', 'Medieval', 'Ancient & Classical', 'Self Service', 'Custom Stores'], 'authors': ['Geoffrey Chaucer'], 'title': 'The Portable Chaucer: Revised Edition (Portable Library)', 'isbn13': '9780140150810', 'msrp': 20, 'binding': 'Paperback', 'related': {'ePub': '1101127414'}, 'isbn': '0140150811', 'isbn10': '0140150811', 'other_isbns': [{'isbn': '9781101127414', 'binding': 'print'}]}}