{'book': {'publisher': 'Penguin Classics', 'synopsis': "Charles Dickens's powerful black comedy of of hypocrisy and greed<br/><br/>The greed of his family has led wealthy old Martin Chuzzlewit to become suspicious and misanthropic, leaving his grandson and namesake to make his own way in the world. And so young Martin sets out from the Wiltshire home of his supposed champion, the scheming architect Pecksniff, to seek his fortune in America. In depicting Martin's journey - an experience that teaches him to question his inherited self-interest and egotism - Dickens created many vividly realized figures: the brutish lout Jonas Chuzzlewit, plotting to gain the family fortune; Martin's optimistic manservant, Mark Tapley; gentle Tom Pinch; and the drunken and corrupt private nurse, Mrs Gamp. With its portrayal of greed, blackmail and murder, and its searing satire on America Dickens's novel is a powerful and blackly comic story of hypocrisy and redemption. In her introduction, Patricia Ingham examines characterization, the central themes of the novel, and Dickens's depiction of America. This edition also includes two new prefaces, Dickens's postscript written in 1868, his working papers, a note on Mrs Gamp's eccentric speech, a chronology, updated further reading, appendices and original illustrations by 'Phiz'.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/61/43/9780140436143.jpg', 'title_long': 'Martin Chuzzlewit (Penguin Classics)', 'edition': 'Reissue', 'dimensions': 'Height: 7.76 Inches, Length: 5.11 Inches, Weight: 1.3 Pounds, Width: 1.47 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.11}, 'width': {'unit': 'inches', 'value': 1.47}, 'weight': {'unit': 'pounds', 'value': 1.3}, 'height': {'unit': 'inches', 'value': 7.76}}, 'pages': 864, 'date_published': '2000-08-01', 'subjects': ['Literature & Fiction', 'Classics', 'British & Irish', 'Humor & Satire', 'Satire', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors': ['Charles Dickens'], 'title': 'Martin Chuzzlewit (Penguin Classics)', 'isbn13': '9780140436143', 'msrp': 14, 'binding': 'Paperback', 'isbn': '0140436146', 'isbn10': '0140436146'}}