{'book': {'publisher': 'Penguin Classics', 'synopsis': '“The perfect companion to enjoy the most profound stories of the human condition that Shakespeare has given us and that I have had the privilege to perform, from Othello to King Lear.”—James Earl Jones<br/><br/>“Here is an elegant and clear text for either study or the rehearsal room.”—Sir Patrick Stewart<br/><br/>This major new complete edition of Shakespeare’s works combines accessibility with the latest scholarship and features a substantial introduction examining textual and literary-historical issues before each play and poem collection. The texts themselves have been scrupulously edited and are accompanied by same-page notes and glossaries. With The Complete Pelican Shakespeare, discover the works of William Shakespeare as never before in this beautiful, approachable collection of the Bard of Avon’s most famous works.<br/><br/>Penguin Classics is the leading publisher of classic literature in the English-speaking world, representing a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/05/89/9780141000589.jpg', 'title_long': 'The Complete Pelican Shakespeare', 'edition': '2nd revised', 'dimensions': 'Height: 2.3 Inches, Length: 9.5 Inches, Weight: 4.2108292042 Pounds, Width: 7.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 9.5}, 'width': {'unit': 'inches', 'value': 7.5}, 'weight': {'unit': 'pounds', 'value': 4.2108292042}, 'height': {'unit': 'inches', 'value': 2.3}}, 'pages': 1754, 'date_published': '2002-10-01', 'subjects': ['Literature & Fiction', 'Classics', 'Dramas & Plays', 'British & Irish', 'Shakespeare', 'History & Criticism', 'Movements & Periods', 'Genres & Styles', 'World Literature', 'European', 'Contemporary', 'Literary', 'Reference', 'Self Service', 'Custom Stores'], 'authors': ['William Shakespeare'], 'title': 'The Complete Pelican Shakespeare', 'isbn13': '9780141000589', 'msrp': 77, 'binding': 'Hardcover', 'isbn': '0141000589', 'isbn10': '0141000589'}}