{'book': {'publisher': 'Oxford University Press', 'synopsis': 'At once a vigorous translation of one of Euripides\' most subtle and witty plays, and a wholly fresh interpretation, this version reveals for the first time the extraordinary formal beauty and thematic concentration of the Alcestis.<br/>The late William Arrowsmith, who was an eminent classical scholar, translator, and General Editor of this highly praised series, rejects the standard view of the Alcestis as a psychological study of the egotist Admetos and his naive but devoted wife. His translation, instead, presents the play as a drama of human existence--in keeping with the tradition of Greek tragedy--with recognizably human characters who also represent masked embodiments of human conditions. The Alcestis thus becomes a metaphysical tragicomedy in which Admetos, who has heretofore led a life without limitations, learns to "think mortal thoughts." He acquires the knowledge of limits--the acceptance of death as well as the duty to live--which, according to Euripides, makes people meaningfully human and capable of both courage and compassion. This new interpretation compellingly argues that, for Euripides, suffering humanizes, that exemption makes a man selfish and childish, and that only the courage to accept both life and death leads to the realization of one\'s humanity, and, in the case of Alcestis, to heroism.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/16/66/9780195061666.jpg', 'title_long': 'Alcestis (Greek Tragedy in New Translations)', 'edition': 'New edition', 'dimensions': 'Height: 5.38 Inches, Length: 0.3 Inches, Weight: 0.41446905256 Pounds, Width: 8 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 0.3}, 'width': {'unit': 'inches', 'value': 8}, 'weight': {'unit': 'pounds', 'value': 0.41446905256}, 'height': {'unit': 'inches', 'value': 5.38}}, 'pages': 142, 'date_published': '1990-02-01', 'subjects': ['Literature & Fiction', 'Dramas & Plays', 'Ancient & Classical', 'History & Criticism', 'Movements & Periods', 'Medical Books', 'Medicine', 'Internal Medicine', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Euripides'], 'title': 'Alcestis (Greek Tragedy in New Translations)', 'isbn13': '9780195061666', 'msrp': 16.95, 'binding': 'Paperback', 'isbn': '0195061667', 'isbn10': '0195061667'}}