{'book': {'publisher': 'University of Chicago Press', 'synopsis': 'In Love, Sex & Tragedy Simon Goldhill lifts the veil on our inheritance of classical traditions and offers a witty, engrossing survey of the Greek and Roman roots of everything from our overwhelming mania for "hard bodies" to our political systems. Encompassing Karl Marx, Clark Gable, George W. Bush, Oscar Wilde, and Sigmund Freud, Goldhill takes great delight in tracing both follies and fundamental philosophical questions through the centuries and continents to the birthplace of Western civilization as we know it. Underlying his brisk and learned excursions through history and art is the foundational belief, following Cicero, that learning about the classics makes a critical difference to our self-understanding. Whether we are considering the role of religion in contemporary society, our expectations about the boundaries between public and private life, or even how we spend our free time, recognizing the role of the classics is integral to our comprehension of modern life and our place in it.<br/><br/>"Confident, intelligent and assertive; [Love, Sex & Tragedy] stands up for \'classics\' without apology, without snobbishness and without conservatism."—Oliver Taplin, Guardian<br/><br/>"Goldhill . . . takes us through the looking glass into antiquity and shows us some of the sights that he thinks most interesting and informative. . . . Anyone who goes on the journey will be amused, surprised, and enlightened."—Mary K. Lefkowitz, New York Sun<br/><br/>"A passionate, witty, and broad-ranging exploration of the ancient foundations of our world. . . . There is a widening gap between our perceptions and the ancient sources. Goldhill closes that gap with this lively and multi-layered challenge to assumptions embedded in modern life."—Lizzie Speller, Observer', 'language': 'en', 'image': 'https://images.isbndb.com/covers/11/98/9780226301198.jpg', 'title_long': 'Love, Sex & Tragedy: How the Ancient World Shapes Our Lives', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.04058187664 Pounds, Width: 0.9 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.9}, 'weight': {'unit': 'pounds', 'value': 1.04058187664}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 345, 'date_published': '2005-11-01', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Movements & Periods'], 'authors': ['Simon Goldhill'], 'title': 'Love, Sex & Tragedy: How the Ancient World Shapes Our Lives', 'isbn13': '9780226301198', 'msrp': 16, 'binding': 'Paperback', 'isbn': '0226301192', 'isbn10': '0226301192'}}