{'book': {'publisher': 'University of Chicago Press', 'synopsis': 'David Grene, one of the best known translators of the Greek classics, splendidly captures the peculiar quality of Herodotus, the father of history.<br/><br/>Here is the historian, investigating and judging what he has seen, heard, and read, and seeking out the true causes and consequences of the great deeds of the past. In his History, the war between the Greeks and Persians, the origins of their enmity, and all the more general features of the civilizations of the world of his day are seen as a unity and expressed as the vision of one man who as a child lived through the last of the great acts in this universal drama.<br/><br/>In Grene\'s remarkable translation and commentary, we see the historian as a storyteller, combining through his own narration the skeletal "historical" facts and the imaginative reality toward which his story reaches. Herodotus emerges in all his charm and complexity as a writer and the first historian in the Western tradition, perhaps unique in the way he has seen the interrelation of fact and fantasy.<br/><br/>"Reading Herodotus in English has never been so much fun. . . . Herodotus crowds his fresco-like pages with all shades of humanity. Whether Herodotus\'s view is \'tragic,\' mythical, or merely common sense, it provided him with a moral salt with which the diversity of mankind could be savored. And savor it we do in David Grene\'s translation."—Thomas D\'Evelyn, Christian Science Monitor<br/><br/>"Grene\'s work is a monument to what translation intends, and to what it is hungry to accomplish. . . . Herodotus gives more sheer pleasure than almost any other writer."—Peter Levi, New York Times Book Review', 'language': 'en', 'image': 'https://images.isbndb.com/covers/77/09/9780226327709.jpg', 'title_long': 'The History: Herodotus', 'edition': 'Book Club Edition', 'dimensions': 'Height: 8.25 Inches, Length: 6 Inches, Weight: 2 Pounds, Width: 2 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 2}, 'weight': {'unit': 'pounds', 'value': 2}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 710, 'date_published': '1987-03-15', 'subjects': ['History', 'Ancient Civilizations', 'Greece'], 'authors': ['Herodotus'], 'title': 'The History: Herodotus', 'isbn13': '9780226327709', 'msrp': 35, 'binding': 'Hardcover', 'related': {'Kindle Edition': '0226327752', 'eBook': '0226327752'}, 'isbn': '0226327701', 'isbn10': '0226327701', 'other_isbns': [{'isbn': '9780226327754', 'binding': 'ebook'}]}}