{'book': {'publisher': 'Ft Pr', 'synopsis': '“I had been in derivatives for over 25 years. Many traders hadn\'t been born when I stumbled accidentally into the arcane world of derivatives trading. The Indonesians were at the fag end of that career. How did I get there? I had followed the money. I had ridden the tide and currents of financial markets. I had not known very much then. Even now I only knew the many unknowns. How did I get here? It was a very long story. Send Traders, Guns and Money is that story…..”<br/>Warren Buffet once labelled derivatives “financial weapons of mass destruction”. Unlike the military kind, financial WMD are not hard to find. Many great companies use them. These businesses use derivatives to make money or protect them from risk. It’s a simple case of greed or fear. Or is it?<br/>In derivatives, whoever you are, there are things that you don’t know that you don’t know. These are the real risks of derivatives. They’re generally left to the client to discover. So, if you’re entering the dazzling world of derivatives, ask yourself this: What do I know? What do I need to know? What don’t I know? What am I doing?<br/>You can find the answers in Traders, Guns & Money, a sensational and controversial first-person account of the business of derivatives trading and the financial products industry in the spirit of Liar’s Poker. It is a true insider’s view of the business of trading and marketing derivatives for a living. It details the nature of the business, the players, how money is made and lost, and the deceptions that underlie the entire process.<br/>Funny and poignant, and written in a wry and wickedly comic style, the book provides the ordinary reader with an insight into the seeming madness that underlies financial markets and the out-of-control process that is trading in complex financial products that few understand.<br/>Traders, Guns & Money throws light on the culture, games, and pure deceptions played out every day in trading rooms around the world, and played out with other people’s money. It describes the processes by which a small group of gifted, if avaricious, individuals parlay their knowledge of the arcane world of financial products into wealth, leaving shareholders, clients, regulators, and the tax paying ordinary public to bear most of the risk.<br/>This is the story of how one set of clients discovered the perils of unknowns in a derivatives deal. This tale will leave you amazed, and this book will make it all clear.In the sometimes dazzling world of derivatives, Traders Guns & Money shows you how we got here and tells it how it is. Go on, follow the money.<br/>An accessible companion and a wise counsel, Traders, Guns & Money weaves together three core themes:<br/>Known unkowns: if you’re entering the dazzling world of derivatives, ask yourself this: What do I know? What do I need to know? What don’t I know? What am I doing? This book will make it all clear.<br/>Follow the money: an insider’s, expert witness account of the rise and rules of the world of derivatives. This book will show you how we got here and tell it how it is<br/>Send traders guns & money: the story of how one set of clients discovered the perils of unknowns in a derivatives deal . This tale will leave you amazed, but wiser.<br/>"Ever since Warren Buffett memorably described derivatives as "financial weapons of mass destruction" there has been a thriller waiting to be written about them. Derivatives have frightened otherwise right-thinking people for some time. In part this reflects a natural tendency to fear what we do not understand." Financial Times', 'language': 'en', 'image': 'https://images.isbndb.com/covers/47/44/9780273704744.jpg', 'title_long': 'Traders, Guns & Money: Knowns And Unknowns in the Dazzling World of Derivatives', 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 6 Inches, Weight: 1.44623243872 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 1.44623243872}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 334, 'date_published': '2006-05-15', 'subjects': ['Business & Money', 'Economics', 'Finance', 'Investing', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Satyajit Das'], 'title': 'Traders, Guns & Money: Knowns And Unknowns in the Dazzling World of Derivatives', 'isbn13': '9780273704744', 'msrp': 29.99, 'binding': 'Paperback', 'isbn': '0273704745', 'isbn10': '0273704745'}}