{'book': {'publisher': 'Picador', 'synopsis': 'Discover the Boundless Transformation of Life and Time<br/><br/>Welcome to the curated universe of Michael Cunningham\'s compelling novel, Specimen Days. Crafted with the elegance and power synonymous with this Pulitzer prize-winning author, this intricate work harmoniously blends literary fiction, historical narratives, and riveting science fiction. It\'s a bold exploration of New York City and the ultimate direction of America\'s destiny.<br/><br/>The novel masterfully weaves three riveting stories, each one echoing with the presence of characters familiar but uniquely adapted to their own era.<br/><br/>The first tale, "In the Machine," throws us back to the height of the industrial revolution, a chilling ghost story of humanity wrestling with the alien concepts of the new machine age.<br/><br/>Our journey continues with "The Children\'s Crusade," a thrilling narrative set in the 21st century, where a terrifying chain of seemingly random bombings plague a metropolis forcing us to examine the shadows of crisis and terror.<br/><br/>"Like Beauty" envisions New York 150 years into the future, a city teetering on the edge of collapse under the weight of refugees from Earth\'s first extraterrestrial contact.<br/><br/>Promising an immersive, transformative, and genre-blending literary experience, this imaginative narrative illuminates the transcendent interconnectedness of time, humanity, and destiny.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/50/29/9780312425029.jpg', 'title_long': 'Specimen Days: A Novel', 'edition': 'First Edition', 'dimensions': 'Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.95 Pounds, Width: 0.7850378 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.7850378}, 'weight': {'unit': 'pounds', 'value': 0.95}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 336, 'date_published': '2006-04-18', 'subjects': ['Literature & Fiction', 'Short Stories & Anthologies', 'Short Stories', 'United States', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors': ['Michael Cunningham'], 'title': 'Specimen Days: A Novel', 'isbn13': '9780312425029', 'msrp': 18, 'binding': 'Paperback', 'isbn': '0312425023', 'isbn10': '0312425023', 'other_isbns': [{'isbn': '9780374706241', 'binding': 'print'}]}}