{'book': {'publisher': 'Random House Inc.', 'synopsis': 'In one complete volume, here are the five classic novels from Douglas Adams’s beloved Hitchhiker series.<br/><br/>Now celebrating the pivotal 42nd anniversary of The Hitchhiker’s Guide to the Galaxy, soon to be a Hulu original series!<br/><br/>The Hitchhiker’s Guide to the Galaxy (Nominated as one of America’s best-loved novels by PBS’s The Great American Read)<br/>Seconds before the Earth is demolished for a galactic freeway, Arthur Dent is saved by Ford Prefect, a researcher for the revised Guide. Together they stick out their thumbs to the stars and begin a wild journey through time and space.<br/><br/>The Restaurant at the End of the Universe<br/>The moment before annihilation at the hands of warmongers is a curious time to crave tea. It could only happen to the cosmically displaced Arthur Dent and his comrades as they hurtle across the galaxy in a desperate search for a place to eat.<br/><br/>Life, the Universe and Everything<br/>The unhappy inhabitants of planet Krikkit are sick of looking at the night sky– so they plan to destroy it. The universe, that is. Now only five individuals can avert Armageddon: mild-mannered Arthur Dent and his stalwart crew.<br/><br/>So Long, and Thanks for All the Fish<br/>Back on Earth, Arthur Dent is ready to believe that the past eight years were all just a figment of his stressed-out imagination. But a gift-wrapped fishbowl with a cryptic inscription thrusts him back to reality. So to speak.<br/><br/>Mostly Harmless<br/>Just when Arthur Dent makes the terrible mistake of starting to enjoy life, all hell breaks loose. Can he save the Earth from total obliteration? Can he save the Guide from a hostile alien takeover? Can he save his daughter from herself?<br/><br/>Includes the bonus story “Young Zaphod Plays It Safe”<br/><br/>“With droll wit, a keen eye for detail and heavy doses of insight . . . Adams makes us laugh until we cry.”—San Diego Union-Tribune<br/><br/>“Lively, sharply satirical, brilliantly written . . . ranks with the best set pieces in Mark Twain.”—The Atlantic', 'language': 'en', 'image': 'https://images.isbndb.com/covers/37/47/9780345453747.jpg', 'title_long': "The Ultimate Hitchhiker's Guide to the Galaxy", 'dimensions': 'Height: 1.25 Inches, Length: 9 Inches, Width: 6 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 9}, 'width': {'unit': 'inches', 'value': 6}, 'height': {'unit': 'inches', 'value': 1.25}}, 'pages': 832, 'date_published': '1900-01-01', 'subjects': ['Literature & Fiction', 'Humor & Satire', 'Satire', 'Humorous', 'Science Fiction & Fantasy', 'Science Fiction', 'Adventure', 'Space Opera'], 'authors': ['Douglas Adams'], 'title': "The Ultimate Hitchhiker's Guide to the Galaxy", 'isbn13': '9780345453747', 'msrp': 20, 'binding': 'Paperback', 'related': {'ePub': '0307498468'}, 'isbn': '0345453743', 'isbn10': '0345453743', 'other_isbns': [{'isbn': '9780307498465', 'binding': 'printisbn'}]}}