{'book': {'publisher': 'W. W. Norton & Company', 'synopsis': 'This Norton Critical Edition of Death and the King\'s Horseman is the only student edition available in the United States. Based on events that took place in 1946 in the ancient Yoruban city of Oyo, Soyinka\'s acclaimed and powerful play addresses classic issues of cultural conflict, tragic decision-making, and the psychological mindsets of individuals and groups. The text of the play is accompanied by an introduction and explanatory annotations for the many allusions to traditional Nigerian myth and culture. "Backgrounds and Sources" helps readers understand Death and the King\'s Horseman\'s traditional African contexts and the role of theater in African culture. Included are a map of Yoruba-land, discussions of Yoruban religious beliefs and cultural traditions, Soyinka on the various forms that theater has taken in African culture in order to survive, and Anthony Appiah on Soyinka\'s struggle with the problem of African identity in the creation of Death and the King\'s Horseman. Commentary on the play as both a theatrical production and a classroom text is provided by Gerald Moore, Tanure Ojaide, and Martin Rohmer.<br/><br/>"Criticism" collects nine major essays on the play and the difficulties it presents to readers. Contributors include D. S. Izevbaye, Eldred Durosimi Jones, Henry Louis Gates Jr., Biodun Jeyifo, Wole Soyinka, Joan Hepburn, Adebayo Williams, David Richards, and Olakunle George.<br/><br/>A Chronology and Selected Bibliography are also included.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/76/15/9780393977615.jpg', 'title_long': "Death and the King's Horseman: Authoritative Text, Backgrounds and Contexts, Criticism, Norton", 'edition': 'First Edition', 'dimensions': 'Height: 8.4 Inches, Length: 5.2 Inches, Weight: 0.6 Pounds, Width: 0.6 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.2}, 'width': {'unit': 'inches', 'value': 0.6}, 'weight': {'unit': 'pounds', 'value': 0.6}, 'height': {'unit': 'inches', 'value': 8.4}}, 'pages': 228, 'date_published': '2002-11-05', 'subjects': ['Literature & Fiction', 'Dramas & Plays', 'British & Irish', 'History & Criticism', 'Regional & Cultural'], 'authors': ['Wole Soyinka'], 'title': "Death and the King's Horseman: Authoritative Text, Backgrounds and Contexts, Criticism, Norton", 'isbn13': '9780393977615', 'msrp': 2.39, 'binding': 'Paperback', 'isbn': '0393977617', 'isbn10': '0393977617'}}