{'book': {'publisher': 'NAL', 'synopsis': "A remarkable series of lectures on the art of creating effective nonfiction by one of the 20th century's most profound writers and thinkers--now available for the first time in print.<br/>Culled from sixteen informal lectures Ayn Rand delivered to a select audience in the late 1960s, this remarkable work offers indispensable guidance to the aspiring writer of nonfiction while providing readers with a fascinating discourse on art and creation. Based on the concept that the ability to create quality nonfiction is a skill that can be learned like any other, The Art of Nonfiction takes readers through the writing process, step-by-step, providing insightful observations and invaluable techniques along the way.<br/>In these edited transcripts, Rand discusses the psychological aspects of writing, and the different roles played by the conscious and unconscious minds. From choosing a subject to polishing a draft to mastering an individual writing style--for authors of theoretical works or those leaning toward journalistic reporting--this crucial resource introduces the words and ideas of one of our most enduring authors to a new generation.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/23/15/9780452282315.jpg', 'title_long': 'The Art of Nonfiction: A Guide for Writers and Readers', 'edition': 'First Edition', 'dimensions': 'Height: 7.9 Inches, Length: 5.23 Inches, Weight: 0.38801358112 Pounds, Width: 0.47 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.23}, 'width': {'unit': 'inches', 'value': 0.47}, 'weight': {'unit': 'pounds', 'value': 0.38801358112}, 'height': {'unit': 'inches', 'value': 7.9}}, 'pages': 208, 'date_published': '2001-02-01', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Reference', 'Foreign Language Study & Reference', 'Words, Language & Grammar', 'Writing, Research & Publishing Guides', 'Writing'], 'authors': ['Ayn Rand'], 'title': 'The Art of Nonfiction: A Guide for Writers and Readers', 'isbn13': '9780452282315', 'msrp': 16, 'binding': 'Paperback', 'related': {'Kindle Edition': '1101137290', 'ePub': '1101137290'}, 'isbn': '0452282314', 'isbn10': '0452282314', 'other_isbns': [{'isbn': '9781101137291', 'binding': 'print'}]}}