{'book': {'publisher': 'Wiley', 'synopsis': "Buffett is back . . . and better than before!<br/>A decade has passed since the book that introduced the world to Warren Buffett -- The Warren Buffett Way by Robert Hagstrom -- first appeared. That groundbreaking book spent 21 weeks on the New York Times Hardcover Nonfiction Bestseller list and sold over 1 million copies.<br/>Since then, Warren Buffett has solidified his reputation as the greatest investor of all time -- becoming even richer and more successful, despite the wild fluctuation of the markets. How does this value investing legend continue to do it? That's where Robert Hagstrom and the Second Edition of The Warren Buffet Way come in. This edition is a completely revised and updated look at the Oracle of Omaha -- comprising Buffett's numerous investments and accomplishments over the past ten years, as well as the timeless and highly successful investment strategies and techniques he has always used to come out a market winner. This edition is especially accessible as Buffett's basic tenets of investing are presented and illuminated with relevant and up to date examples.<br/>Order your copy today!", 'language': 'en', 'image': 'https://images.isbndb.com/covers/36/75/9780471743675.jpg', 'title_long': 'The Warren Buffett Way, Second Edition', 'edition': '2', 'dimensions': 'Height: 9.0507693 Inches, Length: 6.051169 Inches, Weight: 0.71209310626 Pounds, Width: 0.779526 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.051169}, 'width': {'unit': 'inches', 'value': 0.779526}, 'weight': {'unit': 'pounds', 'value': 0.71209310626}, 'height': {'unit': 'inches', 'value': 9.0507693}}, 'pages': 272, 'date_published': '2005-10-04', 'subjects': ['Biographies & Memoirs', 'Professionals & Academics', 'Business', 'Business & Money', 'Investing', 'Self Service', 'Custom Stores'], 'authors': ['Robert G. Hagstrom'], 'title': 'The Warren Buffett Way, Second Edition', 'isbn13': '9780471743675', 'msrp': 10.16, 'binding': 'Paperback', 'isbn': '0471743674', 'isbn10': '0471743674'}}