{'book': {'publisher': 'Thames & Hudson', 'synopsis': 'From its roots in the development of printing, graphic design has evolved as a means of identification, information, and promotion to become a profession and discipline in its own right. This authoritative documentary history begins with the poster and goes on to chart the development of word and image in brochures and magazines, advertising, corporate identity, television, and electronic media, and the impact of technical innovations such as photography and the computer. For the revised edition, a new final chapter covers all the recent international developments in graphic design, including the role of the computer and the Internet in design innovation and globalization. In the last years of the twentieth century, at a time when "designer products" and the use of logos grew in importance, the role of graphic designers became more complex, subversive, and sometimes more political―witness Oliviero Toscani\'s notorious advertisements for Benetton. Digital technology cleared the way for an astonishing proliferation of new typefaces, and words began to take second place to typography in a whole range of magazines and books as designers asserted the primacy of their medium. Designers and companies discussed here include Neville Brody, David Carson, Design Writing Research, Edward Fella, Tibor Kalman, Jeffery Keedy, LettError, Pierre di Sciullo, Tomato, Gerard Unger, Cornel Windlin, and a host of others. Over 800 illustrations, 30 in color', 'language': 'en', 'image': 'https://images.isbndb.com/covers/34/77/9780500203477.jpg', 'title_long': 'Graphic Design: A Concise History, Second Edition (World of Art)', 'edition': 'Second', 'dimensions': 'Height: 8.3 Inches, Length: 5.9 Inches, Weight: 1.0802650838 Pounds, Width: 0.7 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.9}, 'width': {'unit': 'inches', 'value': 0.7}, 'weight': {'unit': 'pounds', 'value': 1.0802650838}, 'height': {'unit': 'inches', 'value': 8.3}}, 'pages': 232, 'date_published': '2002-06', 'subjects': ['Arts & Photography', 'History & Criticism', 'History', 'Graphic Design', 'Techniques', 'Computers & Technology'], 'authors': ['Richard Hollis'], 'title': 'Graphic Design: A Concise History, Second Edition (World of Art)', 'isbn13': '9780500203477', 'msrp': 23.95, 'binding': 'Paperback', 'isbn': '0500203474', 'isbn10': '0500203474'}}