{'book': {'publisher': 'Bantam', 'synopsis': "In the years since its publication in 1988, Stephen Hawking's A Brief History Of Time has established itself as a landmark volume in scientific writing. It has become an international publishing phenomenon, translated into forty languages and selling over nine million copies. The book was on the cutting edge of what was then known about the nature of the universe, but since that time there have been extraordinary advances in the technology of macrocosmic worlds. These observations have confirmed many of Professor Hawkin's theoretical predictions in the first edition of his book, including the recent discoveries of the Cosmic Background Explorer satellite (COBE), which probed back in time to within 300,000 years of the fabric of space-time that he had projected.<br/><br/>Eager to bring to his original text the new knowledge revealed by these many observations, as well as his recent research, for this expanded edition Professor Hawking has prepared a new introduction to the book, written an entirely new chapter on the fascinating subject of wormholes and time travel, and updated the original chapters.<br/><br/>In addition, to heighten understanding of complex concepts that readers may have found difficult to grasp despite the clarity and wit of Professor Hawking's writing, this edition is enhanced throughout with more than 240 full-color illustrations, including satellite images, photographs made made possible by spectacular technological advance such as the Hubble Space Telescope, and computer generated images of three and four-dimensional realities. Detailed captions clarify these illustrations, enable readers to experience the vastness of intergalactic space, the nature of black holes, and the microcosmic world of particle physics in which matters and antimatter collide.<br/><br/>A classic work that now brings to the reader the latest understanding of cosmology, A Brief History Of Time is the story of the ongoing search for t he tantalizing secrets at the heart of time and space.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/37/48/9780553103748.jpg', 'title_long': 'The Illustrated Brief History of Time, Updated and Expanded Edition', 'edition': 'Updated,Subsequent', 'dimensions': 'Height: 10.2 Inches, Length: 7.8 Inches, Weight: 1.873929227 Pounds, Width: 0.8 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.8}, 'width': {'unit': 'inches', 'value': 0.8}, 'weight': {'unit': 'pounds', 'value': 1.873929227}, 'height': {'unit': 'inches', 'value': 10.2}}, 'pages': 248, 'date_published': '1996-10-01', 'subjects': ['Science & Math', 'Astronomy & Space Science', 'Astronomy', 'Astrophysics & Space Science', 'Cosmology', 'Evolution', 'Physics'], 'authors': ['Stephen Hawking'], 'title': 'The Illustrated Brief History of Time, Updated and Expanded Edition', 'isbn13': '9780553103748', 'msrp': 40, 'binding': 'Hardcover', 'isbn': '0553103741', 'isbn10': '0553103741'}}