{'book': {'publisher': 'Bantam', 'synopsis': 'FROM ONE OF THE MOST BRILLIANT MINDS OF OUR TIME COMES A BOOK THAT CLARIFIES HIS MOST IMPORTANT IDEAS<br/><br/>Stephen Hawking’s worldwide bestseller A Brief History of Time remains a landmark volume in scientific writing. But for readers who have asked for a more accessible formulation of its key concepts—the nature of space and time, the role of God in creation, and the history and future of the universe—A Briefer History of Time is Professor Hawking’s response.<br/><br/>Although “briefer,” this book is much more than a mere explanation of Hawking’s earlier work. A Briefer History of Time both clarifies and expands on the great subjects of the original, and records the latest developments in the field—from string theory to the search for a unified theory of all the forces of physics. Thirty-seven full-color illustrations enhance the text and make A Briefer History of Time an exhilarating and must-have addition in its own right to the great literature of science and ideas.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/43/62/9780553804362.jpg', 'title_long': 'A Briefer History of Time: A Special Edition of the Science Classic', 'dimensions': 'Height: 9.32 Inches, Length: 6.29 Inches, Weight: 1.19 Pounds, Width: 0.72 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.29}, 'width': {'unit': 'inches', 'value': 0.72}, 'weight': {'unit': 'pounds', 'value': 1.19}, 'height': {'unit': 'inches', 'value': 9.32}}, 'pages': 176, 'date_published': '2005-09-27', 'subjects': ['Science & Math', 'Astronomy & Space Science', 'Astronomy', 'Astrophysics & Space Science', 'Cosmology', 'Evolution'], 'authors': ['Stephen Hawking', 'Leonard Mlodinow'], 'title': 'A Briefer History of Time: A Special Edition of the Science Classic', 'isbn13': '9780553804362', 'msrp': 27, 'binding': 'Hardcover', 'related': {'Kindle Edition': '0307417840'}, 'isbn': '0553804367', 'isbn10': '0553804367', 'other_isbns': [{'isbn': '9780307417848', 'binding': 'print'}]}}