{'book': {'publisher': 'Mariner Books', 'synopsis': 'The official, fully authorized full-color guide to the characters, places, and landscapes of J.R.R. Tolkien\'s Middle-earth as depicted in The Lord of the Rings movie trilogy.<br/><br/>Fully illustrated with almost 300 color photographs, including stunning new images from the extended director\'s versions of The Fellowship of the Ring and The Two Towers, and exclusive "first-look" shots from The Return of the King, this Complete Visual Companion now tells the whole tale of The Lord of the Rings in sumptuous detail.<br/><br/>The many characters, creatures, and strange lands of Middle-earth encountered by the Fellowship of the Ring in their epic journey are here brought to life: from the magical Elven realms of Rivendell and Lothlorien to the abandoned Dwarven kingdom of Moria; from the wizard Saruman\'s stronghold at Isengard to the land of the Horse-lords, Rohan; from their last-ditch fortress at Helm\'s Deep to Minas Tirith, the city-kingdom of the proud Men of Gondor; from the haunted Paths of the Dead to the battlefields of Pelennor and the overrun city of Osgiliath; from Cirith Ungol and the Nazgul\'s tower of sorcery at Minas Morgul into the very heart of Mordor. Along the way our heroes will encounter Elves and Ents, Uruk-hai and Orcs, Trolls, and Haradrim on their towering war-elephants, the mumakil. The Companion introduces readers to the monstrous Shelob the spider, to the Corsairs of Umbar, and to that pitiful but deadly creature Gollum.<br/><br/>This omnibus edition also includes brand-new sections appearing in print for the first time, which take the story of the quest of the Fellowship beyond Mount Doom, all the way to the hearbreaking finale at the Grey Havens.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/08/25/9780618510825.jpg', 'title_long': 'The Lord of the Rings Complete Visual Companion', 'dimensions': 'Height: 10.75 Inches, Length: 8.5 Inches, Weight: 1.8 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.5}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 1.8}, 'height': {'unit': 'inches', 'value': 10.75}}, 'pages': 224, 'date_published': '2004', 'subjects': ['Science Fiction & Fantasy', 'Fantasy', 'Epic'], 'authors': ['Jude Fisher'], 'title': 'The Lord of the Rings Complete Visual Companion', 'isbn13': '9780618510825', 'msrp': 45.83, 'binding': 'Paperback', 'isbn': '0618510826', 'isbn10': '0618510826'}}