{'book': {'publisher': 'Viking', 'synopsis': 'With the delectable wit, unforgettable characters, and challenging themes that have won her a Pulitzer Prize and national bestseller status, Jane Smiley naturally finds a kindred spirit in the author of classics such as Great Expectations and A Christmas Carol. As "his novels shaped his life as much as his life shaped his novels," Smiley\'s Charles Dickens is at once a sensitive profile of the great master and a fascinating meditation on the writing life.<br/><br/>Smiley evokes Dickens as he might have seemed to his contemporaries: convivial, astute, boundlessly energetic-and lionized. As she makes clear, Dickens not only led the action-packed life of a prolific writer, editor, and family man but, balancing the artistic and the commercial in his work, he also consciously sustained his status as one of the first modern "celebrities."<br/><br/>Charles Dickens offers brilliant interpretations of almost all the major works, an exploration of his narrative techniques and his innovative voice and themes, and a reflection on how his richly varied lower-class cameos sprang from an experience and passion more personal than his public knew. Smiley\'s own "demon narrative intelligence" (The Boston Globe) touches, too, on controversial details that include Dickens\'s obsession with money and squabbles with publishers, his unhappy marriage, and the rumors of an affair.<br/><br/>Here is a fresh look at the dazzling personality of a verbal magician and the fascinating times behind the classics we read in school and continue to enjoy today.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/07/74/9780670030774.jpg', 'title_long': 'Charles Dickens (Penguin Lives)', 'dimensions': 'Height: 7.75 Inches, Length: 5.5 Inches, Weight: 0.7 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.7}, 'height': {'unit': 'inches', 'value': 7.75}}, 'pages': 224, 'date_published': '2002-05-13', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Self Service', 'Custom Stores'], 'authors': ['Jane Smiley'], 'title': 'Charles Dickens (Penguin Lives)', 'isbn13': '9780670030774', 'msrp': 22.95, 'binding': 'Hardcover', 'related': {'Kindle Edition': '1101215437', 'ePub': '1101215437'}, 'isbn': '0670030775', 'isbn10': '0670030775', 'other_isbns': [{'isbn': '9781101215432', 'binding': 'print'}]}}