{'book': {'publisher': 'Simon & Schuster', 'synopsis': 'The National Book Award–winning biography that tells the story of how young Teddy Roosevelt transformed himself from a sickly boy into the vigorous man who would become a war hero and ultimately president of the United States, told by master historian David McCullough.<br/><br/>Mornings on Horseback is the brilliant biography of the young Theodore Roosevelt. Hailed as “a masterpiece” (John A. Gable, Newsday), it is the winner of the Los Angeles Times 1981 Book Prize for Biography and the National Book Award for Biography. Written by David McCullough, the author of Truman, this is the story of a remarkable little boy, seriously handicapped by recurrent and almost fatal asthma attacks, and his struggle to manhood: an amazing metamorphosis seen in the context of the very uncommon household in which he was raised.<br/><br/>The father is the first Theodore Roosevelt, a figure of unbounded energy, enormously attractive and selfless, a god in the eyes of his small, frail namesake. The mother, Mittie Bulloch Roosevelt, is a Southerner and a celebrated beauty, but also considerably more, which the book makes clear as never before. There are sisters Anna and Corinne, brother Elliott (who becomes the father of Eleanor Roosevelt), and the lovely, tragic Alice Lee, TR’s first love. All are brought to life to make “a beautifully told story, filled with fresh detail” (The New York Times Book Review).<br/><br/>A book to be read on many levels, it is at once an enthralling story, a brilliant social history and a work of important scholarship which does away with several old myths and breaks entirely new ground. It is a book about life intensely lived, about family love and loyalty, about grief and courage, about “blessed” mornings on horseback beneath the wide blue skies of the Badlands.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/75/40/9780671447540.jpg', 'title_long': 'Mornings on Horseback: The Story of an Extraordinary Family, a Vanished Way of Life and the Unique Child Who Became Theodore Roosevelt', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.125 Inches, Weight: 1.34922904344 Pounds, Width: 1.12 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.125}, 'width': {'unit': 'inches', 'value': 1.12}, 'weight': {'unit': 'pounds', 'value': 1.34922904344}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 448, 'date_published': '1982-05-12', 'subjects': ['Biographies & Memoirs', 'Historical', 'United States', 'Leaders & Notable People', 'Presidents & Heads of State', 'History', 'Americas', 'Self Service', 'Custom Stores'], 'authors': ['David McCullough'], 'title': 'Mornings on Horseback: The Story of an Extraordinary Family, a Vanished Way of Life and the Unique Child Who Became Theodore Roosevelt', 'isbn13': '9780671447540', 'msrp': 12.39, 'binding': 'Paperback', 'related': {'ePub': '0743218302'}, 'isbn': '0671447548', 'isbn10': '0671447548', 'other_isbns': [{'isbn': '9780743218306', 'binding': 'print'}]}}