{'book': {'publisher': 'Harvard University Press', 'synopsis': 'Classic political realism.<br/><br/>Thucydides of Athens was born about 471 BC. He saw the rise of Athens to greatness under the inspired leadership of Pericles. In 430, the second year of the Peloponnesian War, he caught and survived the horrible plague that he described so graphically. Later, as general in 423 he failed to save Amphipolis from the enemy and was disgraced. He tells us about this, not in volumes of self-justification, but in one sentence of his history of the war―that it befell him to be an exile for twenty years. He then lived probably on his property in Thrace, but was able to observe both sides in certain campaigns of the war, and returned to Athens after her defeat in 404. He had been composing his famous history, with its hopes and horrors, triumphs and disasters, in full detail from first-hand knowledge, along with the accounts of others.<br/><br/>The war was really three conflicts with one uncertain peace after the first; and Thucydides had not unified them into one account when death came sometime before 396. His history of the first conflict, 431–421, was nearly complete; Thucydides was still at work on this when the war spread to Sicily and into a conflict (415–413) likewise complete in his awful and brilliant record, though not fitted into the whole. His story of the final conflict of 413–404 breaks off (in the middle of a sentence) when dealing with the year 411. So his work was left unfinished and as a whole unrevised. Yet in brilliance of description and depth of insight this history has no superior.<br/><br/>The Loeb Classical Library edition of Thucydides is in four volumes.', 'language': 'el', 'image': 'https://images.isbndb.com/covers/18/73/9780674991873.jpg', 'title_long': 'Thucydides: History of the Peloponnesian War, IV, Books VII and VIII (Loeb Classical Library No. 169) (Volume IV) (Greek and English Edition)', 'dimensions': 'Height: 6.37498725 Inches, Length: 4.2499915 Inches, Weight: 0.78043640748 Pounds, Width: 1.062497875 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.2499915}, 'width': {'unit': 'inches', 'value': 1.062497875}, 'weight': {'unit': 'pounds', 'value': 0.78043640748}, 'height': {'unit': 'inches', 'value': 6.37498725}}, 'pages': 459, 'date_published': '1965-01-01', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Movements & Periods'], 'authors': ['Thucydides'], 'title': 'Thucydides: History of the Peloponnesian War, IV, Books VII and VIII (Loeb Classical Library No. 169) (Volume IV) (Greek and English Edition)', 'isbn13': '9780674991873', 'msrp': 26, 'binding': 'Hardcover', 'isbn': '0674991877', 'isbn10': '0674991877'}}