{'book': {'publisher': 'Harvard University Press', 'synopsis': '“The classic of all Europe.” ―T. S. Eliot<br/><br/>Virgil (Publius Vergilius Maro) was born in 70 BC near Mantua and was educated at Cremona, Milan, and Rome. Slow in speech, shy in manner, thoughtful in mind, weak in health, he went back north for a quiet life. Influenced by the group of poets there, he may have written some of the doubtful poems included in our Virgilian manuscripts. All his undoubted extant work is written in his perfect hexameters. Earliest comes the collection of ten pleasingly artificial bucolic poems, the Eclogues, which imitated freely Theocritus’ idylls. They deal with pastoral life and love. Before 29 BC came one of the best of all didactic works, the four books of Georgics on tillage, trees, cattle, and bees. Virgil’s remaining years were spent in composing his great, not wholly finished, epic the Aeneid, on the traditional theme of Rome’s origins through Aeneas of Troy. Inspired by the Emperor Augustus’ rule, the poem is Homeric in metre and method but influenced also by later Greek and Roman literature, philosophy, and learning, and deeply Roman in spirit. Virgil died in 19 BC at Brundisium on his way home from Greece, where he had intended to round off the Aeneid. He had left in Rome a request that all its twelve books should be destroyed if he were to die then, but they were published by the executors of his will.<br/><br/>The Loeb Classical Library edition of Virgil is in two volumes.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/58/33/9780674995833.jpg', 'title_long': 'Eclogues. Georgics. Aeneid: Books 1–6 (Loeb Classical Library)', 'edition': 'Revised', 'dimensions': 'Height: 6.37498725 Inches, Length: 4.2499915 Inches, Weight: 0.8598028218 Pounds, Width: 1.262497475 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.2499915}, 'width': {'unit': 'inches', 'value': 1.262497475}, 'weight': {'unit': 'pounds', 'value': 0.8598028218}, 'height': {'unit': 'inches', 'value': 6.37498725}}, 'pages': 608, 'date_published': '1999-10-01', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Movements & Periods', 'Poetry', 'Ancient, Classical & Medieval', 'Themes & Styles', 'Ancient & Medieval Literature', 'Greek', 'Self Service', 'Custom Stores'], 'authors': ['Virgil'], 'title': 'Eclogues. Georgics. Aeneid: Books 1–6 (Loeb Classical Library)', 'isbn13': '9780674995833', 'msrp': 24, 'binding': 'Hardcover', 'isbn': '067499583X', 'isbn10': '067499583X'}}