{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': 'The definitive guide to Robert Pirsig’s Zen and the Art of Motorcycle Maintenance<br/>When Robert Pirsig’s Zen and the Art of Motorcycle Maintenance was first published in 1974, it caused a literary sensation. An entire generation was profoundly affected by the story of the narrator, his son, Chris, and their month-long motorcycle odyssey from Minnesota to California. A combination of philosophical speculation and psychological tension, the book is a complex story of relationships, values, madness, and, eventually, enlightenment.<br/>Ron Di Santo and Tom Steele have spent years investigating the background and underlying symbolism of Pirsig’s work. Together, and with the approval of Robert Pirsig, they have written a fascinating reference/companion to the original.<br/>Guidebook to Zen and the Art of Motorcycle Maintenance serves as a metaphorical backpack of supplies for the reader’s journey through the original work. With the background material, insights, and perspectives the authors provide, Guidebook to Zen and the Art of Motorcycle Maintenance is destined to become required reading for new fans of the book as well as those who have returned to it over the years.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/06/95/9780688060695.jpg', 'title_long': 'Guidebook to Zen and the Art of Motorcycle Maintenance', 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 6.12 Inches, Weight: 0.99648942424 Pounds, Width: 0.93 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.12}, 'width': {'unit': 'inches', 'value': 0.93}, 'weight': {'unit': 'pounds', 'value': 0.99648942424}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 408, 'date_published': '1990-11-19', 'subjects': ['Engineering & Transportation', 'Automotive', 'Motorcycles', 'Reference', 'Religion & Spirituality', 'Buddhism', 'Zen', 'Politics & Social Sciences', 'Philosophy', 'Eastern', 'Modern', 'Movements'], 'authors': ['Ron Di Santo', 'Tom Steele'], 'title': 'Guidebook to Zen and the Art of Motorcycle Maintenance', 'isbn13': '9780688060695', 'msrp': 16.99, 'binding': 'Paperback', 'isbn': '0688060692', 'isbn10': '0688060692'}}