{'book': {'publisher': 'University Press of Kansas', 'synopsis': 'Endlessly pursued but ever elusive, Moby-Dick roams freely throughout the American imagination. A fathomless source for literary exploration, Melville\'s masterpiece has also inspired a stunning array of book illustrations, prints, comics, paintings, sculptures, mixed media, and even architectural designs. Innovative and lavishly illustrated, Unpainted to the Last illuminates this impressive body of work and shows how it opens up our understanding of both Moby-Dick and twentieth-century American art.<br/><br/>Deftly interweaving words with images, Elizabeth Schultz radically reframes our most famous literary symbol and provides a profoundly new way of "reading" one of the key texts in American literature. Ranging from the realists to the abstract expressionists, from the famous to the obscure, Schultz reveals how these artists have tried both to capture the essence of Moby-Dick\'s many meanings and to use it as a springboard for their own provocative imaginations.<br/><br/>The most continuously, frequently, and diversely illustrated of all American novels, Moby-Dick has attracted some remarkable book illustrators in Rockwell Kent, Boardman Robinson, Garrick Palmer, Barry Moser, and Bill Sienkiewicz, among others represented here. It has also inspired extraordinary creations by such prominent artists as Jackson Pollock, Frank Stella, Sam Francis, Benton Spruance, Leonard Baskin, Theodoros Stamos, Richard Ellis, Ralph Goings, Seymour Lipton, Walter Martin, Tony Rosenthal, Richard Serra, and Theodore Roszak.<br/><br/>The artists reflect in equal measure the novel\'s realistic (plot, character, natural history) and philosophical modes, its visual and visionary dimensions. Some, like the obsessed and haunted Gilbert Wilson, claim Moby-Dick as their "Bible." Still others view the novel as a touchstone for feminist, multicultural, and environmentalist themes, or mock its status as a cultural icon.<br/><br/>Schultz demonstrates how these and many other diverse talents enlarge our appreciation of Moby-Dick and how literature and art can amplify each other\'s meanings and achievements. Yet ultimately she, like Melville, concludes that the great white whale remains unpainted and unread in any absolute or final sense.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/74/26/9780700607426.jpg', 'title_long': 'Unpainted to the Last: Moby-Dick and Twentieth-Century American Art', 'edition': 'First Edition', 'dimensions': 'Height: 11 Inches, Length: 8.25 Inches, Weight: 3.58912562536 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.25}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 3.58912562536}, 'height': {'unit': 'inches', 'value': 11}}, 'pages': 440, 'date_published': '1995-10-20', 'subjects': ['Arts & Photography', 'History & Criticism', 'Criticism', 'Themes', 'History', 'Literature & Fiction', 'Regional & Cultural'], 'authors': ['Elizabeth A. Schultz'], 'title': 'Unpainted to the Last: Moby-Dick and Twentieth-Century American Art', 'isbn13': '9780700607426', 'msrp': 35, 'binding': 'Paperback', 'isbn': '0700607420', 'isbn10': '0700607420'}}