{'book': {'publisher': 'Scribner', 'synopsis': 'A stand alone edition of Annie Proulx’s beloved story “Brokeback Mountain” (in the collection Close Range)—the basis for the major motion picture directed by Ang Lee, starring Jake Gyllenhaal and Heath Ledger, screenplay by Larry McMurtry and Diana Ossana.<br/><br/>Annie Proulx has written some of the most original and brilliant short stories in contemporary literature, and for many readers and reviewers, “Brokeback Mountain” is her masterpiece.<br/><br/>Ennis del Mar and Jack Twist, two ranch hands, come together when they’re working as sheepherder and camp tender one summer on a range above the tree line. At first, sharing an isolated tent, the attraction is casual, inevitable, but something deeper catches them that summer.<br/><br/>Both men work hard, marry, and have kids because that’s what cowboys do. But over the course of many years and frequent separations this relationship becomes the most important thing in their lives, and they do anything they can to preserve it.<br/><br/>The New Yorker won the National Magazine Award for Fiction for its publication of “Brokeback Mountain,” and the story was included in Prize Stories 1998: The O. Henry Awards. In gorgeous and haunting prose, Proulx limns the difficult, dangerous affair between two cowboys that survives everything but the world’s violent intolerance.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/13/25/9780743271325.jpg', 'title_long': 'Brokeback Mountain', 'edition': 'Media tie-in', 'dimensions': 'Height: 7.25 Inches, Length: 4.75 Inches, Weight: 0.15 Pounds, Width: 0.3 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.75}, 'width': {'unit': 'inches', 'value': 0.3}, 'weight': {'unit': 'pounds', 'value': 0.15}, 'height': {'unit': 'inches', 'value': 7.25}}, 'pages': 64, 'date_published': '2005-12-02', 'subjects': ['LGBTQ+ Books', 'Literature & Fiction', 'Genre Fiction', 'TV, Movie, Video Game Adaptations', 'Small Town & Rural', 'History & Criticism', 'Criticism & Theory', 'Short Stories & Anthologies', 'Short Stories', 'Literary', 'Politics & Social Sciences', 'Politics & Government', 'Specific Topics'], 'authors': ['Annie Proulx'], 'title': 'Brokeback Mountain', 'isbn13': '9780743271325', 'msrp': 11.66, 'binding': 'Paperback', 'related': {'Kindle Edition': '1439130973', 'ePub': '1439130973'}, 'isbn': '0743271327', 'isbn10': '0743271327', 'other_isbns': [{'isbn': '9781439130971', 'binding': 'print'}]}}