{'book': {'publisher': 'Atria Books', 'synopsis': "It started as a daydream. Poring over a map of the world at home one quiet Saturday afternoon, Ewan McGregor -- acclaimed actor and self-confessed bike nut -- noticed that it was possible to ride all the way round the world, with just one short hop across the Bering Strait from Russia to Alaska. It was a revelation he couldn't get out of his head. So he picked up the phone and called his fellow actor-slash-biker friend Charley Boorman and told him it was time to hit the road....<br/>Long Way Round<br/>Beginning in London, Ewan and Charley chased their shadows through Europe, the Ukraine, Kazakhstan, Mongolia, and Russia; across the Pacific to Alaska; then down through Canada all the way to New York. Long Way Round is the result of their four-month, 20,000-mile joyride. Featuring original diary entries, travel maps, mileage charts, and dozens of photographs, this is a freewheeling, fully charged, and uproariously entertaining book about two world-famous individuals who chose the road not taken...and made the journey worthwhile.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/93/47/9780743499347.jpg', 'title_long': 'Long Way Round: Chasing Shadows Across the World', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6 Inches, Weight: 0.9 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 320, 'date_published': '2005-11-01', 'subjects': ['Biographies & Memoirs', 'Leaders & Notable People', 'Rich & Famous', 'Travelers & Explorers', 'Engineering & Transportation', 'Automotive', 'Motorcycles', 'Travel', 'Specialty Travel', 'Adventure', 'Travel Writing'], 'authors': ['Ewan McGregor', 'Charley Boorman'], 'title': 'Long Way Round: Chasing Shadows Across the World', 'isbn13': '9780743499347', 'msrp': 13.4, 'binding': 'Paperback', 'related': {'ePub': '1416507612'}, 'isbn': '0743499344', 'isbn10': '0743499344', 'other_isbns': [{'isbn': '9781416507611', 'binding': 'print'}]}}