{'book': {'publisher': 'Pocket Books', 'synopsis': "'I can identify the exact moment when things began to change. It was a cold winter afternoon. I had just turned three.'<br/><br/>Emerging from her hiding place, Mineko encounters Madam Oima, the formidable proprietress of a prolific geisha house in Gion. Madam Oima is mesmerized by the child's black hair and black eyes: she has found her successor. And so Mineko is gently, but firmly, prised away from her parents to embark on an extraordinary profession, of which she will become the best.<br/><br/>But even if you are exquisitely beautiful and the darling of the okiya, the life of a geisha is one of gruelling professional demands. And Mineko must first contend with her bitterly jealous sister who is determined to sabotage her success...<br/><br/>Captivating and poignant, Geisha of Gion tells of Mineko's ascendancy to fame and her ultimate decision to leave the profession she found so constricting. After centuries of mystery Mineko is the only geisha to speak out. This is the true story she has long wanted to tell and the one that the West has long wanted to hear.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/05/93/9780743430593.jpg', 'title_long': "Geisha of Gion: The True Story of Japan's Foremost Geisha (Memoir of Mineko Iwasaki)", 'edition': 'UK ed.', 'dimensions': 'Height: 7.71652 Inches, Length: 5.1181 Inches, Weight: 0.6 Pounds, Width: 0.90551 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.1181}, 'width': {'unit': 'inches', 'value': 0.90551}, 'weight': {'unit': 'pounds', 'value': 0.6}, 'height': {'unit': 'inches', 'value': 7.71652}}, 'pages': 352, 'date_published': '2003', 'subjects': ['Biographies & Memoirs', 'Cultural & Regional', 'Japanese', 'Memoirs', 'Politics & Social Sciences', 'Sociology'], 'authors': ['Mineko Iwasaki', 'Rande Brown'], 'title': "Geisha of Gion: The True Story of Japan's Foremost Geisha (Memoir of Mineko Iwasaki)", 'isbn13': '9780743430593', 'msrp': 15.88, 'binding': 'Paperback', 'isbn': '074343059X', 'isbn10': '074343059X'}}