{'book': {'publisher': 'Simon & Schuster', 'synopsis': 'America’s beloved and distinguished historian presents, in a book of breathtaking excitement, drama, and narrative force, the stirring story of the year of our nation’s birth, 1776, interweaving, on both sides of the Atlantic, the actions and decisions that led Great Britain to undertake a war against her rebellious colonial subjects and that placed America’s survival in the hands of George Washington.<br/><br/>In this masterful book, David McCullough tells the intensely human story of those who marched with General George Washington in the year of the Declaration of Independence—when the whole American cause was riding on their success, without which all hope for independence would have been dashed and the noble ideals of the Declaration would have amounted to little more than words on paper.<br/><br/>Based on extensive research in both American and British archives, 1776 is a powerful drama written with extraordinary narrative vitality. It is the story of Americans in the ranks, men of every shape, size, and color, farmers, schoolteachers, shoemakers, no-accounts, and mere boys turned soldiers. And it is the story of the King’s men, the British commander, William Howe, and his highly disciplined redcoats who looked on their rebel foes with contempt and fought with a valor too little known.<br/><br/>Written as a companion work to his celebrated biography of John Adams, David McCullough’s 1776 is another landmark in the literature of American history.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/67/21/9780743226721.jpg', 'title_long': '1776', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.125 Inches, Weight: 1.25 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.125}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.25}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 386, 'date_published': '2006-06-27', 'subjects': ['Biographies & Memoirs', 'Historical', 'United States', 'Leaders & Notable People', 'Military', 'History', 'Americas', 'Teen & Young Adult', 'Education & Reference', 'Language Arts', 'Self Service', 'Custom Stores'], 'authors': ['David McCullough'], 'title': '1776', 'isbn13': '9780743226721', 'msrp': 18, 'binding': 'Paperback', 'related': {'Kindle Edition': '0743287703', 'ePub': '0743287703'}, 'isbn': '0743226720', 'isbn10': '0743226720', 'other_isbns': [{'isbn': '9780743287708', 'binding': 'print'}]}}