{'book': {'publisher': 'Simon & Schuster', 'synopsis': 'Named for the twelfth night after Christmas, the end of the Christmas season, Twelfth Night plays with love and power. The Countess Olivia, a woman with her own household, attracts Duke (or Count) Orsino. Two other would-be suitors are her pretentious steward, Malvolio, and Sir Andrew Aguecheek.<br/><br/>Onto this scene arrive the twins Viola and Sebastian; caught in a shipwreck, each thinks the other has drowned. Viola disguises herself as a male page and enters Orsino’s service. Orsino sends her as his envoy to Olivia—only to have Olivia fall in love with the messenger. The play complicates, then wonderfully untangles, these relationships.<br/><br/>The authoritative edition of Twelfth Night from The Folger Shakespeare Library, the trusted and widely used Shakespeare series for students and general readers, includes:<br/><br/>-Freshly edited text based on the best early printed version of the play<br/><br/>-Full explanatory notes conveniently placed on pages facing the text of the play<br/><br/>-Scene-by-scene plot summaries<br/><br/>-A key to the play’s famous lines and phrases<br/><br/>-An introduction to reading Shakespeare’s language<br/><br/>-An essay by a leading Shakespeare scholar providing a modern perspective on the play<br/><br/>-Fresh images from the Folger Shakespeare Library’s vast holdings of rare books<br/><br/>-An annotated guide to further reading<br/><br/>Essay by Catherine Belsey<br/><br/>The Folger Shakespeare Library in Washington, DC, is home to the world’s largest collection of Shakespeare’s printed works, and a magnet for Shakespeare scholars from around the globe. In addition to exhibitions open to the public throughout the year, the Folger offers a full calendar of performances and programs. For more information, visit Folger.edu.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/27/76/9780743482776.jpg', 'title_long': 'Twelfth Night (Folger Shakespeare Library)', 'edition': 'Illustrated', 'dimensions': 'Height: 0.9842519675 Inches, Length: 8.661417314 Inches, Weight: 0.35 Pounds, Width: 5.905511805 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.661417314}, 'width': {'unit': 'inches', 'value': 5.905511805}, 'weight': {'unit': 'pounds', 'value': 0.35}, 'height': {'unit': 'inches', 'value': 0.9842519675}}, 'pages': 272, 'date_published': '2004-07-01', 'subjects': ['Literature & Fiction', 'Dramas & Plays', 'British & Irish', 'Comedy', 'Ancient & Classical', 'Shakespeare', 'Reference', 'Self Service', 'Custom Stores'], 'authors': ['William Shakespeare'], 'title': 'Twelfth Night (Folger Shakespeare Library)', 'isbn13': '9780743482776', 'msrp': 5.99, 'binding': 'Mass Market Paperback', 'related': {'Kindle Edition': '147678860X', 'ePub': '147678860X'}, 'isbn': '0743482778', 'isbn10': '0743482778', 'other_isbns': [{'isbn': '9781476788609', 'binding': 'print'}]}}