{'book': {'publisher': 'Simon & Schuster', 'synopsis': 'The story of three generations in twentieth-century China that blends the intimacy of memoir and the panoramic sweep of eyewitness history—a bestselling classic in thirty languages with more than ten million copies sold around the world, now with a new introduction from the author.<br/><br/>An engrossing record of Mao’s impact on China, an unusual window on the female experience in the modern world, and an inspiring tale of courage and love, Jung Chang describes the extraordinary lives and experiences of her family members: her grandmother, a warlord’s concubine; her mother’s struggles as a young idealistic Communist; and her parents’ experience as members of the Communist elite and their ordeal during the Cultural Revolution.<br/><br/>Chang was a Red Guard briefly at the age of fourteen, then worked as a peasant, a “barefoot doctor,” a steelworker, and an electrician. As the story of each generation unfolds, Chang captures in gripping, moving—and ultimately uplifting—detail the cycles of violent drama visited on her own family and millions of others caught in the whirlwind of history.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/69/89/9780743246989.jpg', 'title_long': 'Wild Swans: Three Daughters of China', 'edition': 'Reprint', 'dimensions': 'Height: 8.4375 Inches, Length: 5.5 Inches, Weight: 1.08 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 1.08}, 'height': {'unit': 'inches', 'value': 8.4375}}, 'pages': 538, 'date_published': '2003-08-12', 'subjects': ['Biographies & Memoirs', 'Community & Culture', 'Women', 'Asian American & Asian', 'Historical', 'United States', 'Asia', 'Leaders & Notable People', 'Military', 'Memoirs', 'History', 'China', 'World', 'Women in History', 'Self Service', 'Custom Stores'], 'authors': ['Jung Chang'], 'title': 'Wild Swans: Three Daughters of China', 'isbn13': '9780743246989', 'msrp': 18.99, 'binding': 'Paperback', 'related': {'Kindle Edition': '1439106495', 'ePub': '1439106495'}, 'isbn': '0743246985', 'isbn10': '0743246985', 'other_isbns': [{'isbn': '9781439106495', 'binding': 'print'}]}}