{'book': {'publisher': 'Tor Books', 'synopsis': "Everyone knows Frank Herbert's Dune.<br/><br/>This amazing and complex epic, combining politics, religion, human evolution, and ecology, has captured the imagination of generations of readers. One of the most popular science fiction novels ever written, it has become a worldwide phenomenon, winning awards, selling millions of copies around the world. In the prophetic year of 1984, Dune was made into a motion picture directed by David Lynch, and it has recently been produced as a three-part miniseries on the Sci-Fi Channel. Though he is best remembered for Dune, Frank Herbert was the author of more than twenty books at the time of his tragic death in 1986, including such classic novels as The Green Brain, The Santaroga Barrier, The White Plague and Dosadi Experiment.<br/><br/>Brian Herbert, Frank Herbert's eldest son, tells the provocative story of his father's extraordinary life in this honest and loving chronicle. He has also brought to light all the events in Herbert's life that would find their way into speculative fiction's greatest epic.<br/><br/>From his early years in Tacoma, Washington, and his education at the University of Washington, Seattle, and in the Navy, through the years of trying his hand as a TV cameraman, radio commentator, reporter, and editor of several West Coast newspaper, to the difficult years of poverty while struggling to become a published writer, Herbert worked long and hard before finding success after the publication of Dune in 1965. Brian Herbert writes about these years with a truthful intensity that brings every facet of his father's brilliant, and sometimes troubled, genius to full light.<br/><br/>Insightful and provocative, containing family photos never published anywhere, this absorbing biography offers Brian Herbert' unique personal perspective on one of the most enigmatic and creative talents of our time.<br/><br/>Dreamer of Dune is a 2004 Hugo Award Nominee for Best Related Work.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/64/70/9780765306470.jpg', 'title_long': 'Dreamer of Dune: The Biography of Frank Herbert', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 5.999988 Inches, Weight: 1.86 Pounds, Width: 1.32 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.999988}, 'width': {'unit': 'inches', 'value': 1.32}, 'weight': {'unit': 'pounds', 'value': 1.86}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 592, 'date_published': '2004-07-01', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Literature & Fiction', 'History & Criticism', 'Genres & Styles', 'Science Fiction & Fantasy', 'Science Fiction', 'Self Service', 'Custom Stores'], 'authors': ['Brian Herbert'], 'title': 'Dreamer of Dune: The Biography of Frank Herbert', 'isbn13': '9780765306470', 'msrp': 32.99, 'binding': 'Paperback', 'isbn': '0765306476', 'isbn10': '0765306476'}}