{'book': {'publisher': 'French & European Pubns', 'synopsis': 'Product Description<br/><br/>The Real Academia Espanola celebrates the 40th Anniversary of Garcia Marquez s masterpiece in this beautiful commemorative edition. Prologues by Carlos Fuentes, Alvaro Mutis, Mario Vargas Llosa and other intellectuals. One Hundred Years of Solitude is the first piece of literature since the Book of Genesis that should be required reading for the entire human race. -New York Times Book Review<br/><br/>Review<br/><br/>LA REAL ACADEMIA ESPANOLA Y LA ASOCIACION DE ACADEMIAS DE LA LENGUA ESPANOLA PRESENTAN CIEN ANOS DE SOLEDAD UNA EDICION POPULAR CONMEMORATIVA CUYO TEXTO HA REVISADO EL PROPIO GABRIEL GARCIA MARQUEZ. La Asociacion de Academias de la Lengua Espanola presentaron, en el marco del IV Congreso Internacional de la Lengua Espanola (Cartagena de Indias, 26 a 29 de marzo), una edicion de Cien anos de soledad revisada por el autor. --From the Publisher<br/><br/>Como con el Quijote cuando cumplio cuatro siglos, la Real Academia lanza una edicion especial de una novela ejemplar. Esta vez, le toca a Cien anos de soledad en una edicion limitada que circulara 3 anos a partir de su presentacion, a fines de marzo del 2007 en Cartagena de Indias, para festejar los 40 anos de su primera publicacion y los 80 de Garcia Marquez. La introduccion es de Carlos Fuentes, el analisis de Mario Vargas Llosa y el perfil del autor, de Alvaro Mutis. Incluye glosario, genealogia de los Buendia, estudios de academicos de varios paises y notas de Gabo, quien autorizo las pruebas de impresion finales y las correcciones pendientes desde aquella primera edicion de Sudamericana en Buenos Aires en 1967. Un libro de lujo. --From Publisher<br/><br/>Como con el Quijote cuando cumplió cuatro siglos, la Real Academia lanza una edición especial de una novela ejemplar. Esta vez, le toca a Cien años de soledad en una edición limitada que circulará sólo 3 años a partir de su presentación, a fines de marzo del 2007 en Cartagena de Indias, para festejar los 40 años de su primera publicación y los 80 de García Márquez. La introducción es de Carlos Fuentes, el análisis de Mario Vargas Llosa y el perfil del autor, de Álvaro Mutis. Incluye glosario, genealogía de los Buendía, estudios de académicos de varios países y notas de Gabo, quien autorizó las pruebas de impresión finales y las correcciones pendientes desde aquella primera edición de Sudamericana en Buenos Aires en 1967. Un libro de lujo. --From Publisher', 'language': 'en', 'image': 'https://images.isbndb.com/covers/01/03/9780785950103.jpg', 'title_long': 'Cien Anos de Soledad (Spanish Edition) (Spanish Edition)', 'pages': 560, 'date_published': '1997', 'subjects': ['Biographies & Memoirs', 'Literature & Fiction', 'Literary', 'Reference', 'Foreign Language Study & Reference', 'Education & Teaching', 'Studying & Workbooks', 'Study Guides'], 'authors': ['Gabriel Garcia Marquez'], 'title': 'Cien Anos de Soledad (Spanish Edition) (Spanish Edition)', 'isbn13': '9780785950103', 'msrp': 24.95, 'binding': 'Paperback', 'isbn': '0785950109', 'isbn10': '0785950109'}}