{'book': {'publisher': 'Holt Paperbacks', 'synopsis': 'The New York Times bestseller, and one of the most talked about books of the year, Nickel and Dimed has already become a classic of undercover reportage.<br/><br/>Millions of Americans work for poverty-level wages, and one day Barbara Ehrenreich decided to join them. She was inspired in part by the rhetoric surrounding welfare reform, which promised that any job equals a better life. But how can anyone survive, let alone prosper, on $6 to $7 an hour? To find out, Ehrenreich moved from Florida to Maine to Minnesota, taking the cheapest lodgings available and accepting work as a waitress, hotel maid, house cleaner, nursing-home aide, and Wal-Mart salesperson. She soon discovered that even the "lowliest" occupations require exhausting mental and physical efforts. And one job is not enough; you need at least two if you intend to live indoors.<br/><br/>Nickel and Dimed reveals low-wage America in all its tenacity, anxiety, and surprising generosity -- a land of Big Boxes, fast food, and a thousand desperate strategies for survival. Instantly acclaimed for its insight, humor, and passion, this book is changing the way America perceives its working poor.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/38/99/9780805063899.jpg', 'title_long': 'Nickel and Dimed: On (Not) Getting By in America', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.5 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.5}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 240, 'date_published': '2002-05-01', 'subjects': ['Business & Money', 'Economics', 'Economic Conditions', 'Labor & Industrial Relations', 'Human Resources', 'Politics & Social Sciences', 'Social Sciences', 'Poverty'], 'authors': ['Barbara Ehrenreich'], 'title': 'Nickel and Dimed: On (Not) Getting By in America', 'isbn13': '9780805063899', 'msrp': '0.00', 'binding': 'Paperback', 'isbn': '0805063897', 'isbn10': '0805063897'}}