{'book': {'publisher': 'Wayne State University Press', 'synopsis': "Using an introduction to mythology by the master storyteller Ovid himself, the authors have prepared a unique teaching tool designed to achieve proficiency at Latin in one year at the college level, two years at the high school or intermediate level. The volume provides students with imaginative, connected reading, beginning with introductory prose versions of Ovid's simple myth tales and progressing to the rich poetry of Ovidian Latin (with appropriate teaching aids) within forty lessons. The grammatical approach is traditional, but the central emphasis is on reading. In each chapter the reading appears first, followed by the vocabulary, the grammar, exercises, and etymology relating to the vocabulary. The exercises begin with a group of questions in Latin (based on the reading), to be answered in Latin. Each tale is preceded by a brief discussion in English of the story and its mythological significance. The myths retold by Ovid and the attractive format are conceived to impel the student into acquiring the skill to read the author in the original language.<br/><br/>For additional complimentary materials on this topic, please see the accompanying text Practice, Practice: A Latin Via Ovid Workbook by Norma Goldman and Michael Rossi.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/73/27/9780814317327.jpg', 'title_long': 'Latin Via Ovid: A First Course Second Edition', 'edition': '2', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 2.07 Pounds, Width: 1.7 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.7}, 'weight': {'unit': 'pounds', 'value': 2.07}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 524, 'date_published': '1982-09-01', 'subjects': ['Literature & Fiction', 'Classics', 'Ancient & Medieval Literature', 'Ancient & Classical', 'Reference', 'Words, Language & Grammar', 'Linguistics', 'Translating', 'Education & Teaching', 'Schools & Teaching', 'Education Theory', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Jacob E. Nyenhuis', 'Norma W. Goldman'], 'title': 'Latin Via Ovid: A First Course Second Edition', 'isbn13': '9780814317327', 'msrp': 29.99, 'binding': 'Hardcover', 'isbn': '0814317324', 'isbn10': '0814317324'}}