{'book': {'publisher': 'CliffsNotes', 'synopsis': "The original CliffsNotes study guides offer expert commentary on major themes, plots, characters, literary devices, and historical background.<br/>CliffsNotes on Anna Karenina delves into the complex web of relationships in Tolstoy’s epic novel. As the characters unfold, this novel draws you into the lives of Karenin, Anna, and others as they struggle through the seemingly hopeless marriage patterns of urban society. Do romantic relationships make us stronger or weaker as individuals?<br/>With insights into the characters of Anna Karenina, as well as information about Tolstoy’s own life and background, this study guide will help you get the most out of this classic novel. Other features that help you study include A character list that reveals names, traits, and key relationships Summaries and commentaries on each chapter Critical essays In-depth character analyses Analysis of major themes Review questions and suggested writing topics<br/>Classic literature or modern modern-day treasure — you'll understand it all with expert information and insight from CliffsNotes study guides.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/18/36/9780822001836.jpg', 'title_long': 'Anna Karenina (Cliffs Notes)', 'edition': 'Reissue', 'dimensions': 'Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.28219169536 Pounds, Width: 0.19 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.19}, 'weight': {'unit': 'pounds', 'value': 0.28219169536}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 82, 'date_published': '1965-11-12', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Regional & Cultural', 'Teen & Young Adult', 'Education & Reference', 'Study Aids', 'Education & Teaching', 'Studying & Workbooks', 'Study Guides', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Marianne Sturman'], 'title': 'Anna Karenina (Cliffs Notes)', 'isbn13': '9780822001836', 'msrp': 7.49, 'binding': 'Paperback', 'isbn': '0822001837', 'isbn10': '0822001837'}}