{'book': {'publisher': 'Dramatists Play Service, Inc.', 'synopsis': 'Comprised of a series of interrelated scenes, the play traces the coming of age of Heidi Holland, a successful art historian, as she tries to find her bearings in a rapidly changing world. Gradually distancing herself from her friends, she watches them move from the idealism and political radicalism of their college years through militant feminism and, eventually, back to the materialism that they had sought to reject in the first place. Heidi\'s own path to maturity involves an affair with the glib, arrogant Scoop Rosenbaum, a womanizing lawyer/publisher who eventually marries for money and position; a deeper but even more troubling relationship with a charming, witty young pediatrician, Peter Patrone, who turns out to be gay; and increasingly disturbing contacts with the other women, now much changed, who were a part of her childhood and college years. Eventually Heidi comes to accept the fact that liberation can be achieved only if one is true to oneself, with goals that come out of need rather than circumstance. As the play ends she is still "alone," but having adopted an orphaned baby, it is clear that she has begun to find a sense of fulfillment and continuity that may well continue to elude the others of her anxious, self-centered generation.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/51/04/9780822205104.jpg', 'title_long': 'The Heidi Chronicles. (Acting Edition for Theater Productions)', 'edition': 'unknown', 'dimensions': 'Height: 8 Inches, Length: 5.5 Inches, Weight: 0.2 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.2}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 81, 'date_published': '1998-01', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Regional & Cultural'], 'authors': ['Wendy Wasserstein'], 'title': 'The Heidi Chronicles. (Acting Edition for Theater Productions)', 'isbn13': '9780822205104', 'msrp': 10, 'binding': 'Paperback', 'isbn': '0822205106', 'isbn10': '0822205106'}}