{'book': {'publisher': 'Castle Books', 'synopsis': "The Treasured Writings of Kahlil Gibran represents the most comprehensive volume of works of the Lebanese poet and philosopher ever published. This enriching collection of stories, prose poems, verse, parables and autobiographical essays comprising the major body of Kahlil Gibran's works have been carefully translated and edited by a noted trio of Gibran scholars... Martin L. Wolf, Anthony R. Ferris and Andrew Dib Sherfan.<br/><br/>Each of the ten books included in this beautifully bound collectors' volume has been hailed by critics as literary masterpieces. The works in this collection clearly demonstrate why critics regard Kahlil Gibran as eminently among the world's great writers. His writings reflect the wistful beauty, fierce anger, lofty majesty and the abiding peace that Eastern wisdom achieves in its contemplation.<br/><br/>Often revered as the Dante of the twentieth century, the immortal savant of Lebanon, Kahlil Gibran created verses and lyric prose which impart to the reader a grand symphony of sparkling joys. These qualities have made Kahlil Gibran master of the written word.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/38/94/9780890093894.jpg', 'title_long': 'The Treasured Writings of Kahlil Gibran', 'edition': 'Reprint', 'dimensions': 'Height: 9.25 Inches, Length: 6.5 Inches, Weight: 2.94978506556 Pounds, Width: 2.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 2.25}, 'weight': {'unit': 'pounds', 'value': 2.94978506556}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 902, 'date_published': '2009-10-06', 'subjects': ['Literature & Fiction', 'World Literature', 'Middle Eastern', 'Religion & Spirituality', 'Other Eastern Religions & Sacred Texts'], 'authors': ['Kahlil Gibran'], 'title': 'The Treasured Writings of Kahlil Gibran', 'isbn13': '9780890093894', 'msrp': 12.99, 'binding': 'Hardcover', 'isbn': '089009389X', 'isbn10': '089009389X'}}