{'book': {'publisher': 'Library of America', 'synopsis': 'Collected in this Library of America volume are no fewer than six of the works of Edith Wharton: novels, novellas, and her renowned autobiography, A Backward Glance. Together they represent nearly a quarter century in the productive life of one of the most accomplished and admired of American writers.<br/><br/>Madame de Treymes (1907) is set in fashionable Paris society, where a once free-spirited American woman is trying to extricate herself, with the help of a fellow countryman, from her marriage to an aristocratic Frenchman.<br/><br/>Such a village is the scene of Ethan Frome (1911), a tale of marital entrapment even more relentless. Ethan’s unhappy marriage and his desperate love for his wife’s cousin Mattie drive him to an act of shattering violence. The magnificent coda is a classic of American realistic fiction.<br/><br/>Set in the same region of the Berkshires, Wharton called Summer (1917) “the Hot Ethan.” It is the story of a young woman’s initiation into the intricate sexual and social mores of a small town—and her revolt against them.<br/><br/>Observations of the American scene continue in the four novellas that make up Old New York (1924). They take us from the 1840s of “False Dawn,” where a young man is ostracized for his avant garde taste in art, to the 1870s of “New Year’s Day,” where a domestic scandal unfolds.<br/><br/>The poignancies of parenthood are also the theme of The Mother’s Recompense (1925). Kate Clephane, a divorced woman who has been living in Europe, returns to New York to find her former lover engaged to her daughter—and to face the emotional tangles of this unusual triangle.<br/><br/>The fullest portraits of New York are saved for A Backward Glance (1934), one of the most compelling of American autobiographies. Another perspective is offered in “Life and I,” an autobiographical fragment that shows a younger Wharton writing with great frankness about her early life. It is published here for the first time.<br/><br/>LIBRARY OF AMERICA is an independent nonprofit cultural organization founded in 1979 to preserve our nation’s literary heritage by publishing, and keeping permanently in print, America’s best and most significant writing. The Library of America series includes more than 300 volumes to date, authoritative editions that average 1,000 pages in length, feature cloth covers, sewn bindings, and ribbon markers, and are printed on premium acid-free paper that will last for centuries.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/05/30/9780940450530.jpg', 'title_long': "Edith Wharton : Novellas and Other Writings : Madame De Treymes / Ethan Frome / Summer / Old New York / The Mother's Recompense / A Backward Glance (Library of America)", 'dimensions': 'Height: 8.1 Inches, Length: 5.2 Inches, Weight: 1.61 Pounds, Width: 1.4 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.2}, 'width': {'unit': 'inches', 'value': 1.4}, 'weight': {'unit': 'pounds', 'value': 1.61}, 'height': {'unit': 'inches', 'value': 8.1}}, 'pages': 1137, 'date_published': '1990-04-01', 'subjects': ['Arts & Photography', 'History & Criticism', 'History', 'Humor & Entertainment', 'Humor', 'Lawyers & Criminals', 'Self-Help & Psychology', 'Literature & Fiction', 'Genre Fiction', 'Psychological', 'Short Stories & Anthologies', 'Anthologies', 'United States', 'Humor & Satire', 'Satire', 'Literary', 'Ancient & Medieval Literature', 'Roman', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Psychological Thrillers', 'Self Service', 'Custom Stores'], 'authors': ['Edith Wharton'], 'title': "Edith Wharton : Novellas and Other Writings : Madame De Treymes / Ethan Frome / Summer / Old New York / The Mother's Recompense / A Backward Glance (Library of America)", 'isbn13': '9780940450530', 'msrp': 45, 'binding': 'Hardcover', 'isbn': '0940450534', 'isbn10': '0940450534'}}