{'book': {'publisher': 'Clarkson Potter', 'synopsis': 'As his millions of fans know from watching him on Food Network, Tyler likes to rock the kitchen with big, bold flavors and sophisticated yet accessible fare. Whether you’re dishing up a family favorite like spaghetti and meatballs or pulling out all the stops with a succulent tenderloin steak topped with spicy crab salad, Tyler Florence believes every meal can–and should–be the ultimate dining experience. At last, in Tyler’s Ultimate, he shows us how to get these spectacular results in much less time.<br/><br/>Tyler believes the ultimate meal brings together good food, good friends, and good times–with Tyler’s Ultimate as your guide you can elevate any gathering to a cause for celebration and every family meal to an occasion worth savoring. In his travels around the world for his Food Network show, he’s sampled countless versions of classic dishes, taking an ideal technique from one, a perfect ingredient from another. Here he gives you the best of the best.<br/><br/>Make no mistake: Tyler’s approach here may be simplified and the ingredients list streamlined, but your palate will never feel compromised. These recipes are packed with zesty flavors, yet easy to pull together and always straightforward enough for even novice cooks. Because Tyler believes that the little details separate a good meal from a “wow!” experience, his recipes feature bright, exciting flavors that sing on the tongue yet don’t require fancy equipment or exotic ingredients. Tyler has collected all his most trusted and best-loved recipes for the ultimate collection of go-to meals, including can’t-miss versions of the dishes we all crave most: the ultimate burger, French onion soup, beef stew, macaroni and cheese, and chocolate mousse, plus exciting new discoveries that will find a permanent home in your cooking repertoire.<br/><br/>Filled with recipes for sensational, all-American food, Tyler’s Ultimate is the all-around, everyday great cookbook his fans have been waiting for.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/23/87/9781400052387.jpg', 'title_long': "Tyler's Ultimate: Brilliant Simple Food to Make Any Time: A Cookbook", 'edition': 'First Edition', 'dimensions': 'Height: 10.27 Inches, Length: 8.32 Inches, Weight: 2.35 Pounds, Width: 0.91 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.32}, 'width': {'unit': 'inches', 'value': 0.91}, 'weight': {'unit': 'pounds', 'value': 2.35}, 'height': {'unit': 'inches', 'value': 10.27}}, 'pages': 256, 'date_published': '2006-09-26', 'subjects': ['Cookbooks, Food & Wine', 'Cooking by Ingredient', 'Fish & Seafood', 'Quick & Easy', 'Regional & International', 'U.S. Regional'], 'authors': ['Tyler Florence'], 'title': "Tyler's Ultimate: Brilliant Simple Food to Make Any Time: A Cookbook", 'isbn13': '9781400052387', 'msrp': 18.99, 'binding': 'Hardcover', 'related': {'Kindle Edition': '0307953718', 'ePub': '0307953718'}, 'isbn': '1400052386', 'isbn10': '1400052386', 'other_isbns': [{'isbn': '9780307953711', 'binding': 'printisbn'}]}}