{'book': {'publisher': 'Vintage Espanol', 'synopsis': '“El año de mis noventa años quise regalarme una noche de amor con una adolescente virgen.”<br/><br/>Un viejo periodista decide festejar sus noventa años a lo grande, dándose un regalo que le hará sentir que todavía está vivo: una jovencita. En el prostíbulo de un pintoresco pueblo, ve a la jovencita de espaldas, completamente desnuda, y su vida cambia radicalmente. Ahora que la conoce se encuentra a punto de morir, pero no por viejo, sino de amor.<br/><br/>Así, Memoria de mis putas tristes cuenta la vida de este anciano solitario lleno de manñas. Por él sabremos cómo en todas sus aventuras sexuales (que no fueron pocas) siempre dio a cambio algo de dinero, pero nunca imagino que de ese modo encontraría el verdadero amor.<br/><br/>Esta nueva novela es una conmovedora reflexión que celebra las alegrías del enamoramiento y contempla las desventuras de la vejez, escrito en el estilo incomparable de Gabriel García Márquez.<br/><br/>ENGLISH DESCRIPTION<br/><br/>“In my ninetieth year, I decided to give myself the gift of a night of love with a young virgin.”<br/><br/>An elderly journalist decides to celebrate his 90 years in a grand way, giving himself a present that will make him feel like he’s still alive: a virgin. In the brothel of a picturesque town, he sees the young woman from the back, completely naked, and his life changes radically. Now that he meets her he finds himself close to dying, not of old age, but rather of love.<br/><br/>Memoria de mis putas tristes is the story of this eccentric, solitary old man, a narrative of his sexual adventures (of which there were many), for which he always paid, never imagining that this would be the way he would discover true love.<br/><br/>This new novel, written in Gabriel García Márquez’s incomparable style movingly, contemplates the misfortunes of old age and celebrates the joys of being in love.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/58/03/9781400095803.jpg', 'title_long': 'Memoria de mis putas tristes / Memories of my Melancholy Whores (Spanish Edition)', 'edition': 'Spanish-language Edition', 'dimensions': 'Height: 7.97 Inches, Length: 5.2 Inches, Weight: 0.3 Pounds, Width: 0.32 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.2}, 'width': {'unit': 'inches', 'value': 0.32}, 'weight': {'unit': 'pounds', 'value': 0.3}, 'height': {'unit': 'inches', 'value': 7.97}}, 'pages': 112, 'date_published': '2004-10-19', 'subjects': ['Literature & Fiction', 'Classics', 'Genre Fiction', 'United States', 'Literary', 'Science Fiction & Fantasy', 'Fantasy', 'Magical Realism'], 'authors': ['Gabriel García Márquez'], 'title': 'Memoria de mis putas tristes / Memories of my Melancholy Whores (Spanish Edition)', 'isbn13': '9781400095803', 'msrp': 14.95, 'binding': 'Paperback', 'related': {'ePub': '1101911077'}, 'isbn': '1400095808', 'isbn10': '1400095808', 'other_isbns': [{'isbn': '9781101911075', 'binding': 'print'}]}}