{'book': {'publisher': 'New City Press', 'synopsis': 'Written as a favor for a friend this little work is a wonderful explanation of the Christian faith. A true catechism from which, throughout the history of the church, other catechisms have drawn and learned including the recent Catechism of the Catholic Church which quotes Augustine extensively. Within the context of the three theological virtues, faith, hope and love, Augustine masterfully covers the faith. He first works his way through the creed and then the Lords prayer as recorded by Matthew, ending with the sacraments. This is a colossal work in one small volume. Augustines Enchiridion On Faith, Hope and Charity, here called The Augustine Catechism, expresses his mature thinking and is an ideal introduction to studying his theologyhis teaching on the Trinity, the Church and the Sacraments, his doctrine of Original Sin and of redemption through Christ. It provides an admirable orientation to understanding his thought. Gerald Bonner Professor Emeritus Durham University Profound and complex in his theological vision, Augustine of Hippo could nonetheless synthesize and simplify when occasion needed. This fresh translation of his handbook of the Catholic faith. along with helpful introduction and commentary, makes accessible to the contemporary reader both the profundity and simplicity of the thought of Augustine of Hippo, revealing once again why he remains a Christian teacher and spiritual guide for all ages. Thomas F. Martin, O.S.A. Villanova University', 'language': 'en', 'image': 'https://images.isbndb.com/covers/12/44/9781565481244.jpg', 'title_long': "Soliloquies: Augustine's Inner Dialogue (Augustine (New City Press)) (BK. 5) by Saint Augustine (2000-09-01)", 'dimensions': 'Weight: 0.4 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 0.4}}, 'pages': 103, 'date_published': '2000', 'subjects': ['Politics & Social Sciences', 'Philosophy'], 'authors': ['Augustine of Hippo'], 'title': "Soliloquies: Augustine's Inner Dialogue (Augustine (New City Press)) (BK. 5) by Saint Augustine (2000-09-01)", 'isbn13': '9781565481244', 'msrp': 11.95, 'binding': 'Mass Market Paperback', 'isbn': '1565481240', 'isbn10': '1565481240'}}