{'book': {'publisher': 'Barnes & Noble Classics', 'synopsis': "Moby-Dick, by Herman Melville, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics: New introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriate All editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.<br/><br/>On a previous voyage, a mysterious white whale had ripped off the leg of a sea captain named Ahab. Now the crew of the Pequod, on a pursuit that features constant adventure and horrendous mishaps, must follow the mad Ahab into the abyss to satisfy his unslakeable thirst for vengeance. Narrated by the cunningly observant crew member Ishmael, Moby-Dick is the tale of the hunt for the elusive, omnipotent, and ultimately mystifying white whale—Moby Dick.<br/><br/>On its surface, Moby-Dick is a vivid documentary of life aboard a nineteenth-century whaler, a virtual encyclopedia of whales and whaling, replete with facts, legends, and trivia that Melville had gleaned from personal experience and scores of sources. But as the quest for the whale becomes increasingly perilous, the tale works on allegorical levels, likening the whale to human greed, moral consequence, good, evil, and life itself. Who is good? The great white whale who, like Nature, asks nothing but to be left in peace? Or the bold Ahab who, like scientists, explorers, and philosophers, fearlessly probes the mysteries of the universe? Who is evil? The ferocious, man-killing sea monster? Or the revenge-obsessed madman who ignores his own better nature in his quest to kill the beast?<br/><br/>Scorned by critics upon its publication, Moby-Dick was publicly derided during its author’s lifetime. Yet Melville’s masterpiece has outlived its initial misunderstanding to become an American classic of unquestionably epic proportions.<br/><br/>Includes an extensive Dictionary of Sea Terms (37 pages).", 'language': 'en', 'image': 'https://images.isbndb.com/covers/01/81/9781593080181.jpg', 'title_long': 'Moby-Dick (Barnes & Noble Classics Series)', 'edition': 'Illustrated', 'dimensions': 'Height: 8 Inches, Length: 5.1875 Inches, Weight: 1.3 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.1875}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 1.3}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 752, 'date_published': '2003-04-01', 'subjects': ['Literature & Fiction', 'Classics'], 'authors': ['Herman Melville'], 'title': 'Moby-Dick (Barnes & Noble Classics Series)', 'isbn13': '9781593080181', 'msrp': 11.95, 'binding': 'Paperback', 'isbn': '1593080182', 'isbn10': '1593080182', 'other_isbns': [{'isbn': '9781411433656', 'binding': 'printisbncanonical'}]}}