{'book': {'publisher': "Sterling Children's Books", 'synopsis': '&&LDIV&&R&&LDIV&&R&&LI&&RThe Portrait of a Lady&&L/I&&R, by &&LSTRONG&&RHenry James&&L/B&&R&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&R New introductions commissioned from today\'s top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader\'s viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriate All editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences―biographical, historical, and literary―to enrich each reader\'s understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&LP style="MARGIN: 0in 0in 0pt"&&R &&L/P&&R&&LP style="MARGIN: 0in 0in 0pt"&&RWidely regarded as &&LB&&RHenry James&&L/B&&R’s greatest masterpiece, &&LI&&RThe Portrait of a Lady&&L/I&&R features one of the author’s most magnificent heroines: Isabel Archer, a beautiful, spirited American who becomes a victim of her provincialism during her travels in Europe.&&LBR&&R&&LBR&&RAs the story begins, Isabel, resolved to determine her own fate, has turned down two eligible suitors. Her cousin, who is dying of tuberculosis, secretly gives her an inheritance so that she can remain independent and fulfill a grand destiny, but the fortune only leads her to make a tragic choice and marry Gilbert Osmond, an American expatriate who lives in Florence. Outwardly charming and cultivated, but fundamentally cold and cruel, Osmond only brings heartbreak and ruin to Isabel’s life. Yet she survives as she begins to realize that true freedom means living with her choices and their consequences.&&LBR&&R&&LBR&&RRichly complex and nearly aesthetically perfect, &&LI&&RThe Portrait of a Lady &&L/I&&Rbrilliantly portrays the clash between the innocence and exuberance of the New World and the corruption and wisdom of the Old. &&LBR&&R&&L/P&&R&&LP style="MARGIN: 0in 0in 0pt"&&R&&LSTRONG&&RGabriel Brownstein&&L/B&&R&&L/B&&R is the author of a collection of stories―&&LI&&RThe Curious Case of Benjamin Button, Apt 3W&&L/I&&R―which won the 2002 PEN/Hemingway Award. His essays, reviews, and criticism have appeared in the &&LI&&RBoston Globe,&&L/I&&R the &&LI&&RNew Leader,&&L/I&&R &&LI&&RScribner’s British Writers, &&L/I&&Rand on Nerve.com.&&L/P&&R&&L/DIV&&R', 'language': 'en', 'image': 'https://images.isbndb.com/covers/09/69/9781593080969.jpg', 'title_long': 'The Portrait of a Lady (Barnes & Noble Classics)', 'edition': 'Illustrated', 'dimensions': 'Height: 7.999984 Inches, Length: 5.1873912 Inches, Weight: 1.21 Pounds, Width: 1.67999664 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.1873912}, 'width': {'unit': 'inches', 'value': 1.67999664}, 'weight': {'unit': 'pounds', 'value': 1.21}, 'height': {'unit': 'inches', 'value': 7.999984}}, 'pages': 672, 'date_published': '2004-01-16', 'subjects': ['Literature & Fiction', 'Classics', 'Literary'], 'authors': ['Henry James'], 'title': 'The Portrait of a Lady (Barnes & Noble Classics)', 'isbn13': '9781593080969', 'msrp': 10.95, 'binding': 'Paperback', 'isbn': '1593080964', 'isbn10': '1593080964', 'other_isbns': [{'isbn': '9781411432949', 'binding': 'printisbncanonical'}]}}