{'book': {'publisher': 'Barnes & Noble Classics', 'synopsis': '&&LDIV&&R&&LDIV&&R&&LDIV&&R&&LI&&RA Tale of Two Cities&&L/I&&R, by &&LB&&RCharles Dickens&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&R New introductions commissioned from todays top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the readers viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriate All editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences―biographical, historical, and literary―to enrich each readers understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&L/DIV&&R&&LDIV&&R &&L/DIV&&R&&LDIV&&R“It was the best of times, it was the worst of times . . .” With these famous words, &&LB&&RCharles Dickens&&L/B&&R plunges the reader into one of history’s most explosive eras―the French Revolution. From the storming of the Bastille to the relentless drop of the guillotine, Dickens vividly captures the terror and upheaval of that tumultuous period. At the center is the novel’s hero, Sydney Carton, a lazy, alcoholic attorney who, inspired by a woman, makes the supreme sacrifice on the bloodstained streets of Paris. &&LP&&ROne of Dickens’s most exciting novels, &&LI&&RA Tale of Two Cities&&L/I&&R is a stirring classic of love, revenge, and resurrection. &&L/P&&R&&LP style="MARGIN: 0in 0in 0pt"&&R&&LSTRONG&&RGillen D’Arcy Wood&&L/B&&R&&L/B&&R&&L/B&&R received his Ph.D in English from Columbia University in 2000 and is currently an assistant professor at the University of Illinois, Urbana-Champaign. He is the author of &&LI&&RThe Shock of the Real: Romanticism and Visual Culture, 1760–1860&&L/I&&R. &&L/P&&R&&L/DIV&&R&&L/DIV&&R', 'language': 'en', 'image': 'https://images.isbndb.com/covers/13/86/9781593081386.jpg', 'title_long': 'A Tale of Two Cities (Barnes & Noble Classics)', 'edition': 'Illustrated', 'dimensions': 'Height: 8 Inches, Length: 5.1875 Inches, Weight: 0.8 Pounds, Width: 1.12 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.1875}, 'width': {'unit': 'inches', 'value': 1.12}, 'weight': {'unit': 'pounds', 'value': 0.8}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 448, 'date_published': '2004-07-25', 'subjects': ['Literature & Fiction', 'Classics', 'Genre Fiction', 'Historical', 'Contemporary', 'Literary'], 'authors': ['Charles Dickens'], 'title': 'A Tale of Two Cities (Barnes & Noble Classics)', 'isbn13': '9781593081386', 'msrp': 6.95, 'binding': 'Paperback', 'isbn': '1593081383', 'isbn10': '1593081383', 'other_isbns': [{'isbn': '9781411433236', 'binding': 'printisbncanonical'}]}}