{'book': {'publisher': 'Library of America', 'synopsis': 'In Raymond Chandler’s hands, the pulp crime story became a haunting mystery of power and corruption, set against a modern cityscape both lyrical and violent. Now Chandler joins the authoritative Library of America series in a comprehensive two-volume set displaying all the facets of his brilliant talent.<br/><br/>In his first novel, The Big Sleep (1939), the classic private eye finds his full-fledged form as Philip Marlowe: at once tough, independent, brash, disillusioned, and sensitive—and man of weary honor threading his way (in Chandler’s phrase) “down these mean streets” among blackmailers, pornographers, and murderers for hire.<br/><br/>In Farewell, My Lovely (1940), Chandler’s personal favorite among his novels, Marlowe’s search for a missing woman leads him from shanties and honky-tonks to the highest reaches of power, encountering an array of richly drawn characters. The High Window (1942), about a rare coin that becomes a catalyst by which a hushed-up crime comes back to haunt a wealthy family, is partly a humorous burlesque of pulp fiction. All three novels show Chandler at a peak of verbal inventiveness and storytelling drive<br/><br/>Stories and Early Novels also includes every classic noir story from the 1930s that Chandler did not later incorporate into a novel—thirteen in all, among them such classics as “Red Wind,” “Finger Man,” The King in Yellow," and “Trouble Is My Business.” Drawn from the pages of Black Mask and Dime Detective, these stories show how Chandler adapted the violent conventions of the pulp magazine—with their brisk exposition and rapid-fire dialogue—to his own emerging vision of twentieth-century America.<br/><br/>LIBRARY OF AMERICA is an independent nonprofit cultural organization founded in 1979 to preserve our nation’s literary heritage by publishing, and keeping permanently in print, America’s best and most significant writing. The Library of America series includes more than 300 volumes to date, authoritative editions that average 1,000 pages in length, feature cloth covers, sewn bindings, and ribbon markers, and are printed on premium acid-free paper that will last for centuries.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/10/79/9781883011079.jpg', 'title_long': 'Raymond Chandler: Stories and Early Novels: Pulp Stories / The Big Sleep / Farewell, My Lovely / The High Window (Library of America)', 'edition': '1st Edition', 'dimensions': 'Height: 8.14 Inches, Length: 5.26 Inches, Weight: 1.6 Pounds, Width: 1.46 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.26}, 'width': {'unit': 'inches', 'value': 1.46}, 'weight': {'unit': 'pounds', 'value': 1.6}, 'height': {'unit': 'inches', 'value': 8.14}}, 'pages': 1216, 'date_published': '1995-10-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Short Stories & Anthologies', 'Anthologies', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Hard-Boiled', 'Self Service', 'Custom Stores'], 'authors': ['Raymond Chandler'], 'title': 'Raymond Chandler: Stories and Early Novels: Pulp Stories / The Big Sleep / Farewell, My Lovely / The High Window (Library of America)', 'isbn13': '9781883011079', 'msrp': 38.56, 'binding': 'Hardcover', 'isbn': '1883011078', 'isbn10': '1883011078'}}