{'book': {'publisher': 'Anagrama', 'synopsis': 'El escritor Emilio Renzi, que ha escrito una narracion conjetural de una historia que circulaba en su familia, conoce por fin al protagonista, su tio Marcelo, que vive en provincias e investiga los papeles del secretario privado de un personaje que pudo ser un heroe pero del que se sospecha que en realidad fue un traidor. Entre estos personajes y algunos otros, como un polaco tras el que se adivina la figura de Gombrowicz, se hilvana una trama detectivesca que sirve para reflexionar sobre la dolorosa historia argentina y sobre la literatura y sus mascaras. Una novela radicalmente original que, en una reciente encuesta entre escritores argentinos, ha sido elegida como una de las diez mejores de esa literatura en el siglo XX. / Emilio Renzi has written a speculative book based on a story that circulated among his family. At last he meets its protagonist, his uncle Marcelo, who lives in the countryside; a man who could have been a hero but who he suspects was a traitor. This book pieces together a plot that resembles a detective story, and serves as a reflection on the painful history of Argentina and on literature and its masks. This is a radically original novel, which in a poll among Argentinean writers, was chosen as one of the ten best works in its genre of the twentieth century.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/47/11/9788433924711.jpg', 'title_long': 'Respiracion artificial (Spanish Edition)', 'edition': '6', 'dimensions': 'Height: 8.75 Inches, Length: 5.75 Inches, Weight: 0.69 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.69}, 'height': {'unit': 'inches', 'value': 8.75}}, 'pages': 224, 'date_published': '2013-04-05', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Literary'], 'authors': ['Ricardo Piglia'], 'title': 'Respiracion artificial (Spanish Edition)', 'isbn13': '9788433924711', 'msrp': 27.95, 'binding': 'Paperback', 'isbn': '8433924710', 'isbn10': '8433924710'}}