{'book': {'publisher': 'Ediciones B', 'synopsis': "Presenting economics as the underlying connection between seemingly unrelated events or phenomena, this international bestseller establishes a new way of looking at the world. The authors explain the hidden side of everything, from violent crime, parenting, and baby names to the Ku Klux Klan and real estate, demonstrating how economics isn't just about numbers, but a study of incentives—how people get what they need and want when others need and want the same thing. Comprobando que el estudio de la economía puede explicar como se relacionan fenómenos distintos, este bestseller internacional establece una nueva manera de ver al mundo. Los autores explican el lado escondido de todo, desde crímenes violentos y nombres de bebes hasta el Ku Klux Klan y bienes raíces, demostrando que el estudio de la economía es un estudio de los incentivos: el modo en que las personas obtienen lo que desean o necesitan, especialmente cuando otras personas desean o necesitan lo mismo.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/51/28/9788466625128.jpg', 'title_long': 'Freakonomics: Un economista politicamente incorrecto explora el lado oculta de lo que nos afecta', 'edition': '00001', 'dimensions': 'Height: 6 Inches, Length: 9.5 Inches, Weight: 0.72311621936 Pounds, Width: 0.59 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 9.5}, 'width': {'unit': 'inches', 'value': 0.59}, 'weight': {'unit': 'pounds', 'value': 0.72311621936}, 'height': {'unit': 'inches', 'value': 6}}, 'pages': 237, 'date_published': '2006-08-01', 'subjects': ['Business & Money', 'Economics', 'Commercial Policy', 'Theory', 'Finance', 'Management & Leadership', 'Motivational', 'Literature & Fiction', 'Essays & Correspondence'], 'authors': ['Steven D. Levitt', 'Stephen J. Dubner'], 'title': 'Freakonomics: Un economista politicamente incorrecto explora el lado oculta de lo que nos afecta', 'isbn13': '9788466625128', 'msrp': 18, 'binding': 'Paperback', 'isbn': '8466625127', 'isbn10': '8466625127'}}