{'book': {'publisher': 'Punto de Lectura', 'synopsis': 'A small pottery shop and a gigantic business district is the setting for a world that is rapidly heading towards extinction, another which grows and multiplies within a mirrored maze where there appear to be no boundaries nor limits to false illusions. La caverna is the story of a family of potters who realize that their craft is no longer appreciated in such a fast-paced, ever-changing society. "This remarkably generous and eloquent novel is another landmark work from an 80-year-old literary giant." Publishers Weekly.<br/>Description in spanish: Una pequeña alfarería, regentada por una familia que comprende que ha dejado de serle necesaria al mundo, frente a un centro comercial gigantesco. Un mundo en rápido proceso de extinción, otro que crece y se multiplica como un juego de espejos donde no parece haber límites para la ilusión engañosa.<br/>La caverna habla de un modo de vivir que cada vez va siendo menos el nuestro. Todos los días se extinguen especies, todos los días hay profesiones que se tornan inútiles, idiomas que dejan de tener personas que los hablen, tradiciones que pierden sentido, sentimientos que se convierten en sus contrarios.<br/>El autor despliega su visión del mundo actual a la vez que nos alerta: no cambiaremos de vida si no cambiamos la vida.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/67/99/9788466306799.jpg', 'title_long': 'La caverna = A caverna (Punto De Lectura) (Spanish Edition)', 'dimensions': 'Height: 6.75 Inches, Length: 4.25 Inches, Weight: 0.55 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.55}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 448, 'date_published': '2002-05-01', 'subjects': ['Literature & Fiction', 'World Literature', 'Literary'], 'authors': ['José Saramago'], 'title': 'La caverna = A caverna (Punto De Lectura) (Spanish Edition)', 'isbn13': '9788466306799', 'msrp': 10.99, 'binding': 'Mass Market Paperback', 'isbn': '846630679X', 'isbn10': '846630679X'}}