{'book': {'publisher': 'Harpercollins Pub Ltd', 'synopsis': 'Product Description      In the title story of this sharp, clever collection of short stories, an odd-job man arrives home to his Bradford council block to find a message waiting for one of its inhabitants?in ten-foot-high letters. With his white van and set of ladders, he\x92s the chief suspect. But who is the mysterious Slag that has the whole street gossiping; and who has she hurt? In "Wrestling Jacob," a lusty academic takes out his frustrations down on the farm every weekend, sparring with a fierce, strangely human ram. It\x92s hard work being beaten up by a sheep, but he soon realizes that his girlfriends love to see him wrestle Jacob. And in "Coddock," there\x92s a bold new chipshop owner in town. But who is he? And what do you get if you cross a cod with a haddock, anyway? From the backstreets of Bradford to dingy moorland pubs with ten-year-old jukeboxes, Bill Broady\x92s bright new stories give Yorkshire a lick of new paint, with all of the searingly precise prose, wit, and energy of his highly acclaimed first novel, Swimmer.      From Publishers Weekly      Broady (Swimmer) literately and artistically probes the dark corners of blue-collar British life in his first short story collection, deftly maneuvering his way through gutbucket settings while displaying his smart, perceptive and often fascinating voice. He\'s at his best in the longer entries, often taking an appealing conceit and twisting it in a variety of intriguing directions, most notably in "Bouncing Back," a story about the reappearance of some talented and versatile bears in a down-and-out British town. He delves into man\'s relationship with domestic animals in "Wrestling Jacob," the tale of a lusty architect who sublimates his libido in a series of wrestling matches with a sheep. Broady is also a bit of a literary pub-crawler, choosing saloons for his setting in several stories, the most appealing being "The Tale of the Golden Bath Taps," the story of a musician\'s very strange relationship with a stripper. Also included is a lovely, glowing tribute to Sun Ra in "Short Cut to the Sun," the description of a night at one of the late musician\'s wonderfully bizarre concerts. Broady\'s characters often find themselves taking a winding, choppy road to their destinations, and the author doesn\'t always connect the dots or fill in the narrative gaps as well as he could. But his sharp, rough-hewn voice sticks out like a wolf in a chicken coop, and this book represents another solid building block in the career of an author who shows signs of becoming a literary star. (Mar. 15)Forecast: Some of the British references will confound U.S. readers, but the success of Swimmer should help this title find an audience.Copyright 2002 Cahners Business Information, Inc.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/94/77/9780002259477.jpg', 'title_long': 'In This Block Ther Lives a Slag and Other Yorkshire Fables', 'dimensions': 'Height: 8.5 Inches, Length: 5.25 Inches, Weight: 0.6944561253 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.6944561253}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 242, 'date_published': '2002', 'subjects': ['Literature & Fiction', 'Literary'], 'authors': ['Bill Broady'], 'title': 'In This Block Ther Lives a Slag and Other Yorkshire Fables', 'isbn13': '9780002259477', 'msrp': 19.99, 'binding': 'Paperback', 'isbn': '0002259478', 'isbn10': '0002259478'}}