{'book': {'publisher': 'Phyllis Bruce Books Perennial', 'synopsis': 'The truth is that John Rae solved the two great mysteries ofnineteenth-century Arctic exploration: during a single expedition in 1854, hediscovered both the fate of the Franklin expedition and the only NorthwestPassage navigable by the ships of that time ― the fatal passage explorers hadbeen seeking for centuries. ― from Fatal Passage<br/>Not long after he began reading the handwritten, 820-page diary of Scottishexplorer John Rae, Ken McGoogan realized that here was an astonishing story,hidden from the world for almost 150 years. McGoogan, who was originallyconducting research for a novel, recognized the injustice committed against Rae.He was determined to restore the adventurer’s rightful place in history as theman who discovered not only the grisly truth about the lost Franklin expedition,but also the final link in the elusive Northwest Passage.<br/>Fatal Passage is McGoogan’s completely absorbing account of John Rae’sincredible accomplishments and his undeserved and wholesale discreditation atthe hands of polite Victorian society. After sifting through thousands of pagesof research, maps and charts, and traveling to England, Scotland and the Arcticto visit the places Rae knew, McGoogan has produced a book that reads like afast-paced novel ― a smooth synthesis of adventure story, travelogue andhistorical biography. Fatal Passage is a richly detailed portrait of a time whenthe ambitions of the Empire knew no bounds.<br/>John Rae was an adventurous young medical doctor from Orkney who signed onwith the Hudson’s Bay Company in 1833. He lived in the Canadian wilds for morethan two decades, becoming legendary as a hunter and snowshoer, before he turnedto exploration. Famous for what was then a unique attitude ― a willingness tolearn from and use the knowledge and skills of aboriginal peoples ― Rae becamethe first European to survive an Arctic winter while living solely off the land.<br/>One of dozens of explorers and naval men commissioned by the BritishAdmiralty to find out what became of Sir John Franklin and his two ships, Raereturned from the Arctic to report that the most glorious expedition everlaunched had ended with no survivors ― and worse, that it had degenerated intocannibalism. Unwilling to accept that verdict, Victorian England not onlyostracized Rae, but ignored his achievements, and credited Franklin with thediscovery of the Passage.<br/>Fatal Passage is Ken McGoogan’s brilliant vindication of John Rae’slife and rightful place in history, a book for armchair adventurers, Arcticenthusiasts, lovers of Canadian history, and all those who revel in a story of physical courage andmoral integrity.<br/><br/>Read an opinion piece by Ken McGoogan:<br/><br/>http://www.edmontonjournal.com/opinion1/stories/010415/5013219.html', 'language': 'en', 'image': 'https://images.isbndb.com/covers/65/99/9780006386599.jpg', 'title_long': 'Fatal Passage', 'edition': '3rd Printing', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 0.6 Pounds, Width: 0.79 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 0.79}, 'weight': {'unit': 'pounds', 'value': 0.6}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 352, 'date_published': '2002-02-18', 'subjects': ['Biographies & Memoirs', 'Historical', 'Canadian', 'Leaders & Notable People', 'Military', 'Travelers & Explorers', 'History', 'Americas', 'Canada', 'World', 'Expeditions & Discoveries', 'Travel', 'Specialty Travel', 'Adventure'], 'authors': ['Ken McGoogan'], 'title': 'Fatal Passage', 'isbn13': '9780006386599', 'msrp': 16.9, 'binding': 'Paperback', 'isbn': '0006386598', 'isbn10': '0006386598'}}