{'book': {'publisher': 'Flamingo', 'synopsis': '"At last, I found a trilobite. The rock simply parted around the animal, like some sort of revelation. I was left holding two pieces of rock--surely what I held was the textbook come alive. The long thin eyes of the trilobite regarded me and I returned the gaze. More compelling than any pair of blue eyes, there was a shiver of recognition across 500 million years."<br/><br/>From the author of Life comes the fascinating story of the beginnings of life on our planet as seen by its very first creatures, trilobites--the exotic, crustacean-like animals that dominated the seas for 300 million years.<br/>Richard Fortey fell in love with trilobites as a fourteen-year-old when he held his first fossil in his hand. In Trilobite!, he draws on a lifetime of study of these creatures to unravel the history of life on earth from their point of view. Trilobites saw continents move, mountain chains grow and erode; they survived ice ages and volcanic eruptions, constantly evolving and exquisitely adapting to their environment--their own evolution calibrated to geological time itself.<br/>With Fortey\'s expert guidance, we begin to understand how trilobites reveal the pattern and mechanism of evolution through their fossil legacy in the rocks. Through the eyes of trilobites, he allows us glimpses of former worlds as foreign in their geography as in their life forms. Altogether, he provides a unique picture of our geological past, which in turn provides us--scientist and layperson alike--with a new grasp of the wonders of scientific discovery.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/13/86/9780006551386.jpg', 'title_long': 'Trilobite', 'edition': 'New Ed', 'dimensions': 'Height: 7.79526 Inches, Length: 5.07873 Inches, Weight: 0.5070632026 Pounds, Width: 0.76 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.07873}, 'width': {'unit': 'inches', 'value': 0.76}, 'weight': {'unit': 'pounds', 'value': 0.5070632026}, 'height': {'unit': 'inches', 'value': 7.79526}}, 'pages': 256, 'date_published': '2001', 'subjects': ['Science & Math', 'Biological Sciences', 'Animals', 'Earth Sciences', 'Geology'], 'authors': ['Richard Fortey'], 'title': 'Trilobite', 'isbn13': '9780006551386', 'msrp': 16.5, 'binding': 'Paperback', 'isbn': '0006551386', 'isbn10': '0006551386'}}