{'book': {'publisher': 'Harpercollins', 'synopsis': 'In an age of constant and instantaneous visual communication, we see disasters and calamities played out before our eyes every day. Images of plane crashes and typhoons, famines and war, murders and abuse come tumbling into our homes with soul-numbing regularity.<br/>But the April 19, 1995, terrorist blast in Oklahoma City was somehow different. This wasn\'t Bosnia or Rwanda or even New York City. This was the heart of America. And if little children could not be completely safe at 9:02 in the morning in the America\'s Kids day care center in Oklahoma City, we all knew in a flash that none of us could ever be completely safe anywhere.<br/>When we got over our initial shock, most Americans wondered, "What can I do to help?" There came a great outpouring of aid and concern. Rescuers flew to Oklahoma City from all over the country. Money and supplies were sent. Condolence posters were signed in 62 shopping malls. Prayers were sent over the Internet. Cards and letters arrived by the truckload. Enough flowers were sent to provide fresh bouquets for every household in Oklahoma City.<br/>We believe that it was America\'s reaction to the event, more than the event itself, that defines who we are. A few evil people blew up the Alfred P. Murrah Federal Building, but it was a multitude of good-hearted Americans who came to the rescue and picked up the pieces. As often happens, it was the worst among us who managed to bring out our best.<br/>More than 20 photographers contributed their film to make this book. As professionals, they must remain detached from the horror they witness, but this professional necessity does not stop them from caring deeply. This book was born of a desire on the part of the photographers, editors, writers, publishers, printers and bookstores to give something back, to somehow help the people who suffered.<br/>This book is dedicated to the victims and their families and to all of the heroes of Oklahoma City (Editor\'s Note ).', 'language': 'en', 'image': 'https://images.isbndb.com/covers/20/30/9780006492030.jpg', 'title_long': 'Requiem for the Heartland: The Oklahoma City Bombing', 'dimensions': 'Height: 9.5 Inches, Length: 10 Inches, Weight: 1.1 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 10}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 1.1}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 119, 'date_published': '1995', 'subjects': ['Biographies & Memoirs', 'True Crime', 'Politics & Social Sciences', 'Politics & Government'], 'authors': [], 'title': 'Requiem for the Heartland: The Oklahoma City Bombing', 'isbn13': '9780006492030', 'msrp': 19.95, 'binding': 'Paperback', 'isbn': '0006492037', 'isbn10': '0006492037'}}