{'book': {'publisher': 'HarperCollins Publishers', 'synopsis': 'Product Description      <br/>This novel tells the story of a group of six friends whose close and longstanding relationship begins to fall apart when two of them are brutally murdered. Suspicion falls on all of them as their infidelities and lies begin to come to the surface.<br/>      Review      <br/>"As taut and chilling as anything Hitchcock put on film." -"San Francisco Chronicle"<br/>"A first-rate cliffhanger." -"The New York Times Book Review"<br/>"Penetrating. . . . Smiley\'s lovely, clear prose takes to the mystery as a slow revelation of character that heats up to a page-turning finish." -"Ms."<br/>"Sharp and memorable. . . . Finely wrought." -"Newsday<br/>"<br/>      From the Inside Flap      <br/>"Sharp and memorable...Finely wrought."<br/>NEWSDAY<br/>They were six friends from the Midwest who moved to New York City with high hopes of making it big in the music industry. Although the dream had faded, they had all remained friends--or so it seemed. One brilliant day, two of the group were shot in an apartment for which they all had duplicate keys.<br/>A riveting suspense story about the emotional aftermath of murder--the jealousy and hatred, the deception and rage, and the shocking secrets that lie between even the closest of friends.<br/>      From the Back Cover      <br/>Alice Ellis is a Midwestern refugee living in Manhattan. Still recovering from a painful divorce, she depends on the companionship and camaraderie of tightly knit circle of friends. At the center of this circle is a rock band struggling to navigate New York\'s erratic music scene, and an apartment/practice space with approximately fifty key-holders. One sunny day, Alice enters the apartment and finds two of the band members shot dead. As the double-murder sends waves of shock through their lives, this group of friends begins to unravel, and dangerous secrets are revealed one by one. When Alice begins to notice things amiss in her own apartment, the tension breaks out as it occurs to her that she is not the only person with a key, and she may not get a chance to change the locks.<br/>Jane Smiley applies her distinctive rendering of time, place, and the enigmatic intricacies of personal relationships to the twists and turns of suspense. The result is a brilliant literary thriller that will keep readers guessing up to its final, shocking conclusion.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/74/71/9780006547471.jpg', 'title_long': 'Duplicate Keys', 'edition': 'New Ed', 'dimensions': 'Height: 7.76 Inches, Length: 5.12 Inches, Width: 0.79 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.12}, 'width': {'unit': 'inches', 'value': 0.79}, 'height': {'unit': 'inches', 'value': 7.76}}, 'pages': 320, 'date_published': '1996-12-01', 'subjects': ['Mystery, Thriller & Suspense', 'Mystery', 'Thrillers & Suspense', 'Suspense'], 'authors': ['Professor Jane Smiley'], 'title': 'Duplicate Keys', 'isbn13': '9780006547471', 'msrp': 16.5, 'binding': 'Paperback', 'isbn': '0006547478', 'isbn10': '0006547478'}}