{'book': {'publisher': 'Harper', 'synopsis': 'To some, March 23, 1996, may have just been another Saturday, but for 26 National Hockey League teams, more than 600 professional hockey players, countless men and women behind the scenes and millions of fans, March 23 will be forever remembered as A Day in the Life of: The National Hockey League.<br/>During the heat of pre-playoff competition, 80 of the world\'s best sports and lifestyle photographers set out to create images depicting the thrill and excitement of the National Hockey League. Beginning at 12 a.m., these renowned photographers sought out the essence and spirit of "the Coolest Game on Earth," not only through the players but also through the fans, officials, families, media, past NHLers and the countless others for whom NHL hockey is more than just a game. They captured the mounting excitement as the ice was prepped, the sticks taped, the microphones checked and as 18 teams prepared both mentally and physically for nine games across North America: They also covered the eight other teams as they traveled, practiced and prepared for their games in days ahead. The resulting visual celebration, with over 300 photographs created both on and off the ice, presents a never-before-seen look at A Day in the Life of: The National Hockey League.<br/>In addition to dramatic photographs of game action, A Day in the Life of: The National Hockey League features candid portraits of some of hockey\'s current superstars, including Wayne Gretzky, Pavel Bure, Brett Hull and Mario Lemieux.<br/>Also featured are coaches, such as Mike Keenan and Scotty Bowman, former hockey greats such as Denis Potvin and Henri Richard as well as a look into the NHL offices as they prepare for A Day in the Life of: The National Hockey League. These captivating photographs are accompanied by essays written by some of North America\'s foremost sports writers. With a foreword by NHL commissioner Gary Bettman, A Day in the Life of: The National Hockey League is a tribute to NHL hockey throughout North America, both in words and pictures.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/19/41/9780006491941.jpg', 'title_long': 'A Day in the Life of the National Hockey League', 'edition': '1', 'dimensions': 'Height: 13.5 Inches, Length: 10.5 Inches, Weight: 3.69 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 10.5}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 3.69}, 'height': {'unit': 'inches', 'value': 13.5}}, 'pages': 192, 'date_published': '1996-10-17', 'subjects': ['Sports & Outdoors'], 'authors': ['Productions Sta Opus'], 'title': 'A Day in the Life of the National Hockey League', 'isbn13': '9780006491941', 'msrp': 35, 'binding': 'Hardcover', 'isbn': '0006491944', 'isbn10': '0006491944'}}