{'book': {'publisher': 'Harper Collins', 'synopsis': "The President is dead—and the weight, literally, of the world falls on Jack Ryan's shoulders, in Tom Clancy's newest and most extraordinary novel. I don't know what to do. Where's the manual, the training course, for this job? Whom do I ask? Where do I go? Debt of Honor ended with Tom Clancy's most shocking conclusion ever; a joint session of Congress destroyed, the President dead, most of the Cabinet and the Congress dead, the Supreme Court and the Joint Chiefs likewise. Dazed and confused, the man who only minutes before had been confirmed as the new Vice-President of the United States is told that he is now President. President John Patrick Ryan. And that is where Executive Orders begins. Ryan had agreed to accept the vice-presidency only as a caretaker for a year, and now, suddenly an incalculable weight has fallen on his shoulders. How do you run a government without a government? Where do you even begin? With stunning force, Ryan's responsibilities crush on him. He must calm an anxious and grieving nation, allay the skepticism of the world's leaders, conduct a swift investigation of the tragedy, and arrange a massive state funeral—all while attempting to reconstitute a Cabinet and a Congress with the greatest possible speed. But that is not all. Many eyes are on him now, and many of them are unfriendly. In Beijing, Tehran, and other world capitals, including Washington D.C., there are those eager to take advantage where they may, some of whom bear a deep animus toward the United States—some of whom, from Ryan's past, harbor intense animosity toward the new President himself. Soon they will begin to move on their opportunities; soon they will present Jack Ryan with a crisis so big even he cannot imagine it. Tom Clancy has written remarkable novels before, but nothing comparable to the timeliness and drama of Executive Orders. Filled with the exceptional realism and intricate plotting that are his hallmarks, it attests to the words of the St. Louis Post-Dispatch: This man can tell a story.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/97/58/9780006479758.jpg', 'title_long': 'Executive Orders', 'edition': 'First Edition', 'dimensions': 'Height: 7.00786 Inches, Length: 4.37007 Inches, Weight: 1.6314207388 Pounds, Width: 2.16535 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.37007}, 'width': {'unit': 'inches', 'value': 2.16535}, 'weight': {'unit': 'pounds', 'value': 1.6314207388}, 'height': {'unit': 'inches', 'value': 7.00786}}, 'pages': 1296, 'date_published': '1998', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'War', 'Action & Adventure', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Spies & Politics', 'Suspense', 'Romance'], 'authors': ['Tom Clancy'], 'title': 'Executive Orders', 'isbn13': '9780006479758', 'msrp': 18.6, 'binding': 'Paperback', 'isbn': '0006479758', 'isbn10': '0006479758'}}