{'book': {'publisher': 'Fount', 'synopsis': "A major new book that 'rediscovers our hidden life in God' from one of the most exciting authors emerging from North America. 'A masterpiece and a wonder -- the book I have been searching for all my life' from the foreword by Richard Foster. At the end of the twentieth Century a new expression of Christian Spirituality is forming which is focused on biblical truth but is less concerned with denominational labels. Drawing its support from both Catholics and Protestants, writers such as Richard Foster and Henri Nouwen have been the most popular. Now comes a major new addition: Dallas Willard. The Divine Conspiracy is a moving and penetrating exploration of human existance and human nature. It considers in a fresh way the abiding truths of judgement and grace and what he memorably calls 'theologies of sin management'. All this is set against a backdrop of modern materialism. 'His stories charm. His examples teach,' says Richard Foster, here is 'a soul satisfying banquet,' which he places alongside the writings of John Wesley, Martin Luther, Teresa of Avila 'and perhaps even Thomas Aquinas and Augustine of Hippo.' This is a book for the next millennium.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/11/46/9780006281146.jpg', 'title_long': 'The Divine Conspiracy : Rediscovering Our Hidden Life in God', 'dimensions': 'Height: 7.79526 Inches, Length: 5.07873 Inches, Weight: 0.7275254646 Pounds, Width: 1.14173 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.07873}, 'width': {'unit': 'inches', 'value': 1.14173}, 'weight': {'unit': 'pounds', 'value': 0.7275254646}, 'height': {'unit': 'inches', 'value': 7.79526}}, 'pages': 384, 'date_published': '1998', 'subjects': ['Religion & Spirituality'], 'authors': ['Dallas Willard'], 'title': 'The Divine Conspiracy : Rediscovering Our Hidden Life in God', 'isbn13': '9780006281146', 'msrp': 35.37, 'binding': 'Paperback', 'isbn': '0006281141', 'isbn10': '0006281141'}}