{"book": {"publisher": "HarperCollins Publishers Ltd", "synopsis": "Most girls know the best nights in consist of other girlie friends, a few bottles of vino (or devilish cocktail concoctions) and a good goss. A Girls Night In provides all this and more between the pages of its cover. A collection of short stories by 32 of the UK\"s most up-and-coming female authors, this intoxicating anthology is a heady blend of heartbreaks, highs and hit-and-misses. With each writer\'s distinct perspective and personal style flowing, no two stories are alike--although they all deal with a perennial theme: the battle of the sexes. Contributors include Marian Keyes, Lisa Jewell, Wendy Holden, Amy Jenkins and many, many more. Marian Keyes\' 'The Truth is Out There' is an unusual, screwball spin on getting over a broken heart--a young woman in the process of a break-up is unwittingly assisted by 'a small, yellow, transparent creature who liked to be called Bib', with an eye for the ladies. Lisa Jewell\'s 'Rudy' looks at affairs of the heart from a rare male perspective--the stalker--leaving many a reader, oddly enough, with a wry smile. Innovative, wacky titles abound to induce the reader in: "E-Male of the Species",
        "Dougie, Spoons and the Aquarium Solarium" and 'The Seven Steps from Shag to Spouse'. Whether you are drawn to a familiar writer or someone new, you can dip in and out of these tales at whim, gaining a taster of whether you could enjoy a full course of their longer fiction. Either way, raise a glass to toast this eclectic mix of authors united to raise funds for War Child. Proceeds--£1 from every book sold--will promote a Child\'s Safe Play programme in the Balkans and an educational programme in Rwanda. --Nicola Perry', 'language": "en", "image": "https: //images.isbndb.com/covers/48/55/9780006514855.jpg", "title_long": "Girls" Night in", 'edition": "First Edition", "dimensions": "Height: 7.00786 Inches, Length: 4.37007 Inches, Weight: 0.5732018812 Pounds, Width: 1.37795 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.37007}, "width": {"unit": "inches", "value": 1.37795}, "weight": {"unit": "pounds", "value": 0.5732018812}, "height": {"unit": "inches", "value": 7.00786}}, "pages": 592, "date_published": "2000", "subjects": ["Literature & Fiction', 'Short Stories & Anthologies', 'Short Stories'], 'authors": ['Jessica Adams', 'Fiona Walker', 'Chris Manby'], 'title": "Girls" Night in", 'isbn13": "9780006514855", "msrp": "0.00", "binding": "Paperback", "isbn": "0006514855", "isbn10": "0006514855"}}