{'book': {'publisher': 'HarperCollinsChildren’sBooks', 'synopsis': "“The more that you read, the more things you will know. The more you learn, the more places you’ll go”. In this delightful book, Dr. Seuss celebrates the joys of reading, encouraging young children to take pride in their budding reading abilities.<br/>With his unique combination of hilarious stories, zany pictures and riotous rhymes, Dr. Seuss has been delighting young children and helping them learn to read for over fifty years. Creator of the wonderfully anarchic Cat in the Hat, and ranked among the UK's top ten favourite children's authors, Seuss is firmly established as a global best-seller, with nearly half a billion books sold worldwide.<br/>As the first step in a major rebrand programme, HarperCollins is relaunching 17 of Dr. Seuss's best-selling books, including such perennial favourites as The Cat in the Hat, Green Eggs and Ham and Fox in Socks. In response to consumer demand, the bright new cover designs incorporate much needed guidance on reading levels, with the standard paperbacks divided into three reading strands – Blue Back Books for parents to share with young children, Green Back Books for budding readers to tackle on their own, and Yellow Back Books for older, more fluent readers to enjoy. I Can Read With My Eyes Shut belongs to the Green Back Book range.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/85/15/9780007158515.jpg', 'title_long': 'I Can Read With My Eyes Shut: Green Back Book (Dr Seuss - Green Back Book)', 'edition': 'Rebranded edition', 'dimensions': 'Height: 8.85825 Inches, Length: 6.41731 Inches, Weight: 0.2425084882 Pounds, Width: 0.19685 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.41731}, 'width': {'unit': 'inches', 'value': 0.19685}, 'weight': {'unit': 'pounds', 'value': 0.2425084882}, 'height': {'unit': 'inches', 'value': 8.85825}}, 'pages': 48, 'date_published': '2003-05-06', 'subjects': ["Children's Books", 'Animals', 'Cats', 'Self Service', 'Custom Stores'], 'authors': ['Dr. Seuss'], 'title': 'I Can Read With My Eyes Shut: Green Back Book (Dr Seuss - Green Back Book)', 'isbn13': '9780007158515', 'msrp': 10.35, 'binding': 'Paperback', 'isbn': '0007158513', 'isbn10': '0007158513'}}