{'book': {'publisher': 'Harper', 'synopsis': 'The Impartial Recorder is an extraordinary book about ordinary people in a small town in the middle of nowhere. It may be the only funny book you will ever read about the weather. And the only novel that comes with its own handy index to help guide you straight to subjects such as "sushi, and Christian guilt," "adultery, brazened out" and "regretted bitterly," "snacks, between meals, inadvisability of," and the terrible "unfairness of having read Jeanette Winterson, and yet still having to work in an in-store bakery."<br/>The Impartial Recorder takes its name from the tirelessly gossip-oriented local paper that reports on nothing in particular and on everything that\'s too interesting to have made a more dignified newspaper of record. The story kicks off with the return of a prodigal son, Davey Quinn, who is struggling to hide the fact that he hasn\'t done quite as well in the big city as friends and family have been led to believe. But that\'s only the beginning. The Impartial Recorder goes on to celebrate the heroic energies and comic failures of plumbers and ministers of religion, sandwich entrepreneurs and housewives, short-order cooks and owners of lingerie shops. In the tradition of Garrison Keillor and Roddy Doyle, Ian Sansom has given us a brilliant and hopeful comedy; in his words, a "book of profound inconsequence, as beautiful and moving as, say, the sight of an elderly couple standing outside a greengrocer\'s, trying to choose a cauliflower."', 'language': 'en', 'image': 'https://images.isbndb.com/covers/73/96/9780007157396.jpg', 'title_long': 'The Impartial Recorder: A Novel', 'edition': '1st Am. ed.', 'dimensions': 'Height: 8.5 Inches, Length: 6 Inches, Weight: 1.2 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.2}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 368, 'date_published': '2004-07-06', 'subjects': ['Literature & Fiction', 'British & Irish', 'Contemporary', 'Literary'], 'authors': ['Ian Sansom'], 'title': 'The Impartial Recorder: A Novel', 'isbn13': '9780007157396', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0007157398', 'isbn10': '0007157398'}}