{'book': {'publisher': 'Harpercollins Pub Ltd', 'synopsis': "Providing mouthwatering excuses for eating glorious food exactly when it comes into its best, these inspiring yet unfussy dishes let simple ingredients speak for themselves. Brilliantly written and entertaining, these are recipes that even the most timid cook can approach with gusto. Who wouldn't want to cook Keith's way?throwing out measuring cups, getting rid of scales, and getting to know the food! Recipes include Pork-Loin Chops on a Bed of Sweet Orchard Apples, Husk-Wrapped and Roasted Garlic Corn, Venison Filet with Black Kale and Port, 45-Minute Pumpkin and Parmesan Bread, Char-grilled Asparagus and Halloumi with a Citrus Dressing, and Rhubarb Bread and Butter Pudding. Keith also suggests delicious smoothies and soups to help use up any leftover fruit and veggies at the end of the week. With beautiful finished food shots, inspiring atmospheric pictures, and charming visual references to Keith's own quirky style, this cookbook also features Keith's anecdotes on organic farms and small producers, stories about the friends and family who have inspired him, and hilarious suggestions about how to get the most out of every cooking experience.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/07/09/9780007230709.jpg', 'title_long': 'Cooking Outside the Box: The Abel & Cole Cookbook', 'dimensions': 'Height: 10 Inches, Length: 7.75 Inches, Weight: 2.06 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.75}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 2.06}, 'height': {'unit': 'inches', 'value': 10}}, 'pages': 218, 'date_published': '2007', 'subjects': ['Cookbooks, Food & Wine', 'Cooking by Ingredient', 'Natural Foods'], 'authors': ['Keith Abel'], 'title': 'Cooking Outside the Box: The Abel & Cole Cookbook', 'isbn13': '9780007230709', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0007230702', 'isbn10': '0007230702'}}