{'book': {'publisher': 'HarperCollins Publishers', 'synopsis': "A tale of high adventure and derring-do set in the same Victorian-style world as the acclaimed The Court of the Air and The Secrets of the Fire Sea. Thanks to his father's gambling debts, young Jack Keats finds himself on the streets and trying to survive as a pickpocket, desperate to graft enough coins to keep him and his two younger brothers fed. Following a daring bank robbery gone badly awry, Jack narrowly escapes the scaffold, only to be pressed into Royal Aerostatical Navy. Assigned to the most useless airship in the fleet, serving under a captain who is most probably mad, Jack seems to be bound for almost certain death in the far-away deserts of Cassarabia. Meanwhile, on the other side of the world, Omar ibn Barir, the slave of a rich merchant lord finds his life turned upside down when his master's religious sect is banned. Unexpectedly freed, he survives the destruction of his home to enter into the service of the Caliph's military forces -- just as war is brewing. Two very similar young men prepare to face each other across a senseless field of war. But is Omar the enemy, or is Jack's true nemesis the sickness at the heart of the Caliph's court? A cult that hides the deadly secret to the origins of the gas being used to float Cassarabia's new aerial navy. If Jack and his shipmates can discover what Cassarabia's aggressive new regime is trying to conceal, he might survive the most horrific of wars and clear his family's name. If not!", 'language': 'en', 'image': 'https://images.isbndb.com/covers/97/07/9780007289707.jpg', 'title_long': 'Jack Cloudie', 'dimensions': 'Height: 9.38 Inches, Length: 6.25 Inches, Weight: 1.02294489568 Pounds, Width: 1.2 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1.2}, 'weight': {'unit': 'pounds', 'value': 1.02294489568}, 'height': {'unit': 'inches', 'value': 9.38}}, 'pages': 560, 'date_published': '2011-02-01', 'subjects': ['Science Fiction & Fantasy', 'Fantasy', 'Science Fiction', 'Steampunk'], 'authors': ['Stephen Hunt'], 'title': 'Jack Cloudie', 'isbn13': '9780007289707', 'msrp': 20.17, 'binding': 'Paperback', 'isbn': '0007289707', 'isbn10': '0007289707'}}