{'book': {'publisher': 'HARPER PERENNIAL', 'synopsis': "The anarchic, phenomenally strong-selling classic from the godfather of the Beats, featuring for the first time the restored text, all the accompanying essays, and newly discovered material from the original manuscript. Revitalised with a cool new jacket and an anecdote-packed P.S. Section. Welcome to Interzone! Say hello to Bradley the Buyer, the best narcotics agent in the business. Check yourself into the hospital where Dr Benway works -- but don't expect adrenalin if you need it (the night porter shot it up for kicks). Meet Dr 'Fingers' Schafer, the Lobotomy Kid, and his greatest creation, 'The Complete American De-anxietized Man', a marvel of invasive psychiatry who has been reduced to nothing but a spinal cord. Told by an Ivy League-educated narcotics addict, 'Naked Lunch' juxtaposes two journeys: the narrator's physical progress from America to North Africa, via Mexico, and a terrifying descent into his own altered consciousness. In this 'Interzone', loosely based on Burroughs' temporary home of Tangier, sex, drugs and murder are the most basic of commodities, and the basest desires have become completely banal. Provocative, influential, morbidly fascinating and mordantly funny, 'Naked Lunch' takes us on an exhilarating ride through the darkest recesses of the human psyche -- a ride which stunned the literary world when first published in the repressed 1950s, and is still guaranteed to epater more than a few bourgeois. Over forty years since first publication, Burroughs scholar Barry Miles and Burroughs' longtime editor James Grauerholz have compiled this definitive restored text, correcting numerous errors that have accumulated over the years, and incorporating all of Burroughs' notes and accompanying essays. Most exciting of all, this edition includes an appendix of newly discovered, never before seen material -- including alternate drafts from the original manuscript and letters from Burroughs' private correspondence.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/44/41/9780007204441.jpg', 'title_long': 'Naked Lunch : The Restored Text', 'dimensions': 'Height: 8.50392 Inches, Length: 6.33857 Inches, Weight: 0.4629707502 Pounds, Width: 0.7874 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.33857}, 'width': {'unit': 'inches', 'value': 0.7874}, 'weight': {'unit': 'pounds', 'value': 0.4629707502}, 'height': {'unit': 'inches', 'value': 8.50392}}, 'pages': 224, 'date_published': '2005', 'subjects': ['Literature & Fiction', 'Contemporary'], 'authors': ['William Burroughs'], 'title': 'Naked Lunch : The Restored Text', 'isbn13': '9780007204441', 'msrp': 16.5, 'binding': 'Paperback', 'isbn': '0007204442', 'isbn10': '0007204442'}}