{'book': {'publisher': 'Harper Perennial', 'synopsis': "Passionate, independent-minded nonfiction from the international bestselling author of 'The Corrections'. Jonathan Franzen's 'The Corrections' was the best-loved and most written-about novel of 2001. Nearly every in-depth review of it discussed what became known as 'The Harper's Essay,' Franzen's controversial 1996 look at the fate of the novel. This essay is reprinted for the first time in 'How to be Alone', alongside the personal essays and painstaking, often funny reportage that earned Franzen a wide readership before the success of 'The Corrections'. Although his subjects range from the sex-advice industry to the way a supermax prison works, each piece wrestles with familiar themes of Franzen's writing: the erosion of civic life and private dignity, and the hidden persistence of loneliness, in postmodern, imperial America. Recent pieces include a moving essay on his father's struggle with Alzheimer's disease and a rueful account of Franzen's brief tenure as an Oprah Winfrey author. As a collection, these essays record what Franzen calls 'a movement away from an angry and frightened isolation toward an acceptance -- even a celebration -- of being a reader and a writer.' At the same time they show the wry distrust of the claims of technology and psychology, the love-hate relationship with consumerism, and the subversive belief in the tragic shape of the individual life that help make Franzen one of the sharpest, toughest-minded, and most entertaining social critics at work today.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/35/89/9780007153589.jpg', 'title_long': 'How to Be Alone', 'edition': '(Reissue)', 'dimensions': 'Height: 7.88 Inches, Length: 5.2 Inches, Weight: 0.4850169764 Pounds, Width: 0.78 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.2}, 'width': {'unit': 'inches', 'value': 0.78}, 'weight': {'unit': 'pounds', 'value': 0.4850169764}, 'height': {'unit': 'inches', 'value': 7.88}}, 'pages': 320, 'date_published': '2004', 'subjects': ['Literature & Fiction', 'Classics'], 'authors': ['Jonathan Franzen'], 'title': 'How to Be Alone', 'isbn13': '9780007153589', 'msrp': 18.6, 'binding': 'Paperback', 'isbn': '0007153589', 'isbn10': '0007153589'}}