{'book': {'publisher': 'Collier Books', 'synopsis': "Among the central issues of the modern feminist movement, the debate over biology and culture over sex and gender, over genetics and gender roles has certainly been one of the most passionately contested. Making revolutionary arguments upon its first publication in 1953, The Natural Superiority of Women stands as one of the original feminist arguments against biological determinism. An iconoclast, Montagu wielded his encyclopedic knowledge of physical anthropology in critique of the conventional wisdom of women as the 'weaker sex,' showing how women's biological, genetic, and physical makeup made her not only man's equal, but his superior. Also a humanist, Montagu points to the emotional and social qualities typically ascribed to and devalued in women as being key to just social life and relationships. Subsequent editions of this book have provided additional support for Montagu's arguments, examining both biological and social scientific data of the late 20th century. One of the most broadly renowned and read scholars of our century, Montagu brings out this fifth edition with up-to-date statistics and references. A lengthy foreword by Susan Sperling contextualizes the book within the intellectual histories of feminism and anthropology, noting the huge social and intellectual changes that are spanned in Montagu's life and writing. Montagu's foundational book is an important addition to the library of all gender scholars.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/08/05/9780020960805.jpg', 'title_long': 'The natural superiority of women', 'edition': 'Revised', 'dimensions': 'Weight: 0.5 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 0.5}}, 'pages': 268, 'date_published': '1974', 'subjects': ['Health, Fitness & Dieting', 'Psychology & Counseling', 'Social Psychology & Interactions', 'Medical Books', 'Psychology', 'Politics & Social Sciences', 'Social Sciences'], 'authors': ['Ashley Montagu'], 'title': 'The natural superiority of women', 'isbn13': '9780020960805', 'msrp': 1.99, 'binding': 'Paperback', 'isbn': '0020960808', 'isbn10': '0020960808'}}