{'book': {'publisher': 'Prentice Hall', 'synopsis': "From the Publisher      Now in its twentieth successful year, Corrections in America has grown into the preeminent work in its field--a comprehensive, skillfully organized introduction to all aspects of adult and juvenile corrections. The book covers everything from historical precedents to the very latest programs and practices. Its main focus is on how today's correctional subsystems function within the larger criminal justice system, with related theory and research introduced where appropriate. While Corrections in America covers more topics in more detail than other texts, its clarity and well- designed learning features make it a favorite with students, and its superior organization makes it easy for instructors to adapt to any type of course. This major new edition features many significant revisions and improvements. In particular it includes more on female offenders, alternative penalties, and juvenile violence, as well as updated examples, data, and references throughout. No other text offers such a thorough, current, and useful treatment of America's correctional systems.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/74/14/9780023017414.jpg', 'title_long': 'Corrections in America: An Introduction', 'edition': 'Seventh Edition', 'dimensions': 'Height: 9.5 Inches, Length: 1.5 Inches, Weight: 2.79546148216 Pounds, Width: 7.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 1.5}, 'width': {'unit': 'inches', 'value': 7.75}, 'weight': {'unit': 'pounds', 'value': 2.79546148216}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 742, 'date_published': '1995', 'subjects': ['Politics & Social Sciences', 'Social Sciences', 'Criminology', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Harry E. Allen', 'Clifford E. Simonsen'], 'title': 'Corrections in America: An Introduction', 'isbn13': '9780023017414', 'msrp': 77, 'binding': 'Hardcover', 'isbn': '0023017414', 'isbn10': '0023017414'}}