{'book': {'publisher': 'Scribner', 'synopsis': "In this “engrossing,” (The New Yorker) vivid, and intensively researched volume, esteemed Napoleon scholar David Chandler outlines the military strategy that led the famous French emperor to his greatest victories—and to his ultimate downfall.<br/><br/>Napoleonic war was nothing if not complex—an ever-shifting kaleidoscope of moves and intentions, which by themselves went a long way towards baffling and dazing his conventionally minded opponents into that state of disconcerting moral disequilibrium which so often resulted in their catastrophic defeat.<br/><br/>The Campaigns of Napoleon is a masterful analysis and insightful critique of Napoleon's art of war as he himself developed and perfected it in the major military campaigns of his career. Napoleon disavowed any suggestion that he worked from formula (“Je n'ai jamais eu un plan d'opérations”), but military historian David Chandler demonstrates this was at best only a half-truth. To be sure, every operation Napoleon conducted contained unique improvisatory features. But there were from the first to the last certain basic principles of strategic maneuver and battlefield planning that he almost invariably put into practice. To clarify these underlying methods, as well as the style of Napoleon's fabulous intellect, Chandler examines in detail each campaign mounted and personally conducted by Napoleon, analyzing the strategies employed, revealing wherever possible the probable sources of his subject's military ideas.<br/><br/>“Writing clearly and vividly, [Chandler] turns dozens of persons besides Napoleon from mere wooden soldiers into three- dimensional characters” (The Boston Globe) and this definitive work is “a fine book for the historian, the student, and the intelligent reader” (The New York Review of Books).", 'language': 'en', 'image': 'https://images.isbndb.com/covers/66/08/9780025236608.jpg', 'title_long': "Campaigns of Napoleon: The Mind and Method of History's Greatest Soldier", 'dimensions': 'Height: 9.3125 Inches, Length: 6.625 Inches, Weight: 4.14909977084 Pounds, Width: 2.4 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.625}, 'width': {'unit': 'inches', 'value': 2.4}, 'weight': {'unit': 'pounds', 'value': 4.14909977084}, 'height': {'unit': 'inches', 'value': 9.3125}}, 'pages': 1172, 'date_published': '1973-03-01', 'subjects': ['History', 'Europe', 'France', 'Italy', 'Middle East', 'Egypt', 'Syria', 'Military', 'Napoleonic Wars', 'Strategy'], 'authors': ['David G. Chandler'], 'title': "Campaigns of Napoleon: The Mind and Method of History's Greatest Soldier", 'isbn13': '9780025236608', 'msrp': 90, 'binding': 'Hardcover', 'related': {'Kindle Edition': '1439131031', 'ePub': '1439131031'}, 'isbn': '0025236601', 'isbn10': '0025236601', 'other_isbns': [{'isbn': '9781439131039', 'binding': 'print'}]}}