{'book': {'publisher': 'Scribner', 'synopsis': 'She was both guardian of the hearth and, on occasion, ruler and warrior, leading men into battle, managing the affairs of her people, sporting war paint as well as necklaces and earrings. She built houses and ground corn, wove blankets and painted pottery, played field hockey and rode racehorses. Frequently she enjoyed an open and joyous sexuality before marriage; if her marriage didn\'t work out she could divorce her husband by the mere act of returning to her parents. She mourned her dead by tearing her clothes and covering herself with ashes, and when she herself died was often shrouded in her wedding dress. She was our native sister, the American Indian woman, and it is of her life and lore that Carolyn Niethammer writes in this rich tapestry of America\'s past and present. Here, as it unfolded, is the chronology of the native American woman\'s life. Here are the birth rites of Caddo women from the Mississippi-Arkansas border, who bore their children alone by the banks of rivers and then immersed themselves and their babies in river water; here are Apache puberty ceremonies that are still carried on today, when the cost for the celebrations can run anywhere from one to six thousand dollars. Here are songs from the Night Dances of the Sioux, where girls clustered on one side of the lodge and boys congregated on the other; here is the Shawnee legend of the Corn Person and of Our Grandmother, the two female deities who ruled the earth. Far from the submissive, downtrodden "squaw" of popular myth, the native American woman emerges as a proud, sometimes stoic, always human individual from whom those who came after can learn much. At a time when many contemporary American women are seeking alternatives to a life-style and role they have outgrown, Daughters of the Earth offers us an absorbing -- and illuminating -- legacy of dignity and purpose.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/58/06/9780025885806.jpg', 'title_long': 'Daughters of the Earth', 'edition': 'First Edition', 'dimensions': 'Weight: 1.75 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 1.75}}, 'pages': 281, 'date_published': '1977-04-01', 'subjects': ['History', 'Americas', 'Native American', 'Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies'], 'authors': ['Niethamme'], 'title': 'Daughters of the Earth', 'isbn13': '9780025885806', 'msrp': 12.95, 'binding': 'Hardcover', 'isbn': '0025885804', 'isbn10': '0025885804'}}