{"book": {"publisher": "Macmillan Pub Co", "synopsis": 'This is one of the most amazing books every written. After being convicted in the Nuremberg War Crimes Trials, the prisoners were not allowed to have writing paper, were not allowed to write their memoirs and were allowed only limited visits from their relatives. However, they were allowed to have toilet paper. So, on thousands of squares of toilet paper, Albert Speer wrote his diary in tiny letters so small that they could hardly be seen, which he was then able to pass to his relatives when they visited him. By the time Speer was released on September 30,
        1966, twenty years later, there were more than twenty thousand pages of secret diaries just waiting to be edited and published, but it took him another ten years before he could bear to look at them. Albert Speer was a brilliant writer and the world should be forever grateful to him for leaving us this work, that addresses and attempts to answer questions the world will always be asking, including: 1. How was Adolph Hitler, an obvious madman, totally insane, able to attain and keep such great power? 2. Why did the German people not recognize what was happening and do something about it long before the destructive end? 3. Most importantly: Can this happen again? Could and will another Hitler arise, perhaps not in Germany again? Perhaps in the United States of America? What assurance do we have that a lunatic madman could not enter the White House and do much worse than Hitler ever did?", "language": "en", "image": "https: //images.isbndb.com/covers/50/16/9780026995016.jpg", "title_long": "Spandau: The Secret Diaries (English and German Edition)", "dimensions": "Weight: 2.5353158474437 Pounds", "dimensions_structured": {"weight": {"unit": "pounds", "value": 2.5353158474437}}, "date_published": "1976", "subjects": ["History', 'Europe', 'Germany', 'Military', 'World War II', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Albert Speer'], 'title": "Spandau: The Secret Diaries (English and German Edition)", "isbn13": "9780026995016", "msrp": 19.95, 'binding": "Hardcover", "isbn": "0026995018", "isbn10": "0026995018"}}