{'book': {'publisher': "Simon & Schuster Children's Publishing", 'synopsis': 'Product Description<br/><br/>Despite the doctor\'s warning that she is too frail, Samantha\'s grandmother zestfully joins her in a midnight raid on the kitchen, where they make fabulous ice cream sundaes and look at old photographs.<br/><br/>From Publishers Weekly<br/><br/>Granddaughter and grandmother conspire in this demure and touching story to pass a night together in complete freedom, breaking rules when necessary and sharing intergenerational wisdom. " \'Is it awful being old?\' " asks redheaded scamp Samantha J. Blustein (aka Sam). " \'Not awful. But different,\' " Nana replies. Left to their own devices, the two abandon their beds to concoct ice-cream sundaes, swap stories, look at old family photographs, vowing not to tell a soul about their nocturnal mischief. Gundersheimer ( A Special Trade ) sweetly and surely evokes magical companionship in her lambent watercolors, while Hest ( The Mommy Exchange ) gently reveals Sam and Nana through convincing dialogue. The mild-mannered plot, however, drifts into anticlimax, losing emotional momentum. Ages 4-8.<br/>Copyright 1989 Reed Business Information, Inc.<br/><br/>From School Library Journal<br/><br/>Kindergarten-Grade 3-- As in her The Crack-of-Dawn Walkers (Macmillan, 1984) and The Purple Coat (Four Winds, 1986), Hest portrays a loving and supportive relationship between grandparents and grandchild. In this case, Samantha Blustein is sharing a room with her grandmother while Nana recovers from an unnamed illness. One sleepless snowy night, Nana decides a refrigerator raid is just what the doctor ordered. The two sneak downstairs, build a fire, and create the most delicious ice cream sundaes imaginable. They then share family photos, memories, and the promise to have another "midnight eaters" meeting. Hest adeptly portrays the special love and understanding between generations, showing a genuine respect for the aged--void of adoration, pity, or sentimentality. The vigor of the characters is paralleled in the energy and rhythm of the text. Figures, young and old, are drawn with realism and humor in narration and illustrations. Gundersheimer\'s framed warm-toned pastels are the perfect extension of the story. As Nana and Sam share memories, soft colors give way to black-and-white drawings that resemble old photos, then return to the bright hues of the present. This is a true unity of story, narration, and illustration--a carefully polished and thoroughly enjoyable work. --Heide Piehler, Shorewood Public Library, WI<br/>Copyright 1989 Reed Business Information, Inc.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/63/03/9780027436303.jpg', 'title_long': 'Midnight Eaters', 'edition': 'First Edition', 'dimensions': 'Weight: 1.543235834 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 1.543235834}}, 'pages': 32, 'date_published': '1989-09-30', 'subjects': ["Children's Books"], 'authors': ['Hest'], 'title': 'Midnight Eaters', 'isbn13': '9780027436303', 'msrp': 13.95, 'binding': 'Hardcover', 'isbn': '0027436306', 'isbn10': '0027436306'}}