{'book': {'publisher': 'Macmillan General Reference', 'synopsis': 'Webster\'s New World Robert\'s Rules of Order Parliamentary procedure in plain English Webster\'s New World\x99 Robert\'s Rules of Order: Simplified and Applied explains the rules of parliamentary procedure in clear, modern terms and shows you how to apply the rules in a practical and effective way. This handy resource is organized and cross-referenced so you can find what you need quickly and easily. Clear discussions of the concepts behind each rule give you a firm foundation. Down-to-earth examples show you how to apply the rules to your own situation. Real-world "scripts" remove all guesswork about what you should say. Detailed examples of agendas and minutes help you organize and record your meetings. Step-by-step strategies are outlined for taking or blocking action. Timesaving tips make your meeting more efficient.Webster\'s New World\x99 Robert\'s Rules of Order: Simplified and Applied shows you the correct and practical use of parliamentary procedure, to guarantee your organization smooth, fair, and efficiently run meetings. See Inside! Web site and video series available', 'language': 'en', 'image': 'https://images.isbndb.com/covers/74/96/9780028627496.jpg', 'title_long': "Webster's New World Robert's Rules of Order: Simplified and Applied", 'edition': '1', 'dimensions': 'Height: 8 Inches, Length: 0.5 Inches, Weight: 0.70768386102 Pounds, Width: 4.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 0.5}, 'width': {'unit': 'inches', 'value': 4.75}, 'weight': {'unit': 'pounds', 'value': 0.70768386102}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 384, 'date_published': '1998', 'subjects': ['Business & Money', 'Skills', 'Communications', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Robert McConnell Productions'], 'title': "Webster's New World Robert's Rules of Order: Simplified and Applied", 'isbn13': '9780028627496', 'msrp': 8.95, 'binding': 'Paperback', 'isbn': '0028627490', 'isbn10': '0028627490'}}