{'book': {'publisher': 'Potomac Books Inc', 'synopsis': "Ambassador Ed Rowny holds a unique position in American history as a key arms control advisor and negotiator for presidents Nixon, Ford, Carter, Reagan, and Bush. No other policy-maker has ever negotiated for and counseled five presidents and their cabinets. Ambassador Rowny's revealing memoirs contain startling and sometimes amusing anecdotes about Henry Kissinger, Jim Baker, Amy Carter, drunken Soviet negotiators, Ronald Reagan, Leonid Brezhnev, Mikhail Gorbachev, and many other U.S. and world figures. It Takes One to Tango highlights what took place behind closed doors and is highly critical of George Bush's presidency.<br/>By the man who helped negotiate and then sink SALT II, this outspoken account of events at the highest government levels is a wry inside look at five U.S. administrations and a barbed commentary on the major players in the foreign policy and national security arenas. This is the book that tells you what it's like to sit at the conference table with presidents, how Brezhnev and Gorbachev behaved, what Ronald Reagan said about Raisa Gorbachev - and which emperors had no clothes. Ambassador Rowny provides an unprecedented look at world leaders, the Washington elite, and negotiating about life and death.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/03/79/9780028810379.jpg', 'title_long': 'It Takes One to Tango', 'dimensions': 'Height: 9.5 Inches, Length: 6.5 Inches, Weight: 1.25 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.25}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 320, 'date_published': '1992', 'subjects': ['History', 'Military', 'Weapons & Warfare', 'Politics & Social Sciences', 'Politics & Government', 'International & World Politics'], 'authors': ['Edward, L. Rowny'], 'title': 'It Takes One to Tango', 'isbn13': '9780028810379', 'msrp': 22, 'binding': 'Hardcover', 'isbn': '0028810376', 'isbn10': '0028810376'}}