{'book': {'publisher': "Brassey's Inc", 'synopsis': 'Over the past forty years, we have seen more advances in science and technology than in all of previous history. Our world has been transformed in ways that surpass the wildest imagination: advances in telecommunications let us sit in our living rooms and watch events taking place on the other side of the planet - wars, sporting events, famines, revolutions - as they actually occur; high school students around the world think nothing today of doing their homework on personal computers, each a fraction of the size and hundreds of times more powerful than the experimental models of the Fifties; doctors routinely perform delicate surgery with lasers. Fiberoptic cables connected to video cameras permit them to see inside the body and operate through tiny holes in the skin or without cutting the skin at all; military pilots and soldiers use infrared technology to see in the dark and electronic guidance to attack distant targets with unbelievable precision. Electronic simulators, like the time machines of science fiction, let them fight the wars of the future in a world of "virtual reality; and meteorologists, with data gathered by satellites and processed by computers, predict the movement of dangerous storms and save untold lives every year.In medicine, communications, education, defense, transportation - everywhere we look - science and technology have changed our way of life.This lavishly illustrated book chronicles the development of some of the essential technologies that, almost overnight, have changed the way you live: microchips, microprocessors and computers, communications satellites, simulators, lasers, fiber optics, thermal imaging, radar, and more. Inventing the Future is fascinating reading because it includes the inspiring stories of the inventors - creative men and women with visions and the courage to pursue them. By describing its incredible impact on your daily life, noted technology writer F. Clifton Berry, Jr., makes the world of science and technology understandable and one to which we all can relate. Inventing the Future is for you if you want to understand today\'s highly technical world and how it got that way. It\'s your invitation to join in mankind\'s most exciting adventure: the creation of tomorrow\'s world.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/02/94/9780028810294.jpg', 'title_long': 'Inventing the Future: How Science and Technology Transform Our World', 'dimensions': 'Height: 11.25 Inches, Length: 8.75 Inches, Weight: 1.873929227 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.75}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 1.873929227}, 'height': {'unit': 'inches', 'value': 11.25}}, 'pages': 180, 'date_published': '1993', 'subjects': ['Engineering & Transportation', 'Engineering', 'Science & Math', 'Technology', 'Politics & Social Sciences', 'Social Sciences'], 'authors': ['F. Clifton, Jr. Berry'], 'title': 'Inventing the Future: How Science and Technology Transform Our World', 'isbn13': '9780028810294', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0028810295', 'isbn10': '0028810295'}}