{'book': {'publisher': 'Wiley', 'synopsis': "Baseball fans were able to enjoy the first uninterrupted major league season in three years in 1996, and were rewarded with several record-breaking performances and unforgettable moments. Mark McGwire and Brady Anderson reached the 50 home run mark as more home runs were hit in 1996 than any other season in baseball history, Tony Gwynn captured his seventh batting title and Alex Rodriguez his first, while John Smoltz racked up 24 victories. Paul Molitor joined the 3,000 hit club and Eddie Murray blasted his 500th career homer. The New York Yankees returned to prominence by winning their 23rd World Championship, and their first since 1978. Fans can review this unforgettable year in The Baseball Encyclopedia® Update, 1997 Edition, the most complete source of information on the past major league season. It not only includes complete season and career records of every player and manager active in 1996, it also features standings, statistics, lineups for each team, a wrap-up of post-season action, plus the season leaders in every important category—all from The Baseball Encyclopedia's authoritative database. The Baseball Encyclopedia® Update, 1997 Edition, is the perfect companion to the tenth edition of The Baseball Encyclopedia® and the one book every fan needs to stay on top of the National Pastime. Visit us online at http://www.mcp.com/mgr/macmillan", 'language': 'en', 'image': 'https://images.isbndb.com/covers/51/27/9780028615127.jpg', 'title_long': 'The 1997 Baseball Encyclopedia Update: Complete Career Records for All Players Who Played in the 1996 Season', 'edition': '1', 'dimensions': 'height: 231 mm, length: 185 mm, width: 13 mm, weight: 369 g', 'dimensions_structured': {'length': {'unit': 'mm', 'value': 185}, 'width': {'unit': 'mm', 'value': 13}, 'weight': {'unit': 'g', 'value': 369}, 'height': {'unit': 'mm', 'value': 231}}, 'pages': 207, 'date_published': '1997-05-09', 'subjects': ['Sports & Outdoors', 'Baseball', 'Reference', 'Encyclopedias & Subject Guides', 'Sports'], 'authors': ['Ken Samelson', 'Macmillan Publishing'], 'title': 'The 1997 Baseball Encyclopedia Update: Complete Career Records for All Players Who Played in the 1996 Season', 'isbn13': '9780028615127', 'msrp': 14.95, 'binding': 'paperback', 'isbn': '0028615123', 'isbn10': '0028615123'}}