{'book': {'publisher': 'The Free Press', 'synopsis': "The story of Culpeper County, Virginia, is a unique one in Civil War history. Nestled in one of the South's most strategically important locations, it was occupied by the Northern army, recaptured by the Confederacy, and finally ceded to the North. Told largely through the diaries, papers, and correspondence of residents, common infantrymen, and such eminent personalities as Robert E. Lee, Walt Whitman, Ulysses S. Grant, Clara Barton, and Stonewall Jackson, all of whom spent time in Culpeper, this story wonderfully captures both the intimacy and grandeur of war.<br/>Sutherland's account of the war is unlike any other. Both a military and a social history, it details the life of a single Confederate community without losing sight of the titanic struggle of a nation divided. It allows readers to join the councils of Lee and Grant while sharing the letters of young couples separated by war. We frolic with the fun-loving Jeb Stuart, experience the confused terror of men in battle, feel the anguish of civilians surrounded by contending armies, observe the tensions between neighbors with different loyalties, and sense the joy of liberated slaves.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/04/30/9780028740430.jpg', 'title_long': 'Seasons of War: The Ordeal of the Confederate Community, 1861-1865', 'edition': 'First Edition', 'dimensions': 'Height: 9.5 Inches, Length: 6.5 Inches, Weight: 1.80999517102 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 1.80999517102}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 496, 'date_published': '1995-12-04', 'subjects': ['History', 'Americas', 'United States', 'Military'], 'authors': ['Daniel E. Sutherland'], 'title': 'Seasons of War: The Ordeal of the Confederate Community, 1861-1865', 'isbn13': '9780028740430', 'msrp': 3.33, 'binding': 'Hardcover', 'isbn': '0028740432', 'isbn10': '0028740432'}}