{'book': {'publisher': 'Alpha', 'synopsis': '-- Covers the events of the past three tumultuous years.-- A must-read for anyone who wants to truly understand the long history of the conflict.<br/><br/>-- Includes new chapters that cover the histories of the Arab nations as well as thepost-9/11 Middle East.<br/><br/>Since the escalation of the conflict in the Middle East and the terrorist attacks in Israel and battling in the Israeli-occupied territories of the West Bank, many Americans have turned to The Complete Idiot\'s Guide "RM" to Middle East Conflict for information. No matter whether readers are pro-Israeli or pro-Palestinian -- or somewhere in between -- it is crucial, particularly following the events of September 11, 2001, for us to understand the history of the conflict, including the disputes and the peace treaties, the U.S., and international intervention, and the reasons why the Middle East has always been the most disputed territory in the world. This second edition of the book will bring the conflict up to date, covering Ariel Sharon\'s visit to Haram al-Sharif, the failure of the Camp David summit in 2000, the most recent intifada and the current wave of suicide bombings, the confinement of Yasser Arafat in his Ramallah headquarters, the effect of 9/11 on the conflict, and more. The revision will also include more information on the Arab nations of the Middle East and the Palestinian side of the conflict.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/41/03/9780028644103.jpg', 'title_long': "The Complete Idiot's Guide to Middle East Conflict (2nd Edition)", 'edition': '2nd', 'dimensions': 'Height: 9.1 Inches, Length: 7.36 Inches, Weight: 1.81440441626 Pounds, Width: 1.14 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.36}, 'width': {'unit': 'inches', 'value': 1.14}, 'weight': {'unit': 'pounds', 'value': 1.81440441626}, 'height': {'unit': 'inches', 'value': 9.1}}, 'pages': 504, 'date_published': '2002-11-12', 'subjects': ['History', 'Middle East', 'Reference', 'Foreign Language Study & Reference', 'Politics & Social Sciences', 'Politics & Government', 'International & World Politics'], 'authors': ['Mitchell Bard Ph.D.', 'Mitchell G. Bard'], 'title': "The Complete Idiot's Guide to Middle East Conflict (2nd Edition)", 'isbn13': '9780028644103', 'msrp': 18.95, 'binding': 'Paperback', 'isbn': '0028644107', 'isbn10': '0028644107'}}