{'book': {'publisher': 'Schirmer Trade Books', 'synopsis': "Music/Jazz BiographyFirst English-language biography of a legendary and compelling jazz artist.Thelonious Monk was one of jazz's legendary figures, whose life story has yet to be told. Pianist and bandleader, he led the legendary jam sessions at Harlem's Minton's Playhouse where, along with Charlie Parker and Dizzy Gillespie, he helped mold the nascent style of bebop. Monk's composition 'Round Midnight; Straight, No Chaser; Blue Monk; Misterioso; Rhythm-a-ning; and countless others have become classics in the jazz repertoire. Monk's piano playing was so unique that it has been widely emulated and praised, but never equaled. His personal life was also unique, including a long battle with depression and mental illness that finally led to his total withdrawal from recording and music making years before his tragic death. This book tells Monk's story based on first-hand interviews with the musicians who worked with him, along with the participation of his son, T.S., and other family members. It discusses both his musical and personal lives in frank detail, and illuminates one of the most important jazz player's of our time. Leslie Gourse is a well-known authority and writer on jazz. Her books have been widely praised, including Sassy: The Biography of Sarah Vaughan; Unforgettable: The Life and Mystique of Nat King Cole; and Madame Jazz. She has been awarded an ASCAP award for her journalism. Additionally, she writes regularly on jazz for both specialty journals and popular newspapers and magazines, including The New York Times, Christian Science Monitor, Village Voice, Boston Globe, Jazz Times, Harper's Bazaar, Elle, New York, Cosmopolitan, and many others. She has written liner notes for many jazz labels.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/65/65/9780028646565.jpg', 'title_long': 'Straight, No Chaser: The Life and Genius of Thelonious Monk', 'edition': 'First Edition', 'dimensions': 'Height: 9.55 Inches, Length: 6.45 Inches, Weight: 1.40875385418 Pounds, Width: 1.15 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.45}, 'width': {'unit': 'inches', 'value': 1.15}, 'weight': {'unit': 'pounds', 'value': 1.40875385418}, 'height': {'unit': 'inches', 'value': 9.55}}, 'pages': 400, 'date_published': '1997-10-01', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Composers & Musicians'], 'authors': ['Leslie Gourse'], 'title': 'Straight, No Chaser: The Life and Genius of Thelonious Monk', 'isbn13': '9780028646565', 'msrp': 30, 'binding': 'Hardcover', 'isbn': '0028646568', 'isbn10': '0028646568'}}