{'book': {'publisher': 'Wiley', 'synopsis': "While any number of encyclopedic volumes have been published in recent years about women's health, few books have offered the clearly presented, inside information to be found in The Unofficial Guide to Women's Health. Too often doctors -- male and female -- tell their women patients what the medical establishment thinks they ought to know, rather than answering the questions that are crucial to their physical and mental health. From general matters, such as how to choose a doctor and deal with insurance companies and HMOs, to specifically female issues, such as uterine and breast cancer, The Unofficial Guide to Women's Health presents the information women want and need to know yet so often don't receive from the official sources, including: How to work the health-care system, and the 10 questions to ask the doctor on the first visit Why it's important to have testosterone levels checked before beginning hormone replacement therapy Which commonly ordered prenatal tests aren't really necessary, even for high-risk moms When it's time to ask for help in dealing with relationships, overcoming anxiety, and controlling substance abuse What body changes women can expect as they age How to combat stress and anxiety How women can protect their sexual health How to use nutrition, exercise, and a healthy lifestyle to stay energetic and radiant -- at any age", 'language': 'en', 'image': 'https://images.isbndb.com/covers/66/65/9780028636665.jpg', 'title_long': "The Unofficial Guide to Women's Health", 'edition': '1', 'dimensions': 'Height: 8.2200623 Inches, Length: 5.338572 Inches, Weight: 2.18698563904 Pounds, Width: 1.921256 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.338572}, 'width': {'unit': 'inches', 'value': 1.921256}, 'weight': {'unit': 'pounds', 'value': 2.18698563904}, 'height': {'unit': 'inches', 'value': 8.2200623}}, 'pages': 400, 'date_published': '2000-01-15', 'subjects': ['Health, Fitness & Dieting', "Women's Health", 'General', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Carol A. Turkington', 'Susan J. Probst'], 'title': "The Unofficial Guide to Women's Health", 'isbn13': '9780028636665', 'msrp': 15.95, 'binding': 'Paperback', 'isbn': '002863666X', 'isbn10': '002863666X'}}