{'book': {'publisher': '*Frommers', 'synopsis': 'You\x92ll never fall into the tourist traps when you travel with Frommer\x92s. It\x92s like having a friend show you around, taking you to the places locals like best. Our expert authors have already gone everywhere you might go\x97they\x92ve done the legwork for you, and they\x92re not afraid to tell it like it is, saving you time and money. No other series offers candid reviews of so many hotels and restaurants in all price ranges. Every Frommer\x92s Travel Guide is up-to-date, with exact prices for everything, dozens of color maps, and exciting coverage of sports, shopping, and nightlife. You\x92d be lost without us!<br/>Completely updated every year (unlike most of the competition), Frommer\x92s Hawaii features gorgeous color photos of the stunning beaches and thrilling adventures that await you. Meticulously researched by two of Hawaii\x92s most noted journalists, this is hands-down the most reliable, up-to-date, and comprehensive guide to the islands.<br/>Each of our candid hotel reviews is based on a detailed personal inspection. You\x92ll find lavish beachfront resorts, intimate rain-forest B&Bs, family-friendly condos, and much, much more. Our dining reviews are simply the best in the business, whether you crave cutting-edge Asian-fusion cuisine or a hearty, affordable plate lunch.<br/>Our authors make sure that you\x92ll truly experience the spirit of aloha, and they\x92ll help you steer clear of anything that\x92s overpriced, touristy, or inauthentic. With Frommer\x92s in hand, you\x92ll know where to find secluded beaches; secret spots for snorkeling; the best outfitters to choose for everything from diving to deep-sea fishing; and where to find the top galleries and shops.<br/>Inside you\x92ll find extensive coverage of family-friendly accommodations and activities; tips on how to get married in the islands; recommendations for the best honeymoon resorts; and valuable advice on finding the best airfares and package deals. Whether you want to watch the fiery spectacle at the Big Island\x92s volcano, play a challenging round of golf, snorkel with sea turtles, or simply kick back with a mai tai to watch the sunset, you can design the perfect trip with Frommer\x92s Hawaii. You\x92ll even get a free color fold-out map, and an online directory that makes trip-planning a snap!', 'language': 'en', 'image': 'https://images.isbndb.com/covers/78/08/9780028637808.jpg', 'title_long': "Frommer's Hawaii 2001", 'edition': '1', 'dimensions': 'Height: 8.436991 Inches, Length: 5.657469 Inches, Weight: 1.3448197982 Pounds, Width: 1.188974 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.657469}, 'width': {'unit': 'inches', 'value': 1.188974}, 'weight': {'unit': 'pounds', 'value': 1.3448197982}, 'height': {'unit': 'inches', 'value': 8.436991}}, 'pages': 656, 'date_published': '2000-09-15', 'subjects': ['Travel', 'United States', 'West'], 'authors': ['Jeanette Foster', 'Jocelyn K. Fujii'], 'title': "Frommer's Hawaii 2001", 'isbn13': '9780028637808', 'msrp': 18.99, 'binding': 'Paperback', 'isbn': '0028637801', 'isbn10': '0028637801'}}