{'book': {'publisher': 'Wiley', 'synopsis': "Dr. Sheldon Blau almost died after undergoing open-heart surgery—not from the surgery or heart disease, but from infectious bacteria introduced during surgery. His in-hospital experiences made him a better doctor, and inspired him to write How to Get Out of the Hospital Alive. The book describes the role of each member of the medical team, shows patients how to become active, effective members of that team, and offers concrete advice about ways to avoid the most common hospital-related errors.<br/>Ten Things You Can Do to Get Out of the Hospital Alive Make sure all your known allergies are clearly marked on your chart, wrist band, or on a piece of paper taped above your bed. Mark the area of your body to be operated on with a felt-tip pen. Never eat or drink anything before surgery, even if the nurse brings you a food tray. Tell your anesthesiologist if you're on any type of medication. Have a reliable advocate with you as often as possible throughout your hospital stay. Write your name prominently on a piece of paper and tape it to the wall above your bed. Always ask the nurse to check the name and dosage of any medication he or she is about to give you. Don't let anyone bully you. Don't hesitate to get a second—or third—opinion. Trust your instincts.<br/>Visit us online at http://www.mgr.com", 'language': 'en', 'image': 'https://images.isbndb.com/covers/36/34/9780028623634.jpg', 'title_long': 'How to Get Out of the Hospital Alive: A Guide to Patient Power', 'edition': '1', 'dimensions': 'Height: 9.21 Inches, Length: 6.14 Inches, Weight: 0.8046872563 Pounds, Width: 0.69 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.14}, 'width': {'unit': 'inches', 'value': 0.69}, 'weight': {'unit': 'pounds', 'value': 0.8046872563}, 'height': {'unit': 'inches', 'value': 9.21}}, 'pages': 256, 'date_published': '1998-07-01', 'subjects': ['Cookbooks, Food & Wine', 'Vegetarian & Vegan', 'Non-Vegan Vegetarian', 'Health, Fitness & Dieting', 'Reference', 'Medical Books', 'Administration & Medicine Economics', 'Hospital Administration'], 'authors': ['Sheldon Paul Blau'], 'title': 'How to Get Out of the Hospital Alive: A Guide to Patient Power', 'isbn13': '9780028623634', 'msrp': 14.95, 'binding': 'Paperback', 'related': {'ePub': '1620458586'}, 'isbn': '0028623630', 'isbn10': '0028623630', 'other_isbns': [{'isbn': '9781620458587', 'binding': 'print'}]}}