{'book': {'publisher': 'IDG Books', 'synopsis': "Cruising is the perfect way to see America's last frontier—wildlife and wilderness abound along the state's breathtaking coastline, and are easily seen from the comfort of a deck chair or observation lounge.<br/>Thoroughly updated every year (unlike the rest of the competition), Frommer's Alaska Cruises & Ports of Call is a compact guide that's on top of all the latest developments and offerings in the rapidly changing cruise industry. Our authors, both leading cruise journalists with years of experience, have compiled candid, first-hand reviews of each cruise line and each ship. The easy-to-use ratings, detailed drawings of each ship, and honest evaluations make it easy for you to find the cruise that suits your budget and your personal style, whether you want a luxury liner with fine dining or a small-ship cruise led by serious naturalists.<br/>You'll also find a nature guide that helps you understand what you're seeing, complete with illustrations of glaciers and the various types of whales. We'll show you how to get the best deals and how to maximize your time in the ports of call—all in one concise, pocket-sized volume.<br/>For an in-depth guide to the rest of the state, check out Frommer's Alaska.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/51/32/9780028635132.jpg', 'title_long': "Frommer's 2000 Alaska Cruises & Ports of Call", 'edition': '1', 'dimensions': 'Height: 7.318883 Inches, Length: 4.196842 Inches, Weight: 0.40344593946 Pounds, Width: 0.578739 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.196842}, 'width': {'unit': 'inches', 'value': 0.578739}, 'weight': {'unit': 'pounds', 'value': 0.40344593946}, 'height': {'unit': 'inches', 'value': 7.318883}}, 'pages': 208, 'date_published': '2000-01-15', 'subjects': ['Travel', 'Specialty Travel', 'Cruises', 'United States', 'West'], 'authors': ['Fran Wenograd Golden', 'Jerry Brown'], 'title': "Frommer's 2000 Alaska Cruises & Ports of Call", 'isbn13': '9780028635132', 'msrp': 11.99, 'binding': 'Paperback', 'isbn': '0028635132', 'isbn10': '0028635132'}}