{'book': {'publisher': 'Wiley', 'synopsis': "The inside scoop\x85 for when you want more than the official line! More than one in seven Americans will suffer from arthritis at some point in their lives. The term arthritis refers to a family of more than 100 distinct disorders\x97including osteoarthritis, rheumatoid arthritis, lupus, and gout. Each type creates different symptoms and demands different treatment. If you have arthritis, you want to keep the aches and pains from cramping your lifestyle. You want to explore the best treatments, preventative strategies, and pain management techniques available. You want information on the latest medications that may ease your symptoms. You want the inside scoop. The Unofficial Guide\x99 to Overcoming Arthritis gives savvy people like you a foolproof appraisal of everything you need to know, with unbiased recommendations that are not influenced by any company, product, or organization. This book, like every Unofficial Guide\x99, is intensively inspected by The Unofficial Panel of Experts, a team of highly respected medical professionals. They ensure that you are armed with the most up-to-date insider information on arthritis and are told exactly what the Official establishment doesn't want you to know. Vital Information that other sources can't or won't reveal\x97 including all the current therapies and medical interventions available. Insider Secrets from medical specialists and clinical researchers\x97and people just like you who have found the best strategies for coping with arthritis. Money-Saving Techniques that let you choose effective treatments without running up high medical bills. Time-Saving Tips that help you overcome the aches and pains of arthritis with minimal disruption to your daily routine. The Latest Trends in arthritis treatments, including both traditional and non-traditional therapy. Handy Checklists and Charts that help you manage your arthritis and minimize its impact on your daily life. Macmillan Lifestyle Guides", 'language': 'en', 'image': 'https://images.isbndb.com/covers/71/44/9780028627144.jpg', 'title_long': 'The Unofficial Guide? to Overcoming Arthritis (Unofficial Guides)', 'edition': '1', 'dimensions': 'Height: 8.157464 Inches, Length: 5.259832 Inches, Weight: 0.87523518014 Pounds, Width: 1.149604 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.259832}, 'width': {'unit': 'inches', 'value': 1.149604}, 'weight': {'unit': 'pounds', 'value': 0.87523518014}, 'height': {'unit': 'inches', 'value': 8.157464}}, 'pages': 400, 'date_published': '1999-05-21', 'subjects': ['Health, Fitness & Dieting', 'Diseases & Physical Ailments', 'Musculoskeletal Diseases', 'Reference', 'Medical Books', 'Medicine', 'Internal Medicine'], 'authors': ['Lisa Iannucci', 'Mark Horowitz'], 'title': 'The Unofficial Guide? to Overcoming Arthritis (Unofficial Guides)', 'isbn13': '9780028627144', 'msrp': 15.95, 'binding': 'Paperback', 'isbn': '0028627148', 'isbn10': '0028627148'}}