{'book': {'publisher': '*Frommers', 'synopsis': "You'll never fall into the tourist traps when you travel with Frommer's. It's like having a friend show you around, taking you to the places locals like best. Our expert authors have already gone everywhere you might go--they've done the legwork for you, and they're not afraid to tell it like it is, saving you time and money. No other series offers candid reviews of so many hotels and restaurants in all price ranges. Every Frommer's Travel Guide is up-to-date, with exact prices for everything, dozens of color maps, and exciting coverage of sports, shopping, and nightlife. You'd be lost without us!<br/>Completely updated every year (unlike most of the competition), Frommer's Germany features gorgeous color photos of the dazzling baroque architecture, picturesque villages, and beer gardens that await you. Come along with us and discover some of Europe's most spectacular scenery, from the medieval towns and half-timbered houses along the Romantic Road to lovely vineyards along the Rhine River. Frommer's offers up-to-date coverage of all the country's highlights--music festivals, hiking in the Black Forest, Oktoberfest, cafes, castles, and Berlin's vibrant, cutting-edge cultural scene.<br/>Inside you'll find candid, detailed reviews of the very best dining and accommodations for any taste and budget. We offer a wealth of sightseeing, sports, shopping, strolls, and special moments--from highlights for the first-time visitor to off-the-beaten-track discoveries that will impress even the most seasoned traveler.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/06/87/9780028630687.jpg', 'title_long': "Frommer's Germany 2000 (Country Annual)", 'edition': '12', 'dimensions': 'Height: 8.456676 Inches, Length: 5.059045 Inches, Weight: 1.44843706134 pounds, Width: 1.248029 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.059045}, 'width': {'unit': 'inches', 'value': 1.248029}, 'weight': {'unit': 'pounds', 'value': 1.44843706134}, 'height': {'unit': 'inches', 'value': 8.456676}}, 'pages': 688, 'date_published': '1999-10-04', 'subjects': ['Travel', 'Europe', 'Germany', 'General'], 'authors': ['Darwin Porter', 'Danforth Prince'], 'title': "Frommer's Germany 2000 (Country Annual)", 'isbn13': '9780028630687', 'msrp': 19.95, 'binding': 'Paperback', 'isbn': '0028630688', 'isbn10': '0028630688'}}