{'book': {'publisher': "Frommer's", 'synopsis': "You'll never fall into the tourist traps when you travel with Frommer's. It's like having a friend show you around, taking you to the places locals like best. Our expert authors have already gone everywhere you might go--they've done the legwork for you, and they're not afraid to tell it like it is, saving you time and money. No other series offers candid reviews of so many hotels and restaurants in all price ranges. Every Frommer's Travel Guide is up-to-date, with exact prices for everything, dozens of color maps, and exciting coverage of sports, shopping, and nightlife. You'd be lost without us!<br/>This brand-new guide will show you the best of Vancouver, the hottest destination in North America, where you can enjoy cutting-edge Asian-fusion cuisine and experience firsthand its vibrant arts and nightlife scene. Then we'll take you into some of the most spectacular, unspoiled countryside on the continent, where you can enjoy whale watching, sea kayaking, canoeing, wildlife viewing, downhill skiing, wine tasting, hiking, biking, and more. In the Rockies, you'll get full coverage of gorgeous Banff and Jasper National Parks, and we'll also take you to the glowing glacial waters of Lake Louise. Our author has traveled every inch of this vast region, and he's chosen the best places to stay: wilderness lodges, guest ranches, elegant B&Bs, mom-and-pop motels, secluded campgrounds, and luxury resorts. With Frommer's in hand, it's a snap to design the Canadian adventure that's right for you.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/62/83/9780028636283.jpg', 'title_long': "Frommer's British Columbia & the Canadian Rockies", 'edition': '1', 'dimensions': 'Height: 8.476361 Inches, Length: 5.657469 Inches, Weight: 1.00089866948 Pounds, Width: 1.066927 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.657469}, 'width': {'unit': 'inches', 'value': 1.066927}, 'weight': {'unit': 'pounds', 'value': 1.00089866948}, 'height': {'unit': 'inches', 'value': 8.476361}}, 'pages': 459, 'date_published': '2000-06-27', 'subjects': ['Travel', 'Canada', 'Provinces', 'General'], 'authors': ['Bill McRae', 'Shawn Blore'], 'title': "Frommer's British Columbia & the Canadian Rockies", 'isbn13': '9780028636283', 'msrp': 18.99, 'binding': 'Paperback', 'isbn': '0028636287', 'isbn10': '0028636287'}}