{'book': {'publisher': 'Wiley', 'synopsis': 'Whether working, single, married, or widowed, every woman should have a basic understanding about how to invest and manage her money. This valuable new reference introduces, in easy to understand language, the world of investing to any woman who wants to learn more. It is an indispensable guide for developing an investment program to insure one\'s financial security. Advance praise for Investment Basics for Women from top financial executives "Women need to take control of their financial lives, and this book is an important step. Kathy Buys and Jonathan Berohn have done a terrific job explaining the concepts and issues for women." \x97Bridget A. Macaskill President and Chief Executive Officer Oppenheimer Funds, Inc. "Experts estimate that 90% of all women will have sole control over their finances at some point in their lives\x85Through this book, Kathy has clarified the basics of investing and provided the tools necessary for women to face their unique issues in preparing for the future." \x97Elizabeth T. Sorrells Senior Vice President, Colonial Investment Services, Inc. Co-author of two books: Financial Planning Under the New Rules: An Investor\'s Guide to the Tax Reform Act of 1986 Tax Reform Act of 1986: The Financial Planner Seminar Series', 'language': 'en', 'image': 'https://images.isbndb.com/covers/17/54/9780028611754.jpg', 'title_long': 'Investment Basics for Women: The Essential Guide to Taking Charge of Your Money', 'edition': '1', 'dimensions': 'Height: 9.059037 Inches, Length: 7.318883 Inches, Weight: 0.81350574678 Pounds, Width: 0.507873 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.318883}, 'width': {'unit': 'inches', 'value': 0.507873}, 'weight': {'unit': 'pounds', 'value': 0.81350574678}, 'height': {'unit': 'inches', 'value': 9.059037}}, 'pages': 204, 'date_published': '1996-12-26', 'subjects': ['Business & Money', 'Economics', 'Investing', 'Personal Finance'], 'authors': ['Kathy Buys', 'Jonathan Berohn'], 'title': 'Investment Basics for Women: The Essential Guide to Taking Charge of Your Money', 'isbn13': '9780028611754', 'msrp': 16.95, 'binding': 'Paperback', 'isbn': '0028611756', 'isbn10': '0028611756'}}