{'book': {'publisher': 'Free Pr', 'synopsis': 'A Conception Of Practice. An Approach To Group Work Practice / Robert D. Vinter ; The Essential Components Of Social Group Work Practices / Robert D. Vinter ; Social Group Work : The Preventive And Rehabilitative Approach / Charles D. Garvin And Paul H. Glasser ; Behavior Theory And Group Work / Rosemary C. Sarri ; A Conceptual Framework For Group Development / Rosemary C. Sarri And Maeda J. Galinsky ; Socioeducation Groups / Norma Radin --^ The Treatment Sequence. Diagnosis In Group Work / Martin Sundel, Norma Radin Adn Sallie R. Churchill ; Goals In Social Group Work Practice : Formulation, Implementation And Evaluation / Janice H. Schopler And Maeda J. Galinsky ; Modes Of Integration And Conformity Behavior : Implications For Social Group Work Intervention / Ronald A. Feldman ; The Therapeutic Contract In Social Treatment / Tom A. Croxton ; Elements And Issues In Group Composition / Harvey J. Bertcher And Frank Maple ; Group Process : Usage And Uses In Social Work Practice / Charles D. Garvin ; Program Activities : An Analysis Of Their Effects On Participant Behavior / Robert D. Vinter ; Program Activities : Their Selection Adn Use In A Therapeutic Milieu / James K. Whittaker ; Planning For Termination Of The Group / Carole Johnson ; A Comparison Of Two Models Of Social Group Work : The Treatment Model And The Reciprocal Model / Sallie R. Churchill --^ The Group In The Social Environment. Extragroup Relations And Approaches / Robert D. Vinter Adn Maeda J. Galinsky ; Group Work Intervention In The Social Environment / Paul H. Glasser, Beryl Carter, Richard English, Charles D. Garvin And Charles Wolfson ; Organizational Factors In Services In Groups / Yeheskel Hasenfeld --^ Group Work In Selected Fields Of Practice. Behavioral Group Treatment With Adults In A Family Service Agency / Martin Sundel And Harry Lawrence ; A Behavioral Approach To The Group Treatment Of Parents / Sheldon D. Rose ; Preventative, Short-term Groups For Siblings Of Child Mental Hospital Patients / Sallie R. Churchill ; Small Groups In The Mental Hospital / Sallie R. Churchill And Paul H. Glasser ; An Evaluatio Nof Group Work Practice With Afdc Mothers / Elizabeth Navarre, Paul H. Glasser And Jane Costabile ; The Hartwig Project : A Behavior Approach To The Treatment Of Juvenile Offenders / Sheldon D. Rose And Martin Sundel ; Integrating Divergent Theories In A Compensatory Preschool Program / Norma Radin And Glorianne Wittes ; Beyond Group Work : Organizational Determinants Of Malperformance In Secondary Schools / Rosemary C. Sarri And Robert D. Vinter ; Reinforcement And Estimation Procedures In A Child Development Program / Alan Conner ; Group Treatment Of Alcoholics / Edwin J.^ Thomas And Paul V. Soren -- Conclusion. The Bases Of Social Treatment / Charles D. Garvin And Paul H. Glasser. Edited By Paul Glasser, Rosemary Sarri, Robert Vinter. Includes Six Rev. And Updated Papers Published In 1967 Under Title: Readings In Group Work Practice, Edited By R. D. Vinter. Includes Bibliographical References And Index. Includes Bibliographies. Also Issued Online.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/81/08/9780029118108.jpg', 'title_long': 'Individual Change Through Small Groups.', 'edition': '1', 'dimensions': 'xii, 515 p. 24 cm.', 'pages': 515, 'date_published': '1974', 'subjects': ['Politics & Social Sciences', 'Social Sciences'], 'authors': ['Paul H. Glasser'], 'title': 'Individual Change Through Small Groups.', 'isbn13': '9780029118108', 'msrp': 4.95, 'binding': 'Hardcover', 'isbn': '0029118107', 'isbn10': '0029118107'}}