{'book': {'publisher': 'Free Press', 'synopsis': "In a fascinating and insightful examination of the phenomenon of brand equity, Aaker provides a clear and well-defined structure of the relationship between a brand and its symbol and slogan, as well as each of the five underlying assets, which will clarify for managers exactly how brand equity does contribute value.<br/><br/>The most important assets of any business are intangible: its company name, brands, symbols, and slogans, and their underlying associations, perceived quality, name awareness, customer base, and proprietary resources such as patents, trademarks, and channel relationships. These assets, which comprise brand equity, are a primary source of competitive advantage and future earnings, contends David Aaker, a national authority on branding. Yet, research shows that managers cannot identify with confidence their brand associations, levels of consumer awareness, or degree of customer loyalty. Moreover in the last decade, managers desperate for short-term financial results have often unwittingly damaged their brands through price promotions and unwise brand extensions, causing irreversible deterioration of the value of the brand name. Although several companies, such as Canada Dry and Colgate-Palmolive, have recently created an equity management position to be guardian of the value of brand names, far too few managers, Aaker concludes, really understand the concept of brand equity and how it must be implemented.<br/><br/>The author opens each chapter with a historical analysis of either the success or failure of a particular company's attempt at building brand equity: the fascinating Ivory soap story; the transformation of Datsun to Nissan; the decline of Schlitz beer; the making of the Ford Taurus; and others. Finally, citing examples from many other companies, Aaker shows how to avoid the temptation to place short-term performance before the health of the brand and, instead, to manage brands strategically by creating, developing, and exploiting each of the five assets in turn", 'language': 'en', 'image': 'https://images.isbndb.com/covers/10/11/9780029001011.jpg', 'title_long': 'Managing Brand Equity', 'edition': 'New Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.125 Inches, Weight: 1.14419913978 Pounds, Width: 1.1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.125}, 'width': {'unit': 'inches', 'value': 1.1}, 'weight': {'unit': 'pounds', 'value': 1.14419913978}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 299, 'date_published': '1991-09-09', 'subjects': ['Business & Money', 'Management & Leadership', 'Management', 'Marketing & Sales', 'Consumer Behavior', 'Marketing'], 'authors': ['David A. Aaker'], 'title': 'Managing Brand Equity', 'isbn13': '9780029001011', 'msrp': 35, 'binding': 'Hardcover', 'related': {'ePub': '1439188386'}, 'isbn': '0029001013', 'isbn10': '0029001013', 'other_isbns': [{'isbn': '9781439188385', 'binding': 'print'}]}}