{'book': {'publisher': 'Free Press', 'synopsis': 'Here is one of the most enjoyable and illuminating books ever published for the music lover, a feast of delightful anecdotes that reveal the all-too-human side of the great composers and performers.<br/>There are stories of appetites (Handel eating dinner for three), embarrassments (Brahms falling asleep as Liszt plays), oddities (Bruckner\'s dog being trained to howl at Wagner), and devotions (a lovely admirer disrobing in tribute to Puccini). There are memorable accounts of Stravinsky telling Proust how much he hates Beethoven, of Tchaikovsky\'s first bewildering telephone call, of Dvorak\'s strange love of pigeons, and of Verdi\'s intricate maneuvering to keep the now-famous melody of "La donna è mobile" top secret.<br/>There is also wonderful trivia (Beethoven loved to cat "bread soup" made with ten raw eggs), along with eccentric strategies (Verdi, disturbed by the sound of street organs playing arias from his operas, hired them all for a season and kept them locked in a room). There are examples of musicians munificent generosity (Haydn called Mozart "the greatest composer known to me, either in person or by name"), and scathing dismissal ("Have you heard any Stockhausen?" the conductor Sir Thomas Beecham was asked. "No," he replied, "but I believe I have trodden in some").<br/>Collected from thousands of books, articles, and unpublished manuscripts (with historical sources provided in extensive notes), these anecdotes appear in their original form, throwing fresh light on familiar figures in the musical hall of fame. For browsing, reading, research and amusement, this book is a grand entertainment for concert-goers, record-buyers, operamanes, gossips and music lovers everywhere.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/71/04/9780029187104.jpg', 'title_long': 'Book of Musical Anecdotes', 'edition': '2nd Printing', 'dimensions': 'Height: 1.5 Inches, Length: 9.1 Inches, Weight: 0.00220462262 Pounds, Width: 6.3 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 9.1}, 'width': {'unit': 'inches', 'value': 6.3}, 'weight': {'unit': 'pounds', 'value': 0.00220462262}, 'height': {'unit': 'inches', 'value': 1.5}}, 'pages': 384, 'date_published': '1985-12-01', 'subjects': ['Arts & Photography', 'Music', 'Reference', 'Encyclopedias & Subject Guides'], 'authors': ['Norman Lebrecht'], 'title': 'Book of Musical Anecdotes', 'isbn13': '9780029187104', 'msrp': 30, 'binding': 'Hardcover', 'isbn': '0029187109', 'isbn10': '0029187109'}}