{'book': {'publisher': 'Free Press', 'synopsis': 'In Defying the Crowd, world-renowned psychologist Robert Sternberg, with the assistance of Todd Lubart, presents a fresh and compelling picture of the creative process from the inception of an idea to its ultimate success. Drawing on his pathbreaking research on creativity and intelligence, Sternberg shows that the creative person is one who has the foresight, determination, and, sometimes, the necessary luck, to "buy low and sell high" - that is, to consistently develop ideas that may be unfashionable or misunderstood at first but gain currency over time as the public catches on to the significance of the idea. With fascinating examples from business, education, politics, and the arts, Sternberg reveals the intuitive method the creative person employs to predict early on which ideas and products will gain popularity and how that person promotes his or her ideas effectively despite initial resistance.<br/>Sternberg also looks at the role intelligence plays in determining a person\'s creativity. Drawing on an innovative summer program he developed for fostering creativity, Sternberg shows that the traditional high-IQ student, typically labeled "gifted" in our schools, often does very poorly when it comes to producing original, insightful ideas. As he shows, because our schools prize almost exclusively the ability to memorize and analyze material, the development of original thinking is given short shrift. Sternberg also looks at the role knowledge of a field, as well as particular styles of thinking, personality, and motivation, play in the development of creativity. He concludes that it is the right amount and balance of these factors that makes for a fully creative person.<br/>Finally, Sternberg examines the ways in which such institutions as business and education consistently seek to squelch creative ideas and how the creative person typically finds ways to subvert those institutions to promote his or her ideas. Most importantly, Sternberg explores the paths we can all take to become more creative as he shows how institutions can learn to foster creativity.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/47/53/9780029314753.jpg', 'title_long': 'Defying the Crowd: Cultivating Creativity in a Culture of Conformity', 'edition': 'First Edition', 'dimensions': 'Height: 9.5 Inches, Length: 6.5 Inches, Weight: 1.40875385418 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.40875385418}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 255, 'date_published': '1995-06-01', 'subjects': ['Self-Help', 'Relationships', 'Love & Romance', 'Health, Fitness & Dieting', 'Psychology & Counseling', 'Parenting & Relationships', 'Medical Books', 'Psychology', 'General'], 'authors': ['Robert J. Sternberg', 'Todd I. Lubart'], 'title': 'Defying the Crowd: Cultivating Creativity in a Culture of Conformity', 'isbn13': '9780029314753', 'msrp': 25, 'binding': 'Hardcover', 'isbn': '0029314755', 'isbn10': '0029314755'}}