{'book': {'publisher': 'Free Press', 'synopsis': 'From Pulitzer Prize-winning columnist George Will, whose “thinking is stimulating, erudite, and makes for great reading” (The Boston Globe) comes a “biting, humorous, and perceptive” (The New York Times Book Review) argument for the necessity of term limits in Congress.<br/><br/>The world’s oldest democracy—ours—has an old tradition of skepticism about government. However, the degree of dismay about government today is perhaps unprecedented in our history. Americans are particularly convinced that Congress has become irresponsible, either unwilling or incapable of addressing the nation’s problems—while it spends its time and our money on extending its members’ careers. Many Americans have come to believe fundamental reform is needed, specifically limits on the number of terms legislators can serve.<br/><br/>In Restoration, George Will makes a compelling case, drawn from our history and his close observance of Congress, that term limits are now necessary to revive the traditional values of classical republican government, to achieve the Founders’ goal of deliberative democracy, and to restore Congress to competence and its rightful dignity as the First Branch of government. At stake, Will says, is the vitality of America’s great promise self-government under representative institutions. At issue is the meaning of representation. The morality of representative government, Will argues, does not merely permit, it requires representatives to exercise independent judgment rather than merely execute instructions given by constituents. However, careerism, which is a consequence of the professionalization of politics, has made legislators servile and has made the national legislature incapable of rational, responsible behavior. Term limits would restore the constitutional space intended by the Founders, the healthy distance between the electors and the elected that is necessary for genuine deliberation about the public interest.<br/><br/>Blending the political philosophy of the Founders with alarming facts about the behavior of legislative careerists, Restoration demonstrates how term limits, by altering the motives of legislators, can narrow the gap between the theory and the practice of American democracy.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/71/33/9780029347133.jpg', 'title_long': 'Restoration: Congress, Term Limits and the Recovery of Deliberative Democracy', 'edition': 'Reprint', 'dimensions': 'Height: 0.81 Inches, Length: 8.87 Inches, Weight: 0.73634395508 Pounds, Width: 5.74 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.87}, 'width': {'unit': 'inches', 'value': 5.74}, 'weight': {'unit': 'pounds', 'value': 0.73634395508}, 'height': {'unit': 'inches', 'value': 0.81}}, 'pages': 272, 'date_published': '1993-12-31', 'subjects': ['History', 'Americas', 'United States', 'Politics & Social Sciences', 'Politics & Government', 'Ideologies & Doctrines', 'Political Science'], 'authors': ['George F. Will'], 'title': 'Restoration: Congress, Term Limits and the Recovery of Deliberative Democracy', 'isbn13': '9780029347133', 'msrp': 18.95, 'binding': 'Paperback', 'related': {'Kindle Edition': '143911904X', 'ePub': '143911904X'}, 'isbn': '0029347130', 'isbn10': '0029347130', 'other_isbns': [{'isbn': '9781439119044', 'binding': 'print'}]}}