{'book': {'publisher': 'Harcourt College Pub', 'synopsis': 'This text\'s straightforward manner helps make concepts accessible to finance students. It is intended for the introductory finance course required of all business majors, usually called "Corporate Finance".  Features: * Clear, uncomplicated practitioner\'s approach, organized in the balance sheet format, gives students a real-world corporate perspective, and minimizes use of complicated theory. * Chapter 3 on federal monetary policy and banks provides students with a foundation for understanding interest rates. * Format for self-test questions and problems allows students to work more problems in less time. * Many up-to-date real world examples show students the relevance of topics under study.  New to this edition: * New four-colour design * New author Bodie Dickerson brings new material from more than 12 years of teaching experiences with thousands of students at Oregon State. * Unique, stand-alone Lotus-based mini-cases which appear at the end of five chapters (6,7,9,14,16) allow students to build their own models without templates. As a result, they learn the entire process. Software has been class-tested for the past eight years in Dickerson\'s classes.  * Many new problems have been added based on Dickerson\'s teaching to large class sections at Oregon State. New problems are shorter, concise, and applied. * Chapter 9, Management of Cash & Market Securities, has been extensively revised, with an excellent new case on Cash Budget. * Learning objectives, tied into end-of-chapter summaries and main chapter points, provide continuity. Self-test questions provide the apparatus to check student knowledge. * Chapter 8 on working capital has been revised to improve coverage of this important topic. * The material on bond valuation (Ch. 16), common stock (Ch. 17) and financial institutions (Ch. 3) is treated by presenting the models first, followed by descriptive presentations, for a smooth flow of topics. * The International Finance chapter (23), written by Michael Moffet, now has a practical rather than a historical emphasis.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/07/70/9780030980770.jpg', 'title_long': 'Introduction to Financial Management: Study Guide', 'edition': 'Student', 'dimensions': 'Height: 11.25 Inches, Length: 8.75 Inches, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.75}, 'width': {'unit': 'inches', 'value': 1}, 'height': {'unit': 'inches', 'value': 11.25}}, 'pages': 800, 'date_published': '1994', 'subjects': ['Business & Money', 'Economics', 'Reference', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Bodil Dickerson', 'B. J. Campsey', 'Eugene F. Brigham'], 'title': 'Introduction to Financial Management: Study Guide', 'isbn13': '9780030980770', 'msrp': 34.95, 'binding': 'Paperback', 'isbn': '0030980771', 'isbn10': '0030980771'}}