{'book': {'publisher': 'Dryden Pr', 'synopsis': "This reader deals with the environment, external and internal strategic dimensions and implementation considerations from the viewpoint of the new entrant into the international market. Exporting, from the standpoint of both smaller and medium-sized firms, is given primary emphasis. Features: * Theoretical and pragmatic viewpoints are reflected, to encourage a thorough understanding of foreign market entry requirements, opportunities and strategies. * The first section, on the environment, outlines the growing interdependencies and linkages that make all firms part of international marketing. Trading blocs and international trade relationships are illustrated using the EC, the former communist bloc, the U.S. and Japan as examples. * Government assistance to firms in the start-up phase of international market entry is highlighted in the second section. These chapters include overviews of export promotion, with detail on who is helped and who isn't. * Chapter 8 presents a detailed study of a state government's efforts in export promotion. * Part 3 studies the factors affecting a firm's decision to internationalize or not. It also deals with the challenges that might be unfamiliar to firms which only market domestically. * Part 4 examines cost factors and competitive factors in light of globalized marketing. Product development, distribution, and trading companies are also among the topics included in this discussion of the impact of globalization.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/37/33/9780030983733.jpg', 'title_long': 'International Marketing Strategy: Environmental Assessment and Entry Strategies', 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 6.5 Inches, Weight: 1.05160498974 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 1.05160498974}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 353, 'date_published': '1997-11-01', 'subjects': ['Business & Money', 'Management & Leadership', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Michael R. Czinkota'], 'title': 'International Marketing Strategy: Environmental Assessment and Entry Strategies', 'isbn13': '9780030983733', 'msrp': 72.95, 'binding': 'Paperback', 'isbn': '0030983738', 'isbn10': '0030983738'}}