{'book': {'publisher': 'South-Western College Pub', 'synopsis': 'About the Author<br/><br/>Peter R. Dickson is the Knight-Ridder Eminent Scholar in Global Marketing at Florida International University. He was previously the Arthur C. Nielsen Jr., Chair of Marketing Research at the University of Wisconsin-Madison Nielsen Center for Marketing Research and the Crane Professor of Strategic Marketing at The Ohio State University. Dr. Dickson is heading up the NHCC/FIU Hispanic Market Research project, is the Academic Director of the Master of International Business, and is leading the launch of the Masters in Sales Management at the Chapman Business School, Florida International University. Dr. Dickson is the past Chairman of the marketing strategy special interest group of the American Marketing Association. He has won awards for his undergraduate and graduate teaching and four of his most recent academic papers have won national awards. He recently, co-authored with Dr. Tom Miller a paper that reviewed the impact of the Internet on market research. He has also written on the dubious origins of the Sherman Antitrust Act, a cornerstone of marketing law in the United States.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/74/22/9780030177422.jpg', 'title_long': 'Marketing Management', 'edition': '2', 'dimensions': 'Height: 10.37 Inches, Length: 1.25 Inches, Weight: 3.91100052788 Pounds, Width: 8.89 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 1.25}, 'width': {'unit': 'inches', 'value': 8.89}, 'weight': {'unit': 'pounds', 'value': 3.91100052788}, 'height': {'unit': 'inches', 'value': 10.37}}, 'pages': 852, 'date_published': '1996-10-11', 'subjects': ['Business & Money', 'Economics', 'Economic Conditions', 'Finance', 'Management & Leadership', 'Management', 'Marketing & Sales', 'Marketing', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Peter R. Dickson'], 'title': 'Marketing Management', 'isbn13': '9780030177422', 'msrp': 124.95, 'binding': 'Hardcover', 'isbn': '0030177421', 'isbn10': '0030177421'}}