{'book': {'publisher': 'Harcourt School', 'synopsis': "Published For The Society For The Psychological Study Of Social Issues. Part I. Prologue For Science And Society -- Reflections And Redirections / June Louin Tapp And Felice J. Levine -- Law And The Fireside Inductions : Some Reflections Of A Clinical Psychologist / Paule E. Meehl -- Part Ii. The Role Of Law As Socializer -- Some Presuppositions Shaping The Concept Of Socialization / Lon L. Fuller -- The Basic Law Or Constitution Of A Small Group / Walter O. Weyrauch -- The Moral Or Educative Influence Of Criminal Law / Johannes Andenaes -- The Legal Threat As An Instrument Of Social Change / Franklin Zimring And Gordon Hawkins -- The Idea Of Right As A Social And Legal Concept / Lawrence M. Friedman -- The Use Of Law To Guide People To Virtue : A Comparison Of Soviet And U.s. Perspectives / Harold J. Berman -- Part Iii. The Pattern Of Legal Development -- Developing Senses Of Law And Legal Justice / June Louin Tapp And Lawrence Kohlberg -- Legal Guarantees Of Individual Freedom : A Cross-national Study Of The Development Of Political Thought / Judith Gallatin And Joseph Adelson -- Childhood Origins Of Tolerance For Dissent / Gail L. Zellman And David O. Sears -- Socialization Of Attitudes Toward The Legal System / Judith V. Torney -- Part Iv. Socialization Into Legal Systems -- The Value Gap Between Police And Policed / Milton Rokeach, Martin G. Miller, John A. Snyder -- Law In The Schools / Paul A. Freund -- The Dialectic Of Legal Socialization In Community And School / Felice J. Levine And June Louin Tapp -- Socialization Into Child Abuse : A Social Interactional Perspective / Ross D. Parke -- The Socialization Into Criminality : On Becoming A Prisoner And A Guard / Craig Haney And Philip G. Zambardo -- Crime, Mental Illness, And Political Dissent / David Levine -- Why Criminal Law? Parameters For Evaluating Objectives And Responsive Alternatives / Samuel I. Shuman -- Part V. Decision Making In Legal Contexts -- The System Impact Of Criminal Justice Reforms / Raymond T. Nimmer -- Legal Structures And Restoring Equity / Stewart Macaulay And Elaine Walster -- Responsible Decision Making In Dispute Settlement / Ernest A. Haggard And Soia Mentschikoff -- Decision Making And Decision Consensus In Commercial Arbitration / Soia Mentschikoff And Ernst A. Haggard -- The Institutionalization Of Conflict : Jury Acquittals / Mortimer R. Kadish And Sanford Kadish -- Please, Morris, Don't Make Trouble : Two Lessons In Courtroom Confrontation / Harry Kalven, Jr. -- The Empirical Study Of Decision Processes In Juries : A Critical Review / James H. Davis, Robert M. Bray, Robert W. Holt -- Part Vi. Epilogue For Psychology And Law / June Louin Tapp And Felice J. Levine. Edited By June Louin Tapp, Felice J. Levine. Published For The Society For The Psychological Study Of Social Issues. Includes Indexes. Bibliography: P. 369-417.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/15/62/9780030121562.jpg', 'title_long': 'Law, Justice, and the Individual in Society: Psychological and Legal Issues', 'dimensions': 'Weight: 1.8518830008 pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 1.8518830008}}, 'pages': 446, 'date_published': '1977', 'subjects': ['Politics & Social Sciences', 'Social Sciences', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['June Louin Tapp', 'Felice J. Levine'], 'title': 'Law, Justice, and the Individual in Society: Psychological and Legal Issues', 'isbn13': '9780030121562', 'msrp': 31.95, 'binding': 'Hardcover', 'isbn': '0030121566', 'isbn10': '0030121566'}}