{'book': {'publisher': 'Harcourt College Pub', 'synopsis': 'Briefer than competing majors texts, Arms and Camp focuses on developing a student\'s understanding of the basic principles of biology and preparing them for future coursework.  This edition uses a "problem-solving" and experimental approach and de-emphasizes biological jargon in favour of communicating ideas and principles.  Features:  * "How do we know?" boxes focus on the experimental aspects of biology and the scientific process showing students how biological information is obtained through specific problem-solving methods and investigative techniques. * Symbiosis is introduced as a major theme of evolution to balance the coverage of competition/predation as evolutionary forces and strategies. * Highly praised pedagogy includes learning objectives, self-quizzes, numerous tables, and discussion questions. Key concepts near the beginning of each chapter and concept summaried at the end of each chapter set students\' priorities in approaching and reviewing the material. * Illustrated tables help students visualize description of biological features and facts. New to this edition:  * This edition features new material on genetics, cell biology, plant biology, and extensive new material on the origin of kingdoms and the development of evolutionary relationships. * A completely new full color art program greatly clarifies concepts and makes the text inviting to read.  Every photo and illustration in the text has been scrutinized for effectiveness. * A new chapter on genetic engineering provides up-to-the-minute coverage of this timely topic. The text\'s relevance is further enhanced with a new chapter (Ch. 50) on human ecology and natural resources.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/68/95/9780030056895.jpg', 'title_long': 'Biology, Fourth Edition (Study Guide)', 'edition': '4th', 'dimensions': 'Height: 11.25 Inches, Length: 8.25 Inches, Weight: 3.55 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.25}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 3.55}, 'height': {'unit': 'inches', 'value': 11.25}}, 'pages': 869, 'date_published': '1995', 'subjects': ['Science & Math', 'Biological Sciences', 'Biology', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Jan Jenner'], 'title': 'Biology, Fourth Edition (Study Guide)', 'isbn13': '9780030056895', 'msrp': 39.95, 'binding': 'Paperback', 'isbn': '0030056896', 'isbn10': '0030056896'}}