{'book': {'publisher': 'Brooks Cole', 'synopsis': 'Readability combined with a systematic, rigorous approach characterize this classic text. Extensive coverage of the principles and practices of quantitative chemistry makes this text suitable for chemistry and science students. Once of the co-authors, Douglas Skoog, received the 1993 ACS Division of Analytical Chemistry Award for Excellence in Teaching because of his fine texts. * Clarity and readability. These are two of the strengths of the new edition of Fundamentals of Analytical Chemistry 7/e. The authors have retained the lucid style that characterized earlier editions. In this edition, Special attention to language makes the text even more student friendly. * This text is presented with approrpiate rigor, particularly in the treatment of equilibrium calculations. This provides the student with the fundamentals required for the understanding and use of all branches of chemistry. * Fundamentals fo Analytical Chemistry 7/e presents a broad coverage of topics that allow the instructor maximum flexibility. * Mathcad Applications for Analytical Chemistry. This supplement introduces students to Mathcad - a powerful and versatile mathematical tool - and its application to problems and computations of analytical chemistry, correlated to the text - the only one of its kind.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/92/23/9780030749223.jpg', 'title_long': 'FUNDM OF ANALYT CHEMISTRY 6E', 'edition': '6', 'dimensions': 'Height: 10.25 Inches, Length: 1.5 Inches, Weight: 4.6 Pounds, Width: 8.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 1.5}, 'width': {'unit': 'inches', 'value': 8.5}, 'weight': {'unit': 'pounds', 'value': 4.6}, 'height': {'unit': 'inches', 'value': 10.25}}, 'pages': 928, 'date_published': '1992-01-02', 'subjects': ['Science & Math', 'Chemistry', 'Analytic', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['SKOOG'], 'title': 'FUNDM OF ANALYT CHEMISTRY 6E', 'isbn13': '9780030749223', 'msrp': 114.95, 'binding': 'Hardcover', 'isbn': '0030749220', 'isbn10': '0030749220'}}