{'book': {'publisher': 'Brooks Cole', 'synopsis': 'Product Description      INVESTIGATING BASIC COLLEGE MATHEMATICS is a flexible worktext that supports a variety of teaching methods. The book engages students in active learning, allowing them to discover knowledge and describe their understandings. Through a blend of lecture-type Discussions and Investigations, this book provides a comprehensive foundation in basic mathematical concepts. While the table of contents for this text is similar to others on the market, the presentation is unique. Carefully designed INVESTIGATIONS lead students to discover key concepts, while DISCUSSIONS offer a more traditional explanation. The INVESTIGATIONS can be completed as a class led by the instructor, in cooperative groups, or by the student alone. Instead of passively listening to an explanation of the concept, the student participates in its development, followed immediately by practice and application of the concept. This method helps developmental students understand and retain concepts. Selected for their high interest, the application problems are drawn from the media and everyday situations. Students find the problems relevant and easy to visualize; a variety of applications provides substantial practice. The authors also provide an organizer (the five step method) to help students learn to get started and finish problems successfully. Because students are constantly asked to apply their skills in application problems, systems of measurement are introduced early. This also prepares students for success in related classes in the natural sciences, social sciences, and technology.      Review      "...this book (provides) the structure and content to meet a variety of teaching methods from a lecture format to a student centered format. The book is highly interactive from the student\'s point of view and each instructor may determine how they wish to use the writing assignments, check your understandings, review exercises, etc...."      About the Author      Laura Bracken, co-author of Investigating Prealgebra and Investigating Basic College Mathematics, teaches developmental mathematics at Lewis-Clark State College. As developmental math coordinator, Laura led the process of developing objectives, standardizing assessments, and enforcing placement including a mastery skill quiz program. She has worked collaboratively with science faculty to make connections between developmental math and introductory science courses. Laura has presented at numerous national and regional conferences and currently serves as the regional representative for the AMATYC Placement and Assessment Committee. Her blog, Dev Math Diary, is at http://devmathdiary.wordpress.com/.Hazel J McKenna is a professor of mathematics in the School of Learning Resources at Utah Valley State College, in Orem, Utah. Along with a B.Sc. and M.S. in Mathematics, she holds a Ph.D. in Instructional Science with an emphasis in educational measurement and evaluation. She has presented at national and international conferences including the American Educational Research Association, the National Council on Measurement and Evaluation, and the American Mathematical Association of Two Year Colleges. Her main research interests lie in the fields of course development and evaluation, item bias in testing, and teaching adult learners. She has consulted with school boards, organizations and companies, dealing with topics ranging from program evaluation to computer adaptive testing. Hazel has been teaching mathematics at the college level since 1986 and has devoted her teaching to developmental mathematics since 1993. She won the Teacher of the Year award at UVSC in 2001, and the Board of Trustees Award for Excellence in 2002. Hazel J. McKenna, along with Laura Bracken, has authored two texts: INVESTIGATING BASIC MATHEMATICS, and INVESTIGATING PREALGEBRA.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/49/47/9780030344947.jpg', 'title_long': 'Investigating Basic College Mathematics (with CD-ROM, BCA Tutorial, and InfoTrac)', 'edition': '1', 'dimensions': 'Height: 10.5 Inches, Length: 8.25 Inches, Weight: 3.95068373504 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.25}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 3.95068373504}, 'height': {'unit': 'inches', 'value': 10.5}}, 'pages': 888, 'date_published': '2002-07-26', 'subjects': ['Science & Math', 'Mathematics', 'Pure Mathematics', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Laura Bracken', 'Hazel McKenna'], 'title': 'Investigating Basic College Mathematics (with CD-ROM, BCA Tutorial, and InfoTrac)', 'isbn13': '9780030344947', 'msrp': 275.95, 'binding': 'Paperback', 'isbn': '0030344948', 'isbn10': '0030344948'}}