{'book': {'publisher': 'George Allen & Unwin', 'synopsis': "1. Objectivity And Methodological Transposition -- 2. The Observer And The Facts -- 3. Pure Phenomenology And Phenomenological Psychology -- 4. Some Basic Propositions -- 5. Misinterpretations Of Phenomenology -- 6. Main Topics Of This Book -- Introduction -- 1. Technical Knowledge V. Individual Experience -- 2. The Embodiment -- 3. Dualism And Its Consequences -- 4. The A Priori In The Epistemological Framework -- Chapter 1: Biology And Culture In Objective Psychology -- 1. The Historical Perspective And The A Priori -- 2. Objectivity As A Construct -- 3. The Abandonment Of Subjectivity -- 4. The Cultural Origin Of Psychological Concepts -- 5. Reductionism And Intuitive Biology -- 6. Clinical Cases And Scientific Phenomena -- 7. Subjectivity V. Subjectivism -- 8. The Time-perspective In Psychology -- Chapter 2: The Development Of Phenomenology -- 1. Empirical And Experimental Psychology -- 2. Franz Brentano: The Founding Intentionality -- 3. The Meaning Of Experience --^ 4. Phenomenal Existence -- 5. The Description Of Psychic Phenomena -- 6. The Positivism Of Ernst Mach -- 7. Form Qualities And Object Theory -- 8. Stumpf's Experimental Phenomenology -- 9. James Ward's System Of Act Psychology -- 10. Husserl's Influence On Gestalt Psychology -- 11. Numbers And Structures -- 12. Gestalt Psychology Reconsidered -- 13. The Phenomenological V. The Biological Standpoint -- Chapter 3: The Physiology Of The Behavioural Field -- 1. Sherrington: The Founding Of The Biology Of Behaviour -- 2. Central Nervous Integration -- 3. The Anatomical Basis Of Behaviour Structures -- 4. Distance-receptors And Precurrent Reactions -- 5. Subjective Space-time -- 6. The Body As Part Of The Exteroceptive Field -- 7. Perceptual Structures From The Evolutionary Perspective -- 8. Sherrington's Teachings And The Phenomenological Standpoint -- Chapter 4: Philosophical And Psychological Realism -- 1. A Critical Analysis Of Classical Psychology -- 2. The Myth Of Substantialism --^ 3. Striving Towards The 'concrete' -- 4. The Postulate Of Conventional Meaning 5. Psychoanalysis And The Concrete Subject -- 6. An Epistemological Appraisal Of Concrete Psychology -- 7. Epistemology And Ideology -- Chapter 5: Phenomenological Psychology And The Biological Standpoint -- 1. The Life-world -- 2. Husserl's First Characterisation Of Phenomenological Psychology -- 3. Further Husserlian Analyses Of Phenomenological Psychology -- 4. The Problem Of 'foreign Subjectivity' -- 5. The Historical Nature Of Man's Life-world -- 6. The Dual Meaning Of Phenomenological Psychology -- 7. Reduction And The Scientific Standpoint -- Chapter 6: Phenomenological Psychology In Actual Practice -- 1. The Methodological Problem -- 2. Phenomenological Experimental Psychology -- 3. Stumpf's Acoustical And Musical Investigations -- 4. The Experimental Phenomenology Of David Katz -- 5. Michotte's Conception Of Experimental Phenomenology -- 6. The Anthropological Physiology Of Buytendijk --^ 7. Intersubjectivity As An Ethological Problem -- 8. Subjective Phenomena As Seen By Ethologists -- Concluding Remarks. Georges Thinès. Includes Indexes. Bibliography: P. [155]-168.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/01/87/9780041210187.jpg', 'title_long': 'Phenomenology and the Science of Behaviour. An Historical and Epistemological Approach', 'edition': 'First Edition', 'dimensions': '174 p. ; 24 cm.', 'pages': 174, 'date_published': '1977', 'subjects': ['Politics & Social Sciences', 'Philosophy', 'Epistemology'], 'authors': ['Georges Thinès'], 'title': 'Phenomenology and the Science of Behaviour. An Historical and Epistemological Approach', 'isbn13': '9780041210187', 'msrp': 1.99, 'binding': 'Hardcover', 'isbn': '0041210182', 'isbn10': '0041210182'}}