{'book': {'publisher': 'Unwin Hyman', 'synopsis': "Despite the popularity of the concept of anomie in contemporary social sciences, very little is known about the history of the concept before Durkheim. Following Robert Merton's remark in 1949 that 'the term anomie. . . might well become the object of an investigation by a student interested in the historical filiation of ideas/ this study documents and discusses the evidence of pre-sociological interest in anomie in Classical Greek philosophy, biblical literature, and English Renaissance theological and legal writings. In addition, it traces the resurrection of the word in nineteenth-century France (before Durkheim), and its adoption in Durkheim's sociology and contemporary social sciences. To this task, the author brings an academic background in philosophy and in classical sociological theory, and a knowledge of the foreign languages that gave him direct access to the original texts (in classical Greek, Latin, and French).The book is not only relevant because it traces the history of anomie, but also because it highlights the varieties of moral assumptions that have accounted, historically, for the formulation of antithetical theories about human nature, reason, morality, and justice. The historical perspective makes it possible to show similarities between theories of anomie that are far apart in sophistic philosophy and contemporary theories of anomie, Plato's and Durkheim's social theories, and late Judaic thought and Durkheimian sociology.The findings in this monograph are relevant to professionals in the areas of historical sociology, the sociology of knowledge, deviance, the history of ideas, and moral philosophy, and to undergraduate and graduate students in these areas. In addition, the book features an exhaustive bibliographical appendix which lists the literature on anomie from classical Greek texts to the latest publications on the subject.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/26/73/9780043012673.jpg', 'title_long': 'Anomie: History and Meanings', 'edition': 'First Edition', 'dimensions': 'Weight: 0.85539357656 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 0.85539357656}}, 'pages': 224, 'date_published': '1987', 'subjects': ['Politics & Social Sciences', 'Social Sciences'], 'authors': ['Marco Orru'], 'title': 'Anomie: History and Meanings', 'isbn13': '9780043012673', 'msrp': 76, 'binding': 'Hardcover', 'isbn': '0043012671', 'isbn10': '0043012671'}}