{'book': {'publisher': 'Springer', 'synopsis': 'The study of plant development in recent years has often been concerned with the effects of the environment and the possible involvement of growth substances. The prevalent belief that plant growth substances are crucial to plant development has tended to obscure rather than to clarify the underlying cellular mechanisms of development. The aim in this book is to try to focus on what is currently known, and what needs to be known, in order to explain plant development in terms that allow further experimentation at the cellular and molecular levels. We need to know where and at what level in the cell or organ the critical processes controlling development occur. Then, we will be better able to under stand how development is controlled by the genes, whether directly by the continual production of new gene transeripts or more indirectly by the genes merely defining self-regulating systems that then function autonomously. This book is not a survey of the whole of plant development but is meant to concentrate on the possible component cellular and molecular processes involved. Consequently, a basic knowledge of plant structure is assumed. The facts of plant morphogenesis can be obtained from the books listed in the General Reading seetion at the end of Chapter 1. Although references are not cited specifically in the text, the key references for each section are denoted by superscript numbers and listed in the Notes section at the end of each chapter.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/03/38/9780045810338.jpg', 'title_long': 'Plant Development: The Cellular Basis (Topics in Plant Physiology, 3)', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.16404074336 Pounds, Width: 0.78 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.78}, 'weight': {'unit': 'pounds', 'value': 1.16404074336}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 342, 'date_published': '1990-05-24', 'subjects': ['Science & Math', 'Biological Sciences', 'Botany', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Robert Lyndon'], 'title': 'Plant Development: The Cellular Basis (Topics in Plant Physiology, 3)', 'isbn13': '9780045810338', 'msrp': 109.99, 'binding': 'Paperback', 'isbn': '0045810338', 'isbn10': '0045810338'}}