{'book': {'publisher': 'Allen & Unwin Australia', 'synopsis': 'The two terms \'environmental chemistry\' and \'pollution\' often seem to go together, yet environmental chemistry is much more than the study of the chemical effects of pollution. In this book I have attempted to emphasise the natural mobility of the elements and their compounds. Only by understanding these normal movements can we begin to appreciate the changes - good or bad - that human activities can bring about. The breakdown of rock to form soils, the uptake of the mobi lised chemicals by plants, and the return of the dead plant material to the soil ready for further uptake has long been known as a \'biogeochemical\' cycle (indicating the interaction of biology, geology and chemistry). The biogeochemical cycle is only one part of the general geochemical cycle in which material is moved from the land to the sea, possibly having entered the atmosphere, and then being reincorporated in the land mass. The elements move through their cycles in fits and starts, with many variations in chemical form occurring along the way. Environmental chemistry attempts to explain why a specific change occurs and why a par ticular pathway has been followed: of necessity, there is overlap with biology, geology and physics. One possible definition of envi ronmental chemistry is the study of the rOle of chemical elements in the synthesis and decomposition of natural materials of all kinds, including the changes specifically brought about by human actions. The selection of topics for inclusion in this book proved difficult."', 'language': 'en', 'image': 'https://images.isbndb.com/covers/08/56/9780045510856.jpg', 'title_long': 'Environmental Chemistry', 'edition': '1', 'pages': 232, 'date_published': '1985', 'subjects': ['Engineering & Transportation', 'Engineering'], 'authors': ["Peter O'Neill"], 'title': 'Environmental Chemistry', 'isbn13': '9780045510856', 'msrp': 55, 'binding': 'Hardcover', 'isbn': '0045510857', 'isbn10': '0045510857'}}