{"book": {"publisher": "It Books", "synopsis": "Each summer, on the fields of glorious Cape Marlin, off theNew England coast, the nation"s best college players gatherto play the most important baseball of their lives.<br/>Jack Faber is a young hotshot pitcher with an unhittable slider and a rocket for a fastball. He plays for the fabled Seapuit Seawolves and dreams of making the Big Show. But a new coach, the scowling Bruno Riazzi, a former pro catcher, resents the kid"s celebrity status and decides to knock him down a peg or two. And he stops at nothing to make it happen.<br/>Humiliated, Jack loses his lifelong art, and with it his passion for the game, as well as, mysteriously, his ability to throw. A devastated Jack Faber is released from the St. Charles College roster. But the Seawolves coaches won"t give up on him. They bring Jack back to Cape Marlin, determined to help him rediscover his lost talent. He finds himself again under the summer sun, coaches and old friends standing by him. But in the end it will be up to Jack.<br/>Based on a true story, Slider celebrates the national pastime, a game that can break grown men's hearts -- as well as make them whole again.', 'language": "en", "image": "https: //images.isbndb.com/covers/03/39/9780060580339.jpg", "title_long": "Slider: A Novel", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 0.67 Pounds, Width: 0.94 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 0.94}, "weight": {"unit": "pounds", "value": 0.67}, "height": {"unit": "inches", "value": 8}}, "pages": 416, "date_published": "2004-04-27", "subjects": ["Biographies & Memoirs', 'Travelers & Explorers', 'Literature & Fiction', 'Genre Fiction', 'Sports', 'United States', 'Contemporary', 'Sports & Outdoors', 'Baseball', 'Biographies', 'Coaching', 'Travel', 'West'], 'authors": ["Patrick Robinson'], 'title": "Slider: A Novel", "isbn13": "9780060580339", "msrp": 9.99, "binding": "Paperback", "related": {"ePub": "0061752363"}, "isbn": "006058033X", "isbn10": "006058033X", "other_isbns": [{'isbn": "9780061752360", "binding": "print"}]}}