{'book': {'publisher': 'William Morrow', 'synopsis': "Night Train to Lisbon is a sensuous tale of the pursuit of love and passion against all odds, set in the 1930s when the world was on the brink of war and suspicion of loyalty, motivation, and intent -- to both country and lover -- was at flood tide.<br/>Carson Weatherell is a privileged young American woman traveling in Europe in 1936, courtesy of her aunt and uncle who live abroad and have kindly offered to show her the sights. A bout of illness and self-pity almost send her back to her sheltered Connecticut life, but on an overnight train to Lisbon, she suddenly can't imagine returning home. On that train she meets Alec Breve, a young British scientist traveling with a group of colleagues -- and in his company, Carson finds that she's enjoying herself, certainly for the first time since she left New York Harbor, and quite possibly for the first time in her life.<br/>In Lisbon, Carson and Alec begin an intense love affair, but their bliss is threatened when Carson's uncle reveals that Alec might be a spy for Germany. He insists that it is essential that Alec be trapped and brought to justice, and the only person who can deliver an unsuspecting Alec to the proper authorities is Carson. Desperate to believe in her new love -- and terrified of discovering she has fallen for a traitor -- Carson must choose whether to prove her lover innocent or leave him to face the consequences on his own.<br/>A riveting page-turner, Night Train to Lisbon travels back to the days when war loomed, the Mitford sisters dazzled, and night trains brimmed with romance and intrigue, delivering a mesmerizing novel of a love that must truly conquer all in order to survive.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/26/41/9780060542641.jpg', 'title_long': 'Night Train to Lisbon: A Novel', 'edition': '1', 'dimensions': 'Height: 7.5 Inches, Length: 5.5 Inches, Weight: 0.7 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.7}, 'height': {'unit': 'inches', 'value': 7.5}}, 'pages': 224, 'date_published': '2004-05-11', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'United States'], 'authors': ['Emily Grayson'], 'title': 'Night Train to Lisbon: A Novel', 'isbn13': '9780060542641', 'msrp': 21.95, 'binding': 'Hardcover', 'isbn': '0060542640', 'isbn10': '0060542640'}}