{'book': {'publisher': 'Avon', 'synopsis': "In the light of the recent tragedy that has changed our world, David Ovason, the foremost expert on the prophecies of Michel Nostradamus, has reexamined the writings of the 16th Century French seer. What Ovason discovered was startling: a quatrain that specifically predicts the horrific terrorist attack on New York City that killed more people in one day than died in America's three-year War of Independence. In this bold new interpretation of Nostradamus's prescient texts, Ovason reveals with reasoned, intelligent scholarship what the Master presaged for the United States-a nation that did not exist in Nostradamus's time-including the shocking foretelling of a devastating “fire to approach a great new city”…and the coming of a new age of prosperity for us all.<br/>Renowned scholar David Ovason also reveals how Western history's most remarkable clairvoyant predicted the most momentous events in the development of the United States, including: The settlement of Jamestown The Declaration of Independence The founding of St. Louis The development of electricity The invention of manned flight The Apollo space programAND The terrorist attack on America and the destruction of the World Trade Center", 'language': 'en', 'image': 'https://images.isbndb.com/covers/35/18/9780060093518.jpg', 'title_long': 'Nostradamus: Prophecies for America', 'edition': 'First Edition', 'dimensions': 'Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.1984160358 Pounds, Width: 0.48 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 0.48}, 'weight': {'unit': 'pounds', 'value': 0.1984160358}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 192, 'date_published': '2001-10-30', 'subjects': ['History', 'Americas', 'United States', 'Religion & Spirituality', 'New Age & Spirituality', 'Divination', 'Occult & Paranormal', 'Occultism', 'Politics & Social Sciences', 'Politics & Government'], 'authors': ['David Ovason'], 'title': 'Nostradamus: Prophecies for America', 'isbn13': '9780060093518', 'msrp': 1.99, 'binding': 'Mass Market Paperback', 'related': {'ePub': '0062561189'}, 'isbn': '006009351X', 'isbn10': '006009351X', 'other_isbns': [{'isbn': '9780062561183', 'binding': 'print'}]}}