{'book': {'publisher': 'William Morrow', 'synopsis': "Driving home at dusk, Claire Andrews, an art history professor at a prestigious New England university, accidentally strikes and kills a boy who darts into the path of her car. She is immediately cleared of blame but is nonetheless left psychologically devastated. Haunted by the accident's consequences, Claire also wrestles with her study of one of Vincent van Gogh's final paintings, Crows over the Wheatfield, and its mysterious relationship to the great artist's untimely death.<br/>Claire has been writing the definitive book on the connection between the artist's late paintings and his deteriorating mental condition before his suicide. She has uncovered evidence that the painter's death may not have been as it seems and that someone close to van Gogh may have pushed the fragile painter to take his own life. Meanwhile, Claire, too, begins to feel that she is being broken by despair. And when the boy's family files a high-profile lawsuit against Claire, even her work may not be able to pull her out of the darkness that has begun to envelop her.<br/>On the advice of her lawyers and her husband, Richard, from whom she has recently separated but who has been caring for her, Claire sets off on a research trip to Auvers, France, where van Gogh spent his last days, determined to answer her questions about the artist and his masterpiece. While in Auvers, worrisome parallels between her life and that of the troubled painter begin to emerge, and Claire realizes that she must reconcile herself to her past in order to reunite the forces that make her whole.<br/>Adam Braver, one of our finest young novelists, beautifully juxtaposes past and present in this remarkable story of art, tragedy, and redemption.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/23/20/9780060782320.jpg', 'title_long': 'Crows over the Wheatfield: A Novel', 'edition': 'First Edition', 'dimensions': 'Height: 8.5 Inches, Length: 5.75 Inches, Weight: 0.95 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.95}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 288, 'date_published': '2006-05-23', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Psychological', 'United States'], 'authors': ['Adam Braver'], 'title': 'Crows over the Wheatfield: A Novel', 'isbn13': '9780060782320', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060782323', 'isbn10': '0060782323'}}