{'book': {'publisher': 'Ecco', 'synopsis': "<p> Potent as a dose of Viagra and hilarious as any modern woman's love life,  In Search of an Impotent Man is a profoundly irreverent look at one irrepressible woman's search for Mr. Right.</p><br/><p> Carmen Legg is a thirty-something, flame-haired, BMW-driving temptress who has everything she could possibly want--except peace of mind. She can't sit through a business meeting without men ogling her legs; she can't come home after an eternal workday without fending off advances from her oversexed boyfriend. What she needs, Carmen decides, is a man with more meaningful things on his mind. So, like many contemporary single women, she hopes to find her Prince Charming by placing an ad in the personals, describing a wish distinctly her own: </p><br/><p>  Wanted: Clear-thinking male <br>Attractive, successful 35-year-old <br> woman seeks man for good times, days <br> out, nights in, companionship. <br> Must be intelligent and impotent. </p><br/><p> In response to the ad, Carmen meets a colorful array of men, ranging from an outrageously wealthy baron to a motorcycle-riding James Dean look-alike to a divorced father who works with computers. Sharing every step of her adventures with her lively octogenarian neighbor, Elvira, her best friend Laura, a level-headed therapist named Isabella, and a good witch who specializes in cures for impotency, Carmen gradually begins to see that abstaining from sex isn't necessarily the clearest path to clear-thinking relationships. </p><br/><p> Sassy and wholly entertaining,  In Search of an Impotent Man is a story about a woman who is not afraid to take matters into her own hands and turn the assumptions about romantic love on their head.</p>", 'language': 'en', 'image': 'https://images.isbndb.com/covers/60/35/9780060196035.jpg', 'title_long': 'In Search Of an Impotent Man: A Novel', 'edition': '1st U.S. ed', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 1.05 Pounds, Width: 1.05 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.05}, 'weight': {'unit': 'pounds', 'value': 1.05}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 320, 'date_published': '1999', 'subjects': ['Literature & Fiction', 'Contemporary'], 'authors': ['Gaby Hauptmann', 'Shaun Whiteside'], 'title': 'In Search Of an Impotent Man: A Novel', 'isbn13': '9780060196035', 'msrp': 24, 'binding': 'Hardcover', 'isbn': '0060196033', 'isbn10': '0060196033'}}