{'book': {'publisher': 'Ecco', 'synopsis': 'One of the most recognizable poets of the last century, Charles Bukowski is simultaneously a common man and an icon of urban depravity. He uses strong, blunt language to describe life as he lives it, and through it all charts the mutations of morality in modern America.<br/>Sifting Through the Madness for the Word, the Line, the Way is a treasure trove of confessional poetry written towards then end of Bukowski’s life. With the overhang of failing health and waning fame, he reflects on his travels, his gambling and drinking, working, not working, sex and love, eating, cats, and more.<br/>Sifting Through is Bukowski at his most meditative – published posthumously, it’s completely non-performative, and gets to the heart of Bukowski’s lifelong pursuit of natural language and raw honesty. We recommend you read this as Bukowski wrote: by sifting through the madness for what hits you as the word, the line, the way.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/82/38/9780060568238.jpg', 'title_long': 'Sifting Through the Madness for the Word, the Line, the Way: New Poems', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1 Pounds, Width: 1.04 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.04}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 416, 'date_published': '2004-01-06', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Poetry', 'Regional & Cultural', 'Themes & Styles', 'United States', 'Anthologies', 'Literary', 'Self Service', 'Custom Stores'], 'authors': ['Charles Bukowski'], 'title': 'Sifting Through the Madness for the Word, the Line, the Way: New Poems', 'isbn13': '9780060568238', 'msrp': 13.48, 'binding': 'Paperback', 'related': {'eBook': '006197997X', 'ePub': '006197997X'}, 'isbn': '0060568232', 'isbn10': '0060568232', 'other_isbns': [{'isbn': '9780061979972', 'binding': 'print'}]}}