{'book': {'publisher': 'Harper', 'synopsis': '“A cohesive picture of an extraordinary figure. . . . The issues raised by Bruce’s life and career resonate today, making Graham’s book not just a history but a revealing commentary on race and class, and on their inordinately powerful force in shaping our lives today.”—Chicago Tribune<br/>Spanning more than a century, Lawrence Otis’s illuminating biography is a fascinating look at race and class in America, witnessed through the life of Blanche Kelso Bruce—the head of America’s first black dynasty and the first black U.S. senator. Otis reveals how Bruce rose from slavery to achieve power and prestige in the aftermath of the Civil War. With his wife, the daughter of a prominent Philadelphia physician, he would break social and racial barriers—a legacy continued by their children until scandal destroyed the family’s wealth and stature. Filled with triumph and tragedy, Otis’s riveting book brings into focus an important yet little-known segment of our nation’s past.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/41/24/9780060184124.jpg', 'title_long': "The Senator and the Socialite: The True Story of America's First Black Dynasty", 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.8 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 1.8}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 480, 'date_published': '2006-06-27', 'subjects': ['Biographies & Memoirs', 'Community & Culture', 'Black & African American', 'Historical', 'United States', 'Leaders & Notable People', 'Military', 'Political', 'History', 'Americas', 'World', 'Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies'], 'authors': ['Lawrence Otis Graham'], 'title': "The Senator and the Socialite: The True Story of America's First Black Dynasty", 'isbn13': '9780060184124', 'msrp': 27.95, 'binding': 'Hardcover', 'isbn': '0060184124', 'isbn10': '0060184124'}}