{"book": {"publisher": "Harper", "synopsis": "Yearning for a life of leisure? In 24 chapters representing each hour of a typical working day, this book will coax out the loafer in even the most diligent and schedule-obsessed worker.<br/>From the founding editor of the celebrated magazine about the freedom and fine art of doing nothing, The Idler, comes not simply a book, but an antidote to our work-obsessed culture. In How to Be Idle, Hodgkinson presents his learned yet whimsical argument for a new, universal standard of living: being happy doing nothing. He covers a whole spectrum of issues affecting the modern idler—sleep, work, pleasure, relationships—bemoaning the cultural skepticism of idleness while reflecting on the writing of such famous apologists for it as Oscar Wilde, Robert Louis Stevenson, Dr. Johnson, and Nietzsche—all of whom have admitted to doing their very best work in bed.<br/>It’s a well-known fact that Europeans spend fewer hours at work a week than Americans. So it’s only befitting that one of them—the very clever, extremely engaging, and quite hilarious Tom Hodgkinson—should have the wittiest and most useful insights into the fun and nature of being idle. Following on the quirky, call-to-arms heels of the bestselling Eat, Shoots and Leaves: The Zero Tolerance Approach to Punctuation by Lynne Truss, How to Be Idle rallies us to an equally just and no less worthy cause: reclaiming our right to be idle.", "language": "en", "image": "https: //images.isbndb.com/covers/96/89/9780060779689.jpg", "title_long": "How to Be Idle", "edition": "First American Edition", "dimensions": "Height: 7.25 Inches, Length: 5.25 Inches, Weight: 0.81 Pounds, Width: 1 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.25}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 0.81}, "height": {"unit": "inches", "value": 7.25}}, "pages": 304, "date_published": "2005-05-10", "subjects": ["Self-Help', 'Creativity', 'Time Management', 'Humor & Entertainment', 'Humor', 'Essays', 'Self-Help & Psychology'], 'authors": ["Tom Hodgkinson'], 'title": "How to Be Idle", "isbn13": "9780060779689", "msrp": 18.95, "binding": "Hardcover", "isbn": "0060779683", "isbn10": "0060779683", "other_isbns": [{'isbn": "9780062313416", "binding": "printisbncanonical"}]}}