{"book": {"publisher": "Harper", "synopsis": "When Black Boy exploded onto the literary scene in 1945, it caused a sensation. Orville Prescott of the New York Times wrote that "if enough such books are written, if enough millions of people read them maybe, someday, in the fullness of time, there will be a greater understanding and a more true democracy." Opposing forces felt compelled to comment: addressing Congress, Senator Theodore Bilbo of Mississippi argued that the purpose of this book "was to plant seeds of hate and devilment in the minds of every American.' From 1975 to 1978, Black Boy was banned in schools throughout the United States for 'obscenity' and 'instigating hatred between the races.'<br/>This new edition of the once controversial, now classic American autobiography measures the brutality and rawness of the Jim Crow South against the sheer desperate will it took to survive as 'black boy.' Richard Wright grew up in the woods of Mississippi, with poverty, hunger, fear, and hatred. He lied, stole, and raged at those about him; at six he was 'a drunkard,' hanging about taverns. Surly, brutal, cold, suspicious, and self-pitying, he was surrounded on one side by whites who were either indifferent to him, pitying, or cruel, and on the other by blacks who resented anyone trying to rise above the common lot. At the end of Black Boy, Wright sits poised with pencil in hand, determined to 'hurl words into this darkness and wait for an echo.'<br/>Wright\'s eloquent account is at once a profound indictment and an unashamed confession -- a poignant and disturbing record of social injustice and human suffering.<br/>HarperCollins is proud to celebrate the sixtieth anniversary of the book\'s publication with this special hardcover edition, which utilizes the restored text established by The Library of America and features a new foreword by Edward P. Jones, author of the Pulitzer Prize-winning novel The Known World.', 'language": "en", "image": "https: //images.isbndb.com/covers/40/05/9780060834005.jpg", "title_long": "Black Boy: A Record of Childhood and Youth", "edition": "First Edition", "dimensions": "Height: 9 Inches, Length: 6.25 Inches, Weight: 1.55 Pounds, Width: 1.25 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.25}, "width": {"unit": "inches", "value": 1.25}, "weight": {"unit": "pounds", "value": 1.55}, "height": {"unit": "inches", "value": 9}}, "pages": 432, "date_published": "2005-11-29", "subjects": ["Biographies & Memoirs', 'Community & Culture', 'Black & African American', 'Historical', 'United States', 'Memoirs', 'History', 'Americas', 'Literature & Fiction', 'Politics & Social Sciences', 'Sociology', 'Race Relations'], 'authors": ["Richard Wright'], 'title": "Black Boy: A Record of Childhood and Youth", "isbn13": "9780060834005", "msrp": 24.95, 'binding": "Hardcover", "isbn": "0060834005", "isbn10": "0060834005"}}