{'book': {'publisher': 'William Morrow', 'synopsis': "In this beautifully written tour de force of a novel, Beth Gutcheon takes readers back to the coastal village of Dundee, Maine. There, in a Victorian summer house called Leeway Cottage, we witness the scenes of a long twentieth-century marriage.<br/>In April 1940, as the Nazis march into Denmark, a rich girl of the Dundee summer colony named Sydney Brant marries a gifted Danish pianist, Laurus Moss. They believe they are well matched, as young lovers do, but almost at once, their views of the world and their marriage begin to diverge. Laurus's beloved family is in Copenhagen, hostage to what the fortunes of Hitler's war will bring, especially as his mother is Jewish. When Laurus chooses to leave Sydney in the fall of 1941 to help build a Danish Resistance from London, Sydney is dismayed. By the time they are reunited four years later, Laurus's family and the reader have been through one of the most stirring stories of the war: Denmark's courageous grassroots rescue of virtually all 7,000 of the country's Jews. Meanwhile, in America, Sydney has led a group knitting for the war effort, and had a baby.<br/>In the decades to come, many people, especially their three grown children, will wonder whether these two very different people understand each other at all. If they do, how do they stay together? Laurus likes to claim that in heaven you get to see the movie of your life, with all the blanks filled in. In their old age Sydney fears what he might see and why he wants to know; their children fear he'll die and there won't be any movie.<br/>But there will be.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/90/54/9780060539054.jpg', 'title_long': 'Leeway Cottage: A Novel', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6.25 Inches, Weight: 1.6 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 1.6}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 432, 'date_published': '2005-05-03', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Family Life', 'United States', 'Literary'], 'authors': ['Beth Gutcheon'], 'title': 'Leeway Cottage: A Novel', 'isbn13': '9780060539054', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060539054', 'isbn10': '0060539054'}}