{'book': {'publisher': 'Harper', 'synopsis': "One foggy evening, the most famous crime specialists in the world meet in an exclusive club, their minds on mystery. On the agenda, two tantalizing, unsolved cases of ghostly terror.<br/>New York Times bestselling author and unsurpassed mater of suspense Barbara Michaels delivers a fireside page-turner in the grand tradition with her latest book, Other Worlds.<br/>The smoky room glows with a mix of cigars, brandy, and genius. Those present include Harry Houdini, king of illusion; Sir Arthur Conan Doyle, father of the modern detective novel; Dr. Nandor Fodor, a psychoanalyst of international acclaim; and an elegant writer who can rival them all with her sleuthing talent.<br/>These maters of mystery put their minds to a pair of gripping stories--of families beset by poltergeistly pranks and bewitched by inexplicable horrors. Gripping puzzles, yes, but the terror is all too vicious and all too real.<br/>In the hallows of Tennessee, a family is threatened by a dire spirit whose predictions of despair and death come frighteningly true.<br/>In a small Connecticut town, a newly married widow and her children move into her second husband's home to find their lives possessed by an unimaginable demon.<br/>For the gathering at the club, a brilliant battle of wits is at hand. Were these villains phantoms from beyond or evildoers of flesh and blood? Each expert has a theory. Which of them is correct?<br/>Whether writing as Barbara Michaels or Elizabeth Peters, this author is a master chef crafting richly atmospheric, suspense-filled delights. Other Worlds is an up-all-nighter, guaranteed to still haunt in the morning--a tale as chilling by daylight as it is by darkness.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/23/58/9780060192358.jpg', 'title_long': 'Other Worlds', 'edition': 'First Edition', 'dimensions': 'Height: 9.75 Inches, Length: 6.5 Inches, Weight: 0.95 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.95}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 224, 'date_published': '1999-01-27', 'subjects': ['Literature & Fiction', 'Contemporary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense'], 'authors': ['Barbara Michaels'], 'title': 'Other Worlds', 'isbn13': '9780060192358', 'msrp': 23, 'binding': 'Hardcover', 'isbn': '0060192356', 'isbn10': '0060192356'}}