{'book': {'publisher': 'Harper', 'synopsis': '"It starts with my family, of course. Childhood, adolescence, the American way of sorting out what is real from what is not. My family was credulous, idealistic, odd, old-fashioned. I trained myself to be otherwise. The result has been a kind of tetherball existence, an orbiting around the parental pole with more speed than grace, more movement than progress. "<br/>Aaron, Approximately, first-time novelist Zachary Lazar\'s uniquely poignant coming-of-age novel, tells with heart-wrenching clarity the story of Aaron Bright, a fiercely intelligent and resilient young man struggling toward self-acceptance, identity, and human connection in the aftermath of his father\'s death. When 26-year-old Aaron\'s relationship with his girlfriend, Clarisse, threatens to crumble, he revisits the trials of his past in an attempt to unearth the root of his lifelong alienation.<br/>Aaron, Approximately powerfully details the narrator\'s moving and often darkly humorous journey out of isolation and self-doubt and into adulthood. "The Horace and Waldo Show" is the most popular children\'s television hour in Colorado, but being the only son of Horace Bright, the show\'s top-hat-and-purple-tuxedo-wearing clown, is a dubious honor for eight-year-old Aaron. When the local radio station\'s resident shock jock comically spoofs Horace\'s show as a front for sexual misconduct, Aaron is ruthlessly ostracized by his peers. In a last-ditch attempt at positive publicity, Horace challenges the deejay to a parachute jump. But when the stunt ends in tragedy, Aaron is thrust prematurely into the adolescent sphere of dislocation, insecurity, and rebellion, struggling to find his way without his father.<br/>Intelligent, sensitive, and profoundly concerned with issues of identity, Aaron turns himself into a would-be clown, wearing strange vintage clothing and cracking jokes to hide his uneasiness, as he first rejects but ultimately comes to understand his inextricable link to his dead father.When Aaron\'s mother later remarries, proving she has escaped the torment of loneliness caused by Horace\'s death, Aaron is confronted by his core dilemma: Should he conform to his mother\'s wishes, sacrifice the comfort of his insular life, and move beyond his rage and self-pity, or should he continue to live in his self-styled world of purposeful isolation and boundless cynicism? Only by facing up to the reality of his situation can Aaron break free of his lifelong pattern of alienation and confusion. And only then will he be able to salvage his relationship with Clarisse.<br/>Portrayed with both humor and compassion, Zachary Lazar\'s Aaron Bright searches for answers to the questions that plague us all. An outsider from the very start, the hilariously endearing yet overwhelmingly conflicted Aaron shows us what it is like to need attention so desperately that one would sabotage both family and love to satisfy its call. Aaron, Approximately rings with the truth of what it means to have grown up at the tail end of the 20th century and marks Zachary Lazar\'s debut as a refreshing and profoundly intelligent new voice in American fiction.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/21/16/9780060392116.jpg', 'title_long': 'Aaron, Approximately: A Novel', 'edition': 'First Edition', 'dimensions': 'Height: 9.75 Inches, Length: 6.5 Inches, Weight: 1.4 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.4}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 352, 'date_published': '1998-01-20', 'subjects': ['Literature & Fiction'], 'authors': ['Zachary Lazar'], 'title': 'Aaron, Approximately: A Novel', 'isbn13': '9780060392116', 'msrp': 22, 'binding': 'Hardcover', 'isbn': '0060392118', 'isbn10': '0060392118'}}