{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': "No matter what your age or your family and medical<br/>history, you can take steps to prevent debilitating<br/>strokes. And you can start today.<br/>No one plans to have a stroke, but too many people think that avoiding them is impossible. Written by the director of the Stroke Research Center at Mayo Clinic, this book helps you determine your risk for stroke and offers you a personalized prevention program based on your own risk profile.<br/>This book is the first of its kind to offer such thorough information about our nation's #1 disabler and #3 killer. Based on decades of research, Dr. Wiebers shares crucial information you need to know, including: The six different types of stroke Simple dietary changes that can help prevent stroke Common heart conditions that are little-known stroke risk factors Where to get the best treatment during a stroke<br/>You and your loved ones don't have to live in fear of suffering strokes. This book gives you specific, positive steps to reduce the risk of stroke and to help you lead a more healthy, balanced, and enjoyable life.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/78/27/9780060957827.jpg', 'title_long': 'Stroke-Free for Life: The Complete Guide to Stroke Prevention and Treatment', 'edition': '2nd', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.1 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.1}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 352, 'date_published': '2002-07-02', 'subjects': ['Health, Fitness & Dieting', 'Diseases & Physical Ailments', 'Heart Disease', 'Nervous System'], 'authors': ['David Wiebers M.D.'], 'title': 'Stroke-Free for Life: The Complete Guide to Stroke Prevention and Treatment', 'isbn13': '9780060957827', 'msrp': 15.99, 'binding': 'Paperback', 'related': {'ePub': '0062013688'}, 'isbn': '0060957824', 'isbn10': '0060957824', 'other_isbns': [{'isbn': '9780062013682', 'binding': 'print'}]}}