{'book': {'publisher': 'William Morrow', 'synopsis': 'Turning forty, fifty, or sixty is not about getting older, it\'s about becoming ageless . . .<br/>Renowned style expert and fashion consultant Christine Schwab sees aging as an opportunity to revitalize your style and enliven your attitude. In her frank, opinionated, and provocative style, she writes the book that defies many of the fashion and beauty industry philosophies.<br/>Now more than ever, women have the ability to look and feel fresh, chic, and fabulous at any age, simply by understanding age maintenance. Schwab is adamant that with all this new ageless information and technology, it is imperative to be informed about what works and what does not..<br/>In this honest and empowering book, she offers the first open-minded approach to style, beauty, health, and well-being that will help every forty-plus woman achieve a classic look while maintaining her edge and personality.<br/>A personal stylist and support group within a book, The Grown-Up Girl\'s Guide to Style addresses every aspect of aging, from hair and makeup to sex and family life. Straightforward and candid, Schwab even embraces once taboo subjects, offering the lowdown from leading doctors and surgeons on injectable skin treatments, cosmetic surgery and dentistry, and hormone replace-ment therapy. Accompanying her eye-opening advice are dozens of fun, revealing photographs—including celebrity profiles, woman-on-the-street snapshots, stunning professional photography, and even personal photographs of Schwab herself—that demonstrate style disasters (sleeveless tops, head-to-toe denim, and more), and dazzling triumphs.<br/>The Grown-Up Girl\'s Guide to Style holds the ultimate insider\'s secrets to a beautiful, sexy, and healthy life after forty. An essential book for the modern "grown-up girl," it is sure to dramatically rejuvenate the already-stylish, the aspiring-to-be-stylish, and the simply style-challenged woman in her prime.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/45/84/9780060784584.jpg', 'title_long': "The Grown-Up Girl's Guide to Style: A Maintenance Bible for Fashion, Beauty, and More . . .", 'dimensions': 'Height: 10.25 Inches, Length: 8.5 Inches, Weight: 2 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.5}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 2}, 'height': {'unit': 'inches', 'value': 10.25}}, 'pages': 224, 'date_published': '2006-09-26', 'subjects': ['Self-Help', 'Motivational', 'Arts & Photography', 'Fashion', 'Graphic Design', 'Commercial', 'Health, Fitness & Dieting', 'Beauty, Grooming, & Style', 'Style & Clothing'], 'authors': ['Christine Schwab'], 'title': "The Grown-Up Girl's Guide to Style: A Maintenance Bible for Fashion, Beauty, and More . . .", 'isbn13': '9780060784584', 'msrp': 1.99, 'binding': 'Hardcover', 'isbn': '006078458X', 'isbn10': '006078458X'}}