{'book': {'publisher': 'William Morrow', 'synopsis': "Award-winning author Jill Churchill takes us back to beautiful Grace & Favor, the tiny town along the Hudson River known for tradition, charm . . . and murder.<br/>March 3, 1933, the day before Franklin Roosevelt's inauguration. While Robert Brewster heads to Washington, D.C., to witness the historic event, his sister, Lily, travels to a nursing home near Grace & Favor. The owner, Miss Twibell, has lost an assistant nurse, and the siblings have agreed to help out.<br/>The home is full of colorful characters, including a cantankerous old man named Sean Connor, the only patient who is seriously ill. The very day the Brewsters arrive, he slips into a coma and passes away. Though saddened, no one is surprised by his death -- until it's revealed that he's been murdered. The old man wasn't well liked, but who would bother to murder him when he had so little time left? Several people had visited his room that morning, and there are plenty of suspects. Good motives, on the other hand, are thin on the ground.<br/>And Mr. Connor isn't the only victim in town. Over the winter, a young man went missing and was presumed dead, though no body was found. Now that the spring sun has melted the ice, a body has surfaced. Is this the missing man or has a third crime been committed?<br/>With multiple murders plaguing the community, the Brewster siblings are more committed than ever to helping the police find a cold-blooded criminal before he strikes again.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/84/30/9780060528430.jpg', 'title_long': 'It Had to Be You (Grace & Favor Mysteries, No. 5)', 'edition': '1', 'dimensions': 'Height: 6.75 Inches, Length: 5.25 Inches, Weight: 0.8 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.8}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 219, 'date_published': '2004-03', 'subjects': ['Literature & Fiction', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Romance', 'Contemporary'], 'authors': ['Jill Churchill'], 'title': 'It Had to Be You (Grace & Favor Mysteries, No. 5)', 'isbn13': '9780060528430', 'msrp': 23.95, 'binding': 'Hardcover', 'isbn': '0060528435', 'isbn10': '0060528435'}}