{'book': {'publisher': 'Avon', 'synopsis': 'An anonymous author has turned English society upside down, and only one man can protect her identity from being revealed, and her life from being destroyed, in this sexy new romance from reader favourite Jacquie D’Alessandro.<br/>The scandalous book, A Ladies’ Guide to the Pursuit of Personal Happiness and Marital Fulfilment has taken English society by storm. The slim but erotically explicit volume was penned by an unknown author, and now all of London is trying to discover the mysterious writer’s true identity. But the search doesn’t scare Catherine Ashfield, Viscountess Bickley, the proper woman who transcribed the book for her dear friend, a very elderly and experienced widow. Disgusted by the shallow values and morals of the town, Catherine was excited to help her friend and set the uppity nobility on its ear. And maybe by giving women a little more knowledge they could finally have happier marriages, instead of loveless unions as she had her with her own late husband.<br/>But Catherine didn’t anticipate the violent backlash against the book. With threats being made against the unknown author, Catherine fears for her safety and that of her son. When she is the victim of a near fatal accident, she wonders how hidden her identity truly is.<br/>Knowing she needs protection, she turns to her brother’s best friend, an accomplished pugilist and fencer. She invites him to stay at her country estate under the guise of a simple visit, not realizing that she has invited a fugitive with a dangerous past into her home--a man she soon finds herself powerfully attracted to...', 'language': 'en', 'image': 'https://images.isbndb.com/covers/67/18/9780060536718.jpg', 'title_long': 'Love and the Single Heiress (Avon Historical Romance)', 'dimensions': 'Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.41 Pounds, Width: 0.96 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 0.96}, 'weight': {'unit': 'pounds', 'value': 0.41}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 384, 'date_published': '2004-08-31', 'subjects': ['Literature & Fiction', 'Humor & Satire', 'Humorous', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Spies & Politics', 'Historical', 'Romance', 'Victorian', 'Regency', 'Romantic Suspense'], 'authors': ["Jacquie D'Alessandro"], 'title': 'Love and the Single Heiress (Avon Historical Romance)', 'isbn13': '9780060536718', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'related': {'ePub': '0061748749'}, 'isbn': '0060536713', 'isbn10': '0060536713', 'other_isbns': [{'isbn': '9780061748745', 'binding': 'print'}]}}