{'book': {'publisher': 'Harper Voyager', 'synopsis': 'To save two kingdoms from a despot\'s rule, one man must journey into the unknown, seeking answers to the strange and powerful secret that so plagues him.<br/>Wyl Thirsk, loyal soldier of Morgravia, has seen his best friend slain, his sister tortured, and his mentor sent to certain death, all at the hands of his sovereign, the cruel and manipulative King Celimus. Now Celimus, believing himself to be rid of the "moral constraints" of the Thirsk influence, has turned his greedy eye to expansion ... and Morgravia\'s neighboring kingdom, ruled by the spirited but inexperienced Queen Valentyna. As Celimus pressures Valentyna into a doomed political marriage, Wyl endeavors desperately to preserve both the honor of his country and the freedom of the woman he loves.<br/>But fate has other plans for him. Despite his friends and loved ones becoming increasingly tangled in the evil machinations of King Celimus, though war with the dread Northern Kingdom appears imminent and Valentyna is poised to succumb to Morgravia\'s oily rule, Wyl must leave behind all he knows and cares about and travel into the land from which none return, seeking out the bestower of Myrren\'s sinister gift.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/75/89/9780060747589.jpg', 'title_long': 'Blood and Memory: The Quickening Book Two (The Quickening, 2)', 'edition': '1', 'dimensions': 'Height: 7.64 Inches, Length: 1.34 Inches, Weight: 0.8 Pounds, Width: 5.98 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 1.34}, 'width': {'unit': 'inches', 'value': 5.98}, 'weight': {'unit': 'pounds', 'value': 0.8}, 'height': {'unit': 'inches', 'value': 7.64}}, 'pages': 544, 'date_published': '2005-07-26', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Romance', 'Fantasy', 'Science Fiction', 'Science Fiction & Fantasy', 'Epic', 'Romantic'], 'authors': ['Fiona McIntosh'], 'title': 'Blood and Memory: The Quickening Book Two (The Quickening, 2)', 'isbn13': '9780060747589', 'msrp': 15.99, 'binding': 'Paperback', 'related': {'Kindle Edition': '0061827355', 'ePub': '0061827355'}, 'isbn': '0060747587', 'isbn10': '0060747587', 'other_isbns': [{'isbn': '9780061827358', 'binding': 'print'}]}}