{'book': {'publisher': 'William Morrow', 'synopsis': 'To single mom Allison Barker, men are a heap of heartbreak. So when her twelve-year-old daughter confesses that she\'s posted Allison\'s profile on an Internet matchmaking service and has been pretending to be her mom, Allison hits the roof . . . just before the doorbell rings. Standing on the porch is her date—he\'s Hollywood handsome and all male and he looks somehow familiar.<br/>Turns out he\'s famed ProRodeo bull-riding champion Quint Matthews. He whisks Allison off to dinner, but it\'s not Quint who captures her interest—it\'s his old friend, rodeo bull fighter Tag Freeman.<br/>But Quint\'s got something—or rather, someone, more on his mind than Allison—because the very next day he\'s off to visit Debbie Sue Overstreet. Debbie Sue was once taken in by Quint\'s sky-blue eyes and tight jeans, but that was before she remarried the best-looking man in Texas, Buddy Overstreet. When Quint turns up at Debbie Sue\'s door begging for help, she can\'t turn him down. Seems that Quint has finally gotten his comeuppance—his identity has been stolen, by a woman no less, one he met through an online dating service.<br/>The Equalizers take the case—after all, Quint is an "old friend" and, even better, he can pay! But no one would ever have guessed that the investigation would lead to murder . . . or that gender-confused Eugene/Janine—whom the Equalizers have tangled with before—would return to stir the stew. Or that there would be mixed messages and broken hearts all over the place.<br/>Of course, as Edwina has often said, there\'s nothin\' that a pitcher of strong margaritas and some serious snooping can\'t cure . . . but not until Debbie Sue and Edwina go on a crazy ride across West Texas!', 'language': 'en', 'image': 'https://images.isbndb.com/covers/97/11/9780060829711.jpg', 'title_long': 'I Gave You My Heart, but You Sold It Online', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.01 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 1.01}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 304, 'date_published': '2006-10-24', 'subjects': ['Literature & Fiction', 'Genre Fiction', "Women's Fiction", 'Contemporary', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Romance', 'Romantic Suspense'], 'authors': ['Dixie Cash'], 'title': 'I Gave You My Heart, but You Sold It Online', 'isbn13': '9780060829711', 'msrp': 21.95, 'binding': 'Hardcover', 'isbn': '0060829710', 'isbn10': '0060829710'}}