{'book': {'publisher': 'William Morrow', 'synopsis': "Luther Green is the very best at what he does. But the mastery of his profession is nothing he can brag about. It's nothing for which he will ever be officially recognized and it will never earn him a large paycheck. But there is a high likelihood that Luther's proficiency at his job will get him killed.<br/>Luther Green is a government assassin. For more than a decade, he has traveled the world, surgically eliminating America's enemies, never questioning his orders while performing as reliably as death itself. But his new assignment threatens to change all that. Luther's superiors have designated his new target as Alex Deavers -- the agent who taught Luther everything he knows and a man now considered to be a rogue agent on the edge of insanity.<br/>For Luther, a man normally more concerned with determining the how of an assignment than the why, his new duty forces him to confront questions he's never before had to consider. Why is he being sent to kill someone on American soil when all of his previous assignments were done abroad? Why doesn't his agency notify the FBI? Perhaps most important, why does he get the feeling that his own agency is spying on him?<br/>As Luther seeks to uncover the clues that will lead him to his prey, he slowly realizes that Alex is on a mission of his own, playing a cat-and-mouse game with his former apprentice while setting in motion a plan that could kill millions. Luther begins to suspect that the only person who can give him the answers he needs is the psychotic madman he has been ordered to execute.<br/>Luther follows a perilous trail that takes him into the most dangerous territory he has ever encountered. He is just a pawn in a twisted chess match, but a pawn may transform itself into the game's most dominant weapon. Now he has just days to learn the rules and employ all of his skill and training to find the truth. But to defeat the deadly forces against him, Luther Green must win the most dangerous game of all.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/58/47/9780060575847.jpg', 'title_long': "The Executioner's Game", 'edition': 'First Edition', 'dimensions': 'Height: 9.25 inches, Length: 6.25 Inches, Weight: 1.1 Pounds, Width: 1 inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.1}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 320, 'date_published': '2005-01-04', 'subjects': ['Literature & Fiction', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Thrillers & Suspense', 'Spies & Politics'], 'authors': ['Gary Hardwick'], 'title': "The Executioner's Game", 'isbn13': '9780060575847', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060575840', 'isbn10': '0060575840'}}