{"book": {"publisher": "Harper", "synopsis": "“An elegant, personalized integration of anecdote, analysis, scholarship, memory and speculation. . . . Not since Henry James, perhaps, has a fiction writer examined the process of writing with such insight, authority and range of reference and allusion.” —Russell Banks, New York Times Book Review<br/>“A magic curtain, woven of legends, hung before the world. Cervantes sent Don Quixote journeying and tore through the curtain. The world opened before the knight-errant in all the comical nakedness of its prose.”<br/>In this thought-provoking, endlessly enlightening, and entertaining essay on the art of the novel, renowned author Milan Kundera suggests that “the curtain” represents a ready-made perception of the world that each of us has—a pre-interpreted world. The job of the novelist, he argues, is to rip through the curtain and reveal what it hides.<br/>Here an incomparable literary artist cleverly sketches out his personal view of the history and value of the novel in Western civilization. In doing so, he celebrates a prose form that possesses the unique ability to transcend national and language boundaries in order to reveal some previously unknown aspect of human existence.", "language": "en", "image": "https: //images.isbndb.com/covers/18/67/9780060841867.jpg", "title_long": "The Curtain: An Essay in Seven Parts", "edition": "First Edition", "dimensions": "Height: 8.5 Inches, Length: 6 Inches, Weight: 0.7 Pounds, Width: 1 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 0.7}, "height": {"unit": "inches", "value": 8.5}}, "pages": 176, "date_published": "2007-01-30", "subjects": ["Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Movements & Periods'], 'authors": ["Milan Kundera'], 'title": "The Curtain: An Essay in Seven Parts", "isbn13": "9780060841867", "msrp": 22.95, 'binding": "Hardcover", "isbn": "0060841869", "isbn10": "0060841869"}}