{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': 'When smart, successful, levelheaded lawyer Alexis Pearson gets blindsided by her faithless fiancé, who disses and dumps her, she decides to change everything. Gone are the trendy dreads in favor of her own soft and natural tresses. She\'s going to get her body, mind, and spirit in shape with tae kwan do classes - and maybe kick some butt in the process to work out the aggression brought on by the abandonment . . . and her boss\'s unsubtle offers to help mend her busted heart. Of course, she never intended for it all to get out of hand - and she certainly didn\'t mean to break the elbow of her first-time sparring partner, Remedy Brown.<br/>At least she got the attention of this tall, dark, and very handsome nightclub owner with the unfortunate name. And though Alexis is wary about diving recklessly too soon into the relationship fire again, she can\'t help wondering if sexy, warm-hearted Remedy might be a remedy for what\'s ailing her. But the man comes with some crazy baggage - namely Ayzah, his estranged and deranged ex-wife, who\'s pure, unadulterated \'hood. And suddenly both the personal and professional lives of the "new" Alexis Pearson are about to get a lot wilder . . . and riskier.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/79/99/9780060847999.jpg', 'title_long': 'Just Short of Crazy', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 0.49 Pounds, Width: 0.65 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 0.65}, 'weight': {'unit': 'pounds', 'value': 0.49}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 288, 'date_published': '2006-06-13', 'subjects': ['Humor & Entertainment', 'Humor', 'Lawyers & Criminals', 'Literature & Fiction', 'Genre Fiction', 'Historical', "Women's Fiction", 'Contemporary', 'United States', 'Black & African American', 'Humor & Satire', 'Satire', 'Dark Humor', 'Humorous', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Legal', 'Romance'], 'authors': ['Nina Foxx'], 'title': 'Just Short of Crazy', 'isbn13': '9780060847999', 'msrp': 12.95, 'binding': 'Paperback', 'related': {'ePub': '0061865656'}, 'isbn': '0060847999', 'isbn10': '0060847999', 'other_isbns': [{'isbn': '9780061865657', 'binding': 'print'}]}}