{'book': {'publisher': 'Perennial', 'synopsis': '“All who love children are served generously and intelligently by the ideas, commitments, and passion of Marian Wright Edelman. Her arms are open to the children and adults of the world, and we all are stronger and more safe because of her.” — Maya Angelou<br/>Throughout her life and work, Marian Wright Edelman has been at the heart of this century\'s most dramatic civil rights and child advocacy struggles. In this stirring, heartfelt memoir she pays tribute to the extraordinary mentors who helped light her way including Martin Luther King, Jr., Robert F. Kennedy, Fannie Lou Hamer, and William Sloane Coffin. She celebrates the lives of her parents and the great Black Women of Bennettsville, South Carolina—Miz Tee, Miz Lucy, Miz Kate—who gave her love and guidance in her youth, as well as the many teachers and figures who inspired her education at Spelman College and empowered her early as an activist in the 1960\'s.<br/>Illustrated with many of the author\'s personal photographs, Lanterns also includes a "Parents\' Pledge" and "Twenty-Five More Lessons for Life" to guide, protect, and love our children every day so that they will become, in Edelman\'s moving vision, the healing agents for national transformation.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/85/96/9780060958596.jpg', 'title_long': 'Lanterns: A Memoir of Mentors', 'edition': 'Reprint', 'dimensions': 'Height: 8 Inches, Length: 5.3125 Inches, Weight: 0.4 Pounds, Width: 0.56 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.3125}, 'width': {'unit': 'inches', 'value': 0.56}, 'weight': {'unit': 'pounds', 'value': 0.4}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 208, 'date_published': '2000-08-18', 'subjects': ['Self-Help', 'Motivational', 'Success', 'Biographies & Memoirs', 'Community & Culture', 'Black & African American', 'Memoirs', 'Professionals & Academics', 'Educators', 'Parenting & Relationships', 'Religion & Spirituality', 'Worship & Devotion', 'Inspirational', 'Self Service', 'Custom Stores'], 'authors': ['Marian Wright Edelman'], 'title': 'Lanterns: A Memoir of Mentors', 'isbn13': '9780060958596', 'msrp': 15.68, 'binding': 'Paperback', 'isbn': '0060958596', 'isbn10': '0060958596'}}