{'book': {'publisher': 'William Morrow', 'synopsis': "Jim Rogan was born to a single mother—a cocktail waitress who was later convicted of welfare fraud; his bartender-father abandoned them both before he was born. After a rough-and-tumble childhood in San Francisco's hardscrabble Mission District—where he was raised by his colorful extended family—he became a political junkie at the age of nine, and once received help with his homework from Harry Truman. But Rogan traveled with a tough circle of friends; after years of borderline delinquency he was expelled from high school, became a porn theater bouncer, and then a bartender at a strip joint and a Hell's Angels bar. Along the way, a young Arkansas politician advised him to study law and become a member of a different kind of bar.<br/>In time Rogan scrapped his way through college and law school. He was appointed a Los Angeles County DA, prosecuting members of the notorious Crips and Bloods gangs; then became a judge, a state legislator, and finally a congressman from Southern California. And in 1998, as a Republican member of the House Judiciary Committee, he found himself prosecuting the impeachment of the President of the United States—Bill Clinton, the same Arkansas politician who advised him to go into law and politics two decades earlier.<br/>Rough Edges is a rarity among Washington tales: full of outrageous stories, wild humor, pull-no-punches candor, and downright fun. Replete with character and characters, and told in Rogan's engaging and unswervingly frank voice, Rogan's story is certainly the most freewheeling—and perhaps the most honest—political memoir ever written.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/05/99/9780060580599.jpg', 'title_long': 'Rough Edges: My Unlikely Road from Welfare to Washington', 'edition': 'First Edition, First Printing', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.35 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.35}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 352, 'date_published': '2004-07-01', 'subjects': ['Politics & Social Sciences', 'Politics & Government', 'Self Service', 'Custom Stores'], 'authors': ['James E. Rogan'], 'title': 'Rough Edges: My Unlikely Road from Welfare to Washington', 'isbn13': '9780060580599', 'msrp': 1.99, 'binding': 'Hardcover', 'isbn': '0060580593', 'isbn10': '0060580593'}}