{'book': {'publisher': 'William Morrow', 'synopsis': "The super-bestselling book that's enhancing Americans' health<br/>By eating the fourteen SuperFoods highlighted in Dr. Steven Pratt's instant bestseller, you can actually stop the incremental deteriorations that lead to common ailments and diseases Beans -- reduce obesity Blueberries -- lower risk for cardiovascular disease Broccoli -- lowers the incidence of cataracts and fights birth defects Oats -- reduce the risk of type II diabetes Oranges -- prevent strokes Pumpkin -- lowers the risk of various cancers Wild salmon -- lowers the risk of heart disease Soy -- lowers cholesterol Spinach -- decreases the chance of cardiovascular disease and age-related macular degeneration Tea -- helps prevent osteoporosis Tomatoes -- raise the skin's sun protection factor Turkey -- helps build a strong immune system Walnuts -- reduce the risk of developing coronary heart disease, diabetes, and cancer * Yogurt-promotes strong bones and a healthy heart<br/>SuperFoods Rx includes recipes created by Chef Michel Stroot of the Golden Door Spa and teaches you how to incorporate SuperFoods and their sidekicks into your diet. SuperFoods Rx is an indispensable guide to a healthy, long, and energetic life.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/56/74/9780060535674.jpg', 'title_long': 'SuperFoods Rx: Fourteen Foods That Will Change Your Life', 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.35 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.35}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 352, 'date_published': '2003-12-23', 'subjects': ['Cookbooks, Food & Wine', 'Health, Fitness & Dieting', 'Diets & Weight Loss', 'Other Diets'], 'authors': ['Steven G. Pratt M.D.', 'Kathy Matthews'], 'title': 'SuperFoods Rx: Fourteen Foods That Will Change Your Life', 'isbn13': '9780060535674', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060535679', 'isbn10': '0060535679'}}