{'book': {'publisher': 'Harper', 'synopsis': 'The New York Times bestselling memoir of Ronald Reagan by his longtime aide and friend<br/><br/>"These are memories of a friend and they span over the 35 years that I have known and loved Ronald and Nancy Reagan. Primarily anecdotal, there will be no footnotes, simply my best efforts to reconstruct these years and what they have meant to me."--Michael Deaver<br/>RONALD REAGAN AND ME will be comprised of six parts:<br/>The Early Years: Deaver and his first meeting with Reagan during his campaign for governor of California in 1966. His first impressions of Reagan\'s his management style, media savvy and incredible ability to communicate.<br/>Reagan: The Man: A look at the traits that make the man: perfectionist, competitor, unwavering discipline, and a deep sense of purpose and destiny.<br/>Sincerely, Ronald Reagan: Never-before-published excerpts from letters Reagan wrote to people of various backgrounds.<br/>The Campaigner: On the stump during the presidential campaigns.<br/>Mr. President: Reagan in action in the Oval Office. How he changed after he was shot, and his battles with Congress and Communism.<br/>The Long Goodbye: With Nancy\'s cooperation, a look at the Reagans\' struggle with Alzheimers and the impact it has had on their marriage and the family.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/78/41/9780060197841.jpg', 'title_long': 'A Different Drummer: My Thirty Years with Ronald Reagan', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.12 Inches, Weight: 1.0582188576 Pounds, Width: 0.85 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.12}, 'width': {'unit': 'inches', 'value': 0.85}, 'weight': {'unit': 'pounds', 'value': 1.0582188576}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 228, 'date_published': '2001-04-20', 'subjects': ['Biographies & Memoirs', 'Historical', 'United States', 'Leaders & Notable People', 'Military', 'Political', 'Presidents & Heads of State', 'History', 'Americas'], 'authors': ['Michael K. Deaver'], 'title': 'A Different Drummer: My Thirty Years with Ronald Reagan', 'isbn13': '9780060197841', 'msrp': 25, 'binding': 'Hardcover', 'isbn': '0060197846', 'isbn10': '0060197846'}}