{'book': {'publisher': 'William Morrow', 'synopsis': "In this honest, funny, and straight-talking answer to the blockbuster The Rules, a doctor, a lawyer, and an accountant, all in their late twenties, reveal what really attracts men, show women how to avoid being hurt, and explain the ways to tell if a man is interested in them for kicks. . .or for keeps.<br/>While The Rules was an unqualified smash, selling more than 1.5 million copies so far, many men who read the book know that the advice it offers simply will not work. Now women can get straight talk and honest answers with What Men Want, a revolutionary dating guide written by three young, attractive, and successful professional men. From a list of the signals men send to indicate their long-term interest--or lack of it, to how to clear explanation of why a man's friends can be a women's best allies or biggest stumbling blocks, What Men Want gives women a rare look inside men's minds through advice that really works. As shown by the phenomenal success of John Gray's Mars and Venus titles--more than 10 million copies sold--and the national blockbuster The Rules, the psychology of sex and dating is hotter than ever. With this fevered climate, What Men Want will one be of the season's most requested titles.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/58/25/9780060175825.jpg', 'title_long': 'What Men Want: Three Professional Single Men Reveal to Women What It Takes to Make a Man Yours', 'edition': 'First Edition', 'dimensions': 'Height: 8.75 Inches, Length: 6 Inches, Weight: 0.9 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 8.75}}, 'pages': 224, 'date_published': '1998-04-21', 'subjects': ['Self-Help', 'Relationships', 'Interpersonal Relations', 'Love & Romance', 'Parenting & Relationships', 'Politics & Social Sciences', 'Social Sciences'], 'authors': ['Bradley Gerstman', 'Christopher Pizzo'], 'title': 'What Men Want: Three Professional Single Men Reveal to Women What It Takes to Make a Man Yours', 'isbn13': '9780060175825', 'msrp': 19, 'binding': 'Hardcover', 'isbn': '0060175826', 'isbn10': '0060175826'}}