{'book': {'publisher': 'Harper & Row', 'synopsis': "Little Bear makes a new friend but misses her when summer ends.<br/>One summer Little Bear makes friends with a girl named Emily and her doll Lucy. But when summer ends, Emily must leave. Little Bear is sad—until he finds a way to stay close to his new friend even when she is far away.<br/>Little Bear's Friend is among the beloved classic Little Bear books from Else Holmelund Minarik and Maurice Sendak. The first, Little Bear, launched the I Can Read early reader series in 1957.<br/>In the Little Bear stories, we meet Little Bear, whose adventures are filled with humor and joy. And we meet Mother Bear, who is there whenever Little Bear needs her. When it is cold and snowy outside, she finds just the right outfit for Little Bear to play in. When he goes to the moon, she has a hot lunch waiting for him on his return. And, of course, she never forgets his birthday.<br/>This Level One I Can Read is full of warm and lovingly playful stories that are perfect for children learning to sound out words and sentences. Whether shared at home or in a classroom, the short sentences, familiar words, and simple concepts of Level One books support success for children eager to start reading on their own.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/25/58/9780060242558.jpg', 'title_long': "Little Bear's Friend, An I Can Read Book", 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.49 Pounds, Width: 0.38 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.38}, 'weight': {'unit': 'pounds', 'value': 0.49}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 64, 'date_published': '1960-01-01', 'subjects': ["Children's Books", 'Animals', 'Bears', 'Growing Up & Facts of Life', 'Friendship, Social Skills & School Life', 'Literature & Fiction', 'Chapter Books & Readers', 'Education & Reference', 'Self Service', 'Custom Stores'], 'authors': ['Else Holmelund Minarik'], 'title': "Little Bear's Friend, An I Can Read Book", 'isbn13': '9780060242558', 'msrp': 16.95, 'binding': 'Hardcover', 'isbn': '0060242558', 'isbn10': '0060242558'}}