{'book': {'publisher': 'Avon', 'synopsis': "You met star quarterback Kevin Tucker in This Heart of Mine. Now get ready to meet his shark of an agent, Heath Champion, and Annabelle Granger, the girl least likely to succeed.<br/>Annabelle's endured dead-end jobs, a broken engagement . . . even her hair's a mess! But that's going to change now that she's taken over her late grandmother's matchmaking business. All Annabelle has to do is land the Windy City's hottest bachelor as her client, and she'll be the most sought-after matchmaker in town.<br/>Why does the wealthy, driven, and gorgeous sports agent Heath Champion need a matchmaker, especially a red-haired screw-up like Annabelle Granger? True, she's entertaining, and she does have a certain quirky appeal. But Heath is searching for the ultimate symbol of success -- the perfect wife. And to make an extraordinary match, he needs an extraordinary matchmaker, right?<br/>Soon everyone in Chicago has a stake in the outcome, and a very big question: When the determined matchmaker promised she'd do anything to keep her star client happy . . . did she mean anything? If Annabelle isn't careful, she just might find herself going heart-to-heart with the toughest negotiator in town.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/45/65/9780060734565.jpg', 'title_long': 'Match Me If You Can (Chicago Stars, 6)', 'edition': '~', 'dimensions': 'Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.48 Pounds, Width: 1.04 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 1.04}, 'weight': {'unit': 'pounds', 'value': 0.48}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 402, 'date_published': '2006-08-29', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Sports', 'Feel-Good', "Women's Fiction", 'Contemporary', 'United States', 'Romance', 'Romantic Comedy'], 'authors': ['Susan Elizabeth Phillips'], 'title': 'Match Me If You Can (Chicago Stars, 6)', 'isbn13': '9780060734565', 'msrp': 4.99, 'binding': 'Mass Market Paperback', 'related': {'Kindle Edition': '0061795127', 'ePub': '0061795127'}, 'isbn': '0060734566', 'isbn10': '0060734566', 'other_isbns': [{'isbn': '9780061795121', 'binding': 'print'}]}}