{"book": {"publisher": "Harper Perennial Modern Classics", "synopsis": "New York Times Bestseller • Pulitzer Prize Finalist • An Oprah"s Book Club Selection<br/>“Powerful . . . [Kingsolver] has with infinitely steady hands worked the prickly threads of religion, politics, race, sin and redemption into a thing of terrible beauty.” —Los Angeles Times Book Review<br/>The Poisonwood Bible, now celebrating its 25th anniversary, established Barbara Kingsolver as one of the most thoughtful and daring of modern writers. Taking its place alongside the classic works of postcolonial literature, it is a suspenseful epic of one family"s tragic undoing and remarkable reconstruction over the course of three decades in Africa.<br/>The story is told by the wife and four daughters of Nathan Price, a fierce, evangelical Baptist who takes his family and mission to the Belgian Congo in 1959. They carry with them everything they believe they will need from home, but soon find that all of it—from garden seeds to Scripture—is calamitously transformed on African soil.<br/>The novel is set against one of the most dramatic political chronicles of the twentieth century: the Congo"s fight for independence from Belgium, the murder of its first elected prime minister, the CIA coup to install his replacement, and the insidious progress of a world economic order that robs the fledgling African nation of its autonomy. Against this backdrop, Orleanna Price reconstructs the story of her evangelist husband's part in the Western assault on Africa, a tale indelibly darkened by her own losses and unanswerable questions about her own culpability. Also narrating the story, by turns, are her four daughters—the teenaged Rachel; adolescent twins Leah and Adah; and Ruth May, a prescient five-year-old. These sharply observant girls, who arrive in the Congo with racial preconceptions forged in 1950s Georgia, will be marked in surprisingly different ways by their father's intractable mission, and by Africa itself. Ultimately each must strike her own separate path to salvation. Their passionately intertwined stories become a compelling exploration of moral risk and personal responsibility.', 'language": "en", "image": "https: //images.isbndb.com/covers/65/02/9780060786502.jpg", "title_long": "The Poisonwood Bible: A Novel (covers may vary)", "edition": "First Edition", "dimensions": "Height: 1.2 Inches, Length: 8 Inches, Weight: 0.9 Pounds, Width: 5.2 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8}, "width": {"unit": "inches", "value": 5.2}, "weight": {"unit": "pounds", "value": 0.9}, "height": {"unit": "inches", "value": 1.2}}, "pages": 545, "date_published": "2005-05-31", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'Literary', 'Religion & Spirituality', 'Self Service', 'Custom Stores'], 'authors": ["Barbara Kingsolver'], 'title": "The Poisonwood Bible: A Novel (covers may vary)", "isbn13": "9780060786502", "msrp": 16.99, "binding": "Paperback", "related": {"Kindle Edition": "0061804819", "eBook": "0061804819", "ePub": "0061804819"}, "isbn": "0060786507", "isbn10": "0060786507", "other_isbns": [{'isbn": "9780061804816", "binding": "ebook"}]}}