{"book": {"publisher": "Harper", "synopsis": "Mad hatter . . . pie in the sky . . . egg on your face. We use these phrases every day, yet how many of us know what they really mean or where they came from?<br/>From bringing home the bacon to leaving no stone unturned, the English language is peppered with hundreds of common idioms borrowed from ancient traditions and civilizations throughout the world. In Red Herrings and White Elephants, Albert Jack has uncovered the amazing and sometimes downright bizarre stories behind many of our most familiar and eccentric modes of expression:<br/>If you happen to be a bootlegger, your profession recalls the Wild West outlaws who sold illegal alcohol by concealing slender bottles of whiskey in their boots. If you"re on cloud nine, you owe a nod to the American Weather Bureau"s classification of clouds, the ninth topping out all others at a mountainous 40,000 feet. If you opt for the hair of the dog the morning after, you"re following the advice of medieval English doctors, who recommended rubbing the hair of a dog into the wound left by the animal's bite.<br/>A delightful compendium of anecdotes on everything from minding your p's and q's to pulling out all the stops, Red Herrings and White Elephants is an essential handbook for language-lovers of all ages.', 'language": "en", "image": "https: //images.isbndb.com/covers/33/73/9780060843373.jpg", "title_long": "Red Herrings and White Elephants: The Origins of the Phrases We Use Every Day", "edition": "First Edition", "dimensions": "Height: 7.25 Inches, Length: 4.75 Inches, Weight: 0.75 Pounds, Width: 1.01 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.75}, "width": {"unit": "inches", "value": 1.01}, "weight": {"unit": "pounds", "value": 0.75}, "height": {"unit": "inches", "value": 7.25}}, "pages": 272, "date_published": "2005-11-01", "subjects": ["Humor & Entertainment', 'Humor', 'Puzzles & Games', 'Trivia', 'Reference', 'Foreign Language Study & Reference', 'Words, Language & Grammar', 'Etymology', 'Grammar', 'Linguistics', 'Vocabulary, Slang & Word Lists', 'Writing, Research & Publishing Guides', 'Writing'], 'authors": ["Albert Jack'], 'title": "Red Herrings and White Elephants: The Origins of the Phrases We Use Every Day", "isbn13": "9780060843373", "msrp": 16.99, "binding": "Hardcover", "related": {"eBook": "0061835153", "ePub": "0061835153"}, "isbn": "0060843373", "isbn10": "0060843373", "other_isbns": [{'isbn": "9780061835155", "binding": "print"}]}}