{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': 'As far as her family and friends are concerned, Frieda has been the grieving widow for long enough. At 35, she\'s still (relatively) young, still (adequately) attractive. Her sex drive is very much alive; even Frieda admits she\'d like to put it to use again. Besides, she has a son who certainly needs a father figure. With visions of the perfect second husband in mind, Frieda\'s sisters start to send eligible males in her direction.<br/>Big sister Ilene - herself substantially married - has found the ultimate unattached catch: a gorgeous, independently wealthy, successful, divorced father, pillar of society and paragon of potential. What more could a single mom ask for? Apparently a lot more than loved ones realize. Frieda\'s own efforts bear very tasty fruit. Sam is young, talented, devoted, and incredibly sexy - though broke, only sporadically employed, and clueless about kids. But he makes Frieda feel brand-spanking-new, in a most wonderfully wanton way. When all is said and done, does Frieda really need the "perfect man" . . . or the far-from-ideal man who\'s perfect for her?', 'language': 'en', 'image': 'https://images.isbndb.com/covers/66/88/9780060536688.jpg', 'title_long': 'The Not-So-Perfect Man', 'edition': '1', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 0.61 Pounds, Width: 0.83 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 0.83}, 'weight': {'unit': 'pounds', 'value': 0.61}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 368, 'date_published': '2004-01-20', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Feel-Good', "Women's Fiction", 'Domestic Life', 'Mothers & Children', 'Sisters', 'Contemporary', 'United States', 'Humor & Satire', 'Dark Humor', 'Romance', 'Romantic Comedy'], 'authors': ['Valerie Frankel'], 'title': 'The Not-So-Perfect Man', 'isbn13': '9780060536688', 'msrp': 14.99, 'binding': 'Paperback', 'related': {'ePub': '0061860522'}, 'isbn': '0060536683', 'isbn10': '0060536683', 'other_isbns': [{'isbn': '9780061860522', 'binding': 'print'}]}}