{'book': {'publisher': 'William Morrow', 'synopsis': 'Based on her more than thirty years as a noted thinker and speaker on personal contentment, Alexandra Stoddard shares what she has learned about the small but significant changes you can make to be happier day by day.<br/>A fun first step: quickly write down ten words that define who you are—perhaps beaches, family, food, home—and what else? This and dozens of other inventive ideas will help you pursue happiness wisely and well.<br/>In challenging times, it is easy to question whether happiness is a choice. Alexandra Stoddard affirms that not only is it possible to choose happiness but that happiness is the best choice we can make. It is the "first principle" of life that unites humankind because it is what we all desire.<br/>Happiness lies in the passions we pursue and in the pressures we decline. It is in knowing how to work and when to play. It is in the treasured objects we keep nearby and in the ordinary moments we elevate into small celebrations. It is in the note we write to a friend and the kindness we show a stranger. Happiness is what you make it, where you make it. Happiness is our best choice.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/80/48/9780060008048.jpg', 'title_long': 'Choosing Happiness: Keys to a Joyful Life', 'edition': '1st Collins Edition', 'dimensions': 'Height: 8.28 Inches, Length: 6.24 Inches, Weight: 0.8598028218 Pounds, Width: 0.59 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.24}, 'width': {'unit': 'inches', 'value': 0.59}, 'weight': {'unit': 'pounds', 'value': 0.8598028218}, 'height': {'unit': 'inches', 'value': 8.28}}, 'pages': 192, 'date_published': '2002-04', 'subjects': ['Self-Help', 'Happiness', 'Stress Management', 'Religion & Spirituality', 'New Age & Spirituality', 'Mental & Spiritual Healing'], 'authors': ['Alexandra Stoddard'], 'title': 'Choosing Happiness: Keys to a Joyful Life', 'isbn13': '9780060008048', 'msrp': 19.95, 'binding': 'Hardcover', 'related': {'ePub': '0061982911'}, 'isbn': '0060008040', 'isbn10': '0060008040', 'other_isbns': [{'isbn': '9780061982910', 'binding': 'print'}]}}