{'book': {'publisher': 'Amistad', 'synopsis': 'Black Americans have had an ongoing presence in the American military, from the Revolution to the Civil War to Vietnam to the War in Iraq, yet their contributions are often relegated to a footnote of history, if mentioned at all. The recent successes and wide visibility of African Americans in the military -- such as those of Colin Powell and Shoshanna Johnson -- belie a harsh reality: the Army was segregated until the Korean War. Only in the last fifty years have blacks been allowed to serve in a manner commensurate with both their skills and commitment.<br/>Now, in a book that honors their service to their country, more than two dozen veterans and military personnel, including Brigadier General Vincent Brooks, one of the foremost spokespersons to the media on the War in Iraq, speak for themselves and their peers about their experiences -- in combat, in the barracks, and in their hometowns after they returned from war. Each profile is accompanied by photographs of the men and women from their days in uniform, as well as specially commissioned contemporary portraits from acclaimed photographer Ron Tarver. With stories of patriotism combined with a determination to overcome obstacles, We Were There is an inspiring account of the extraordinary sacrifices of everyday Americans.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/21/77/9780060542177.jpg', 'title_long': 'We Were There: Voices of African American Veterans, from World War II to the War in Iraq', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1 Pounds, Width: 0.82 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.82}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 208, 'date_published': '2004-03', 'subjects': ['Biographies & Memoirs', 'Community & Culture', 'Black & African American', 'Historical', 'United States', 'Leaders & Notable People', 'Military', 'History', 'World War II', 'Iraq War', 'Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies'], 'authors': ['Yvonne Latty', 'Ron Tarver'], 'title': 'We Were There: Voices of African American Veterans, from World War II to the War in Iraq', 'isbn13': '9780060542177', 'msrp': 23.95, 'binding': 'Hardcover', 'isbn': '0060542179', 'isbn10': '0060542179'}}