{'book': {'publisher': 'William Morrow', 'synopsis': 'In eighteenth-century England the aristocracy dominated the imagination, their exploits -- and misdeeds -- discussed, debated, and gossiped about in the salons and parlors of London. Now author Martin Levy vividly re-creates one of the most shocking and scandalous events of the period, in a riveting true tale of passion, obsession, murder, and courtroom drama.<br/>On a spring evening in the year 1779, a young woman emerged from London\'s Covent Garden Theatre amid a grand swirl of lords and ladies, their servants and coachmen. From out of the shadows a man emerged, dressed in a black suit. He raised a pistol and fired one fatal shot point-blank into the woman\'s head. A sudden and brutal murder, it was all the more shocking because of the identities of those involved. The victim was Martha Ray, famed aficionada of fashion and the arts, and longtime live-in mistress of the Earl of Sandwich, high-ranking minister to King George III. The assailant was James Hackman, a respected Anglican minister and Martha Ray\'s former lover.<br/>It was a savage crime that rocked both British high society and the church, and inflamed the interest and imagination of such renowned personages as Samuel Johnson and James Boswell, noted biographer and lover of prostitutes and executions. And it resulted in a courtroom extravaganza unique in the annals of legal proceedings -- where passion was the motive, the madness of "momentary phrenzy" the mitigating circum-stance . . . and love the ultimate justification for a crazed act of murder.<br/>With consummate skill, author Martin Levy brings to breathtaking life the sights and sounds of an unparalleled era in history -- when hangings were public entertainment and debauchery was a popular pastime of the wealthy and the titled -- and expertly unravels the mystery behind a truly sensational slaying. Fascinating, startling, edifying, and entertaining, Love and Madness is a brilliant tale of crime and punishment as vivid and compelling as the headlines of today.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/97/48/9780060559748.jpg', 'title_long': 'Love and Madness: The Murder of Martha Ray, Mistress of the Fourth Earl of Sandwich', 'edition': '1', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.75 Pounds, Width: 0.89 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.89}, 'weight': {'unit': 'pounds', 'value': 0.75}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 256, 'date_published': '2004-02-03', 'subjects': ['History', 'Europe', 'Great Britain', 'World'], 'authors': ['Martin Levy'], 'title': 'Love and Madness: The Murder of Martha Ray, Mistress of the Fourth Earl of Sandwich', 'isbn13': '9780060559748', 'msrp': 1.99, 'binding': 'Hardcover', 'isbn': '0060559748', 'isbn10': '0060559748'}}