{'book': {'publisher': 'William Morrow', 'synopsis': "Steven Sorrentino had moved from West Long Branch, New Jersey, to New York City, with dreams of finding love and Broadway stardom. Venturing out of the closet and feeling free (at last!) from small-town America, Steven found his niche among the quirky and kindred spirits of the city's musical theater hopefuls.<br/>But on Christmas Eve of 1980, just after Stevenarrived in New Jersey to celebrate the holidays, his father contracted a sudden and rare neurological disorder that left him paralyzed. Stepping up to the plate and back into the closet, Steven returned to West Long Branch to help the family out and to take over Clint's Corner, his father's luncheonette. He soon found himself at the grill flipping porkroll (the unofficial state meat) and serving a counter full of eccentrics including Googie the Gizmo, Half Cup Harold, and Steven's old high-school jock crush, Brent Jamison. And always at his side was the most colorful of them all, Dolores, the crusty head waitress with coke-bottle glasses, a wayward wig, and a particular flair for butchering the English language. From this unusual post, Steven watched as his ailing father refused to accept defeat.<br/>Confined to a wheelchair, yet determined and optimistic, Clint Sorrentino ignored all the medical setbacks and even managed to further his own career in local politics. Yet for Steven, the more his father triumphed over the obstacles, the more his own life seemed to stall.<br/>Guilty, confused, and stuck behind the counter, Steven made a shocking and desperate decision -- not knowing that he was about to stumble upon the secret of his father's resilience. Steven had returned home to save his father, but in the end, his father saved him.<br/>An insightful, bitingly hilarious, and poignant debut, Luncheonette is an uplifting reminder of the unexpected lessons life brings and of the inspiration we find in the least likely places.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/89/22/9780060728922.jpg', 'title_long': 'Luncheonette: A Memoir', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.15 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.15}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 304, 'date_published': '2005-02-01', 'subjects': ['Biographies & Memoirs', 'Memoirs', 'Professionals & Academics', 'Business', 'Culinary', 'Regional U.S.', 'Mid Atlantic', 'Travelers & Explorers', 'Business & Money', 'Industries', 'Hospitality, Travel & Tourism'], 'authors': ['Steven Sorrentino'], 'title': 'Luncheonette: A Memoir', 'isbn13': '9780060728922', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060728922', 'isbn10': '0060728922'}}