{'book': {'publisher': 'Greenwillow', 'synopsis': 'Here are the stories of three very different men -- a journalist, a scientist, and a labor leader -- who shared the same seemingly impossible dream. They were determined to create a Jewish state in the land God promised to Abraham and his descendants -- land the Jews had been exiled from nearly two thousand years ago. They faced towering obstacles and dramatic setbacks. Yet they prevailed. How?<br/>Spanning nearly ninety years and many significant world events, this concise history tells the tale of the creation of the state of Israel through the lives of three men. Theodor Herzl, Chaim Weizmann, and David Ben-Gurion at times disagreed -- even vehemently -- but each needed the other two in order to accomplish a common goal. A Promise Fulfilled shows how events built on one another -- how the way one crisis was handled influenced the way the next played out. It is essential reading, not just for understanding how the nation of Israel came to be, but for insight into the controversy and crises that surround this country even today.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/50/58/9780060515058.jpg', 'title_long': 'A Promise Fulfilled: Theodor Herzl, Chaim Weitzmann, David Ben-Gurion, and the Creation of the State of Israel', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 7 Inches, Weight: 0.9 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 144, 'date_published': '2005-04-01', 'subjects': ["Children's Books", 'History', 'Holocaust', 'Middle East', 'Religions', 'Judaism', 'Teen & Young Adult', 'Religion & Spirituality', 'Education & Reference'], 'authors': ['Howard Greenfeld'], 'title': 'A Promise Fulfilled: Theodor Herzl, Chaim Weitzmann, David Ben-Gurion, and the Creation of the State of Israel', 'isbn13': '9780060515058', 'msrp': 19.89, 'binding': 'Library Binding', 'isbn': '0060515058', 'isbn10': '0060515058'}}