{'book': {'publisher': 'William Morrow', 'synopsis': "There are few individuals as unique, enigmatic, and colorful as Prince Alwaleed Bin Talal Bin Abdulaziz Alsaud.<br/>This biography of the world's fifth-richest man -- worth around $24 billion -- tells the story of a businessman who started out with a relatively modest bank loan and built an empire that embraces the best-known brands, from Citigroup and Disney to Apple Computers and the Four Seasons Hotels.Alwaleed, as he's known to most in the Middle East, is the largest single foreign investor in the U.S. economy, with interests in almost everything that touches the American lifestyle. Like investment guru Warren Buffett, Alwaleed became hugely successful through consecutive strategic high-profile investments, earning him the respect of Wall Street.<br/>In this fascinating and uniquely insightful authorized biography, international journalist and broadcaster Riz Khan offers a revealing insider's view of this provocative business genius, focusing on issues including: his unique family history the origins of his powerful drive to succeed his phenomenal success in rescuing beleaguered companies such as America's giant Citigroup his investments in top brands including Four Seasons Hotels, Saks Fifth Avenue, and NewsCorp his unique approach to investing -- and some of his most lucrative strategies<br/>Beyond the billionaire, jet-set lifestyle, Prince Alwaleed has a close and emotional relationship with the desert and its people. His identity sits on the fence separating the Arab world on one side, with tents, camels, and rifle-toting Bedouins ... and the fast-paced, hungry, pinstripe world of Wall Street, with limousines and designer labels.<br/>Brilliant, charming, and extraordinarily hardworking, this billionaire's personal story unfolds in gripping detail, based on in-depth interviews with the Prince's family, entourage, and closest business associates -- including top names such as Sandy Weill, Rupert Murdoch, and Jimmy Carter.<br/>Alwaleed is a revealing portrait of an unusual individual whose presence in the global economy is unmatched; a twenty-first-century ambassador who could be the ultimate bridge to connect the Middle East and the West.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/03/02/9780060850302.jpg', 'title_long': 'Alwaleed: Businessman, Billionaire, Prince', 'edition': 'HAR/DVD', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.7 Pounds, Width: 1.33 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.33}, 'weight': {'unit': 'pounds', 'value': 1.7}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 432, 'date_published': '2005-10-18', 'subjects': ['Biographies & Memoirs', 'Historical', 'Middle East', 'Leaders & Notable People', 'Rich & Famous', 'Royalty', 'Professionals & Academics', 'Business', 'History', 'Saudi Arabia', 'Self Service', 'Custom Stores'], 'authors': ['Riz Khan'], 'title': 'Alwaleed: Businessman, Billionaire, Prince', 'isbn13': '9780060850302', 'msrp': 26.95, 'binding': 'Hardcover', 'isbn': '0060850302', 'isbn10': '0060850302'}}