{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': 'When his cover is blown and his wife is kidnapped in Jerusalem, Lt Col Peter Newman realises he may have to pay a catastrophic price for his participation in a secret government mission to uncover Iraqi nuclear weapons.<br/>Newman has always been willing to put his life on the line for his country. As concern that Iraq may already possess nuclear weapons grows, he once again puts America first and agrees to undertake a clandestine mission to uncover the weapons. But when his cover is blown and his wife is kidnapped in Jerusalem, Newman discovers that his courage has put more than just his own life at risk.<br/>Matters become even more complicated when Israel discovers that Iraq has nukes, and plans a pre–emptive strike on Baghdad with Jericho missiles – an event that could have unprecedented consequences. Newman is the only man who knows all of the pieces to the puzzle, and the only one experienced and brave enough to prevent full–scale nuclear war. But as time ticks away, will he be able to both save his wife and prevent Armageddon, or will he have to make a terrible choice?', 'language': 'en', 'image': 'https://images.isbndb.com/covers/98/05/9780060599805.jpg', 'title_long': 'The Jericho Sanction', 'edition': '1st ptg.', 'dimensions': 'Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.65 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 0.65}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 624, 'date_published': '2004-08-31', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'War', 'Action & Adventure', 'Mystery, Thriller & Suspense', 'United States', 'Thrillers & Suspense', 'Spies & Politics', 'Suspense', 'Military', 'Self Service', 'Custom Stores'], 'authors': ['Oliver North', 'Joe Musser'], 'title': 'The Jericho Sanction', 'isbn13': '9780060599805', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'isbn': '0060599804', 'isbn10': '0060599804'}}