{'book': {'publisher': 'William Morrow', 'synopsis': "The acclaimed author of The Water Dancers, Terry Gamble uses lush, evocative prose to bring to life a place of secrets and dreams, exploring the complex relationships within a powerful, conflicted family and the nostalgic ache of riotous, heartrending summers past.<br/>Good Family<br/>A retreat on Lake Michigan for old-moneyed WASPs, Sand Isle has long been the summer residence of the Addison family. A scion of a great American industrial clan, Maddie Addison survived an awkward but sheltered adolescence only to be plagued in adulthood by alcoholism, a failed marriage, and an unendurable loss that sent her fleeing the burden of rigid family expectations. Now, after an eleven-year hiatus, Maddie is returning to the bucolic setting of her privileged childhood summers. In recovery and approaching forty, she is summoned back to Sand Isle, where her widowed mother has suffered a stroke that has left her mute, immobile, and near death. It is here that Maddie must reconnect with her past, assess what she has become, and confront the circumstances that changed her and those she loved forever.<br/>Maddie has avoided her relatives for more than a decade, cobbling a life for herself as a documentary filmmaker far from the cocoon of her wealthy family: her sister Dana, who stayed close to the Addison family hearth; her cousins Sedgie, an aspiring actor drinking his way through a second divorce, Derek, a gifted artist who carves images out of trees the way he once etched an impression into Maddie's heart, and Adele, the stunning beauty turned mystical religious seeker; and her niece Jessica, Dana's adopted daughter whose pierced and tattooed rebellion expresses an alienation that echoes Maddie's. What awaits Maddie in her ancestral summerhouse is a collision of distinct, eccentric personalities -- by turns hilarious and poignant -- as well as an archive of memories that stir together pleasure, passion, and pain in equal measure. Beneath the silent gaze of Evelyn Addison -- the stricken matriarch whose stoically traditional but gilded life masked her own brand of despair -- Maddie and her relatives play out a family drama of loss, forgiveness, and transcendence as she confronts her past and faces the future, finding a home once again in a house steeped in untold stories of its own.<br/>With disarming charm and dazzling insight, Terry Gamble offers a rich, compassionate portrait of individuals connected by blood but separated by experience, perception, and destiny. Good Family is a masterly work of fiction that enthralls with the power of story while evoking laughter, heartbreak, and exhilaration.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/79/48/9780060737948.jpg', 'title_long': 'Good Family: A Novel', 'edition': 'First Edition', 'dimensions': 'Height: 9.5 Inches, Length: 6.75 Inches, Weight: 1.35 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.75}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.35}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 336, 'date_published': '2005-05-31', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Family Saga', 'United States'], 'authors': ['Ms. Terry Gamble'], 'title': 'Good Family: A Novel', 'isbn13': '9780060737948', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060737948', 'isbn10': '0060737948'}}