{'book': {'publisher': 'William Morrow', 'synopsis': "All that writer Cece Caruso -- a thirty-nine-year-old former beauty queen from New Jersey -- really wants to do is finish her biography of Erle Stanley Gardner so that she can finally stop obsessing about Perry Mason. Well, that and find a 1970 silk chiffon Ossie Clark to add to her collection of vintage clothing. And fix the broken front doorknob on her West Hollywood bungalow. But first she has to help save her daughter's foundering marriage, which is more than Cece could manage for her own.<br/>Everybody's got problems. In a last-ditch effort to kick a bad case of writer's block, Cece pays a visit to a prison inmate who had once corresponded with Gardner, pleading his innocence. Her impetuousness lands her smack in the middle of a case worthy of Perry Mason himself -- a double-edged mystery linking a forty-year-old murder to one where the body is still warm. Propelled by tenacity, curiosity, a sense of humor, and an understanding of human nature's dark side, Cece will channel the inner sleuth she never realized she possessed to find a killer who is all too real -- and all too close.<br/>I Dreamed I Married Perry Mason is hip, sexy, and smart. Susan Kandel has created an unforgettable cast of characters planted firmly in terra California. Join Cece as she breaks into crime scenes, outfoxes lawyers, rekindles a romance with a police detective, and -- oh, yes -- finally makes her peace with Perry Mason.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/10/53/9780060581053.jpg', 'title_long': 'I Dreamed I Married Perry Mason: A Cece Caruso Mystery', 'dimensions': 'Height: 8.5 Inches, Length: 6 Inches, Weight: 0.95 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.95}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 288, 'date_published': '2004-05-04', 'subjects': ['Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths'], 'authors': ['Susan Kandel'], 'title': 'I Dreamed I Married Perry Mason: A Cece Caruso Mystery', 'isbn13': '9780060581053', 'msrp': 23.95, 'binding': 'Hardcover', 'isbn': '0060581050', 'isbn10': '0060581050'}}