{"book": {"publisher": "Harper Perennial", "synopsis": ""A powerful message for all of us. I was hypnotized by the simple truths and spiritual lessons. Read it and tell everyone you know to do the same.' —Wayne Dyer<br/>This incredible adventure story—and New York Times bestseller—offers us an opportunity to discover the wisdom of an ancient culture and to hear its powerful message.<br/>An American woman is summoned by a remote tribe of nomadic Aboriginals who call themselves the “Real People” to accompany them on a four-month-long walkabout through the Outback. While traveling barefoot with them through 1,
        400 miles of rugged desert terrain, she learns a new way of life, including their methods of healing, based on the wisdom of their 50,
        000-year-old culture. Ultimately, she experiences a dramatic personal transformation.<br/>Mutant Message Down Under recounts a unique, timely, and powerful life-enhancing message for all humankind: It is not too late to save our world from destruction if we realize that all living things—be they plants, animals, or human beings—are part of the same universal oneness. If we heed the message, our lives, like the lives of the Real People, can be filled with this great sense of purpose.", "language": "en", "image": "https: //images.isbndb.com/covers/35/14/9780060723514.jpg", "title_long": "Mutant Message Down Under, Tenth Anniversary Edition", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 0.4 Pounds, Width: 0.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 0.5}, "weight": {"unit": "pounds", "value": 0.4}, "height": {"unit": "inches", "value": 8}}, "pages": 224, "date_published": "2004-05-25", "subjects": ["Literature & Fiction', 'Action & Adventure', 'Sea Adventures', 'Women's Adventure', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Marlo Morgan'], 'title": "Mutant Message Down Under, Tenth Anniversary Edition", "isbn13": "9780060723514", "msrp": 14.99, "binding": "Paperback", "related": {"ePub": "0061749982"}, "isbn": "0060723513", "isbn10": "0060723513", "other_isbns": [{'isbn": "9780061749988", "binding": "print"}]}}