{'book': {'publisher': 'HarperBusiness', 'synopsis': 'In this book, you\'ll learn the real-world, street-smart rules for managing and protecting your money -- told through the everyday experiences of people like you. Never before have such valuable insights and sage advice been stated in such a witty, informative, and straight-from-the-shoulder way.<br/>And that\'s no accident. The product of a lower-middle-class family, David W. Latko is a self-made multimillionaire who today manages more than $100 million in client assets -- and he did it by applying the plain-spoken truths contained within these pages.<br/>But Everybody Wants Your Money is not just one more book that promises get-rich-quick secrets. Rather, it is a detailed guidebook to protect yourself from the money traps we fall into by trusting our families, financial advisors, neighbors, or friends -- who mean us no harm but know little about building wealth. And Latko arms you against the unscrupulous predators who covet all that you possess -- and in the process will rob you of everything you need to achieve true financial security. Latko\'s book lays bare the scams and con games that target each of us on a daily basis, and tells you how to recognize -- and defeat -- those who delight in fleecing the unwary.<br/>In these pages, you will learn:<br/>How brokers, financial advisors, lawyers, and other "professionals" get their hands into your pockets . . . and how to pick professionals you can trust<br/>How today\'s divorce laws make a mockery of the so-called equitable settlement . . . and what you can do to prevent the resultant financial catastrophe<br/>How to manage the hard questions of estates, trusts, and wills while keeping your children from torpedoing your financial security, whether through good intentions or not<br/>Why most people lose staggering amounts of money when they shop for autos . . . and how to best even the most savvy car salesman in every negotiation<br/>How to keep your identity from being stolen in today\'s perilous world . . . and what to do when it is<br/>The real secrets to making money in real estate . . . and keeping it!<br/>Everybody Wants Your Money is packed with innovative, low-risk, and proven strategies for protecting -- and passing on -- the money we make and the wealth we build.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/11/56/9780060851156.jpg', 'title_long': 'Everybody Wants Your Money: The Straight-Talking Guide to Protecting (and Growing) the Wealth You Worked So Hard to Earn', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6.25 Inches, Weight: 1.15 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.15}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 288, 'date_published': '2006-03-01', 'subjects': ['Business & Money', 'Personal Finance', 'Budgeting & Money Management'], 'authors': ['David W. Latko'], 'title': 'Everybody Wants Your Money: The Straight-Talking Guide to Protecting (and Growing) the Wealth You Worked So Hard to Earn', 'isbn13': '9780060851156', 'msrp': 22.95, 'binding': 'Hardcover', 'isbn': '0060851155', 'isbn10': '0060851155'}}