{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': 'If you\'re like most people, 70 percent of what\'s in your kitchen right now is unhealthy and has to go. Now the good news ...<br/>This book will show you that there are healthy and tasty alternatives to everything in your refrigerator and pantry, and the transition is easier than you think.<br/>When it comes to food, most of us go through a constant tug-of-war between the foods we love and the foods we feel we should be eating. But what if we didn\'t have to give up our favourite foods? What if we could take recipes from our childhood or our favourite cookbooks and find healthier ways to enjoy them?<br/>Marilu Henner\'s Healthy Life Kitchen shows you a new way, a better way, to create a "health factory" in your home. Out go the red meat, dairy, and refined sugar products, and in come the freshest fruits, vegetables, grains, soy, seafood, poultry, and seasonings imaginable-and, in a few easy steps, you\'ve created a Healthy Life you!<br/>After inspiring legions of readers with Marilu Henner\'s Total Health Makeover and The 30-Day Total Health Makeover, Marilu presents the first cookbook in her bestselling series.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/85/79/9780060988579.jpg', 'title_long': 'Healthy Life Kitchen', 'edition': 'First Edition', 'dimensions': 'Height: 9 inches, Length: 7 inches, Weight: 1.5 Pounds, Width: 1 inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.5}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 368, 'date_published': '2002-06-15', 'subjects': ['Cookbooks, Food & Wine', 'Special Diet', 'Health, Fitness & Dieting', 'Nutrition', 'Parenting & Relationships'], 'authors': ['Marilu Henner'], 'title': 'Healthy Life Kitchen', 'isbn13': '9780060988579', 'msrp': 15.95, 'binding': 'Paperback', 'related': {'ePub': '0062032186'}, 'isbn': '0060988576', 'isbn10': '0060988576', 'other_isbns': [{'isbn': '9780062032188', 'binding': 'print'}]}}