{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': 'The parenting classic, now revised with new chapters, checklists, and information about today\'s most pressing issues regarding our children<br/>This bestselling guide rejects "quick-fix" solutions and focuses on helping kids develop their own self-discipline by owning up to their mistakes, thinking through solutions, and correcting their misdeeds while leaving their dignity intact. Barbara Coloroso shows these principles in action through dozens of examples -- from sibling rivalry to teenage rebellion; from common misbehaviors to substance abuse and antisocial behavior. She also explains how to parent strong-willed children, effective alternatives to time-outs, bribes, and threats, and how to help kids resolve disputes and serious injustices such as bullying.<br/>Filled with practical suggestions for handling the ordinary and extraordinary tribulations of growing up, kids are worth it! helps you help your children grow into responsible, resilient, resourceful adults -- not because you tell them to, but because they want to.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/43/15/9780060014315.jpg', 'title_long': 'Kids Are Worth It! : Giving Your Child The Gift Of Inner Discipline', 'edition': 'Revised ed.', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 1 Pounds, Width: 0.79 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 0.79}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 352, 'date_published': '2002-08-20', 'subjects': ['Self-Help', 'Relationships', 'Conflict Management', 'Health, Fitness & Dieting', 'Psychology & Counseling', 'Child Psychology', 'Parenting & Relationships', 'Family Relationships', 'Conflict Resolution', 'Parenting', 'Early Childhood', 'Medical Books', 'Psychology'], 'authors': ['Barbara Coloroso'], 'title': 'Kids Are Worth It! : Giving Your Child The Gift Of Inner Discipline', 'isbn13': '9780060014315', 'msrp': 14.99, 'binding': 'Paperback', 'isbn': '0060014318', 'isbn10': '0060014318', 'other_isbns': [{'isbn': '9780061995415', 'binding': 'printisbncanonical'}]}}