{'book': {'publisher': 'Harper Business', 'synopsis': "Take an ordinary business. A bike shop. An auction company. An ice cream parlor. A sock manufacturer. In thoroughly mundane businesses like these, an entrepreneur must outsmart the multitudes of competitors, leap to the head of the pack, and become a dominant Alpha Dog.<br/>Exactly how does an everyday company distinguish itself in the marketplace, generate much higher sales than its competitors, and earn the lasting loyalty of customers and employees? Is it cutting-edge products? Brilliant service? Ingenious branding?<br/>Donna Fenn, a twenty-year veteran of Inc. magazine, has discovered the people who have the answers. In a personal and probing style, she introduces you to eight Alpha Dogs. These men and women share their solutions and insights on how to rise to the top, despite multiple competitors, from Chinese manufacturers to Wal-Mart.<br/>Readers will meet:<br/>Chris Zane, an intense, ambitious father of three boys. His Branford, Connecticut, retail bike shop has flourished among Wal-Mart, Sports Authority, and independent bike stores. He's done it by seeking out new markets and perfecting the art of customer service.<br/>Deb Weidenhamer, a tough woman in a male-dominated industry who transformed a traditional auction company with cutting-edge technology. While her competitors were still fretting about eBay, she was using the online auction giant as a training ground for her own innovative Web site.<br/>Amy Simmons, a former premed student who fell in love with the ice cream business in Boston and then founded her own ice cream parlor in Austin, Texas. With twelve Amy's Ice Creams stores in Austin, Amy's is the Austin hometown favorite, despite her deep-pocketed rivals, Ben & Jerry's and Cold Stone Creamery.<br/>In accessible, conversational style, Donna Fenn tells each entrepreneur's personal story, shares their winning formulas, and offers nuts-and-bolts advice and practical tips. Alpha Dogs is a lively handbook for every current and aspiring entrepreneur.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/86/77/9780060758677.jpg', 'title_long': 'Alpha Dogs: How Your Small Business can become a Leader of the Pack', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.7275254646 Pounds, Width: 0.85 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.85}, 'weight': {'unit': 'pounds', 'value': 0.7275254646}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 240, 'date_published': '2005-11-29', 'subjects': ['Business & Money', 'Job Hunting & Careers', 'Guides', 'Business Development & Entrepreneurship', 'Entrepreneurship', 'Starting a Business', 'Small Business', 'Politics & Social Sciences', 'Sociology'], 'authors': ['Donna Fenn'], 'title': 'Alpha Dogs: How Your Small Business can become a Leader of the Pack', 'isbn13': '9780060758677', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060758678', 'isbn10': '0060758678'}}