{"book": {"publisher": "Harper", "synopsis": "At long last, the bestselling author of Small Miracles and The Poisonwood Bible returns with the wise and compelling true story of her family’s adventure to reclaim the food they eat<br/><br/>America has long been a nation of farmers. But within the past several decades, our food supply has become dependent on transportation that burns fossil fuels and on increasingly fewer varieties of vegetables and animals. In a single generation, most Americans have lost their knowledge of agriculture and the natural processes that are a part of our food chain. But while food is cheap we pay for it in other ways, including shorter life spans for our children, argues Barbara Kingsolver.<br/>Determined to integrate their food choices with their family values, Kingsolver and her family moved from suburban Arizona to a rural Appalachia, and embarked on an adventure of realigning their lives with the food chain. Part memoir, part journalistic investigation, Animal, Vegetable, Miracle follows them through the first year of their experiment.<br/>Told in the compelling voices of the Kingsolver family, it recalls their experiences, and introduces other passionate, committed citizens who are trying to turn the tide in their communities, from organic farmers to members of the Slow Food movement who are doing their best to protect our foods against extinction and return us to a way of life that is better for our health, our wallets, and our environment.", "language": "en", "image": "https: //images.isbndb.com/covers/25/59/9780060852559.jpg", "title_long": "Animal, Vegetable, Miracle: A Year of Food Life", "edition": "Illustrated", "dimensions": "Height: 1.24 Inches, Length: 9.22 Inches, Weight: 1.5 pounds, Width: 6.6 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 9.22}, "width": {"unit": "inches", "value": 6.6}, "weight": {"unit": "pounds", "value": 1.5}, "height": {"unit": "inches", "value": 1.24}}, "pages": 384, "date_published": "2007-05-01", "subjects": ["Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Community & Culture', 'Women', 'Memoirs', 'Professionals & Academics', 'Culinary', 'Environmentalists & Naturalists', 'Crafts, Hobbies & Home', 'Gardening & Landscape Design', 'By Technique', 'Science & Math', 'Agricultural Sciences', 'Food Science', 'Nature & Ecology', 'Conservation', 'Environment', 'Environmentalism', 'Politics & Social Sciences', 'Self Service', 'Custom Stores'], 'authors": ["Barbara Kingsolver', 'Camille Kingsolver', 'Steven L. Hopp'], 'title": "Animal, Vegetable, Miracle: A Year of Food Life", "isbn13": "9780060852559", "msrp": 26.95, 'binding": "Hardcover", "isbn": "0060852550", "isbn10": "0060852550"}}