{'book': {'publisher': 'Harper Business', 'synopsis': "Meet the new leaders of the twenty-first-century stock market-each an Internet stock-trading legend. Each a cyber-guru in the vanguard of the millions of people trading and talking about stocks on the Internet. Each with legions of eager followers and determined foes, and the ability to make stock prices leap-or plummet-at the click of a mouse. Colorful, charismatic, and often outrageous, they are reshaping the way we invest and how Wall Street works.<br/>Scam Dogs and Mo-Mo Mamas is their story the first journalistic look at these market wizards and their brave new world. Veteran Wall Street Journal reporter John Emshwiller has entered that world and brought back a lively, entertaining tale, documenting their rise, the culture they've created, their intertwined lives, and their power, influence, and turf battles.<br/>Pitted against the cyber-gurus, and a major part of this story, are the self-appointed truthsayers who seek to expose their excesses, Web officials who try to keep order in cyberspace, and enforcement officials from the SEC, who are beginning a government crackdown.<br/>Though these Internet voyagers rarely meet or even share a spoken word, their lives and passions have all met in cyberspace. There, they befriend or battle each other in pursuit of fame and fortune. They operate in a realm without substance that can be powerfully, even frighteningly, real. There, it is as easy to be entertained as it is to be fleeced. Of course, if you are very good and very lucky, you just might strike it rich.<br/>Welcome to the wild and woolly world of Internet stock trading-where the rules are still being written, nothing is as it seems, and everything is up for grabs.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/62/02/9780060196202.jpg', 'title_long': 'Scam Dogs And Mo-Mo Mamas: Inside the Wild and Woolly World of Internet Stock Trading', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.12 Inches, Weight: 1.3 Pounds, Width: 1.05 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.12}, 'width': {'unit': 'inches', 'value': 1.05}, 'weight': {'unit': 'pounds', 'value': 1.3}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 295, 'date_published': '2000-06-15', 'subjects': ['Business & Money', 'Finance', 'Investing', 'Business Development & Entrepreneurship', 'Small Business'], 'authors': ['John R. Emshwiller'], 'title': 'Scam Dogs And Mo-Mo Mamas: Inside the Wild and Woolly World of Internet Stock Trading', 'isbn13': '9780060196202', 'msrp': 25, 'binding': 'Hardcover', 'isbn': '0060196203', 'isbn10': '0060196203'}}