{'book': {'publisher': 'Avon', 'synopsis': 'A story of love, life and going completely la-la in LA, from the internationally bestselling author of Bare Necessity and For Better, For Worse, Carole Matthews.<br/>One girl in love with two guys…<br/>Isn\'t that the sweetest taboo?<br/>Sadie Nelson knows that falling in love can be big trouble - especially when she discovers that the best things in life are never free. Her heart starts causing trouble when she first lays eyes on Gil McGann, the sexy and powerful Hollywood producer at the London Book Fair. In no time, Gil is whisking her away from her dead-end job and drizzly old England to join him in the land of the perfect suntan. Then there\'s Tavis Jones, an irresistibly endearing -- and criminally good-looking -- actor who\'s soon pulling her heartstrings in a different direction. Suddenly the choices facing Sadie in the home of the famous and the desperate-to-be-famous are enough to drive a good girl insane -- especially when no-one is quite what they seem to be. It\'s not great to find out that Gil has a sticky ex who won\'t let go or that Tavis\'s uncertain orientation may permanently cast him in the role of "good friend". With her real life turning rapidly into a mad movie plot, what does a slightly crazed woman two much in love do?<br/>Lights, camera, action...', 'language': 'en', 'image': 'https://images.isbndb.com/covers/56/23/9780060595623.jpg', 'title_long': 'The Sweetest Taboo', 'edition': '1', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 0.6 Pounds, Width: 0.76 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 0.76}, 'weight': {'unit': 'pounds', 'value': 0.6}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 328, 'date_published': '2004-05-25', 'subjects': ['Literature & Fiction', 'Genre Fiction', "Women's Fiction", 'Contemporary', 'United States', 'Romance', 'Clean & Wholesome', 'Self Service', 'Custom Stores'], 'authors': ['Carole Matthews'], 'title': 'The Sweetest Taboo', 'isbn13': '9780060595623', 'msrp': 10.95, 'binding': 'Paperback', 'isbn': '0060595620', 'isbn10': '0060595620'}}