{'book': {'publisher': 'Avon', 'synopsis': "The past's blood stains the present<br/>The opportunity of a lifetime awaits archaeologist EmmaFielding in the Berkshire foothills of Western Massachusetts: the chance to study the eighteenth-century diary of Margaret Chandler, the accused witch and murderess whose home Emma excavated only months before. However, the three other Shrewsbury Foundation fellows she must share the premises with are a disturbingly odd bunch, and before too long one of them is dead.<br/>But Emma can find no solace in the bleak beauty of thesurrounding wilderness, for there are dark secrets encoded in Madam Chandler's writings, and shocking parallels between an ancient slaying and the strange, brutal demise of her colleague.When the killer strikes again, Emma realizes her own life isat stake. And suddenly there is no choice left: she is driven to investigate bloody crimes past and present -- before her own death becomes a footnote in a chilling, three-centuries-old story.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/46/20/9780060554620.jpg', 'title_long': 'A Fugitive Truth (Emma Fielding Mysteries, No. 4)', 'dimensions': 'Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.4 Pounds, Width: 0.88 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 0.88}, 'weight': {'unit': 'pounds', 'value': 0.4}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 352, 'date_published': '2004-04-27', 'subjects': ['Literature & Fiction', 'Genre Fiction', "Women's Fiction", 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Cozy', 'Amateur Sleuths', 'Thrillers & Suspense', 'Suspense', 'Self Service', 'Custom Stores'], 'authors': ['Dana Cameron'], 'title': 'A Fugitive Truth (Emma Fielding Mysteries, No. 4)', 'isbn13': '9780060554620', 'msrp': 6.99, 'binding': 'Mass Market Paperback', 'related': {'Kindle Edition': '0061744085', 'ePub': '0061744085'}, 'isbn': '0060554622', 'isbn10': '0060554622', 'other_isbns': [{'isbn': '9780061744082', 'binding': 'print'}]}}