{'book': {'publisher': 'Harper', 'synopsis': 'Herman Wouk has ranged in his novels from the mighty narrative of The Caine Mutiny and the warm, intimate humor of Marjorie Morningstar to the global panorama of The Winds of War and War and Remembrance. All these powers merge in this major new work of nonfiction, The Will to Live On, an illuminating account of the worldwide revolution that has been sweeping over Jewry, set against a swiftly reviewed background of history, tradition, and sacred literature.<br/>Forty years ago, in his modern classic This Is My God, Herman Wouk stated the case for his religious beliefs and conduct. His aim in that work and in The Will to Live On has been to break through the crust of prejudice, to reawaken clearheaded thought about the magnificent Jewish patrimony, and to convey a message of hope for Jewish survival.<br/>Although the Torah and the Talmud are timeless, the twentieth century has brought earthquake shocks to the Jews: the apocalyptic experience of the Holocaust, the reborn Jewish state, the precarious American diaspora, and deepening religious schisms. After a lifetime of study, Herman Wouk examines the changes affecting the Jewish world, especially the troubled wonder of Israel, and the remarkable, though dwindling, American Jewry. The book is peppered with wonderful stories of the author\'s encounters with such luminaries as Ben Gurion, Isidor Rabi, Yitzhak Rabin, Saul Bellow, and Richard Feynan.<br/>Learned in general culture, warmly tolerant of other beliefs, this noted author expresses his own other beliefs, this noted author expresses his own faith with a passion that gives the book its fire and does so in the clear, engaging style that--as in all Wouk\'s fiction--makes the reader want to know what the next page will bring.<br/>Herman Wouk writes, in The Will to Live On:<br/>"And so the Melting Pot is beginning to work on Jewry. Its effect was deferred in the passing century by the shock of the Holocaust and the rise of Israel, but today the Holocaust is an academic subject, and Israel is no longer a beleaguered underdog. Amkha in America is not dying, it is slowly melting, and those are very different fates. Dying is a terror, an agony, a strangling finish, to be fought off by sheer instinct, by the will to live on, to the last breath. Melting is a mere diffusion into an ambient welcoming warmth in which one is dissolved and disappears, as a teaspoon of sugar vanishes into hot tea....<br/>Yet here in the United States, for all the scary attrition I have pictured, we are still a community of over five million strong. . . . At a far stretch of my hopes, our descendants could one day be a diaspora comparable to Babylonia. At the moment, of course, that is beyond rational expectation. We have to concentrate on lasting at all. . . ."', 'language': 'en', 'image': 'https://images.isbndb.com/covers/60/80/9780060196080.jpg', 'title_long': 'The Will To Live On: This is Our Heritage', 'dimensions': 'Height: 9.5 Inches, Length: 5.5 Inches, Weight: 1.4 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.4}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 320, 'date_published': '2000-02-16', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Leaders & Notable People', 'Religious', 'History', 'Religion & Spirituality', 'Judaism'], 'authors': ['Herman Wouk'], 'title': 'The Will To Live On: This is Our Heritage', 'isbn13': '9780060196080', 'msrp': 25, 'binding': 'Hardcover', 'isbn': '0060196084', 'isbn10': '0060196084'}}