{'book': {'publisher': 'HarperCollins', 'synopsis': "Publishers Weekly Best Book * ALA Best Book for Young Adults * ALA Notable Children's Book * ALA Booklist Editors' Choice<br/>Moving, honest, and deeply personal, Red Scarf Girl is the incredible true story of one girl’s courage and determination during one of the most terrifying eras of the twentieth century.<br/>It's 1966, and twelve-year-old Ji-li Jiang has everything a girl could want: brains, popularity, and a bright future in Communist China. But it's also the year that China's leader, Mao Ze-dong, launches the Cultural Revolution—and Ji-li's world begins to fall apart. Over the next few years, people who were once her friends and neighbors turn on her and her family, forcing them to live in constant terror of arrest. And when Ji-li's father is finally imprisoned, she faces the most difficult dilemma of her life.<br/>Written in an accessible and engaging style, this page-turning autobiography will appeal to readers of all ages, and it includes a detailed glossary and a pronunciation guide.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/58/53/9780060275853.jpg', 'title_long': 'Red Scarf Girl: A Memoir of the Cultural Revolution', 'edition': 'First Edition', 'dimensions': 'Height: 7.5 Inches, Length: 5 Inches, Weight: 0.7 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 0.7}, 'height': {'unit': 'inches', 'value': 7.5}}, 'pages': 304, 'date_published': '1997-09-06', 'subjects': ['Biographies & Memoirs', 'Community & Culture', 'Asian American & Asian', 'Teen & Young Adult', 'Biographies', 'Historical', 'Political', 'Social Issues', 'Family', 'Historical Fiction', 'Education & Reference', 'History'], 'authors': ['Ji-li Jiang'], 'title': 'Red Scarf Girl: A Memoir of the Cultural Revolution', 'isbn13': '9780060275853', 'msrp': 17.99, 'binding': 'Hardcover', 'isbn': '0060275855', 'isbn10': '0060275855'}}