{"book": {"publisher": "Harper Perennial", "synopsis": "In 1793, a canal digger named William Smith made a startling discovery. He found that by tracing the placement of fossils, which he uncovered in his excavations, one could follow layers of rocks as they dipped and rose and fell -- clear across England and, indeed, clear across the world -- making it possible, for the first time ever, to draw a chart of the hidden underside of the earth. Determined to expose what he realized was the landscape"s secret fourth dimension, Smith spent twenty-two years piecing together the fragments of this unseen universe to create an epochal and remarkably beautiful hand-painted map. But instead of receiving accolades and honors, he ended up in debtors" prison, the victim of plagiarism, and virtually homeless for ten years more. Finally, in 1831, this quiet genius -- now known as the father of modern geology -- received the Geological Society of London"s highest award and King William IV offered him a lifetime pension.<br/>The Map That Changed the World is a very human tale of endurance and achievement, of one man's dedication in the face of ruin. With a keen eye and thoughtful detail, Simon Winchester unfolds the poignant sacrifice behind this world-changing discovery.', 'language": "en", "image": "https: //images.isbndb.com/covers/18/03/9780060931803.jpg", "title_long": "The Map That Changed the World", "edition": "First Edition", "dimensions": "Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.7 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 0.7}, "height": {"unit": "inches", "value": 8.25}}, "pages": 329, "date_published": "2002-07-30", "subjects": ["Biographies & Memoirs', 'Historical', 'Europe', 'Professionals & Academics', 'Scientists', 'History', 'Great Britain', 'World', 'Science & Math', 'Earth Sciences', 'Geology', 'Politics & Social Sciences', 'Philosophy'], 'authors": ["Simon Winchester'], 'title": "The Map That Changed the World", "isbn13": "9780060931803", "msrp": 13.95, 'binding": "Paperback", "isbn": "0060931809", "isbn10": "0060931809"}}