{"book": {"publisher": "Harper Business", "synopsis": "The definitive collection of thoughts, assaults, and hilarious observations from America’s premier business humorist and bestselling author of Throwing the Elephant and What Would Machiavelli Do?<br/>The Big Bing will be a mandatory addition to the library of everyone who works for a living, or would like to. For nearly 20 years, Stanley Bing’s funny, wise, pleasantly mean-spirited, and at times even useful columns have delighted readers in the pages of Esquire, Fortune and a variety of other national publications.<br/>Bing has lived the last two decades inside the belly of the corporate beast, clawing his way to the top of one of the great multinational companies in the cosmos. And he has seen it all: the high body count after many a gruesome deal, the machine that grinds up the bones of those who stood in its way, the birth and death of executive dinosaurs (and he’s had quite a few lunches with some of them, too). The result is storytelling at its best—sophisticated, amusing, and driven by the kind of insight that only a true insider can possess.<br/>The Big Bing provides a mole’s-eye-view of the society in which we all live and work, creating one of the most entertaining, thought-provoking, and just plain funny bodies of work in contemporary letters.", "language": "en", "image": "https: //images.isbndb.com/covers/95/74/9780060529574.jpg", "title_long": "The Big Bing: Black Holes of Time Management, Gaseous Executive Bodies, Exploding Careers, and Other Theories on the Origins of the Business Universe", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 0.59083886216 Pounds, Width: 0.84 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 0.84}, "weight": {"unit": "pounds", "value": 0.59083886216}, "height": {"unit": "inches", "value": 8}}, "pages": 368, "date_published": "2006-01-03", "subjects": ["Business & Money', 'Business Culture', 'Workplace Culture', 'Management & Leadership', 'Management', 'Processes & Infrastructure', 'Humor & Entertainment', 'Humor', 'Essays', 'Business & Professional'], 'authors": ["Stanley Bing'], 'title": "The Big Bing: Black Holes of Time Management, Gaseous Executive Bodies, Exploding Careers, and Other Theories on the Origins of the Business Universe", "isbn13": "9780060529574", "msrp": 14.99, "binding": "Paperback", "related": {"eBook": "0061739073", "ePub": "0061739073"}, "isbn": "0060529571", "isbn10": "0060529571", "other_isbns": [{'isbn": "9780061739071", "binding": "print"}]}}