{'book': {'publisher': 'HarperEntertainment', 'synopsis': 'The life of Janice Dickinson is a story of extremes: uncontrolled energy, mad self-confidence and crushing insecurity, a boundless appetite for life and a ceaseless drive to self-destruct. During the 1970s she was the first lush-lipped, long-stemmed, dark-eyed brunette to break through and become not just a model but a supermodel -- a term she coined for herself.<br/>She graced major magazine covers from Vogue to Elle to Cosmopolitan, in photographs by Avedon and Irving Penn and fashions by Versace and Calvin Klein. She was voracious in everything: affairs both passionate and casual, endless partying, and a drug habit that dogged her through twenty years and three husbands. She spent her glory days with Gia Carangi and Christie Brinkley and her nights with Warren Beatty, Jack Nicholson, and Sylvester Stallone. And wherever she went, Janice captured the imagination of everyone who encountered her.<br/>Yet the tale Janice Dickinson has lived to tell is no mere diva cartoon. For the haunting undercurrent in her life is a violent dance of cruelty and abuse with her own father -- a story she tells here for the first time. And as she careens from runway to rehab to rock bottom to recovery, readers will be captivated by her tale of survival . . . and by its cautionary power for anyone who still believes that fashion -- or life -- is an easy business.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/94/65/9780060009465.jpg', 'title_long': "No Lifeguard on Duty: The Accidental Life of the World's First Supermodel", 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.4109584768 Pounds, Width: 0.9457 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.9457}, 'weight': {'unit': 'pounds', 'value': 1.4109584768}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 320, 'date_published': '2002-09-01', 'subjects': ['Arts & Photography', 'Fashion', 'Biographies & Memoirs', 'Leaders & Notable People', 'Rich & Famous', 'Memoirs'], 'authors': ['Janice Dickinson'], 'title': "No Lifeguard on Duty: The Accidental Life of the World's First Supermodel", 'isbn13': '9780060009465', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060009462', 'isbn10': '0060009462'}}