{'book': {'publisher': 'Harper', 'synopsis': "Today's definition of family is completely unrecognizable from what it was forty, thirty, even twenty years ago. Into the chaos that has become typical of the modern American family, judge Judy Sheindlin attempts to bring some order. With Keep It Simple, Stupid, Judge Judy addresses how convoluted family life has become. The traditional nuclear family has expanded to include exes and parents of exes, merging families, stepchildren, lovers, adopted children, in-laws the list goes on and on.<br/>Complex issues naturally arise from the enlarged families into which we're born. There is the ex-wife who wants more child support from husband number one so she can stay home with new baby by husband number two. There are the parents who gave their daughter thirty thousand dollars as a wedding gift only to watch the marriage quickly crumble and their former son-in-law claim half the money. How about the adult son who runs out on his kids, leaving his parents to pay his child support? When it comes to families, Judge Judy has seen it all in her courtroom, and she knows stupidity when she sees it.<br/>Tackling all the explosive issues that drive families crazy -- and into court -- Judge Judy shares her on-target, brutally honest thoughts on the chaos that is characteristic of today's American family and gives no-holds-barred advice on how to resolve conflicts and repair relationships.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/54/65/9780060195465.jpg', 'title_long': "Keep It Simple, Stupid: You're Smarter Than You Look", 'edition': 'First Edition', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.7936641432 Pounds, Width: 0.78 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.78}, 'weight': {'unit': 'pounds', 'value': 0.7936641432}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 192, 'date_published': '2000-07-03', 'subjects': ['Self-Help', 'Relationships', 'Conflict Management', 'Interpersonal Relations', 'Marriage', 'Health, Fitness & Dieting', 'Parenting & Relationships', 'Family Relationships', 'Conflict Resolution', 'Parenting'], 'authors': ['Judy Sheindlin'], 'title': "Keep It Simple, Stupid: You're Smarter Than You Look", 'isbn13': '9780060195465', 'msrp': 23, 'binding': 'Hardcover', 'isbn': '0060195460', 'isbn10': '0060195460'}}