{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': 'Everyone knows your wedding day is the most important day of your life. But did you know it could also be the wackiest? Part family reunion, part ceremony, part dinner party, part get-down-and boogie dance party, weddings have a tendency to spin out of control-especially when You start considering all the important questions: Do I invite all of my relatives or just the ones I know? What does a wed" ding budget look like-and how do I stay on one? Where do I find a Dj who won\'t play the macarena? Why is my groom acting like such a grouch?<br/>So who can you turn to for answers? Your best friend-that wise, resourceful, and wonderfully witty friend who will help you pull together the wedding of your dreams and make sure you have fun along the way.<br/>In The Best Friend\'s Guide to Planning a Wedding, Lara Webb Carrigan, like that indispensable girl Friend, helps you navigate the complicated process of organizing a wedding with smarts, grace, and, above all, good humor. After having survived he hundreds of brides-to-be and newlyweds, collecting the kind of useful suggestions that no one thinks to share -- until after the wedding. Filled with voices of real women, plus insider tips from wedding consultants, caterers, and other pros, this essential resource offers practical, step-by-step strategies, checklists, and real-life advice from brides who have been there before. It also debunks wedding myths from "All bridesmaids have to wear the same dress" to "Seating charts are optional" and "The more makeup you wear, the better you\'ll look."<br/>Like your best girlfriend, The Best Friend\'s Guide to Planning a Wedding helps you keep track of all the details (and your wits) while reminding you that what matters most isn\'t a perfect wedding but a wonderful marriage.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/30/21/9780060393021.jpg', 'title_long': 'best-friends-guide-to-planning-a-wedding', 'edition': 'Reprint', 'dimensions': 'Height: 8 Inches, Length: 6 Inches, Weight: 0.78 Pounds, Width: 0.576577 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.576577}, 'weight': {'unit': 'pounds', 'value': 0.78}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 256, 'date_published': '2002', 'subjects': ['Crafts, Hobbies & Home', 'Weddings', 'Gown', 'Reference'], 'authors': ['lara-webb-carrigan'], 'title': 'best-friends-guide-to-planning-a-wedding', 'isbn13': '9780060393021', 'msrp': 13.95, 'binding': 'Paperback', 'isbn': '0060393025', 'isbn10': '0060393025'}}