{'book': {'publisher': 'William Morrow', 'synopsis': "As the dust settles over Baghdad, a leading expert on Iraq tells the story of the obstacles that stood between the US and the fall of Saddam – and reveals that many of them came from within the US Government itself.<br/>Combining groundbreaking new research with an insider's understanding of the workings of Washington, Mylroie describes how forces within the CIA and the State Department have conspired to ly discredit crucial intelligence about Saddam Hussein's regime, from his links to al Qaeda to his development of chemical, biological, and nuclear weaponry. She charges the bureaucrats within these agencies with cynical, self–serving behaviour, designed to help them save face even at the expense of our national security. She describes how major elements of the case against Iraq––from new information about the al–Qaeda terrorists' possible links to Iraq, to potential Iraq involvement in the fall 2001 anthrax attacks––were suppressed or prematurely dismissed by these agencies.<br/>She reveals how the very idea of state–sponsored terrorism had been pronounced dead after the 1993 World Trade Center bombing––thereby giving states like Iraq the perfect cover to carry out well–orchestrated terrorist acts without ever being detected.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/01/24/9780060580124.jpg', 'title_long': 'Bush vs. the Beltway: How the CIA and the State Department Tried to Stop the War on Terror', 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.15 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.15}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 272, 'date_published': '2003-07-29', 'subjects': ['History', 'Americas', 'United States', 'Politics & Social Sciences', 'Politics & Government', 'Specific Topics'], 'authors': ['Laurie Mylroie'], 'title': 'Bush vs. the Beltway: How the CIA and the State Department Tried to Stop the War on Terror', 'isbn13': '9780060580124', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0060580127', 'isbn10': '0060580127', 'other_isbns': [{'isbn': '9780062026262', 'binding': 'printisbncanonical'}]}}