{'book': {'publisher': 'HarperEntertainment', 'synopsis': 'The Rock says. . . "Know your damn role--and shut your mouth!" But that simple catch-phrase, embraced by the millions ñand the millions--of The Rock\'s fans, can\'t begin to capture the spirit and larger-than-life personality of the most electrifying man in sports-entertainment."<br/>In this action-packed, revealing and outrageously funny memoir, World Wrestling Federation Superstar The Rock recounts his life in and out of the ring with unapologetic honesty and inimitable style. From his boyhood days traveling around the world with his father (professional wrestler Rocky Johnson) to his years as a football player at the University of Miami to his meteoric rise through the ranks of the Federation, The Rock Says. . .chronicles in vivid detail the life story of one of sports-entertainment\'s most innovative and best-loved personalities.<br/>The Rock recalls his injury-plagued career at Miami and a subsequent foray to the Great White North, where he discovered that in Canada being a professional football player is not exactly a glamorous life. After a few months of sleeping on putrid, stained mattresses that he dug out of the garbage and subsisting on nothing but plain spaghetti, "D.J." ditched his cleats forever and set his sights on the path of his father and grandfather--wrestling.<br/>Performing first in the minors as plain old Dwayne Johnson, then as "Flex Kavana" and later as "Rocky Maivia," he quickly became one of the World Wrestling Federation\'s hopefuls. But no matter how he tried to get over with the fans, the stadiums greeted him with chants of "Rocky sucks! Rocky sucks!" He then adopted the brash persona of The Rock--a snorting, spitting, snotting, swearing son-of-a-bitch with the soul of a smart-ass comic and the body of an Adonis--and he found his true calling as the "People\'s Champion."<br/>The Rock will take fans on a guided tour of big-time professional wrestling, a highly competitive business in which a handful of gifted and lucky performers dominate, and all others dream of a moment in the spotlight. He provides a breathtaking, minute-by-minute account of Wrestle Mania, the Super Bowl of pro wrestling, including an intimate backstage look at rehearsals with his opponent, Stone Cold Steve Austin. And he discusses in heartfelt detail the loss of his friend and co-worker, Owen Hart.<br/>Filled with genuinely touching stories of love and strife, hilarious anecdotes, inside accounts of an industry whose machinations have long been shrouded in secrecy and dozens of previously unpublished photographs from The Rock\'s personal collection, The Rock Says. . .is--as The Rock himself might put it--"the coolest thing since the other side of the pillow if you smell what The Rock is cookin\'."', 'language': 'en', 'image': 'https://images.isbndb.com/covers/29/87/9780060392987.jpg', 'title_long': 'The Rock Says...', 'edition': 'First Edition', 'dimensions': 'Height: 9.12 Inches, Length: 6.12 Inches, Weight: 1 Pounds, Width: 1.09 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.12}, 'width': {'unit': 'inches', 'value': 1.09}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 9.12}}, 'pages': 304, 'date_published': '2000-01-05', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Actors & Entertainers', 'Sports & Outdoors', 'Biographies', 'Boxing, Wrestling & MMA', 'Individual Sports', 'Wrestling'], 'authors': ['The Rock', 'Joe Layden'], 'title': 'The Rock Says...', 'isbn13': '9780060392987', 'msrp': 26, 'binding': 'Hardcover', 'isbn': '0060392983', 'isbn10': '0060392983'}}