{"book": {"publisher": "Harper", "synopsis": "From the acclaimed author of River Town comes a rare portrait, both intimate and epic, of twenty-first-century China as it opens its doors to the outside world.<br/>A century ago, outsiders saw Chinaas a place where nothing ever changes. Today the coun-try has become one of the most dynamic regions on earth. That sense of time—the contrast between past and present, and the rhythms that emerge in a vast, ever-evolving country—is brilliantly illuminated by Peter Hessler in Oracle Bones, a book that explores the human side of China"s transformation.<br/>Hessler tells the story of modern-day China and its growing links to the Western world as seen through the lives of a handful of ordinary people. In addition to the author, an American writer living in Beijing, the narrative follows Polat, a member of a forgotten ethnic minority, who moves to the United States in searchof freedom; William Jefferson Foster, who grew up in an illiterate family and becomes a teacher; Emily,a migrant factory worker in a city without a past; and Chen Mengjia, a scholar of oracle-bone inscriptions, the earliest known writing in East Asia, and a man whosetragic story has been lost since the Cultural Revolution. All are migrants, emigrants, or wanderers who find themselves far from home, their lives dramatically changed by historical forces they are struggling to understand.<br/>Peter Hessler excavates the past and puts a remarkable human face on the history he uncovers. In a narrative that gracefully moves between the ancient and the present, the East and the West, Hessler captures the soul of a country that is undergoing a momentous change before our eyes.", "language": "en", "image": "https: //images.isbndb.com/covers/65/81/9780060826581.jpg", "title_long": "Oracle Bones: A Journey Between China"s Past and Present", 'edition": "First Edition", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 0.89 Pounds, Width: 1.2 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1.2}, "weight": {"unit": "pounds", "value": 0.89}, "height": {"unit": "inches", "value": 9}}, "pages": 512, "date_published": "2006-04-25", "subjects": ["History', 'Asia', 'China', 'Reference', 'Writing, Research & Publishing Guides', 'Writing', 'Politics & Social Sciences', 'Politics & Government', 'International & World Politics'], 'authors": ["Peter Hessler'], 'title": "Oracle Bones: A Journey Between China"s Past and Present", 'isbn13": "9780060826581", "msrp": 26.95, "binding": "Hardcover", "isbn": "0060826584", "isbn10": "0060826584", "other_isbns": [{'isbn": "9780061834127", "binding": "printisbncanonical"}]}}