{'book': {'publisher': 'William Morrow', 'synopsis': "Breathtaking and mesmerizing, Colditz: The Untold Story of World War II's Great Escapes is a gripping tale of perseverance, heroism, and adventure. Filled with the thrilling never-before-told personal stories of the prisoners of war held within it's walls -- who made it their personal duty and obsession to escape -- Colditz offers endlessly intriguing stories of consummate survivors who proved the human spirit to be indomitable.<br/>During World War II Colditz, a medieval fortress, served as the only high-security camp in Germany. Its massive walls contained every persistent escapee, troublemaker, and valuable hostage captured by the Germans. Guards and prisoners were almost equal in number, and Colditz -- which boasted such prison-break deterrents as walls up to twelve feet thick, battlements of solid rock, and a 150-foot drop from the castle to the valley below -- was considered escape proof. But the prisoners -- many of whom were high-ranking military officers -- were determined to accomplish the impossible and pooled their collective talents to create the greatest escape academy of the war. Three hundred officers attempted to escape and thirty achieved what they considered to be the home run, journeying all the way back to their native country.<br/>In Colditz, Henry Chancellor breaks new ground by offering the prisoners' own stories of the great escapes. Using more than fifty original interviews, the English, French, Dutch, and Polish officers and their guards describe in their own words their experiences in the notorious castle. They reveal their boredom and frustrations, as well as the challenges inherent in making maps out of jelly or constructing tunnels with mere cutlery knives. The stories are by turns comic and tragic as much of their labor and invention ended in failure, but what emerges is a story of breathtaking ingenuity and daring, and an intriguing portrait of the fascinating game of wits between captives and captors, who were bound together by mutual respect and extraordinary tolerance.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/25/26/9780060012526.jpg', 'title_long': "Colditz: The Untold Story of World War II's Great Escapes", 'dimensions': 'Height: 9.25 Inches, Length: 6.125 Inches, Weight: 1.83 Pounds, Width: 1.41 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.125}, 'width': {'unit': 'inches', 'value': 1.41}, 'weight': {'unit': 'pounds', 'value': 1.83}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 464, 'date_published': '2002-01-22', 'subjects': ['Biographies & Memoirs', 'Historical', 'United States', 'Europe', 'Leaders & Notable People', 'Military', 'History', 'Americas', 'Germany', 'World War II'], 'authors': ['Henry Chancellor'], 'title': "Colditz: The Untold Story of World War II's Great Escapes", 'isbn13': '9780060012526', 'msrp': 1.99, 'binding': 'Hardcover', 'isbn': '0060012528', 'isbn10': '0060012528'}}