{'book': {'publisher': 'William Morrow', 'synopsis': "New York Times bestselling author Laura Lippman’s Tess Monaghan finds herself facing the most complicated case of her career…<br/>When Tess Monaghan begins her new gig as a consultant to the local newspaper, she’s handed the case of an unsolved homicide of a young federal prosecutor. But she never dreams the key to the sensational homicide will fall into her lap when her boyfriend, Crow, brings home a street kid—a juvenile con artist who unwittingly holds a crucial clue in the prosecutor’s murder.<br/>Tess agrees to protect the boy’s identity no matter what, especially when one of his friends is killed in what appears to be a case of mistaken identity. But as she soon discovers, her ethical decision to protect him has dire consequences. And with federal agents determined to learn the boy’s name at any cost, Tess finds out just how far even official authorities will go to get what they want.<br/>It isn’t long before Tess finds herself facing felony charges. To make matters worse, Crow has gone into hiding with his young protégé. So Tess can’t deliver the kid to investigators even if she wants to. Now her only recourse is to get to the heart of the sordid and deadly affair while they're all still free...and still breathing.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/07/29/9780060570729.jpg', 'title_long': 'No Good Deeds: A Tess Monaghan Novel', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.4 Pounds, Width: 1.13 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.13}, 'weight': {'unit': 'pounds', 'value': 1.4}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 352, 'date_published': '2006-06-27', 'subjects': ['Literature & Fiction', 'United States', 'Contemporary', 'Mystery, Thriller & Suspense', 'Mystery', 'Hard-Boiled', 'Women Sleuths', 'Thrillers & Suspense', 'Suspense'], 'authors': ['Laura Lippman'], 'title': 'No Good Deeds: A Tess Monaghan Novel', 'isbn13': '9780060570729', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060570725', 'isbn10': '0060570725'}}