{"book": {"publisher": "It Books", "synopsis": "<p> Claudia Corvette. From her tousled bedroom hair to her name–all the porn stars in this world take their names from supermodels and sports cars–she is adult entertainment"s prototypical femme fatale. Her life is the collision of countless troubled–childhood cliches and grown–up wet dreams, projected onto her as surely as her videos project their blue light onto lonely men around the world.</p><br/><p> From its first panel, How to Make Money Like a Porn Star draws the reader into the dark world of girls like Claudia, the men who fantasize about them, and the monsters who control them. In the hands of Rolling Stone writer Neil Strauss and illustrator Bernard Chang, this adult graphic novel weaves together black humor and blacker reality. Like all great American stories, it features humble beginnings, life–changing tragedy, stripping, abuse, implants, fame, addiction, bigger implants, abduction, gunplay, downfall, and even bigger implants. Not to mention a thousand shades of latex and L"Oreal.</p><br/><p> Part parody, part morality tale, here is the truth about the porn life, its outsized visual splendor captured in a comic parade of doe–eyed centerfolds, its essence distilled in a story that will haunt every reader who has ever wondered where his next fantasy is coming from.</p>", 'language": "en", "image": "https: //images.isbndb.com/covers/40/55/9780060884055.jpg", "title_long": "How to Make Money Like a Porn Star", "edition": "Not Appropriate For Children", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 0.440924524 Pounds, Width: 0.35 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 0.35}, "weight": {"unit": "pounds", "value": 0.440924524}, "height": {"unit": "inches", "value": 9}}, "pages": 128, "date_published": "2006", "subjects": ["Comics & Graphic Novels', 'Comic Strips', 'Graphic Novels', 'Erotica', 'Humor & Entertainment', 'Humor', 'Pop Culture', 'Art', 'Literature & Fiction', 'Science Fiction & Fantasy'], 'authors": ["Neil Strauss', 'Bernard Chang'], 'title": "How to Make Money Like a Porn Star", "isbn13": "9780060884055", "msrp": 19.95, 'binding": "Paperback", "isbn": "0060884053", "isbn10": "0060884053"}}