{'book': {'publisher': 'William Morrow', 'synopsis': "Now, in her own words, the most dynamic vocal talent of our time-the international singing sensation whose recordings have sold millions, and whose performances electrify the world's great arenas-gives us her poignant, intimate, and inspiring life story . . . from the heart.<br/><br/>She was born into a working-class Canadian family, the youngest of fourteen children. She gave her first performance standing on a kitchen table and dreamed of becoming a superstar. Few in her field can rival the phenomenal God-given abilities of Celine Dion. Fewer still have experienced the love, sorrow, accomplishment, and ecstasy that have shaped her remarkable life and carried her to the pinnacle of the entertainment world.<br/><br/>In Celine Dion: My Story, My Dream Celine takes us backstage, on the road, into the recording studio, and behind the scenes to reveal the hard work that creates the magic. But her book, much more than a chronicle of early breakthroughs and professional high-water marks, of unforgettable encounters with the luminaries and legends of show business is, first and foremost, a story of love.<br/>This talented and beautiful woman who has moved us with her singing now moves us with her words as she tells of growing up in a large, close-knit household fortified in its daily struggles by powerful bonds of heartfelt affection and the family tragedies their shared love enabled them to overcome. Here, also, Celine recounts warmly and intimately the storybook romance that remains her most enduring passion and greatest joy: Celine's marriage to Rene Angelil her manager and soul mate. She tells of the devastating pain they both experienced when a doctor informed them that Rene had cancer, and how fighting the disease together helped strengthen their relationship. And she shares her joy, anxiety, and breathless anticipation of the impending fulfillment of their most cherished dream: parenthood.<br/><br/>A true story of courage, perseverance, dedication, and devotion--told with the wide-eyed honesty of someone who, though she has basked in the glowing adoration of millions of fans, has never lost touch with her working-class roots--Celine Dion: My Story, My Dream is for anyone who has ever wondered about the real person behind the magnificent voice. Touching and funny, fascinating and uplifting, it is an exquisitely detailed portrait of a remarkable woman who has never backed away from a challenge . . . even the most daunting challenges of the heart.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/79/71/9780060197971.jpg', 'title_long': 'Celine Dion : My Story, My Dream', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.12 Inches, Weight: 1.1 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.12}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 1.1}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 293, 'date_published': '2000-10-31', 'subjects': ['Arts & Photography', 'Music', 'Musical Genres', 'Biographies & Memoirs', 'Arts & Literature', 'Actors & Entertainers', 'Composers & Musicians', 'Community & Culture', 'Women', 'Leaders & Notable People', 'Rich & Famous', 'Humor & Entertainment'], 'authors': ['Celine Dion'], 'title': 'Celine Dion : My Story, My Dream', 'isbn13': '9780060197971', 'msrp': 25, 'binding': 'Hardcover', 'isbn': '0060197978', 'isbn10': '0060197978'}}