{'book': {'publisher': 'William Morrow', 'synopsis': 'What would happen if an ordinary teenager was suddenly proclaimed a modern-dayHoly Virgin? That is the premise of Janis Hallowell\'s wise and provocative debut novel, The Annunciation of Francesca Dunn.<br/>A failed prodigy and child of divorce, Francesca Dunn is also an adolescent like any other, trying to find her identity and figure out her place in the world. One night Chester, a visionary homeless man (or an insane one, depending on your point of view) "sees" Francesca hovering over the river, bathed in celestial light. Days later, as Francesca serves meals to the needy in a local café, Chester falls to his knees before her in adoration. Word spreads, hordes of followers converge, and the result is a catastrophic storm of fervent belief and doubt, the relentless and perpetual desire for salvation, possible miracles, and an adolescent trapped by events far beyond her control.<br/>The Annunciation of Francesca Dunn is a beautifully crafted tale about people who pin their hopes for spiritual salvation on a young girl; and how, slowly, surely, and tragically, she comes to believe that she is the divine being they want her to be. At stake for each is nothing less than the fundamental belief in the structure of the world, and the balance between the miraculous and the mundane.<br/>Narrating by turns are four disparate characters who tell the story as they see it: Chester, who smells fear, disease, and holiness and appoints himself Francesca\'s protector and follower; Anne Dunn, Francesca\'s paleobotanist mother who places her faith in Darwin and natural selection; Sid, the schoolmate, who wants to use Francesca\'s new circumstances for her own profit; and Francesca herself, who becomes increasingly deluded by the adoration bestowed upon her.<br/>At once powerful, tender, and humorous, The Annunciation of Francesca Dunn is an astonishing and resonant work from an exciting new talent. With each of its gentle revelations, the novel brings an unforgettable cast of characters to vibrant life as it brilliantly explores the seductive and destructive power of belief.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/91/99/9780060559199.jpg', 'title_long': 'The Annunciation of Francesca Dunn: A Novel', 'edition': 'First Edition', 'dimensions': 'Height: 8.75 Inches, Length: 5.75 Inches, Weight: 1.05 Pounds, Width: 1.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 1.75}, 'weight': {'unit': 'pounds', 'value': 1.05}, 'height': {'unit': 'inches', 'value': 8.75}}, 'pages': 320, 'date_published': '2004-03-02', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Psychological', 'United States'], 'authors': ['Janis Hallowell'], 'title': 'The Annunciation of Francesca Dunn: A Novel', 'isbn13': '9780060559199', 'msrp': 23.95, 'binding': 'Hardcover', 'isbn': '0060559195', 'isbn10': '0060559195'}}