{'book': {'publisher': 'William Morrow', 'synopsis': "A trio of great single women is being driven to distraction; they have one thing in common -- Randall Hollis, a successful art dealer at the top of his game. Randall is rich, handsome, and charming -- the true-to-life dream lover of these smart, independent women who all find themselves passionately involved with him during the same seven-month period.<br/>There's Medora Jackson, an artist who has loved Randall since college and is now desperately trying to cut him loose. But turning Randall Hollis out of her life will end up being far more difficult than she thinks. There's Ana Reese-Mitchell, a wealthy widow and art collector who is haunted by the death of her best friend and the specter of her cruel late husband. She hopes Randall Hollis will be her second chance at love. And there's ambitious Taylor Benedict, a graduate student in art history who is coming to terms with her parents' divorce and problems from her childhood that she can't chase away. She's sure that Randall Hollis will be the first rung on her ladder to success.<br/>Randall Hollis is a man for all seasons, representing a different fantasy for each of the women who love him. As the novel unfolds, each woman will discover more about herself than she bargained for. And each, along with the errant Randall himself, will finally know the true meaning of love and the peace that comes with forgiveness.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/88/32/9780060188832.jpg', 'title_long': 'Always True to You in My Fashion: A Novel', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.9 Pounds, Width: 1.05 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.05}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 320, 'date_published': '2002-11-05', 'subjects': ['Literature & Fiction', 'Genre Fiction', "Women's Fiction", 'United States', 'Literary'], 'authors': ['Valerie W Wesley'], 'title': 'Always True to You in My Fashion: A Novel', 'isbn13': '9780060188832', 'msrp': 23.95, 'binding': 'Hardcover', 'isbn': '0060188839', 'isbn10': '0060188839'}}