{"book": {"publisher": "Avon", "synopsis": "When New York Times bestselling author Victoria Alexander created the Effingtons, she introduced an irresistible clan. Now, meet her most unforgettable hero yet . . .<br/>Dashing Jonathon Effington, the Marquess of Helmsley, has had more than one lady willingly fall into his arms. But he"s so delicious none has ever complained at their inevitable parting. And while Jonathon"s no stranger to passion of the flesh, his heart has remained untouched. Until now . . .<br/>At each Christmas Ball, Jonathon selects a delectable lady to share the pleasures of the evening—after all, it"s a holiday tradition! But he is shocked to discover that his choice is replaced by an enchanting stranger who surprises him with a proposal of marriage. Beautiful Fiona Fairchild is desperate—only a wedding will save her sisters and her inheritance. But Jonathon has no interest in marriage, and what starts as a shocking proposal turns into a scandalous proposition that might ruin them both . . .', 'language": "en", "image": "https: //images.isbndb.com/covers/32/09/9780060593209.jpg", "title_long": "Let It Be Love (Effington Family & Friends)", "edition": "Reissue", "dimensions": "Height: 6.75 Inches, Length: 4.1875 Inches, Weight: 0.39 Pounds, Width: 0.96 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.1875}, "width": {"unit": "inches", "value": 0.96}, "weight": {"unit": "pounds", "value": 0.39}, "height": {"unit": "inches", "value": 6.75}}, "pages": 384, "date_published": "2005-10-25", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Family Life', 'United States', 'Romance', 'Historical', 'Victorian', 'Regency'], 'authors": ["Victoria Alexander'], 'title": "Let It Be Love (Effington Family & Friends)", "isbn13": "9780060593209", "msrp": 4.74, "binding": "Mass Market Paperback", "related": {"Kindle Edition": "0061796700", "ePub": "0061796700"}, "isbn": "0060593202", "isbn10": "0060593202", "other_isbns": [{'isbn": "9780061796708", "binding": "print"}]}}