{'book': {'publisher': 'William Morrow', 'synopsis': 'Ever since 9/11, investigative reporter Peter Lance has been leading the fight to expose the intelligence gaps that led to 9/11. Now, in the follow-up to his bestselling 1000 Years for Revenge, he returns with devastating new evidence that the government has been covering up its own counterterror failures since the mid-1990s -- and continues today.<br/>In Cover Up, Lance shows how the government chose again and again to sacrifice America\'s national security for personal motives and political convenience. In its first half, he unveils shattering new evidence that terror mastermind Ramzi Yousef ordered the bombing of TWA 800 from his prison cell in order to effect a mistrial in his own terror bombing case. Astonishingly, the FBI was alerted to Yousef\'s plans in advance by a prison informant who even passed along his detailed sketch of a bomb-trigger device -- a document seen here for the first time. And Lance reveals the shocking reason the Justice Department suddenly ruled the crash anaccident despite overwhelming evidence of the bombing -- throwing away its best chance to penetrate the cell that was already planning 9/11.<br/>And the outrage doesn\'t stop there. In Part II, Lance offers an unofficial "minority report" on the 9/11 Commission, critiquing it as the incomplete, highly politicized "Warren Commission of our time." He explores potential conflicts of interest among its members, from the staff director who wrote a book with Condoleezza Rice, to the former Clinton deputy attorney general who participated in a critical meeting that upended the TWA probe. He exposes the report\'s false contention that the 9/11 plan was conceived in 1996, when the FBI had knowledge that the plot was in motion as early as 1994. And, in a heart-stopping, minute-by-minute chronicle of the attacks, he asks dozens of unanswered questions about the defense failures of that day -- from why fighter jets weren\'t scrambled for almost an hour after the hijackings, to why the president and several of his top military advisers remained virtually incommunicado for more than half an hour after it was clear that America was under attack.<br/>At a time when America feels no safer than ever, Cover Up will lend new eyes to readers who want the full story behind the 9/11 attacks -- and inspire us all to keep demanding the truth.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/35/56/9780060543556.jpg', 'title_long': 'Cover Up: What the Government Is Still Hiding About the War on Terror', 'edition': 'First Edition', 'dimensions': 'Height: 9.5 Inches, Length: 6.75 Inches, Weight: 1.4 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.75}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 1.4}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 368, 'date_published': '2004-09-07', 'subjects': ['History', 'Americas', 'United States', 'Politics & Social Sciences', 'Politics & Government', 'Specific Topics'], 'authors': ['Peter Lance'], 'title': 'Cover Up: What the Government Is Still Hiding About the War on Terror', 'isbn13': '9780060543556', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0060543558', 'isbn10': '0060543558'}}