{'book': {'publisher': 'William Morrow', 'synopsis': 'From renowned producer and writer Linda Bloodworth Thomason, creator of the beloved hit television series Designing Women, comes Liberating Paris, an audacious, poignant, and endearing debut novel about love, memories that won\'t fade, and holding on to your dreams. Set in small-town Paris, Arkansas, it is the story of six best friends who have just passed their fortieth birthdays and now must come to terms with the past in order to move forward with their lives.<br/>Woodrow McIlmore, the town\'s golden boy and local gynecologist, is married to his beautiful high school sweetheart, Milan, and seems by all appearances to be leading the perfect life with his two children and extended family and friends. But when Wood\'s daughter announces that she is smitten with a college classmate and intends to marry him, her parents are stunned. Their daughter\'s beloved is none other than the son of Wood\'s lost love, Duff -- romantic chemistry has repeated itself in the next generation!<br/>The impending wedding will lead the free-spirited Duff, now an IHOP waitress, to return to the town and the man she left behind, for the first time in twenty years. As Wood\'s and Duff\'s reckless behavior progresses, they are forced to question whether their rediscovered passion is worth shattering their children\'s future and Milan\'s faith in her husband, and abandoning the friendships and values that they have clung to since childhood. As one of the group says to Wood, "See, it\'s not just you having an affair. Now we\'re all having an affair."<br/>During this one tumultuous year, there is a revelation of sexual identity, an unexpected death, a birth, and a wedding, bringing about as many changes as the national discount superstore that is destroying the very heart of the town. The six friends will be forced to decide what in their lives is worth keeping and what needs to be thrown away, and how they can save for their children not only Main Street, but the things that were learned there.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/67/05/9780060596705.jpg', 'title_long': 'Liberating Paris: A Novel', 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 6.5 Inches, Weight: 1.38 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.38}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 352, 'date_published': '2004-09-07', 'subjects': ['Literature & Fiction', 'United States'], 'authors': ['Linda Bloodworth Thomason'], 'title': 'Liberating Paris: A Novel', 'isbn13': '9780060596705', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060596708', 'isbn10': '0060596708'}}