{'book': {'publisher': 'HarperEntertainment', 'synopsis': 'I\'ve learned never to let momentary fear stand in my way. There are no excuses. I\'ve learned that power is sexy. So is confidence in yourself.<br/>Patrika Darbo, the popular star of Days of Our Lives and the woman who TV Guide calls the "full-figured bitch goddess" of daytime television, has broken the size barrier and shattered the stereotype that heavy people are doomed to unhappy lives -- personally or professionally. Here Patrika shares her life story, writing with her heart on her sleeve about her hard-won victories as she offers advice -- not for losing weight, but for gaining confidence, a winning attitude, and a positive approach to life.<br/>Patrika doesn\'t ask anyone to change but simply to celebrate who they really are. Patrika herself wasn\'t always self-confident and savvy to the ways of Hollywood and the real world. Over the years, she\'s often been up and down on the scale; yet through all the diets and binges she\'s never lost sight of her dreams and has never let momentary fear stand in her way.<br/>She\'s the first to admit that issues of self-esteem go along with being big, but she\'s learned how to move beyond them and has never allowed conventional notions of beauty limit her or tell her what her life should be.<br/>No matter who you are or what size you\'re not, you can be beautiful, confident, and sexy. As Patrika takes you through her life story, she offers advice for living out loud and great pointers for making everyday exciting -- from the set of Days of Our Lives to the bedroom (or kitchen, or living room, or laundry room). Patrika encourages and inspires women of all sizes to remember the best of who they are.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/38/20/9780060013820.jpg', 'title_long': '365 Glorious Nights of Love and Romance', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.0361726314 Pounds, Width: 0.81 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.81}, 'weight': {'unit': 'pounds', 'value': 1.0361726314}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 224, 'date_published': '2002-04-30', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Actors & Entertainers', 'Humor & Entertainment'], 'authors': ['Patrika Darbo', 'Lorraine Zenka'], 'title': '365 Glorious Nights of Love and Romance', 'isbn13': '9780060013820', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060013826', 'isbn10': '0060013826'}}