{'book': {'publisher': 'HarperCollins', 'synopsis': 'Product Description      Hurt by the sexual escapades of her husband, celebrated author Jay Ellis, forty-five-year-old Anne Ellis has retreated to a secluded seaside home in northern California but her peace is shattered by the arrival of her husband\'s most recent cast-off lover      From Publishers Weekly      When 20-year-old "other woman" Ellen Cassidy arrives unannounced at the secluded California seaside home of 45-year-old Alice Ellis, the two clash, but gradually learn to understand each other in fundamental ways. "Although LeCompte is an accomplished writer," said PW , "her characters do not achieve the credibility of warmblooded human beings." Copyright 1990 Reed Business Information, Inc.      Review      nytimes.com/1989/06/25/books/polygamy-is-part-of-the-answer.html --New York TimesIn the tradition of Virginia Woolf, Katharine Anne Porter and, more recently, Alice Walker, Jane LeCompte presents an intimate tale of one woman\'s self-discovery... --Boston HeraldMoon Passage\xa0is a first novel of unusual lyric beauty and warmth. --Washington Post      From the Inside Flap      Anne Ellis is content to live mostly apart from her husband of twenty-three years, celebrated writer Jay Ellis. Wounded by his affairs, she has retreated to a secluded seaside home in northern California. But this peaceful existent is shattered by the arrival of her husband\'s most recent lover -- twenty-year-old Ellen Cassidy, spurned and confused, has come to see the woman Jay always returns to.\xa0\xa0 With the brutal, unrelenting honesty of youth, Ellen invades Anne\'s life, forcing her to tell her story. Entering this walled-up existence, Ellen attacks, retreats, then returns again to broach Anne\'s jealously guarded emotions, making her face the reality of a past filled with missed opportunities and a present holding contentment but not happiness.\xa0\xa0\xa0 Yet through her siege, Ellen discovers much about herself: a young heart that pines not so much over a lost lover as over the terrible feeling of being without love. In the end, the two form a friendship that is as strong and enduring as any in their lives. --inside flap copy', 'language': 'en', 'image': 'https://images.isbndb.com/covers/69/09/9780060916909.jpg', 'title_long': 'Moon Passage', 'edition': 'Reprint', 'dimensions': 'weight: 181 g', 'dimensions_structured': {'weight': {'unit': 'g', 'value': 181}}, 'pages': 187, 'date_published': '1990', 'subjects': ['Literature & Fiction'], 'authors': ['Jane Lecompte'], 'title': 'Moon Passage', 'isbn13': '9780060916909', 'msrp': 8.95, 'binding': 'Paperback', 'isbn': '0060916907', 'isbn10': '0060916907'}}