{'book': {'publisher': 'William Morrow', 'synopsis': 'In the twenty-first century, successful, hardworking women fill the workplace, earn advanced degrees, and marry for love -- pursuing their vision of "having it all." But for the millions of working women who outearn their husbands, their burgeoning economic power often creates a hidden, complicated, and unexpected backlash.<br/>Bringing Home the Bacon<br/>Breadwinning wives account for more than 35 percent of married working women, a number that\'s growing every day. Yet personal and societal attitudes and expectations have not kept pace with this dramatic evolution in the workplace. The clash between economic and everyday realities is wreaking havoc on marriages across the country, calling into question notions of power, equality, and even what it means to be a man or a woman. But very few people have talked openly about it -- much less offered solutions to inevitable conflicts -- until now.<br/>Provocative, empowering, and practical, Bringing Home the Bacon gives a blueprint to the pioneers who are reshaping expectations of marriage. Tackling conflicts that lie at the heart of marriages in which women bring home the bigger paycheck, experienced couples therapist Harriet Pappenheim and award-winning journalist Ginny Graves offer insights gleaned from interviews with more than one hundred women and men (conducted especially for this book) and present a prescriptive portrait of couples struggling to restore support, desire, happiness, and a sense of partnership into marriages under pressure. Addressing such hot-button issues as housework, sex, financial decision-making, parenting, and the new role of stay-at-home-dads, Bringing Home the Bacon offers invaluable advice to couples at the forefront of this silent revolution.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/75/41/9780060747541.jpg', 'title_long': 'Bringing Home the Bacon: Making Marriage Work When She Makes More Money', 'edition': 'Uncorrected Advance Proof', 'dimensions': 'Height: 9 Inches, Length: 6.25 Inches, Weight: 1 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 224, 'date_published': '2005-05-24', 'subjects': ['Self-Help', 'Relationships', 'Marriage', 'Business & Money', 'Human Resources', 'Politics & Social Sciences', "Women's Studies", 'Sociology', 'Marriage & Family'], 'authors': ['Harriet Pappenheim', 'Ginny Graves'], 'title': 'Bringing Home the Bacon: Making Marriage Work When She Makes More Money', 'isbn13': '9780060747541', 'msrp': 1.99, 'binding': 'Hardcover', 'isbn': '0060747544', 'isbn10': '0060747544'}}