{'book': {'publisher': 'Avon', 'synopsis': "Who will be the last man standing?<br/>New York Times bestselling author Victoria Alexander's delicious series about four men desperately trying to avoid matrimony continues...<br/>Lady Cordelia Bannister simply cannot marry a man she has not chosen herself, no matter what her father decrees. So, pretending to be her own companion, she decides to seek out information about her intended by meeting with his secretary—a man who soon beguiles her. But Lady Cordelia doesn't know the truth—the man can't resist is really her intended, Daniel Sinclair.<br/>Daniel has nearly won the wager he made with three of London's most eligible bachelors. While two of his compatriots have surrendered to the shackles of marriage, he's remained free to woo any woman he chooses. Yet duty forces him to consider Lady Cordelia, so, determined to find a way to escape honor intact, he continues the masquerade he started.<br/>Each finds the other completely irresistible, but when they uncover their mutual mistaken identities, Daniel and Cordelia must make the most important choice of all...", 'language': 'en', 'image': 'https://images.isbndb.com/covers/26/48/9780060882648.jpg', 'title_long': 'Secrets of a Proper Lady (Last Man Standing, 3)', 'edition': 'First Edition', 'dimensions': 'Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.45 Pounds, Width: 0.96 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 0.96}, 'weight': {'unit': 'pounds', 'value': 0.45}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 384, 'date_published': '2007-09-25', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'Feel-Good', 'United States', 'Romance', 'Victorian', '20th Century', 'Regency', 'Romantic Comedy'], 'authors': ['Victoria Alexander'], 'title': 'Secrets of a Proper Lady (Last Man Standing, 3)', 'isbn13': '9780060882648', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'related': {'Kindle Edition': '0061800279', 'ePub': '0061800279'}, 'isbn': '0060882646', 'isbn10': '0060882646', 'other_isbns': [{'isbn': '9780061800276', 'binding': 'print'}]}}