{'book': {'publisher': 'Harper Business', 'synopsis': 'I am going to turn you into a modern business warrior ... equipped in every way to fight and win I am going to turn you into a modern business warrior...equipped in every way to fight and win the vital battles that are a daily part of your business life. Your transformation from sheep to lion will require a change in your attitude, and that change involves your understanding that business really is combat, in the most visceral and urgent sense. To win, you must be absolutely prepared.<br/>-- James D. Murphy<br/>Your pulse quickens. Your mind focuses. The mission is clear, the maneuvers rehearsed, and there are no second chances. You are about to engage in supersonic jet combat at 45,000 feet ...<br/>. . or maybe you\'re about to enter a fierce sales battle with your toughest corporate competitor.<br/>These two scenarios are more closely related than they might appear. Business today moves faster than ever. The competition is ruthless, the pressure intense, the stakes dizzyingly high. Companies that lag behind or lose sight of their goals can self-destruct almost overnight.<br/>What can you do to survive? James Murphy, one of America\'s top fighter pilots, has the answers. In Business Is Combat he shares the wisdom of his Afterburner Seminars, training you in the military techniques that have made the United States Air Force one of the most formidable organizations in the world. His key concepts, applied to both businesses and the individuals who make them work, include:<br/>The Fighter Pilot Way<br/>Learn that confidence inspires confidence, that discipline keeps it from going to your head, and that camaraderie will keep your company sharp.<br/>Leaning Forward<br/>To win, you\'ll have to fight the next war--not the last one. Accept and prosper from the conviction that change is good.<br/>The Value of Intelligence<br/>Know both yourself and your enemy before planning any attack. A little research saves lives on the battlefield and dollars on the bottom line.<br/>Six Steps to Mission Planning<br/>Includes a preflight checklist, from identifying the threat to setting your timing to planning for contingencies.<br/>The Art of Execution<br/>How to make the kill without losing your cool.<br/>Task Saturation<br/>A primary obstacle to flawless execution. Learn to channel and compartmentalize pressures and stress.<br/>By combining the cool calculation of a four-star general and the hot-blooded nerve of a combat pilot, Murphy\'s "modern business warrior" is uniquely qualified to prioritize, maintain focus, assess risk, and develop the kind of teamwork necessary for long-term success. Whatever your mission, whatever your battle, Business Is Combat provides a blueprint for the kind of success every warrior seeks--absolute victory.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/32/50/9780060393250.jpg', 'title_long': "Business Is Combat: A Fighter Pilot's Guide to Winning in Modern Business Warfare", 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.12 Inches, Weight: 1.0361726314 Pounds, Width: 0.81 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.12}, 'width': {'unit': 'inches', 'value': 0.81}, 'weight': {'unit': 'pounds', 'value': 1.0361726314}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 207, 'date_published': '2000-03-01', 'subjects': ['Business & Money', 'Management & Leadership', 'Management', 'Training', 'Skills', 'Communications', 'Running Meetings & Presentations'], 'authors': ['James D Murphy'], 'title': "Business Is Combat: A Fighter Pilot's Guide to Winning in Modern Business Warfare", 'isbn13': '9780060393250', 'msrp': 24, 'binding': 'Hardcover', 'isbn': '0060393254', 'isbn10': '0060393254'}}