{'book': {'publisher': 'Harper Paperbacks', 'synopsis': 'Readers Respond To RealAge<br/><br/>"After taking the RealAge quiz, I discovered that I am three years younger than my chronological age. Since then, I have made some life changes. I am eating better, exercising, and taking my vitamins daily. As time progresses, I expect to reduce my RealAge even more." -- Laurette Dominguez, Des Moines, WA<br/>"I am a breast cancer survivor of two years. After reading your book, I was surprised to find out that I am 2.74 years younger than my chronological age! By changing a few simple routines in my life, RealAge has taught me how I can make myself even younger. Thank you very much!" -- Kat Middaugh, Greencastle, PA<br/>"My calendar age is 41 and my RealAge is 37.5. I was so inspired by Oprah\'s show, which featured your book, that I have decided to further improve my RealAge. Thanks to you and your book, I\'m working every day to become younger ... I never want to grow old!" -- Kim Claudy, Greenville, OH<br/>"Your book has taught me a lot and I have started following some of your suggestions. With diet and daily exercise, I have lost 130 pounds. Every morning I check your Web site for new information on getting younger. KEEP UP THE GOOD WORK!" -- Dan PHillips, Port Orchard, WA<br/>"I read RealAge in one day -- it was that compelling. The fact that you could ascribe years gained or lost to each and every action left an indelible impression on me. You punched the right button!" -- DR. Jen W. Chiu, Singapore<br/>"I am only sorry that it comes at this late date when so many opportunities to delay my aging have passed me by." -- William K. Hamilton, M.D.. Associate Dean, University of California, San Francisco', 'language': 'en', 'image': 'https://images.isbndb.com/covers/07/52/9780060930752.jpg', 'title_long': 'RealAge: Are You as Young as You Can Be?', 'edition': 'Reprint', 'dimensions': 'Height: 8 Inches, Length: 5.3125 Inches, Weight: 0.5732018812 Pounds, Width: 0.761905 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.3125}, 'width': {'unit': 'inches', 'value': 0.761905}, 'weight': {'unit': 'pounds', 'value': 0.5732018812}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 352, 'date_published': '2001-04-24', 'subjects': ['Self-Help', 'Health, Fitness & Dieting', 'Aging'], 'authors': ['Michael F. Roizen'], 'title': 'RealAge: Are You as Young as You Can Be?', 'isbn13': '9780060930752', 'msrp': 15, 'binding': 'Paperback', 'isbn': '0060930756', 'isbn10': '0060930756'}}