{'book': {'publisher': 'William Morrow', 'synopsis': 'Maura Moynihan\'s first novel, Covergirl, blends reality and fiction in a brilliant and exciting roman à clef that draws richly from the author\'s own adventures as a Warhol Girl and from her many years of working with Tibetan refugees in Asia.<br/>A sparkling follow-up to her bestselling story collection Yoga Hotel, Covergirl introduces Veronica Ferris, the daughter of an imperious socialite and a kindly but absent diplomat. Fresh out of college, Veronica lands in Manhattan in pursuit of romance, disco, and rock \'n\' roll—an arrival that threatens to usurp her mother\'s ambitious assault on New York high society. Maintaining her "double life" as a talented partygoer and a bearer of the esteemed Ferris family name is a high-wire act that requires far more cunning and restraint than young Veronica initially realizes.<br/>One night, Veronica\'s rebellious charm attracts the attention of John Penn, an eccentric, celebrated artist, and her fame explodes when Penn makes her his new Page magazine covergirl. Catapulted into the celebrity-god realm, she has a secret affair with the white-hot rock star Davey Name—who is "lithe, mean, ruthless, utter perfection." But when they\'re exposed while shooting a music video in Paris, Veronica takes the advice of the deeply mysterious and deadly handsome Mr. Norbu, a Tibetan gem dealer, who invites her to Kathmandu to volunteer at his orphanage.<br/>Back in Asia, the land of her "magical childhood," where she had lived during her father\'s diplomatic postings, Veronica befriends an old Tibetan refugee named Auntie Lhanzom, who has escaped to Nepal after years of imprisonment in a Chinese labor camp. When members of a Free Tibet group attempt to exploit Auntie Lhanzom as their own "covergirl" and all hell breaks loose as a result of a cultural misunderstanding, Veronica recognizes the parallels between her two worlds, and somehow finds her way home.<br/>With its unforgettable heroine and wry, highly entertaining voice, Covergirl is at once a poignant coming-of-age tale, a delightful social satire, and a vibrant modern-day odyssey.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/65/74/9780060756574.jpg', 'title_long': 'Covergirl: Confessions of a Flawed Hedonist', 'edition': 1, 'dimensions': 'Height: 9.5 Inches, Length: 6.5 Inches, Weight: 1.15 Pounds, Width: 1 inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.15}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 272, 'date_published': '2006-07-25', 'subjects': ['Literature & Fiction'], 'authors': ['Maura Moynihan'], 'title': 'Covergirl: Confessions of a Flawed Hedonist', 'isbn13': '9780060756574', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0060756578', 'isbn10': '0060756578'}}