{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': "When Moxie Brecker chose her kicky nickname back in college, it suited her perfectly. But now she feels it's one big misnomer. After graduation, she set out to command her own seventh-grade science class and was stunned to find the job too challenging. She didn't have the energy necessary to get a roomful of pre-teens excited about atoms, and she never felt like herself, so she handed in her chalk and lesson plans. Stumped about where to turn next, she followed the advice of her best friend Gerard and took a job folding underthings at the chain lingerie store in the mall.<br/>She's got plenty at home to distract her, including her neighbor, Steven Tyler (no, not that Stephen Tyler) and the kindly septuagenarian Joe, who runs the joke shop downstairs, but she spends her days languishing in the store. Though she feels tired and just out of it physically, she still gets bored steaming peignoir sets, protecting the thong table from shoplifters, and readjusting bras straps for hours on end. Maybe that's why, when a handsome guy named Allan starts hanging around the store for little chats, Moxie sees hope on the horizon. Maybe, just maybe, her employee discount won't go to waste for much longer…", 'language': 'en', 'image': 'https://images.isbndb.com/covers/20/97/9780060732097.jpg', 'title_long': 'The Pajama Game', 'edition': 'First Edition', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 0.56 Pounds, Width: 0.76 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 0.76}, 'weight': {'unit': 'pounds', 'value': 0.56}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 336, 'date_published': '2005-03-29', 'subjects': ['Literature & Fiction', 'Genre Fiction', "Women's Fiction", 'Contemporary', 'United States', 'Romance', 'Science Fiction', 'Science Fiction & Fantasy'], 'authors': ['Eugenie Seifer Olson'], 'title': 'The Pajama Game', 'isbn13': '9780060732097', 'msrp': 14.99, 'binding': 'Paperback', 'related': {'ePub': '0061748889'}, 'isbn': '0060732091', 'isbn10': '0060732091', 'other_isbns': [{'isbn': '9780061748882', 'binding': 'print'}]}}