{'book': {'publisher': 'Harper Perennial', 'synopsis': "A masterful blend of Christian scholarship and thrilling adventure, The Last Cato is a novel about the race to find the secret location of the Vera Cruz, the True Cross on which Christ was crucified, and the ancient brotherhood sworn to protect it.<br/>Holy relics are disappearing from sacred spots around the world—and the Vatican will do whatever it takes to stop the thieves from stealing what is left of the scattered splinters of the True Cross.<br/>Brilliant paleographer Dr. Ottavia Salina is called upon by the highest levels of the Roman Catholic Church to decipher the scars found on an Ethiopian man's corpse: seven crosses and seven Greek letters.<br/>The markings, symbolizing the Seven Deadly Sins, are part of an elaborate initiation ritual for the Staurofilakes, the clandestine brotherhood hiding the True Cross for centuries, headed by a secretive figure called Cato.<br/>With the help of a member of the Swiss Guard and a renowned archaeologist, Dr. Salina uncovers the connection between the brotherhood and Dante's Divine Comedy, and races across the globe to Christianity's ancient capitals. Together, they will face challenges that will put their faith—and their very lives—to the ultimate test.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/85/85/9780060828585.jpg', 'title_long': 'The Last Cato: A Novel', 'edition': 'Reprint', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 0.8 Pounds, Width: 1.05 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 1.05}, 'weight': {'unit': 'pounds', 'value': 0.8}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 464, 'date_published': '2007-04-03', 'subjects': ['Mystery, Thriller & Suspense', 'Thrillers & Suspense'], 'authors': ['Matilde Asensi'], 'title': 'The Last Cato: A Novel', 'isbn13': '9780060828585', 'msrp': 13.95, 'binding': 'Paperback', 'isbn': '0060828587', 'isbn10': '0060828587'}}