{'book': {'publisher': 'Harper Paperbacks', 'synopsis': "In this challenging and enlightening companion volume to the bestselling Goddesses in Everywoman, Jean Shinoda Bolen turns her attention to the powerful inner patterns--or archetypes--that shape men's personalities, careers, and personal relationships. Viewing these archtypes as the inner counterparts of the outer world of cultural stereotypes, she demonstrates how men an women can gain an nvaluable sense of wholeness and integration when what they do is consistent with who they are. Dr. Bolen introduces these patterns in the guise of eight archetypal gods, or personality types, with whom the reader will identify. From the authoritarian power-seeking gods (Zeus, Poseidon) to the gods of creativity (Apollo, Hephaestus) to the sensual Dionysus, Dr. Bolen shows men how to identify their ruling gods, how to decide which to cultivate and which to overcome, and how to tap thepwer of these enduring archetypes in order to enrich and strengthen their lives. She also stresses the importance of understanding which gods you are attracted to and which are compatible with your expectations, uncovers the origins of the often-difficult father-son relationship, and explores society's deep conflict between nurturing behavior and the need to foster masculinity.<br/>In Gods in Everyman Dr. Bolen presents us with a compassionate and lucid male psychology that will help all men and women to better understand themselves and their relationships with their fathers, their sons, their brothers, and their lovers.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/28/06/9780060972806.jpg', 'title_long': 'Gods in Everyman: Archetypes That Shape Mens Lives', 'edition': 'Edition Unstated', 'dimensions': 'Height: 8 Inches, Length: 5.5 Inches, Weight: 0.6 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.6}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 352, 'date_published': '1993-04-09', 'subjects': ['Religion & Spirituality', 'New Age & Spirituality', 'New Thought', 'Politics & Social Sciences', 'Social Sciences', 'Folklore & Mythology', 'Gender Studies'], 'authors': ['Jean Shinoda, M.D. Bolen'], 'title': 'Gods in Everyman: Archetypes That Shape Mens Lives', 'isbn13': '9780060972806', 'msrp': 14.99, 'binding': 'Paperback', 'isbn': '0060972807', 'isbn10': '0060972807'}}