{'book': {'publisher': 'William Morrow', 'synopsis': 'Fire Your Boss<br/>And Hire Yourself.<br/>Impossible? Not according to nationally bestselling author Stephen M. Pollan. As he says in this new and empowering book, "You don\'t have to accept your current work situation. You can be in control of your job and your stream of income, so you\'re never again subject to the whims, prejudices, moods, or circumstances of your so-called boss."<br/>In today\'s difficult work environment, gone are the days of finding satisfaction through your job, gone is the time when your job was secure, and gone are the days when your employer cared about you. This new environment requires new rules, and Pollan has provided surprisingly fresh and intriguing methods for finding "success" on the job.<br/>Pollan\'s bold and unique message begins with the idea that you must "fire your boss." By this he means you can no longer rely on your manager or your company for economic security. Instead, you must put yourself in charge of your working life. In this thought-provoking and counterintuitive career guide, Pollan presents a seven-step program and a series of exercises that give you the confidence, power, and will to achieve the life of your dreams.<br/>Once you have changed your mind-set and learned the new rules of the game, you can start the process of moving to a richer, more enriching, and more enjoyable life. And the best part about it? Your boss will love you for it.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/39/34/9780060583934.jpg', 'title_long': 'Fire Your Boss', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.15 Pounds, Width: 0.97 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.97}, 'weight': {'unit': 'pounds', 'value': 1.15}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 288, 'date_published': '2004-05-11', 'subjects': ['Self-Help', 'Happiness', 'Success', 'Business & Money', 'Job Hunting & Careers', 'Guides', 'Job Hunting', 'Vocational Guidance', 'Education & Teaching', 'Schools & Teaching', 'Counseling'], 'authors': ['Stephen M Pollan', 'Mark Levine'], 'title': 'Fire Your Boss', 'isbn13': '9780060583934', 'msrp': 23.95, 'binding': 'Hardcover', 'isbn': '0060583932', 'isbn10': '0060583932'}}