{'book': {'publisher': 'William Morrow', 'synopsis': 'In 1998 a troubled young man and his flamboyant mother were arrested for murdering a wealthy widow in her New York City mansion. Suddenly, America was transfixed by a pair of real-life film noir characters, an Oedipal team of scam artists who left a trail of blood, lies, and larceny from coast to coast. The media couldn\'t get enough of the twisted relationship between Sante Kimes and her twenty-three-year-old son Kenny.<br/>But the most chilling story of all was never told -- until now. Kent Walker, Sante\'s elder son, reveals how he survived forty years of "the Dragon Lady\'s" very special brand of motherly love and still managed to get away.<br/>As a child Kent watched his mother destroy his hardworking father, Ed Walker, and then -- with Kent\'s painful collusion -- snare what Sante called "my millionaire." When she married seemingly respectable real-estate developer Ken Kimes, it was a match made in hell.<br/>For the next two decades Kent\'s mother and stepfather indulged in a globetrotting orgy of criminal behavior, laying waste to each other and anyone who got in the way. Kent, their would-be recruit, was privvy to the family business -- torching houses, defrauding friends, crashing White House parties, "shopping" for trunkloads of fur coats -- and Sante\'s self-serving style of adultery. When Kent\'s half-brother, Kenny was born, Kent was twelve years old -- old enough to know that he was his younger sibling\'s only protector. Kent tried desperately to save Kenny from his mother\'s sinister bidding. His failure haunts him to this day.<br/>Here, with shocking and sometimes brutal frankness, Kent explodes the romantic Hollywood image of the grifter as antihero and exposes the truth about Sante Kimes behind the headlines. Sone of a Grifter poignantly chronicles what it means to love somebody despite your better instincts, your worst fears, and even your most forbidden hopes.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/86/58/9780060188658.jpg', 'title_long': 'Son of a Grifter: The Twisted Tale of Sante and Kenny Kimes, the Most Notorious Con Artists in America: A Memoir by the Other Son', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.12 Inches, Weight: 1.653466965 Pounds, Width: 1.29 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.12}, 'width': {'unit': 'inches', 'value': 1.29}, 'weight': {'unit': 'pounds', 'value': 1.653466965}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 416, 'date_published': '2001-04', 'subjects': ['Biographies & Memoirs', 'True Crime', 'Crime & Criminal Biographies'], 'authors': ['Kent Walker', 'Mark Schone'], 'title': 'Son of a Grifter: The Twisted Tale of Sante and Kenny Kimes, the Most Notorious Con Artists in America: A Memoir by the Other Son', 'isbn13': '9780060188658', 'msrp': 25, 'binding': 'Hardcover', 'isbn': '0060188650', 'isbn10': '0060188650'}}