{'book': {'publisher': 'Ecco', 'synopsis': "For an extraordinary handful of years around the turn of the millennium, the Yankees were baseball's unstoppable force. With four World Series championships in five seasons and a deep bench of legends and comers -- Clemens, Rivera, Williams, Soriano, Jeter, O'Neill -- they dominated the major leagues, earning the love of their hometown fans and the grudging admiration of players and spectators everywhere.<br/>For the members of the team, though, baseball Yankees-style was an almost unbearable pressure cooker of anxiety, expectation, and infighting. With owner George Steinbrenner at the wheel, the Yankees money machine spun out of control, and as the team's revenues skyrocketed, salaries were inflated unimaginably -- and smaller teams found themselves priced out of competition. True devotees of the game suffered, and so did Steinbrenner's employees. Emboldened by New York's unforgiving fans, Steinbrenner let the Yankees know loud and clear that their fat paychecks carried an equally exaggerated mandate: win now, and win all the time -- any season that doesn't end in a World Series victory is an unforgivable failure. As the spending and emotion spiraled, careers were made and broken, friendships began and ended, and a sports dynasty rose and fell.<br/>In The Last Night of the Yankee Dynasty, Buster Olney tracks the Yankees through these exciting and tumultuous seasons, providing insightful portraits of the stars, the foot soldiers, the coaches, the manager, and the Boss himself. With profound knowledge of the game and an insider's familiarity with the team, Olney also advances a compelling argument that the philosophy that made the Yankees great was inherently unsustainable, ultimately harmful to the sport, and led inevitably to that warm autumn night in Arizona -- the last night of the Yankee dynasty.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/50/65/9780060515065.jpg', 'title_long': 'The Last Night of the Yankee Dynasty: The Game, the Team, and the Cost of Greatness', 'dimensions': 'Height: 9.25 Inches, Length: 7 Inches, Weight: 1.4 Pounds, Width: 1.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 1.75}, 'weight': {'unit': 'pounds', 'value': 1.4}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 346, 'date_published': '2004-08-17', 'subjects': ['Sports & Outdoors', 'Baseball', 'Coaching', 'Politics & Social Sciences', 'Politics & Government', 'United States'], 'authors': ['Buster Olney'], 'title': 'The Last Night of the Yankee Dynasty: The Game, the Team, and the Cost of Greatness', 'isbn13': '9780060515065', 'msrp': 26.95, 'binding': 'Hardcover', 'isbn': '0060515066', 'isbn10': '0060515066'}}