{'book': {'publisher': 'William Morrow Cookbooks', 'synopsis': '"Wine is not to fear or revere, but to enjoy," says Leslie Sbrocco, wine expert. And that\'s exactly what she shows you how to do in Wine for Women, the first wine book written exclusively for women -- the majority of wine consumers.<br/>In Wine for Women, Leslie Sbrocco scraps the stuffy wine-speak and deals with what women really want to know about wine. The book includes shopping guides with hundreds of recommended wines, quick ideas for wine-friendly meals, and creative tips for sharing wine with family and friends.<br/>Organized into easy-to-manage sections, Wine for Women appeals to all levels of wine lovers. From Sauvignon Blanc to Chenin Blanc, Merlot to Malbec, and pink wines to dessert wines, Leslie Sbrocco makes her enormous knowledge of wine entertaining enough for the serious wine lover and accessible enough so any novice can feel like an expert.<br/>Each chapter focuses on a different variety of wine, and covers what Leslie calls the big three -- how to buy, pair, and share wine. You\'ll learn how to make smart buying decisions in stores and restaurants. Leslie also gives you practical advice for pairing wine and food and offers insights on entertaining with wine, whether you\'re having an informal picnic or planning the most formal of weddings.<br/>Confused between Chardonnay and Champagne? Think little black dress versus sequins. And Pinot Gris? Think your wine wardrobe\'s basic jeans. With her relaxed, friendly approach, Leslie makes it easy to understand the differences between wines and encourages women to explore and enjoy wine in their everyday lives.<br/>Keep Wine for Women in your kitchen. Bring it into your living room. Refer to it before you hit the wine shop, or when you just want an excuse to read, relax, and have a sip of something that\'s really you.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/33/29/9780060523329.jpg', 'title_long': 'Wine for Women: A Guide to Buying, Pairing, and Sharing Wine', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.4 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.4}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 352, 'date_published': '2003-10-14', 'subjects': ['Cookbooks, Food & Wine', 'Beverages & Wine', 'Wine & Spirits', 'Homebrewing, Distilling & Wine Making', 'Entertaining & Holidays'], 'authors': ['Leslie Sbrocco'], 'title': 'Wine for Women: A Guide to Buying, Pairing, and Sharing Wine', 'isbn13': '9780060523329', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060523328', 'isbn10': '0060523328'}}