{"book": {"publisher": "Harper Perennial", "synopsis": ""[This] is a book of great richness, beauty and power and thus very difficult to do justice to in a brief review. . . . The violence is sometimes unbearable, the language rarely less than superb. Dillard\"s description of the moth\"s death makes Virginia Woolf\'s go dim and Edwardian. . . . Nature seen so clear and hard that the eyes tear. . . . A rare and precious book.' — Frederick Buechner, New York Times Book Review<br/>A profound book about the natural world—both its beauty and its cruelty—from Pulitzer Prize-winning author Annie Dillard<br/>In 1975 Dillard took up residence on an island in Puget Sound, in a wooden room furnished with 'one enormous window, one cat, one spider, and one person.' For the next two years she asked herself questions about time, reality, sacrifice, death, and the will of God. In Holy the Firm, she writes about a moth consumed in a candle flame, about a seven-year-old girl burned in an airplane accident, about a baptism on a cold beach. But behind the moving curtain of what she calls 'the hard things—rock mountain and salt sea,' she sees, sometimes far off and sometimes as close by as a veil or air, the power play of holy fire.<br/>Here is a lyrical gift to any reader who has ever wondered how best to live with grace and wonder in the natural world.', 'language": "en", "image": "https: //images.isbndb.com/covers/54/38/9780060915438.jpg", "title_long": "Holy the Firm", "edition": "Revised", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 0.15 Pounds, Width: 0.18 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 0.18}, "weight": {"unit": "pounds", "value": 0.15}, "height": {"unit": "inches", "value": 8}}, "pages": 76, "date_published": "1998-12-30", "subjects": ["Literature & Fiction', 'History & Criticism', 'Genres & Styles', 'Regional & Cultural', 'Science & Math', 'Nature & Ecology', 'Nature Writing & Essays'], 'authors": ["Annie Dillard'], 'title": "Holy the Firm", "isbn13": "9780060915438", "msrp": 13, "binding": "Paperback", "related": {"eBook": "0061871656", "ePub": "0061871656"}, "isbn": "0060915439", "isbn10": "0060915439", "other_isbns": [{'isbn": "9780061871658", "binding": "ebook"}]}}