{'book': {'publisher': 'Rayo', 'synopsis': "In a stunning literary achievement -- with a power and scope in the tradition of John Steinbeck and Theodore Dreiser -- Luis J. Rodriguez captures the soul of a community and a little-known era in America's history in his epic novel about love, family, workers' rights, industrial strife, and cultural dislocation.<br/>When the Salcido family departs for the United States, their flight is hardly different from the journeys of the indigenous tribes who roamed America for tens of thousands of years, or immigrants who sailed across entire oceans, or countless others who have left their native lands behind for the promise of a better life.<br/>Traveling mostly on foot, Procopio Salcido and his future wife, Eladia, leave Mexico for the United States to escape the bleak realities of their homeland.<br/>Finally settling in Los Angeles, the young couple discover that the hopes they have for their children must now be weighed against the backdrop of the mighty Nazareth steel mill, their engine for survival, which will eventually become the lifeblood of their own American dream.<br/>Spanning sixty years and three generations, Music of the Mill is set in the industrial boom of post–World War II Southern California, where jobs seemed plentiful, communities thrived, and racial harmony prevailed. However, while postwar prosperity seemed to supply jobs to many migrant African American, Mexican, and poor white workers, in reality there was great struggle and racial discord -- low-paying, backbreaking labor and the cruel manipulation by manufacturers who pitted groups of workers against one another.<br/>For the Salcidos -- especially for Procopio's idealistic son, Johnny, and his young family -- the hard knocks of life often resound louder than their own sense of hope. When their aspirations have long since lost their luster, retaining their dignity and sense of worth becomes the family's greatest challenge.<br/>Destined to be a classic of American literature, Music of the Mill, the long-awaited first novel by Luis J. Rodriguez, portrays the journey of one family caught in a web of politics, racial polarization, and corrupt unions' power struggles, revealing the drama, pain, joy, and humor of working-class life.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/07/68/9780060560768.jpg', 'title_long': 'Music of the Mill: A Novel', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.19 Pounds, Width: 1.05 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.05}, 'weight': {'unit': 'pounds', 'value': 1.19}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 320, 'date_published': '2005-04-26', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Family Saga', 'United States'], 'authors': ['Luis J. Rodriguez'], 'title': 'Music of the Mill: A Novel', 'isbn13': '9780060560768', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060560762', 'isbn10': '0060560762'}}