{'book': {'publisher': 'William Morrow', 'synopsis': 'The open road, a well-tuned machine, and a fine "old lady" hanging on to your back. That\'s freedom. That\'s living. Ridin\' High, Livin\' Free<br/>Sonny Barger is the number one spokesman for the outlaw biker life. His New York Times bestseller Hell\'s Angel was an exhilarating history of his experiences with the world\'s most notorious motorcycle club. Now the Angel spreads his wings even wider to bring us rousing, moving, wildly entertaining true-life stories of his renegade brothers and sisters in black leather and their relentless pursuits of liberty, individuality, and the "ultimate ride."<br/>And what stories he has to tell -- freewheeling, bare-knuckle tales of brawls and battles, brotherhood, breathtaking adventures, and crazy quests, and the inevitable classic scrapes with "John Law." The most colorful legends and unforgettable characters of biker lore come alive here: badass dudes like Cincinnati, one of the many Folsom State Prison graduates riding the nation\'s highways; lone-wolf dreamer Moto Guzzi Ron and his remarkable run at the North Pole, dodging killer bears along the way; and the 1960s saga of party girl Loaded Linda who finally abandoned the biker life for a Silicon Valley gig. Celebrities like Steve McQueen, Johnny Paycheck, and David Crosby thunder through these pages -- alongside some incredibly stylish hog-straddling ladies and quixotic personalities -- in a sensational collection of rebel tales that run the gamut from the poignant and inspiring to the thrilling and utterly outrageous. And through it all, Sonny celebrates the revered creed of the free-spirit motorized wanderer, an ingrained pride and loyalty to the biker fraternity and the glorious machines they love more than their mothers.<br/>Whether you ride, have never ridden, or just dream of riding, Ridin\' High, Livin\' Free is a reading experience you won\'t soon forget. It\'s a fascinating glimpse into a unique culture of freedom that recognizes only one commandment: the code of the road.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/60/20/9780060006020.jpg', 'title_long': "Ridin' High Livin' Free Ralph Sonny Barger: Hell-Raising Motorcycle Stories", 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.25 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 1.25}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 272, 'date_published': '2002-04-16', 'subjects': ['Biographies & Memoirs', 'Professionals & Academics', 'Educators', 'Engineering & Transportation', 'Automotive', 'Motorcycles', 'Sports & Outdoors', 'Biographies', 'Miscellaneous', 'History of Sports', 'Motor Sports'], 'authors': ['Ralph "Sonny" Barger', 'Kent Zimmerman', 'Keith Zimmerman'], 'title': "Ridin' High Livin' Free Ralph Sonny Barger: Hell-Raising Motorcycle Stories", 'isbn13': '9780060006020', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060006021', 'isbn10': '0060006021'}}