{'book': {'publisher': 'HarperEntertainment', 'synopsis': "For Tony Hawk, it wasn't enough to skate for two decades, to invent more than eighty tricks, and to win more than twice as many professional contests as any other skater. It wasn't enough to knock himself unconscious more than ten times, fracture several ribs, break his elbow, knock out his teeth twice, compress the vertebrae in his back, pop his bursa sack, get more than fifty stitches laced into his shins, rip apart the cartilage in his knee, bruise his tailbone, sprain his ankles, and tear his ligaments too many times to count. No. He had to land the 900. And after thirteen years of failed attempts, he nailed it.It had never been done before.<br/><br/>Growing up in Sierra Mesa, California, Tony was a hyperactive demon child with an I44 IQ. He threw tantrums, terrorized the nanny until she quit, exploded with rage whenever he lost a game; this was a kid who was expelled from preschool. When his brother, Steve, gave him a blue plastic hand-me-down skateboard and his father built a skate ramp in the driveway, Tony finally found his outlet--while skating, he could be as hard on himself as he was on everyone around him.<br/><br/>But it wasn't an easy ride to the top of the skating game. Fellow skaters mocked his skating style and dubbed him a circus skater. He was so skinny he had to wear elbow pads on his knees, and so light he had to ollie just to catch air off a ramp. He was so desperate to be accepted by young skating legends like Steve Caballero, Mike McGill, and Christian Hosoi that he ate gum from between Steve's toes. But a few years of determination and hard work paid off in multiple professional wins, and the skaters who once had mocked him were now trying to learn his tricks. Tony had created a new style of skating.<br/><br/>In Hawk Tony goes behind the scenes of competitions, demos, and movies and shares the less glamorous demands of being a skateboarder--from skating on Italian TV wearing see-through plastic shorts to doing a demo in Brazil after throwing up for five days straight from food poisoning. He's dealt with teammates who lit themselves and other subjects on fire, driving down a freeway as the dashboard of their van burned. He's gone through the unpredictable ride of the skateboard industry during which, in the span of a few years, his annual income shrank to what he had made in a single month and then rebounded into seven figures. But Tony's greatest difficulty was dealing with the loss of his number one fan and supporter--his dad, Frank Hawk.<br/><br/>With brutal honesty, Tony recalls the stories of love, loss, bad hairdos, embarrassing '80s clothes, and his determination that had shaped his life. As he takes a look back at his experiences with the skateboarding legends of the '70s, '80s, and '90s, including Stacy Peralta, Eddie Elguera, Lance Mountain, Mark Gonzalez, Bob Burnquist, and Colin Mckay, he tells the real history of skateboarding--and also what the future has in store for the sport and for him.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/86/02/9780060198602.jpg', 'title_long': 'Hawk: Occupation: Skateboarder', 'edition': 'First Edition', 'dimensions': 'Height: 9.12 Inches, Length: 6.12 Inches, Weight: 1.4550509292 Pounds, Width: 1.09 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.12}, 'width': {'unit': 'inches', 'value': 1.09}, 'weight': {'unit': 'pounds', 'value': 1.4550509292}, 'height': {'unit': 'inches', 'value': 9.12}}, 'pages': 304, 'date_published': '2000-08-01', 'subjects': ['Arts & Photography', 'Individual Artists', 'Photography & Video', 'Individual Photographers', 'Biographies & Memoirs', 'Sports & Outdoors', 'Biographies', 'Individual Sports', 'Skateboarding', 'Miscellaneous', 'History of Sports'], 'authors': ['Tony Hawk'], 'title': 'Hawk: Occupation: Skateboarder', 'isbn13': '9780060198602', 'msrp': 23, 'binding': 'Hardcover', 'isbn': '0060198605', 'isbn10': '0060198605', 'other_isbns': [{'isbn': '9780062004260', 'binding': 'printisbncanonical'}]}}