{'book': {'publisher': 'Harper', 'synopsis': "Quincy, Washington, had been a sleepy northwestern farming town until its rest is disturbed by a shocking secret beneath its once-fertile fields: chemical manufacturers are disposing of leftover toxic waste by selling it to unsuspecting farmers as fertilizer. The tainted fertilizer -- containing arsenic and cadmium, lead and dioxins-is believed to be destroying crops, sickening animals, and endangering the nation's food supply. And owing to a gaping regulatory loophole, it is completely legal.<br/>Up against the secrecy and greed of powerful corporations, a local lifelong tomboy and mother of four will make an impassioned stand. Patty Martin begins a fateful journey that will lead to her election as mayor, but also invite the resentment of most of her neighbors for daring to confront the industry that has been Quincy's lifeblood. Martin is joined by a small number of brave farmers who bring ingenuity, outrage, and an investigative reporter to the fight against seemingly insurmountable odds to expose the truth. They learn that toxic waste is turned into fertilizer around the world, spread on food-growing land, absorbed by plants, and, ultimately, consumed by all of us.<br/>Duff Wilson, whose Seattle Times series on this story was a finalist for the Pulitzer Prize, here provides the definitive account of a new and alarming environmental scandal. Fateful Harvest is a gripping study of corruption and courage, of recklessness and reckoning. It is a story that speaks to the greatest fears -- and ultimate hope -- in us all.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/36/90/9780060193690.jpg', 'title_long': 'Fateful Harvest: The True Story of a Small Town, a Global Industry, and a Toxic Secret', 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 6.12 Inches, Weight: 1.4 Pounds, Width: 1.09 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.12}, 'width': {'unit': 'inches', 'value': 1.09}, 'weight': {'unit': 'pounds', 'value': 1.4}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 336, 'date_published': '2001-09-04', 'subjects': ['Business & Money', 'Economics', 'Environmental Economics', 'Law', 'Environmental & Natural Resources Law', 'Engineering & Transportation', 'Engineering', 'Civil & Environmental', 'Science & Math', 'Earth Sciences', 'Environmental Science', 'Nature & Ecology', 'Conservation', 'Environment', 'Environmentalism', 'Politics & Social Sciences', 'Sociology', 'Politics & Government', 'Public Affairs & Policy'], 'authors': ['Duff Wilson'], 'title': 'Fateful Harvest: The True Story of a Small Town, a Global Industry, and a Toxic Secret', 'isbn13': '9780060193690', 'msrp': 26, 'binding': 'Hardcover', 'isbn': '0060193697', 'isbn10': '0060193697', 'other_isbns': [{'isbn': '9780061873768', 'binding': 'print'}]}}