{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': "When to tell, What to tell, and How to tell<br/>Children who are adopted have predictable and often unspoken concerns about themselves and how they joined their families. In this wise and timely guide, Lois Melina, author of the classic manual Raising Adopted Children, helps parents anticipate and respond to those concerns in ways that build self-esteem. Through sample conversations, reassuring advice, and age-specific activities parents will find answers to such questions as: -- When should I give my child the letter her birthmother wrote?<br/>-- How do I share information that might upset my child?<br/>-- How can I know when my child is wondering about adoption?<br/>-- What should I tell school personnel about my child's history? What about family and friends?<br/>-- How can I be sure we talk about adoption enough, but not too much?<br/>Whether parents adopted traditionally, as stepparents, or through donor insemination, surrogacy, or in vitro fertilization, Making Sense of Adoption will open the door to a lifetime of growth and understanding for adoptive families.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/31/94/9780060963194.jpg', 'title_long': "Making Sense of Adoption: A Parent's Guide", 'edition': 'Stated First Edition', 'dimensions': 'Height: 8 Inches, Length: 5.31 inches, Weight: 0.51147244784 Pounds, Width: 0.65 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 0.65}, 'weight': {'unit': 'pounds', 'value': 0.51147244784}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 288, 'date_published': '1989-09-13', 'subjects': ['Parenting & Relationships', 'Adoption', 'Family Relationships', 'Parent & Adult Child', 'Parenting', 'Early Childhood'], 'authors': ['Lois Ruskai Melina'], 'title': "Making Sense of Adoption: A Parent's Guide", 'isbn13': '9780060963194', 'msrp': 13.99, 'binding': 'Paperback', 'related': {'ePub': '0062038168'}, 'isbn': '0060963190', 'isbn10': '0060963190', 'other_isbns': [{'isbn': '9780062038166', 'binding': 'print'}]}}