{'book': {'publisher': 'William Morrow', 'synopsis': "Ship Sooner hears everyone and everything in her sleepy Massachusetts town. The sounds of frost forming on glass, a rabbit hopping on just-fallen snow, and a fork crimping a piecrust are as clear to Ship as an old Sinatra tune playing at full volume in the town diner. Misunderstood by her classmates and ignored by her disdainful older sister, Ship consoles herself by listening to the sounds of others' secrets: her mother's lips pressing against those of a balding salesman's; her sister Helen's trysts in a secluded shed; their family friend Trudy's breath quickening as she cuts the hair of the town priest; and her only friend Brian Dodd's promising his parents not to tell where he goes with them on Sunday afternoons.<br/>Ship's isolation intensifies when Brian disappears inexplicably the day after Christmas. During the long winter of 1981, as Helen retreats behind her slammed bedroom door and their mother is increasingly absent, Ship keeps vigil for Brian and slowly loses hope. But as winter melts into spring, an unexpected cry from the woods will lead her to make an astonishing discovery, one that compels her to abandon all that she has known and set out on a journey that will transform her life.<br/>This is the story of a gifted young girl who comes to realize that what has cut her off from others has also given her the means to become her truest self. In vibrant prose, Mary Sullivan captures the tender and tough essence of an adolescent whose extraordinary sensitivity teaches us to listen for those softest of sounds -- of hope, need, and desire -- that whisper through all our lives. Ship Sooner is an utterly original character whose distinctive voice and startling perception of the undertones of everyday life will hook readers from the very first page and linger on in their memories long after the last page is turned.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/24/03/9780060562403.jpg', 'title_long': 'Ship Sooner: A Novel', 'edition': '1', 'dimensions': 'Height: 8.5 Inches, Length: 6.25 Inches, Weight: 1 Pounds, Width: 2 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 2}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 288, 'date_published': '2004-01-20', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Coming of Age', 'Family Life', "Women's Fiction", 'Domestic Life', 'Literary', 'Science Fiction & Fantasy', 'Fantasy', 'Magical Realism'], 'authors': ['Mary Sullivan'], 'title': 'Ship Sooner: A Novel', 'isbn13': '9780060562403', 'msrp': 23.95, 'binding': 'Hardcover', 'isbn': '0060562404', 'isbn10': '0060562404'}}