{'book': {'publisher': 'William Morrow Cookbooks', 'synopsis': "Everybody loves dessert, but nobody loves the calories. Perfect Light Desserts offers recipes for desserts rich enough to satisfy any sweet tooth -- but with sensible calorie counts.<br/>Master baker Nick Malgieri and healthful food expert David Joachim have joined forces to create 125 exceptional desserts without the usual quantities of fats and sugars. The focus is on flavor and texture achieved through balanced ingredient combinations and superior baking techniques. Not a single recipe has more than 300 calories per serving.<br/>The results are nothing short of spectacular, with desserts that range from devil's food cake (complete with fluffy icing) to a lemon custard highlighted with a colorful raspberry sauce. Old-fashioned American favorites such as hermits mingle with sophisticated treats like rum raisin semifreddo and white chocolate raspberry tartlets. Best of all, while these desserts are low-calorie, they are high in flavor. Moist coconut poppy seed coffee cake, juicy blueberry pie, and fudgy brownies don't taste like “diet desserts”; they simply taste great.<br/>All of the recipes here achieve great flavor without resorting to artificial sweeteners or synthetic substitutes. The recipes use moderate amounts of real butter, sugar, flour, and eggs in perfect proportions. Every recipe includes a complete nutritional analysis as well as serving and storage notes. Everybody loves dessert, and now no one has to go without it.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/92/90/9780060779290.jpg', 'title_long': 'Perfect Light Desserts: Fabulous Cakes, Cookies, Pies, and More Made with Real Butter, Sugar, Flour, and Eggs, All Under 300 Calories Per Generous Serving', 'edition': 'Illustrated', 'dimensions': 'Height: 9 Inches, Length: 7.5 Inches, Weight: 2.53 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 2.53}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 336, 'date_published': '2006-10-17', 'subjects': ['Cookbooks, Food & Wine', 'Quick & Easy', 'Special Diet', 'Diabetic & Sugar-Free', 'Low Fat', 'Weight Loss', 'Desserts', 'Literature & Fiction', 'Classics'], 'authors': ['Nick Malgieri', 'David Joachim'], 'title': 'Perfect Light Desserts: Fabulous Cakes, Cookies, Pies, and More Made with Real Butter, Sugar, Flour, and Eggs, All Under 300 Calories Per Generous Serving', 'isbn13': '9780060779290', 'msrp': 29.95, 'binding': 'Hardcover', 'isbn': '0060779292', 'isbn10': '0060779292'}}