{"book": {"publisher": "HarperOne", "synopsis": "He was the "Man in Black," a country music legend, and the quintessential American troubadour. He was an icon of rugged individualism who had been to hell and back, telling the tale as never before. In his unforgettable autobiography, Johnny Cash tells the truth about the highs and lows, the struggles and hard-won triumphs, and the people who shaped him.<br/>In his own words, Cash set the record straight -- and dispelled a few myths -- as he looked unsparingly at his remarkable life: from the joys of his boyhood in Dyess, Arkansas to superstardom in Nashville, Tennessee, the road of Cash\"s life has been anything but smooth. Cash writes of the thrill of playing with Elvis, the comfort of praying with Billy Graham; of his battles with addiction and of the devotion of his wife, June; of his gratitude for life, and of his thoughts on what the afterlife may bring. Here, too, are the friends of a lifetime, including Willie Nelson, Roy Orbison, Bob Dylan, and Kris Kristofferson. As powerful and memorable as one of his classic songs, Cash is filled with the candor, wit, and wisdom of a man who truly 'walked the line.'', 'language": "en", "image": "https: //images.isbndb.com/covers/75/36/9780060727536.jpg", "title_long": "Cash: The Autobiography", "edition": "First Edition", "dimensions": "Height: 9 inches, Length: 6 inches, Weight: 0.81 Pounds, Width: 0.83 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 0.83}, "weight": {"unit": "pounds", "value": 0.81}, "height": {"unit": "inches", "value": 9}}, "pages": 320, "date_published": "2003-10-07", "subjects": ["Self-Help', 'Personal Transformation', 'Arts & Photography', 'Music', 'Musical Genres', 'Biographies & Memoirs', 'Arts & Literature', 'Actors & Entertainers', 'Composers & Musicians', 'Memoirs', 'Humor & Entertainment', 'Religion & Spirituality', 'Self Service', 'Custom Stores'], 'authors": ["Johnny Cash'], 'title": "Cash: The Autobiography", "isbn13": "9780060727536", "msrp": 1.99, 'binding": "Paperback", "isbn": "0060727535", "isbn10": "0060727535"}}