{'book': {'publisher': 'Avon', 'synopsis': "The gentlemen of the Bastion Club have proven their courage while fighting England's enemies, but nothing has prepared them for dealing with that most formidable of challenges: the opposite sex.<br/>Deverell, Viscount Paignton, is in desperate need of a wife. Unmoved by the matchmaking “herd,” he seeks help from his aunt, who directs him to a lady she vows is perfect for him. Dispatched to a country house party to look the lady over, he discovers her not swanning about among the guests but with her nose buried in a book in the library.<br/>Phoebe Malleson is tempted to distraction by Deverell, but marrying him isn't part of her plan. Moved by an incident in her past, Phoebe has a secret cause to which she's committed. Unfortunately, telling Deverell to go away doesn't work, and he quickly learns of her secret. But someone powerful has her cause targeted for destruction—and her in their sights. Phoebe must accept Deverell's help…though the cost to them both might be dear—and deadly.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/91/09/9780060839109.jpg', 'title_long': 'To Distraction (Bastion Club, 5)', 'edition': 'First Edition', 'dimensions': 'Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.52 Pounds, Width: 0.99 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 0.99}, 'weight': {'unit': 'pounds', 'value': 0.52}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 496, 'date_published': '2006-08-29', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'United States', 'Romance', 'American', '20th Century', 'Regency'], 'authors': ['Stephanie Laurens'], 'title': 'To Distraction (Bastion Club, 5)', 'isbn13': '9780060839109', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'related': {'Kindle Edition': '006175417X', 'ePub': '006175417X'}, 'isbn': '0060839104', 'isbn10': '0060839104', 'other_isbns': [{'isbn': '9780061754173', 'binding': 'print'}]}}