{"book": {"publisher": "William Morrow Paperbacks", "synopsis": "Go further under the covers and stay in bed a little longer with Marian Keyes in this winning follow-up to her smash essay collection, Under the Duvet. Written in the witty, forthright style that has earned her legions of devoted readers, Cracks in My Foundation offers an even deeper and more candid look into this beloved author"s mind and heart, exploring such universal themes as friends and family, home, glamour and beauty, children, travel, and more. Marian"s hilarious and thoughtful take on life makes her readers feel they are reading a friend, not just an author.<br/>Marian continues to entertain with her reports from the trenches, and throws in some original short fiction as well. Whether it"s visiting Siberia, breaking it off with an old hairdresser, shopping (of course!), turning forty, living with her beloved husband, Himself (a man beyond description), or musing on the F word (feminism), Marian shares the joys, passions, and sorrows of her world and helps us feel good about our own. So grab a latte and a pillow and get ready to laugh your slippers off!', 'language": "en", "image": "https: //images.isbndb.com/covers/70/35/9780060787035.jpg", "title_long": "Cracks in My Foundation: Bags, Trips, Make-up Tips, Charity, Glory, and the Darker Side of the Story", "edition": "1", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 0.615 Pounds, Width: 0.83 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 0.83}, "weight": {"unit": "pounds", "value": 0.615}, "height": {"unit": "inches", "value": 8}}, "pages": 368, "date_published": "2005-09-06", "subjects": ["Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Memoirs', 'Humor & Entertainment', 'Humor', 'Essays', 'Literature & Fiction', 'Classics', 'Essays & Correspondence', 'Genre Fiction', 'Women's Fiction', 'United States', 'Humor & Satire', 'Dark Humor', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Marian Keyes'], 'title": "Cracks in My Foundation: Bags, Trips, Make-up Tips, Charity, Glory, and the Darker Side of the Story", "isbn13": "9780060787035", "msrp": 14.99, "binding": "Paperback", "isbn": "0060787031", "isbn10": "0060787031", "other_isbns": [{'isbn": "9780061864698", "binding": "printisbncanonical"}]}}