{'book': {'publisher': 'Avon', 'synopsis': "The seven members of the Bastion Club have served loyally in the perilous service of the Crown. Now they've banded together to support one another through their most dangerous mission of all: getting married.<br/>When Charles St. Austell returns home to claim his title as earl, and to settle quickly on a suitable wife as well, he discovers that experience has made him impatient of the young ladies who vie for his attention—with the exception of Lady Penelope Selborne. Years ago, Charles and Penelope's youthful ardor was consummated in an unforgettable afternoon. Charles is still haunted by their interlude, but Penny refuses to have anything more to do with him.<br/>If controlling her heart was difficult before, resisting a stronger, battle-hardened Charles is well nigh impossible, yet Penelope has vowed she won't make the same mistake twice, nor will she marry without love. But when a traitorous intrigue draws them together, then ultimately threatens them both—will Penny discover she has a true protector in Charles, her first and only love, who now vows to make her his own?", 'language': 'en', 'image': 'https://images.isbndb.com/covers/33/08/9780060593308.jpg', 'title_long': 'A Lady of His Own (Bastion Club, 3)', 'edition': 'Reissue', 'dimensions': 'Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.49 Pounds, Width: 1.12 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 1.12}, 'weight': {'unit': 'pounds', 'value': 0.49}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 448, 'date_published': '2004-09-28', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'United States', 'Romance', 'American', '20th Century', 'Regency'], 'authors': ['Stephanie Laurens'], 'title': 'A Lady of His Own (Bastion Club, 3)', 'isbn13': '9780060593308', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'related': {'ePub': '0061746444'}, 'isbn': '006059330X', 'isbn10': '006059330X', 'other_isbns': [{'isbn': '9780061746444', 'binding': 'print'}]}}