{'book': {'publisher': 'Amistad', 'synopsis': 'White collar crime just got a lot more deadly...<br/>In the 1990s, as the internet boomed and investments soared to unthinkable heights, many people were left with their feet planted firmly on the ground, looking enviously up at the more fortunate winners in life\'s game of roulette. For every bubble billionaire, there were scores of others trying to grab even a small piece of that dream.<br/>This is the era in which we meet Sidarra, Griff, and Yakoob––hard working folks who can\'t seem to get a toe–hold while wealth explodes around them. Sidarra is a single mom with a dead–end job at the Board of "Miseducation;" Griff is a defense lawyer striving to make a difference; and Yakoob is a struggling comedian who works as a computer programmer to pay the bills. Each has personal struggles, but when they form the Central Harlem Investment Club, a plan to restore a little justice to their lives takes shape.<br/>It seems Yakoob has found a way to siphon off funds from wealthy individuals––the kind of people who are well–insured and will probably barely notice the missing money. But in order to justify personal gain at others\' expense, the group decides to pick their victims based on people who have done harm to the Black community in the past. A plan hatched in a dark pool hall could be a way to escape their drab lives and restore a little justice to the world.<br/>But when the group takes in Yakoob\'s shady neighbor Raul, their scheme takes a sinister twist. Now with murder in the mix, and the possibility of serious consequences, their best laid plans may spiral into much more dangerous territory.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/92/99/9780060789299.jpg', 'title_long': 'The Importance of Being Dangerous', 'edition': 'First Edition', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Width: 1.17 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.17}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 368, 'date_published': '2007-04-24', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'Political', 'United States', 'Black & African American', 'Mystery, Thriller & Suspense', 'Mystery', 'Thrillers & Suspense', 'Suspense', 'Crime', 'Romance', 'Romantic Suspense', 'Self Service', 'Custom Stores'], 'authors': ['David Dante Troutt'], 'title': 'The Importance of Being Dangerous', 'isbn13': '9780060789299', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060789298', 'isbn10': '0060789298'}}