{'book': {'publisher': 'Ecco', 'synopsis': '<p>A tribute to the brilliant craftsmanship of one of our most distinguished writers, providing valuable insight into her inspiration and her method</p><br/><p> Joyce Carol Oates is widely regarded as one of America\'s greatest contemporary literary figures. Having written in a number of genres -- prose, poetry, personal and critical essays, as well as plays -- she is an artist ideally suited to answer essential questions about what makes a story striking, a novel come alive, a writer an artist as well as a craftsman.</p><br/><p> In The Faith of a Writer, Oates discusses the subjects most important to the narrative craft, touching on topics such as inspiration, memory, self-criticism, and "the unique power of the unconscious." On a more personal note, she speaks of childhood inspirations, offers advice to young writers, and discusses the wildly varying states of mind of a writer at work. Oates also pays homage to those she calls her "significant predecessors" and discusses the importance of reading in the life of a writer. </p><br/><p> Oates claims, "Inspiration and energy and even genius are rarely enough to make \'art\': for prose fiction is also a craft, and craft must be learned, whether by accident or design." In fourteen succinct chapters, The Faith of a Writer provides valuable lessons on how language, ideas, and experience are assembled to create art.</p>', 'language': 'en', 'image': 'https://images.isbndb.com/covers/55/34/9780060565534.jpg', 'title_long': 'The Faith of a Writer: Life, Craft, Art', 'edition': 'First Edition', 'dimensions': 'Height: 8 Inches, Length: 5.5 Inches, Weight: 0.38 Pounds, Width: 0.733516 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.733516}, 'weight': {'unit': 'pounds', 'value': 0.38}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 176, 'date_published': '2003', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Literature & Fiction', 'Essays & Correspondence', 'Essays', 'Reference', 'Words, Language & Grammar', 'Writing, Research & Publishing Guides', 'Publishing & Books', 'Writing', 'Research'], 'authors': ['Joyce Carol Oates'], 'title': 'The Faith of a Writer: Life, Craft, Art', 'isbn13': '9780060565534', 'msrp': 21.95, 'binding': 'Hardcover', 'isbn': '0060565535', 'isbn10': '0060565535'}}