{'book': {'publisher': 'Perennial', 'synopsis': 'One in three girls will be in a controlling, abusive dating relationship before she graduates from high school – from verbal or emotional abuse to sexual abuse or physical battering. Is your daughter in danger?<br/>Dr. Jill Murray speaks on the topic of dating violence at high schools around the country, reaching more than 10,000 students, teachers, and counsellors each year. In every school she visits, she is approached by teenage girls in miserable relationships who, when confronted with the option of breaking up with the boy, exclaim, "But I love him!"<br/>Many young women – and their parents, aren\'t even aware of the indications of a potentially abusive relationship. What\'s most alarming is that these warning signs are also some of the behaviours that girls find most flattering:<br/>A boy pages and calls a girl often – but as a form of control, not affection.<br/>He wants to spend all his time with her, but eventually won\'t allow her to spend time with her friends.<br/>He says "I love you" very early in the relationship.<br/>These behaviours can escalate into blaming, isolating, manipulating, threatening, humiliation, and sexual and physical abuse.<br/>In But I Love Him, Dr. Murray identifies these controlling, abusive patterns of behaviour and helps you get your daughter out of the relationship without alienating her. You will learn what draws her to this type of relationship, why she has a hard time talking to you about it, the special barriers teens face when breaking off a relationship, and what\'s going on in the mind of a teen abuser. Dr. Murray will help you show your teen what a respectful relationship looks like, and teach her the importance of respecting herself. edition.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/72/92/9780060957292.jpg', 'title_long': 'But I Love Him: Protecting Your Teen Daughter from Controlling, Abusive Dating Relationships', 'edition': '1', 'dimensions': 'Height: 0.52 Inches, Length: 8.08 Inches, Weight: 0.39242282636 Pounds, Width: 5.36 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.08}, 'width': {'unit': 'inches', 'value': 5.36}, 'weight': {'unit': 'pounds', 'value': 0.39242282636}, 'height': {'unit': 'inches', 'value': 0.52}}, 'pages': 208, 'date_published': '2001-08-30', 'subjects': ['Self-Help', 'Relationships', 'Interpersonal Relations', 'Abuse', 'Health, Fitness & Dieting', 'Psychology & Counseling', 'Adolescent Psychology', 'Parenting & Relationships', 'Parenting', 'Teenagers', 'Parenting Girls', 'Reference', 'Politics & Social Sciences', "Women's Studies"], 'authors': ['Jill Murray'], 'title': 'But I Love Him: Protecting Your Teen Daughter from Controlling, Abusive Dating Relationships', 'isbn13': '9780060957292', 'msrp': 10.81, 'binding': 'Paperback', 'related': {'ePub': '0061739820'}, 'isbn': '0060957298', 'isbn10': '0060957298', 'other_isbns': [{'isbn': '9780061739828', 'binding': 'print'}]}}