{'book': {'publisher': 'HarperCol', 'synopsis': 'It is 1947 and Israel Levis, a Cuban composer whose life had once been a dream of music, love and sadness, is returning to Habana, Cuba, from Spain, where he has just recovered from the physical and spiritual malaise resulting from his experiences in Paris, then Buchenwald, during the Nazi occupation of France. (A devout Catholic, Levis had been mistakenly identified as a Jew because of his name.)<br/>When Levis arrives back in Habana, after an absence of many years, his mind is reeling with beautiful memories of his life in Cuba and in Paris before the war, a life of pleasure and excitement that he owes, in part, to an unrequited, nearly "chivalrous" romance with a certain Rita Valladares, a singer for whom Levis had written his most famous song, "Rosas Puras," or "Pretty Roses." This 1928 composition becomes the most famous rumba in the world and changes both American and European tastes in music and dance -- forever; and it is the song, symbolic of the composer\'s love for Rita Valladares, that sets Levis\'s life in Europe in motion.<br/>This is at once a love story -- for art, family and country -- as well as a portrait of Habana at the turn of the last century, when "the world was good." A Simple Habana Melody is a virtuoso performance from one of our most important writers.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/56/96/9780060175696.jpg', 'title_long': 'A Simple Habana Melody: (from when the world was good)', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6.12 Inches, Weight: 1.4 Pounds, Width: 1.13 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.12}, 'width': {'unit': 'inches', 'value': 1.13}, 'weight': {'unit': 'pounds', 'value': 1.4}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 352, 'date_published': '2002-05-28', 'subjects': ['Literature & Fiction'], 'authors': ['Oscar Hijuelos'], 'title': 'A Simple Habana Melody: (from when the world was good)', 'isbn13': '9780060175696', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060175699', 'isbn10': '0060175699'}}