{'book': {'publisher': 'William Morrow', 'synopsis': 'New York Times Notable Book of the Year author Deborah Crombie has garnered tremendous praise -- and has been nominated for virtually every major mystery award -- for her piercing police procedurals featuring Scotland Yard detectives Duncan Kincaid and Gemma James, who are personally and professionally entwined. Now Gemma takes center stage when a lethal crime of passion turns a recreational trip to Scotland into pure bloody business.<br/>Though her reputation for delving into the heart of murder is matched only by that of her former partner and current lover, Duncan Kincaid, newly appointed Detective Inspector Gemma James has never thought to question her friend Hazel Cavendish about her past. So it is quite a shock when Gemma learns that their holiday retreat to a hotel in the Scottish Highlands is, in fact, a homecoming for native daughter Hazel -- and an event that has provoked strong reactions from the small community. Something is definitely amiss -- and that something is quite possibly Donald Brodie, the charming if intense Scotsman who is a guest as well.<br/>The truth comes out before long: Hazel and Brodie were once lovers, despite a vicious, long-standing feud between their families, rival local distillers of fine whisky. Their affair was fierce and passionate, and its fire might not have burned out completely. Certainly Brodie, now the domineering head of the family business, believes his "Juliet" still belongs to him alone -- and he\'s prepared to destroy Hazel\'s English marriage to make it so.<br/>A brutal murder puts Hazel\'s very life in peril when she\'s arrested for the crime. Hazel is the logical suspect, but Gemma knows nothing is simple in this place of secrets and long-seething hatreds. As even more damning evidence piles up against the friend Gemma never truly knew, the investigation into Hazel and Brodie\'s history begins to take darker, more sinister and tumultuous turns. Gemma knows she will need assistance to unravel this bloody knot -- and so she calls the one man she trusts more than any other, Duncan Kincaid, to join her far from home . . . and in harm\'s way.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/52/31/9780060525231.jpg', 'title_long': 'Now May You Weep: A Novel', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.35 Pounds, Width: 1.21 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.21}, 'weight': {'unit': 'pounds', 'value': 1.35}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 384, 'date_published': '2003-10-07', 'subjects': ['Literature & Fiction', 'Genre Fiction', "Women's Fiction", 'Mystery, Thriller & Suspense', 'Mystery', 'Police Procedurals', 'Traditional Detectives', 'Women Sleuths', 'International Mystery & Crime', 'Amateur Sleuths'], 'authors': ['Deborah Crombie'], 'title': 'Now May You Weep: A Novel', 'isbn13': '9780060525231', 'msrp': 23.95, 'binding': 'Hardcover', 'isbn': '0060525231', 'isbn10': '0060525231'}}