{"book": {"publisher": "Harper", "synopsis": "For months he’d thought of her as the Mystery Woman, draped in a black velvet cloak, with outrageous red curls, flawless skin, and carrying a large, odd case — but the night David Dodd saw a helicopter drop a chunk of metal through the roof of his lovely neighbor’s bedroom, he got to meet the formidable and delightful Katherine Finn at last! Rescuing damsels and fixing roofs was dangerous work, he told her, and at the very least he deserved a kiss — didn’t he?<br/>Kate couldn’t argue with Dave’s logic, but how could she, the driven concert musician with more commitments than hours in the day, be falling head over heels for a likeable cuddler who seemed to be drifting through life? No one had ever made her feel as cherished or desirable, and she’d never had so much fun, but even though her eccentric boarder, Elsie, assured her that where Kate was concerned Dave had plenty of ambition, could she really love a guy who was just smart, sexy and rich?", "language": "en", "image": "https: //images.isbndb.com/covers/88/53/9780060598853.jpg", "title_long": "Back to the Bedroom", "edition": "First Edition", "dimensions": "Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.3 Pounds, Width: 0.64 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 4.19}, "width": {"unit": "inches", "value": 0.64}, "weight": {"unit": "pounds", "value": 0.3}, "height": {"unit": "inches", "value": 6.75}}, "pages": 256, "date_published": "2014-02-25", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Political', 'Feel-Good', 'Humor & Satire', 'Humorous', 'Contemporary', 'Mystery, Thriller & Suspense', 'Mystery', 'Romance', 'Romantic Comedy', 'Self Service', 'Custom Stores'], 'authors": ["Janet Evanovich'], 'title": "Back to the Bedroom", "isbn13": "9780060598853", "msrp": 7.99, "binding": "Mass Market Paperback", "related": {"Kindle Edition": "0061797553", "ePub": "0061797553"}, "isbn": "0060598859", "isbn10": "0060598859", "other_isbns": [{'isbn": "9780061797552", "binding": "print"}]}}