{'book': {'publisher': 'HarperOne', 'synopsis': '"Dr. Morse, what are near death experiences good for, anyway?"<br/>This question, asked by a young patient, sent a curious medical doctor down a path of discovery to investigate the many aspects of this most intriguing subject.<br/>Is there proof that "near death" and other spiritual experiences can cure afflictions of the body, mind, and spirit?<br/>Are there simple ways to tap into a "universal power source" that spiritual masters call enlightenment?<br/>Is there scientific evidence of life after death that is being overlooked by skeptics?<br/>Is there scientific proof of a "God Module," a spot in our brains that communicates with God and the universe?<br/>Melvin Morse believes the answer to all these questions is yes. He presents his research in a clear and methodical book that sheds new light on the links between science and mysticism.<br/>Where God Lives not only reveals the area of the brain that is our biological link to the universe, it shows us the secret of tapping into the universal energy to achieve healing, personal peace, and transcendence. In Where God Lives, Morse reveals his own experiences of the divine. By observing and interviewing hundreds of children who have had near death experiences, he was able to cure his own life-threatening disease with the spiritual lessons he learned.<br/>Filled with moving case histories, Where God Lives applies the rigor of science to the study of the spiritual and concludes that here is an unseen-but not unreachable-power that guides us all.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/50/47/9780060175047.jpg', 'title_long': 'Where God Lives: The Science of the Paranormal and How Our Brains are Linked to the Universe', 'edition': '1', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.85 Pounds, Width: 0.82 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.82}, 'weight': {'unit': 'pounds', 'value': 0.85}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 208, 'date_published': '2000-09-05', 'subjects': ['Self-Help', 'Personal Transformation', 'Religion & Spirituality', 'New Age & Spirituality', 'Mysticism', 'Spiritualism', 'Occult & Paranormal', 'Ghosts & Hauntings', 'Parapsychology', 'Supernatural', 'Other Religions, Practices & Sacred Texts', 'Religious Studies', 'Science & Religion'], 'authors': ['Melvin Morse', 'Paul Perry'], 'title': 'Where God Lives: The Science of the Paranormal and How Our Brains are Linked to the Universe', 'isbn13': '9780060175047', 'msrp': 22, 'binding': 'Hardcover', 'isbn': '0060175044', 'isbn10': '0060175044'}}