{'book': {'publisher': 'Avon', 'synopsis': "The incomparable USA Today bestseller Samanth James cordially invites you to Regency England for a Sterling affair . . .<br/>Perfectly Marvelous<br/>Devon St. James must surely be dreaming! She closes her eyes in London's poorest slum, and awakens wrapped in fine linens . . . staring into the eyes of the most gorgeous man she has ever seen! Sebastian Sterling, marquess of Thurston, is clearly shocked to have a girl from the streets in his bed, though the heat of the desire burning in his gaze is unmistakable. But if he believes Devon will easily submit, he is quite mistaken!<br/>What the devil has he done? It's bad enough their family is already mired in scandal, now Sebastian has to deal with the exquisite young beauty in rags he had impetuously carried into his home! Worse still, the lady is driving the serious, responsible marquess to distraction with her fiery spirit and breathtaking sensuality. But perhaps, just perhaps, with some of Sebastian's private schooling, this low-born enchantress can learn refinement and manners—and be miraculously transformed from merely his passionate obsession into . . .<br/>A Perfect Bride", 'language': 'en', 'image': 'https://images.isbndb.com/covers/66/17/9780060006617.jpg', 'title_long': 'A Perfect Bride (Avon Historical Romance)', 'edition': '3rd Revised edition', 'dimensions': 'Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.4 Pounds, Width: 0.96 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 0.96}, 'weight': {'unit': 'pounds', 'value': 0.4}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 384, 'date_published': '2004-07-27', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Romance', 'Historical', 'Victorian', '20th Century', 'Regency'], 'authors': ['Samantha James'], 'title': 'A Perfect Bride (Avon Historical Romance)', 'isbn13': '9780060006617', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'related': {'Kindle Edition': '0061794929', 'ePub': '0061794929'}, 'isbn': '0060006617', 'isbn10': '0060006617', 'other_isbns': [{'isbn': '9780061794926', 'binding': 'print'}]}}