{'book': {'publisher': 'William Morrow', 'synopsis': "Aiden Page wanted only to escape. The CFO of a bank deep in debt and under investigation by the Department of Justice, Aiden saw his chance and took it, leaving behind his family, his creditors, and his persecutors by convincing them of his death. He succeeds in his deception until one night when, tortured by guilt and loneliness, he places a call to his teenage daughter, Morgan. He only utters a single word, but like a solitary ripple spreading across the water, it is enough to convince Morgan that her father is still alive.<br/>Determined to be reunited with her father and confident that she knows where he might be going, Morgan sets out on an ambitious and dangerous journey to a small Pacific island. With little money, no driver's license, and no passport, Morgan attempts to reach her destination by sailboat, prepared to fight through hostile waters, and hostile men, if it means finding her father.<br/>But Morgan isn't the only one searching for Aiden. The same people who engineered his company's collapse know that he is the only man who can uncover a conspiracy that could destroy far more than one bank or a single life. The group is unconstrained by morality, undeterred by mercy, and it will do anything in its power, including using Morgan as a pawn, if it ensures that Aiden Page remains a corpse. Now Aiden must solve the mystery behind his exile if he hopes to save not just his own life but his daughter's as well. Before his race is over, he will discover that thousands of lives may depend upon the actions of a dead man.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/16/90/9780060081690.jpg', 'title_long': 'The Ripple Effect: A Novel of Suspense', 'edition': 'First American Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.1984160358 Pounds, Width: 1.29 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.29}, 'weight': {'unit': 'pounds', 'value': 0.1984160358}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 416, 'date_published': '2004-01-01', 'subjects': ['Literature & Fiction', 'Action & Adventure', "Men's Adventure", 'Mystery, Thriller & Suspense', 'Thrillers & Suspense'], 'authors': ['Paul Garrison'], 'title': 'The Ripple Effect: A Novel of Suspense', 'isbn13': '9780060081690', 'msrp': 1.99, 'binding': 'Hardcover', 'isbn': '0060081694', 'isbn10': '0060081694'}}