{"book": {"publisher": "William Morrow Paperbacks", "synopsis": "New York Times bestselling authors including Karin Slaughter, Lee Child, Peter Robinson, Laura Lippman, John Connolly, and others, combine their talents to deliver a brilliant tour-de-force in this clever suspense novel that revolves around one object—a charm bracelet—and the harrowing circumstances that plague the unlucky people who come into contact with it.<br/>Linked by a glittering charm bracelet that brings misfortune to everyone who handles it, Like a Charm is a novel in sixteen chilling parts written by the cream of US and UK crime writers. From nineteenth-century Georgia, where the bracelet is forged in fire, to wartime Leeds, a steam train across Europe, the violent backstreets of 1980s Scotland, present-day London, a Manhattan taxi, the Mojave Desert and back to Georgia, each writer weaves a gripping story of murder, betrayal and intrigue.<br/>A must-have collection for fans of suspense fiction, Like a Charm is a mesmerizing, masterful story that makes for compulsive, just-one-more-chapter reading.", "language": "en", "image": "https: //images.isbndb.com/covers/33/16/9780060583316.jpg", "title_long": "Like a Charm: A Novel in Voices", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 0.65 Pounds, Width: 0.86 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 0.86}, "weight": {"unit": "pounds", "value": 0.65}, "height": {"unit": "inches", "value": 8}}, "pages": 384, "date_published": "2015-05-26", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Short Stories & Anthologies', 'Anthologies', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Thrillers & Suspense', 'Suspense', 'Crime', 'Self Service', 'Custom Stores'], 'authors": ["Karin Slaughter'], 'title": "Like a Charm: A Novel in Voices", "isbn13": "9780060583316", "msrp": 13.95, 'binding": "Paperback", "isbn": "0060583312", "isbn10": "0060583312"}}