{'book': {'publisher': 'Harper Paperbacks', 'synopsis': 'The compulsively readable and sinfully gossipy tale of five Hollywood personal assistants who band together to turn the tables on their celebrity employers—written by a former personal assistant to a star.<br/>In this wicked, laugh-out-loud debut novel, five miserable souls struggle to make their mark on Hollywood, the city of the soulless.<br/>Rachel, a starry-eyed and clueless Texas transplant accepts a position as assistant to an aging television diva. Michaela has spent years on the casting couch, and the last pilot she almost got, a decade ago, went to that little nobody, Lisa Kudrow. Jeb has been fired from more assistant jobs than he cares to count, and he currently teeters on the edge of insanity under one of the sleaziest agents in Hollywood. Griffin assists a crass A-list manager who has a tanning bed in his office. Kecia, a no-nonsense Pisces pining for love and Krispy Kremes, works for a hot teen heartthrob who is always looking for the next good party—until his ex-con brother shows up at the front door.<br/>Once a week, the assistants meet to commiserate. When the system spits them out, they must learn to succeed through sheer determination, hard-won industry savvy, and luck.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/38/73/9780060723873.jpg', 'title_long': 'The Assistants: A Novel', 'edition': 'Reprint', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.95 Pounds, Width: 0.76 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.76}, 'weight': {'unit': 'pounds', 'value': 0.95}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 304, 'date_published': '2005', 'subjects': ['Literature & Fiction', 'United States', 'Humor', 'Humor & Satire', 'Humorous'], 'authors': ['Robin Lynn Williams'], 'title': 'The Assistants: A Novel', 'isbn13': '9780060723873', 'msrp': 14.95, 'binding': 'Paperback', 'related': {'ePub': '0061738204'}, 'isbn': '0060723874', 'isbn10': '0060723874', 'other_isbns': [{'isbn': '9780061738203', 'binding': 'print'}]}}