{"book": {"publisher": "Harper Perennial", "synopsis": ""Clive Barker\"s career has been building up to The Great and Secret Show. . . . A cross between Gravity\"s Rainbow and J.R.R. Tolkein\'s Lord of the Rings, allusive and mythic, complex and entertaining. Extravagantly metaphorical, wildly symbolic.' — New York Times<br/>In the little town of Palomo Grove, two great armies are amassing; forces shaped from the hearts and souls of America. In this New York Times bestseller, master storyteller Clive Barker unveils one of the most ambitious imaginative landscapes in modern fiction and an intricately woven and meticulously constructed epic where past and future meet.<br/>The Art, the greatest power known to humankind, is the focus of struggle between the evil spirit, Jaff, and a force for light, Fletcher. Jaffe hopes to tap into The Art\'s power while Fletcher wants to prevent it from being tainted. The conflict between the two men spills into the real world in a decades-long feud, distorting reality and affecting the entire human race.<br/>Carrying its readers from the first stirring of consciousness to a vision of the end of the world, The Great and Secret Show is a breathtaking journey in the company of a master storyteller.', 'language": "en", "image": "https: //images.isbndb.com/covers/31/66/9780060933166.jpg", "title_long": "The Great and Secret Show", "edition": "1 HARPER", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 1.15 Pounds, Width: 1.51 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 1.51}, "weight": {"unit": "pounds", "value": 1.15}, "height": {"unit": "inches", "value": 8}}, "pages": 672, "date_published": "1999-11-03", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Horror', 'Metaphysical & Visionary', 'Contemporary', 'Literary', 'Science Fiction & Fantasy', 'Fantasy', 'Myths & Legends', 'Science Fiction', 'Self Service', 'Custom Stores'], 'authors": ["Clive Barker'], 'title": "The Great and Secret Show", "isbn13": "9780060933166", "msrp": 18.99, "binding": "Paperback", "related": {"ePub": "0061760293"}, "isbn": "006093316X", "isbn10": "006093316X", "other_isbns": [{'isbn": "9780061760297", "binding": "print"}]}}