{'book': {'publisher': 'Ecco', 'synopsis': '<p>From one of the subcontinent’s most important and controversial writers comes this definitive history of post-Partition India, published on the 60th anniversary of Independence<br><br>Told in lucid and beautiful prose, the story of India’s wild ride toward and since Independence is a riveting one. Taking full advantage of the dramatic details of the protests and conflicts that helped shape the nation, politically, socially, and economically, Guha writes of the factors and processes that have kept the country together, and kept it democratic, defying the numerous prophets of doom.</p><br/><p>Moving between history and biography, this story provides fresh insights into the lives and public careers of those legendary and long-serving Prime Ministers, Jawaharlal Nehru and his daughter, Indira Gandhi. Guha includes vivid sketches of the major “provincial” leaders, but also writes with feeling and sensitivity about lesser-known Indians—peasants, tribals, women, workers, and Untouchables.</p><br/><p>Massively researched and elegantly written, this is the work of a major scholar at the height of his powers, a brilliant and definitive history of what is possibly the most important, occasionally the most exasperating, and certainly the most interesting country in the world.</p>', 'language': 'en', 'image': 'https://images.isbndb.com/covers/88/17/9780060198817.jpg', 'title_long': "India After Gandhi: The History of the World's Largest Democracy", 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 2.6 Pounds, Width: 1.97279 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.97279}, 'weight': {'unit': 'pounds', 'value': 2.6}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 912, 'date_published': '2007', 'subjects': ['Biographies & Memoirs', 'Historical', 'History', 'Asia', 'India', 'World', 'Politics & Social Sciences', 'Politics & Government', 'Ideologies & Doctrines'], 'authors': ['Ramachandra Guha'], 'title': "India After Gandhi: The History of the World's Largest Democracy", 'isbn13': '9780060198817', 'msrp': 34.95, 'binding': 'Hardcover', 'isbn': '0060198818', 'isbn10': '0060198818'}}