{'book': {'publisher': 'Avon', 'synopsis': "Headstrong American heiress Lillian Bowman has come to England to find an aristocratic husband. Unfortunately, no man is strong enough to tame the stubborn beauty's fierce will. Except, perhaps, the powerful and arrogant Earl of Westcliff—a man Lillian despises more than anyone she's ever met.<br/>Marcus, Lord Westcliff, is famous for his icy English reserve and his supreme self-control. But something about the audacious Lillian drives him mad. Whenever they're in the same room, they can't stop themselves from battling furiously to gain the upper hand.<br/>Then one afternoon, a stunningly sensuous encounter changes everything . . . and Lillian discovers that beneath the earl's reserved façade, he is the passionate and tender lover of her dreams. What neither Westcliff nor Lillian suspect, however, is that a sinister conspiracy threatens to destroy any chance of happiness. After a shocking betrayal endangers Lillian's safety—and possibly her life—will Marcus be able to save her before it's too late?", 'language': 'en', 'image': 'https://images.isbndb.com/covers/24/96/9780060562496.jpg', 'title_long': 'It Happened One Autumn', 'edition': 'First Avon Books Paperback Printing Edition', 'dimensions': 'Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.43 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.43}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 391, 'date_published': '2005-09-27', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'Feel-Good', 'United States', 'Romance', 'Victorian', 'Regency', 'Romantic Comedy'], 'authors': ['Lisa Kleypas'], 'title': 'It Happened One Autumn', 'isbn13': '9780060562496', 'msrp': 5.99, 'binding': 'Mass Market Paperback', 'related': {'ePub': '0061793191'}, 'isbn': '0060562498', 'isbn10': '0060562498', 'other_isbns': [{'isbn': '9780061793196', 'binding': 'print'}, {'isbn': '9780063204836', 'binding': 'printisbncanonical'}]}}