{'book': {'publisher': 'Amistad', 'synopsis': 'Emily Bernard examines the complexities of interracial friendships -- white and black, Latino and white, black and Asian, black and Jewish -- in this poignant book that includes essays from Pam Houston, Darryl Pinckney, Luis Rodriguez, and Susan Straight, among others. Meet a young Italian American heading off to college, the first in his family to do so -- where he rooms with and befriends a sophisticated young black man from a highly educated, socially prominent Washington, D.C., family. Meet a second-generation Korean American "from the \'hood" who is more comfortable with Latinos and blacks than with Korean kids who grew up in the suburbs, and compares his friendships to bi-bam-bap, a Korean dish of "all different vegetables, meats, rice, hot sauce mixed in together like crazy." Meet a black man who reflects on a twenty-year friendship with a Jewish man he met in school and with whom he can talk about absolutely everything, except perhaps the politics of the Middle East. A book that celebrates interracial friendships as it examines them, Some of My Best Friends is a timely look at a subject that has yet to be fully explored.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/27/65/9780060082765.jpg', 'title_long': 'Some of My Best Friends: Writings on Interracial Friendships', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.85 Pounds, Width: 0.85 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.85}, 'weight': {'unit': 'pounds', 'value': 0.85}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 240, 'date_published': '2004-08-03', 'subjects': ['Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies', 'Sociology', 'Race Relations'], 'authors': ['Emily Bernard'], 'title': 'Some of My Best Friends: Writings on Interracial Friendships', 'isbn13': '9780060082765', 'msrp': 23.95, 'binding': 'Hardcover', 'isbn': '0060082763', 'isbn10': '0060082763'}}