{"book": {"publisher": "HarperEntertainment", "synopsis": "The Chronicles of Narnia: The Lion, the Witch and the Wardrobe is now a major motion picture from Walt Disney Pictures and Walden Media. "Like his fellow genius, Tolkien, C. S. Lewis has redefined the nature of fantasy, adding richness, beauty, and dimension.... In our times, every fantasy realm must be measured in comparison with Narnia." -Lloyd Alexander. Journeys to the end of the world, fantastic creatures and epic battles between good and evil -- the book that has it all is The Lion, the Witch and the Wardrobe, written in 1949 by C. S. Lewis. But Lewis did not stop there. Six more books followed, and together they became known as The Chronicles of Narnia. For over fifty years, The Chronicles of Narnia have transcended the fantasy genre to become part of the canon of classic literature. Each of the seven books is a masterpiece, drawing the reader into a land where magic meets reality, and the result is a fictional world whose scope has fascinated generations. This edition presents all seven books -- unabridged -- in one impressive volume.", 'language": "en", "image": "https: //images.isbndb.com/covers/54/53/9780060765453.jpg", "title_long": "The Chronicles of Narnia", "edition": "F First Edition Thus", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 2.3 Pounds, Width: 1.92 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1.92}, "weight": {"unit": "pounds", "value": 2.3}, "height": {"unit": "inches", "value": 9}}, "pages": 768, "date_published": "2005-11-01", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'TV, Movie, Video Game Adaptations', 'Action & Adventure', 'Fantasy', 'Contemporary', 'Science Fiction & Fantasy', 'Epic', 'Teen & Young Adult'], 'authors": ["C. S. Lewis'], 'title": "The Chronicles of Narnia", "isbn13": "9780060765453", "msrp": 21.99, 'binding": "Paperback", "isbn": "0060765453", "isbn10": "0060765453"}}