{'book': {'publisher': 'Harper Voyager', 'synopsis': "Acclaimed fantasy author Dave Duncan returns to Chivial and the dashing King's Blades -- the greatest swordsmen in the world -- with a new epic adventure of sword fights, magic, romance, and a Blade unlike any other.<br/>Sir Wolf is not your typical King's Blade. Sure, he's smart, athletic, a good dresser, and a phenomenal swordsman. But he hasn't been named the King's Killer for nothing, and after years of dark secrets and painful loyalties to a king he cannot respect, all he wants is to be left alone.<br/>But when unknown assailants storm a royal fortress and carry off a former royal mistress, Wolf is dispatched posthaste to investigate. Who were these strangers, what were their motives, and who -- or what -- was their sinister cat-faced leader? Burdened by the need to comfort his impetuous younger brother, Sir Lynx -- the only Blade ever to lose his ward and live -- and shadowed by a secretive Inquisitor with her own agenda, Wolf struggles to solve a mystery that threatens the kingdom of Chivial itself. His quest will lead him into lands of danger and discovery unlike any the Blades have ever seen, and to an answer beyond his wildest nightmares.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/51/15/9780060555115.jpg', 'title_long': "The Jaguar Knights: A Chronicle of the King's Blades", 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.5 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.5}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 400, 'date_published': '2004-09-28', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'Action & Adventure', 'Fantasy', 'Science Fiction & Fantasy', 'Epic', 'Science Fiction', 'Adventure'], 'authors': ['Dave Duncan'], 'title': "The Jaguar Knights: A Chronicle of the King's Blades", 'isbn13': '9780060555115', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060555114', 'isbn10': '0060555114'}}