{'book': {'publisher': 'perennial Library', 'synopsis': 'This unusual self-help book about surviving grief offers the reader comfort and inspiration. Each of us will face some loss, sorrow and disappointment in our lives, and The Courage to Grieve provides the specific help we need to enable us to face our grief fully and to recover and grow from the experience. Although the book emphasizes the response to the death of a loved one, The Courage to Grieve can help with every kind of loss and grief.<br/>Judy Tatelbaum gives us a fresh look at understanding grief, showing us that grief is a natural, inevitable human experience, including all the unexpected, intense and uncomfortable emotions like sorrow, guilt, loneliness, resentment, confusion, or even the temporary loss of the will to live. The emphasis is to clarify and offer help, and the tone is spiritual, optimistic, creative and easy to understand. Judy Tatelbaum provides excellent advice on how to help oneself and others get through the immediate experience of death and the grief that follows, as well as how to understand the special grief of children. Particularly useful are the techniques for completing or "finishing" grief--counteracting the popular misconception that grief never ends. The Courage to Grieve shows us how to live life with the ultimate courage: not fearing death. This book is about so much more than death and grieving it is about life and joy and growth.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/18/50/9780060911850.jpg', 'title_long': 'The Courage to Grieve', 'edition': 'First Edition', 'dimensions': 'Weight: 0.35 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 0.35}}, 'pages': 177, 'date_published': '1980', 'subjects': ['Self-Help', 'Death & Grief', 'Grief & Bereavement', 'Relationships', 'Love & Loss', 'Parenting & Relationships'], 'authors': ['Judy Tatelbaum'], 'title': 'The Courage to Grieve', 'isbn13': '9780060911850', 'msrp': 13.99, 'binding': 'Paperback', 'related': {'ePub': '006187311X'}, 'isbn': '0060911859', 'isbn10': '0060911859', 'other_isbns': [{'isbn': '9780061873119', 'binding': 'print'}]}}