{'book': {'publisher': 'William Morrow', 'synopsis': 'On November 22, 1963, a murder was committed in Dallas, Texas. The victim happened to be the president of the United States. More than forty years later, the case remains unsolved.<br/>Nearly 80 percent of the American people don\'t believe that John F. Kennedy was killed by a lone gunman, and the House Assassinations Committee has found that the president was "assassinated as the result of a conspiracy." Yet the conspirators have never been identified or brought to justice. Until now.<br/>And once you read this book, you\'ll know who killed JFK.<br/>A Simple Act of Murder is the investigation that this case should have had from the beginning. America\'s most famous detective, Mark Fuhrman -- who has cracked some of the best-known and most puzzling crimes in American history -- cuts through the myths and misinformation to focus on the hard evidence. He examines the ballistics and medical records, scrutinizes photographs from the crime scene and the famous Zapruder film, and weighs the testimony of hundreds of witnesses.<br/>Filled with vivid photos, informative diagrams, and original drawings by Fuhrman himself that show the evidence in a new light and make complex forensic matters clear and easily understood, this book is the visual record of the JFK assassination.<br/>In this gripping and highly personal account, Fuhrman unveils a major clue that had been ignored for forty years -- a breakthrough that will change the debate over the assassination. Overturning accepted notions about the way the murder occurred, A Simple Act of Murder answers many questions that have plagued the American people ever since that fateful day in Dallas:<br/>Was Lee Harvey Oswald the lone gunman, or was there a conspiracy?<br/>Could the Magic Bullet have done everything the Warren Commission claimed it did?<br/>What evidence was planted, suppressed, or destroyed?<br/>What crucial piece of evidence was missed by all the government investigations, and even the independent researchers?<br/>And, finally, who killed JFK?<br/>The answers may surprise you.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/15/41/9780060721541.jpg', 'title_long': 'A Simple Act of Murder: November 22, 1963', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6.25 Inches, Weight: 1.05 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.05}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 240, 'date_published': '2006-05-02', 'subjects': ['Biographies & Memoirs', 'True Crime', 'Murder & Mayhem', 'History', 'Americas', 'United States', 'Law', 'Criminal Law', 'Evidence'], 'authors': ['Mark Fuhrman'], 'title': 'A Simple Act of Murder: November 22, 1963', 'isbn13': '9780060721541', 'msrp': 1.99, 'binding': 'Hardcover', 'isbn': '0060721545', 'isbn10': '0060721545'}}