{'book': {'publisher': 'William Morrow Cookbooks', 'synopsis': "What if you could improve your health by eating a luscious espresso cinnamon cheesecake, a delicious key lime tart, or tantalizing chocolate truffles?Well, now you can! Soy Desserts is the first cookbook exclusively devoted to desserts made with tofu, soy chocolate, soy milk, soy yogurt, and soy cheeses. In its pages you'll learn how to make and enjoy such delights as Raspberry Marble Tofu Cheesecake, Soynut Pecan Pie, Tofu Coconut Cream Pie, and Lemon Ginger Soy Ice Cream.Lauded as a miracle food, soy is renowned for lowering the risk of breast cancer and heart disease, easing the symptoms of menopause, protecting against prostate cancer, and preventing digestive disorders. Additionally, soy provides the highest levels of protein available from a plant source, is an ideal source of complex carbohydrates, and is naturally low in sodium. Patricia Greenberg explains the many healthful benefits of soy and reveals how even the most decadent of desserts can be turned into a healthy treat using nature's healthiest bean.Soy Desserts shows how you can indulge in rich, sweet treats like Tofu Chocolate Almond Mousse, Soy Chocolate Raspberry Brownies, and Four-Layer Soy Yellow Cherry Cake with Soy Chocolate Cream Cheese Frosting and still maintain a healthy diet. It also includes helpful sections on buying, storing, and baking with soy products and getting the best nutrition from soy. Whether you're vegetarian, vegan, diabetic, lactose -intolerant, or just someone who wants to prepare tasty, health-promoting desserts, this is the cookbook for you.Soy Desserts includes mouthwatering recipes for: Tasty Pies and Tarts Scrumptious Cakes and Frostings Delicious Quickbreads, Muffins, Brownies, Bars, and Scones Irresistible Candies and Cookies Delightful Parfaits, Custards, Mousses, Puddings, and Soy Ice Creams", 'language': 'en', 'image': 'https://images.isbndb.com/covers/39/46/9780060393946.jpg', 'title_long': 'Soy Desserts: Fresh, Fun, & Fabulously Healthy Recipes', 'edition': 'First Edition', 'dimensions': 'Height: 9.5 Inches, Length: 7.75 Inches, Weight: 1.2 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.75}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 1.2}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 176, 'date_published': '2000-10-17', 'subjects': ['Cookbooks, Food & Wine', 'Cooking by Ingredient', 'Natural Foods', 'Special Diet', 'Desserts'], 'authors': ['Patricia Greenberg'], 'title': 'Soy Desserts: Fresh, Fun, & Fabulously Healthy Recipes', 'isbn13': '9780060393946', 'msrp': 25, 'binding': 'Hardcover', 'isbn': '0060393947', 'isbn10': '0060393947'}}