{"book": {"publisher": "Festival", "synopsis": "Frances Hodgson Burnett"s The Secret Garden delights in the wondrous discoveries of lonely Mary Lennox as she slowly helps bring an abandoned garden back to life. It also delights in good food and a robust appetite, and the health and strength they can bring. Written at a time when many children were going hungry and even starving, Burnett"s beloved story celebrates the magic of fresh air, new milk, homemade currant buns, and hearty, simple fare.<br/>Inside the pages of this cookbook are recipes for Mary"s favorite foods, in and out of the garden, from porridge to roasted potatoes and eggs, all inspired by The Secret Garden and all adapted by chef and culinary historian Amy Coder from traditional Victorian recipes. Ms. Coder has supplemented these simple, wholesome recipes with fascinating tidbits on Victorian foods and Victorian eating customs. The result is a scrumptious tribute to Burnett's classic novel, a fascinating glimpse into the cooking customs of a historical period that is now long past, and a step-by-step guide to making delicious, tasty treats to enjoy in your own secret garden.', 'language": "en", "image": "https: //images.isbndb.com/covers/74/06/9780060277406.jpg", "title_long": "The Secret Garden Cookbook: Recipes Inspired by Frances Hodgson Burnett"s THE SECRET GARDEN", 'edition": "First Edition", "dimensions": "Height: 9 Inches, Length: 7 Inches, Weight: 1.05 Pounds, Width: 0.707143 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7}, "width": {"unit": "inches", "value": 0.707143}, "weight": {"unit": "pounds", "value": 1.05}, "height": {"unit": "inches", "value": 9}}, "pages": 128, "date_published": "1999-03-19", "subjects": ["Children's Books', 'History', 'Europe', 'Classics', 'Children's Cookbooks'], 'authors": ["Amy Cotler'], 'title": "The Secret Garden Cookbook: Recipes Inspired by Frances Hodgson Burnett"s THE SECRET GARDEN", 'isbn13": "9780060277406", "msrp": 17.95, 'binding": "Hardcover", "isbn": "0060277408", "isbn10": "0060277408"}}