{'book': {'publisher': 'William Morrow', 'synopsis': "Combining myth, biography,<br/>and wit -- a highly original<br/>depiction of cutting-edge<br/>science -- told through the<br/>scientists who are rewriting<br/>life on earth<br/>While the future of human existence is literally being forged by today's genetic scientists and biotechnology leaders, the media, policymakers, ethicists, and fellow scientists alike have not been adequately communicating the tremendous potential that is contained in these individuals' work. With the public only vaguely aware of what is really happening, a new coterie of geniuses, tinkerers, tycoons, and genetic soothsayers are -- for better or worse -- about to alter life on earth forever.<br/>Now award-winning journalist David Ewing Duncan has written an insightful narrative about science and personality, delving into stem cell research, cloning, bioengineering, extending life span, and genetics by telling the stories of the characters at the fulcrum of the science. Calling to mind age-old stories and myths -- Prometheus, Faustus, Eve, and Frankenstein -- Duncan asks the question: Can we trust these scientists?<br/>Duncan has spent the last three years reporting on and studying these masterminds, from the co-solver of the DNA structure James Watson to a man who is creating synthetic life, Craig Venter. The Geneticist Who Played Hoops with My DNA tells their stories, revealing their quirky, fascinating, and sometimes vaguely unsettling personas as a way to understand their science and the implications of their work.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/73/88/9780060537388.jpg', 'title_long': 'The Geneticist Who Played Hoops with My DNA: . . . And Other Masterminds from the Frontiers of Biotech', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.15 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.15}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 288, 'date_published': '2005-05-10', 'subjects': ['Science & Math', 'Biological Sciences', 'Biotechnology', 'Evolution', 'Genetics', 'History & Philosophy'], 'authors': ['David Ewing Duncan'], 'title': 'The Geneticist Who Played Hoops with My DNA: . . . And Other Masterminds from the Frontiers of Biotech', 'isbn13': '9780060537388', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0060537388', 'isbn10': '0060537388'}}