{'book': {'publisher': 'Harper Business', 'synopsis': "Why suffer from your own business mistakes? Here's a lifesaving guide from a man who's made them all.<br/>The world of business is like the world's worst minefield: one wrong step in any direction and you're history. It's a lesson F. J. Lennon has learned over and over again, as his entrepreneurial career careened from snafu to snafu. But Lennon was different: from the beginning he kept a journal of the screwups, big and small, he watched himself and others make. And by monitoring his own learning curve he helped turn himself -- finally -- into a successful businessman.<br/>Every Mistake in the Book collects all the best lessons Lennon learned from his mistakes, pulling them together in a pithy, witty, and universally useful format. Whether you're a business owner, a manager, or a freshly minted graduate, Lennon's no-nonsense advice will enlighten you:<br/>Biz Basics: If you're contemplating a startup, here are essential lessons you won't learn in a classroom or read in a textbook.<br/>Money Matters: From venture capital to corporate debt, know the financial fundamentals or pay the price.<br/>How to Manage Managing: All managers are card-carrying members of the baby-sitters club. Learn what you should -- and definitely shouldn't -- do to the poor saps who call you boss.<br/>In the Trenches: Not everyone plays nice and you can't, either. Down-and-dirty advice for when the going gets tough.<br/>Let's Get Personal: Yes, it does matter how you act, speak, write, and dress. Here's how to get that little bit of polish -- or at least not alienate everyone around you.<br/>Often hysterical, always practical, this straight-from-the-hip handbook will educate and encourage everyone from the dot-com greenhorn to the established business professional.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/39/39/9780060393939.jpg', 'title_long': 'Every Mistake in the Book: A Business How-NOT-To', 'edition': '1', 'dimensions': 'Height: 8.25 Inches, Length: 6.25 Inches, Weight: 0.9 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 208, 'date_published': '2001-06-26', 'subjects': ['Business & Money', 'Business Culture', 'Ethics'], 'authors': ['F J Lennon'], 'title': 'Every Mistake in the Book: A Business How-NOT-To', 'isbn13': '9780060393939', 'msrp': 23, 'binding': 'Hardcover', 'isbn': '0060393939', 'isbn10': '0060393939'}}