{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': 'BESTSELLING BOOK<br/>In this inspirational guide, Wayne Dyer, the author of the phenomenal bestsellers Wisdom of the Ages, Pulling Your Own Strings, and Your Erroneous Zones, reveals seven beliefs central to working miracles in our everyday lives.<br/>When most of us think of magic, we picture a man in a black cape sawing a woman in half, or a sleight-of-hand card trick. But there\'s another kind of magic – real magic – that can enrich your life. According to Dyer, real magic means creating miracles in everyday life. Quitting smoking or drinking, achieving new Job success, or finding a happy relationship – these are all miracles because they transcend our perceived limitations. From "creating a miracle mind-set" and achieving change in the areas of personal health, prosperity, and fulfilling love relationships to believing in the magic of miracles on a global scale, Dyer shows us that miracles within our reach and within our own minds.<br/>In Real Magic, Dyer teaches us how to achieve a higher level of consciousness. He asks us to imagine what would make us happy, then offers specific strategies for attaining these goals. In every aspect of our individual lives – physical health, finances, intimate relationships, and personal identity – there is always room for a miracle or two. And with Dyer\'s help, each and every one of us can be a miracle worker.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/58/25/9780060935825.jpg', 'title_long': 'Real Magic: Creating Miracles in Everyday Life', 'edition': 'Reprint', 'dimensions': 'Height: 0.78 Inches, Length: 8.02 Inches, Weight: 0.50044933474 Pounds, Width: 5.31 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.02}, 'width': {'unit': 'inches', 'value': 5.31}, 'weight': {'unit': 'pounds', 'value': 0.50044933474}, 'height': {'unit': 'inches', 'value': 0.78}}, 'pages': 352, 'date_published': '2001-06', 'subjects': ['Self-Help', 'Motivational', 'Personal Transformation', 'Self-Esteem', 'Success', 'Health, Fitness & Dieting', 'Alternative Medicine', 'Meditation', 'Psychology & Counseling', 'Religion & Spirituality'], 'authors': ['Wayne W Dyer'], 'title': 'Real Magic: Creating Miracles in Everyday Life', 'isbn13': '9780060935825', 'msrp': 10.99, 'binding': 'Paperback', 'related': {'ePub': '0062013130'}, 'isbn': '0060935820', 'isbn10': '0060935820', 'other_isbns': [{'isbn': '9780062013132', 'binding': 'print'}]}}