{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': "The fourth book in the Detachment Delta series. When American missionaries are taken hostage by Algerian rebels, the call for a rescue comes to the most elite of military units––the Delta Force.<br/>With a presidential election approaching, Americans are living in fear of a terrorist attack, aimed at taking lives, influencing politics, disrupting the democratic process. General Darren Kragle, a legendary soldier, is at the heart of the effort to keep the election running smoothly.<br/>On the other side of the world, in tumultuous Algeria, Kragle's son Cameron, a former special forces soldier, has agreed to accompany a group of missionaries as added protection, but finds himself no match for a ruthless band of rebel kidnappers. But Cameron is just one son in the legendary family, and soon two of General Kragle's other military sons, Delta Force commandoes, are sent to Algeria––one to rescue Cameron and the other hostages, and the other to rescue a kidnapped American ally. A troubled nation's hopes for peace hang in the balance.<br/>The Kragles have given more than their fair share to the War on Terror and the fight for American freedom––having paid in blood, sweat and the lost lives of loved ones. And as General Kragle tries to prevent a catastrophic nuclear attack on American soil, an attack that has targeted the president himself, his courageous sons won't give up their battle until they are all three safe on friendly soil.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/22/02/9780060592202.jpg', 'title_long': 'Detachment Delta: Operation Aces Wild', 'edition': '4th edition', 'dimensions': 'Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.45 Pounds, Width: 1.08 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 1.08}, 'weight': {'unit': 'pounds', 'value': 0.45}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 432, 'date_published': '2004-12-28', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'War', 'Action & Adventure', 'Mystery, Thriller & Suspense', 'War & Military', 'United States', 'Contemporary', 'Thrillers & Suspense', 'Spies & Politics', 'Military'], 'authors': ['Charles W. Sasser'], 'title': 'Detachment Delta: Operation Aces Wild', 'isbn13': '9780060592202', 'msrp': 6.99, 'binding': 'Mass Market Paperback', 'isbn': '0060592206', 'isbn10': '0060592206'}}