{'book': {'publisher': 'Rayo', 'synopsis': 'The secret history of an empire<br/>The mythical power of a stone<br/>The quest to solve the legend of ... The Queen Jade<br/>For centuries, explorers and scholars of the New World have been captivated by a legend involving the tragic life of a King, a Witch, and a giant blue jade stone whose beauty is intoxicating -- a stone whose possessor is said to be granted a life filled with power -- that stone is called the Queen Jade.<br/>In 1998, Hurricane Mitch tears through Central and South America. A mine of blue jade the size of Rhode Island is uncovered in a Guatemalan mountain range known as Las Sierras de las Minas. For hundreds of years, blue jade relics have been found in the Americas, but the actual source of the precious stone has never been discovered -- until now. The revelation of the blue jade mine solves an archaeological mystery that has baffled scholars for centuries and gives hope to those who have staked their lives on finding the Queen Jade.<br/>The novel unfolds on the eve of the hurricane and centers on Lola Sanchez and her archaeologist mother, Juana. Juana believes that she has discovered the key to unlocking the mystery of the Queen Jade and has gone into the jungle alone to find the stone -- the same week that Hurricane Mitch ravages the land. When her mother disappears in the storm, Lola sets out to find her and embarks on a course of action that will lead to the adventure of her life.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/26/47/9780060582647.jpg', 'title_long': 'The Queen Jade: A Novel', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.3007273458 Pounds, Width: 1.13 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.13}, 'weight': {'unit': 'pounds', 'value': 1.3007273458}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 352, 'date_published': '2005-02-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'United States', 'Hispanic', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense', 'Science Fiction & Fantasy', 'Fantasy', 'Magical Realism'], 'authors': ['Yxta Maya Murray'], 'title': 'The Queen Jade: A Novel', 'isbn13': '9780060582647', 'msrp': 23.95, 'binding': 'Hardcover', 'isbn': '0060582642', 'isbn10': '0060582642'}}