{'book': {'publisher': 'Amistad', 'synopsis': 'Written by two former college athletes, Your Brain Is a Muscle Too is an essential guide to success in the classroom and on the play field for any student athlete.<br/>Taking readers through all the steps toward success for student athletes -- from obtaining athletic scholarships to finding the right sports agent -- Your Brain Is a Muscle Too should be mandatory reading for every student athlete. Insightful tips range from how to adapt to the intensity of the college environment to how to most effectively study for exams and how to avoid the pressures of drugs and alcohol. While this book is invaluable for all students, it is the first book that addresses the specific concerns of African -Americans in a college setting.<br/>Your Brain Is a Muscle Too offers guidance and heightens awareness in areas such as academics, interpersonal relations, money matters, time management, and the social transition from high school to college. It includes colorful anecdotes and candid advice, including contributions from Magic Johnson, Jimmy Jackson, and Kenny Smith.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/85/41/9780060198541.jpg', 'title_long': 'Your Brain Is a Muscle Too How Student Athletes Succeed in College and in Life', 'edition': '1', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.8 Pounds, Width: 0.85 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.85}, 'weight': {'unit': 'pounds', 'value': 0.8}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 240, 'date_published': '2001-07-31', 'subjects': ['Health, Fitness & Dieting', 'Beauty, Grooming, & Style', 'Sports & Outdoors', 'Test Preparation', 'College & High School', 'College Entrance', 'Education & Teaching', 'Higher & Continuing Education', 'Schools & Teaching', 'Student Life'], 'authors': ['Andre Hayes', 'Vince Fudzie'], 'title': 'Your Brain Is a Muscle Too How Student Athletes Succeed in College and in Life', 'isbn13': '9780060198541', 'msrp': 24, 'binding': 'Hardcover', 'related': {'ePub': '0062325116'}, 'isbn': '0060198540', 'isbn10': '0060198540', 'other_isbns': [{'isbn': '9780062325112', 'binding': 'print'}]}}