{"book": {"publisher": "Amistad", "synopsis": "In sex.lies.murder.fame., Lolita Files delivers a sizzling satire set against the affluence and sensuality of the literary and music worlds that explores the outrageous lengths to which three devout fame-chasers will go to seek their fortune.<br/>Fame is a b*#%$. And when boy meets b*#%$, nothing can keep the two of them apart. Penn Hamilton is young, brilliant, beautiful, and ready to take on the world and claim his rightful place in the midst of celebrity. As a Writer. Rapper. Model. God. Unfortunately, the world is not quite ready for him. When Penn writes what he believes to be the "Great American Literary Blockbuster," he\"s rebuffed at every turn. Faced with ridicule, rejection, and mounting resentment, he decides to fight back using his assets -- rock-star looks, genius IQ, and killer charm.<br/>Beryl Unger is a rising star in the publishing world, editor to literati and glitterati alike. Single, plain, obsessive, a bit on the dreamy side, she\'s a train wreck waiting to happen, and easy prey for a beautiful man with a seductive plan. When Penn meets Beryl, sparks fly. And sparks fly even higher when he meets the breathtaking superstar romance author Sharlyn Tate.<br/>Two women, one man. A man with no boundaries, who will stop short at nothing -- even brutal, vicious murder -- to fulfill his desperate ambition. Lolita Files is the author of the bestselling Child of God, which has been optioned as a feature film by Kanye West. Files has a degree in broadcast journalism and lives outside of Los Angeles, where she is currently developing projects for television and film.', 'language": "en", "image": "https: //images.isbndb.com/covers/68/09/9780060786809.jpg", "title_long": "sex.lies.murder.fame.: A Novel", "edition": "First Edition", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 1 Pounds, Width: 1.17 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1.17}, "weight": {"unit": "pounds", "value": 1}, "height": {"unit": "inches", "value": 9}}, "pages": 368, "date_published": "2006-01-10", "subjects": ["Literature & Fiction'], 'authors": ["Lolita Files'], 'title": "sex.lies.murder.fame.: A Novel", "isbn13": "9780060786809", "msrp": 24.95, 'binding": "Hardcover", "isbn": "0060786809", "isbn10": "0060786809"}}