{'book': {'publisher': 'Harper Perennial', 'synopsis': "A fascinating chronicle of a nation's turbulent history.<br/>Reaching back to earliest times, Martin Ewans examines the historical evolution of one of today's most dangerous breeding grounds of global terrorism. After a succession of early dynasties and the emergence of an Afghan empire during the eighteenth century, the nineteenth and early twentieth century saw a fierce power struggle between Russia and Britain for supremacy in Afghanistan that was ended by the nation's proclamation of independence in 1919. A communist coup in the late 1970s overthrew the established regime and led to the invasion of Soviet troops in 1979. Roughly a decade later, the Soviet Union withdrew, condemning Afghanistan to a civil war that tore apart the nation's last remnants of religious, ethnic, and political unity. It was into this climate that the Taliban was born.<br/>Today, war-torn and economically destitute, Afghanistan faces unique challenges as it looks toward an uncertain future. Martin Ewans carefully weighs the lessons of history to provide a frank look at Afghanistan's prospects and the international resonances of the nation's immense task of total political and economic reconstruction.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/50/80/9780060505080.jpg', 'title_long': 'Afghanistan: A Short History of Its People and Politics', 'edition': 'First Paperback Edition', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 0.70106999316 Pounds, Width: 0.83 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 0.83}, 'weight': {'unit': 'pounds', 'value': 0.70106999316}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 368, 'date_published': '2002-09-17', 'subjects': ['History', 'Asia', 'Pakistan', 'Historical Study & Educational Resources', 'Reference', 'Middle East', 'Military', 'Afghan War', 'World', 'Encyclopedias & Subject Guides', 'Politics & Social Sciences', 'Politics & Government', 'International & World Politics'], 'authors': ['Martin Ewans'], 'title': 'Afghanistan: A Short History of Its People and Politics', 'isbn13': '9780060505080', 'msrp': 13.49, 'binding': 'Paperback', 'isbn': '0060505087', 'isbn10': '0060505087'}}