{'book': {'publisher': 'HarperCollins', 'synopsis': 'Product Description      In Echo Falls, secrets buried in the past don\'t always stay there.In the third book in the Edgar Award–nominated and national bestselling Echo Falls series, Peter Abrahams\'s talent for building suspense shines as Ingrid embarks on her most harrowing adventure yet. Perfect for middle schoolers looking for a good mystery.An idyllic day of snowshoeing on Grampy\'s land with the sheriff\'s son, Joey, turns out to be less than idyllic when thirteen-year-old super sleuth Ingrid Levin-Hill stumbles on a body lying in the snow.This discovery sends the town of Echo Falls into a tailspin in which secrets long hidden are revealed and Grampy gets sent to jail. While Ingrid works to clear Grampy\'s name and uncover what really happened to the man in the snow, she discovers even more secrets she wishes she never knew. Just like the character Gretel, whom Ingid is playing in a local production of\xa0Hansel and Gretel, Ingrid must go deep into the darkness to find the truth.The Kliatt reviewer commented: "I’ve read the two previous Echo Falls mysteries featuring Ingrid\xa0(Down the Rabbit Hole\xa0and\xa0Behind the Curtain)\xa0and enjoyed them, but I think this one may be the best of all."      From the Back Cover      In Echo Falls, secrets buried in the past don\'t always stay there.An idyllic day of snowshoeing on Grampy\'s land with Joey Strade turns out to be less than idyllic when thirteen-year-old super sleuth Ingrid Levin-Hill stumbles upon a body lying in the snow. This discovery sends the town of Echo Falls into a tailspin in which secrets long hidden are revealed and Grampy gets sent to jail. While Ingrid works to clear Grampy\'s name and uncover what really happened to the man in the snow, she discovers even more secrets she wishes she never knew. Just like the character Gretel, whom Ingid is playing in the Prescott Players\' production of Hansel and Gretel, Ingrid must go deep into the darkness to find the truth. In the third book in the Edgar Award–nominated and national bestselling Echo Falls series, Peter Abrahams\'s talent for building suspense shines as Ingrid embarks on her most harrowing adventure yet.      About the Author      Peter Abrahams is the New York Times bestselling author of twenty-five books, including the Edgar Award-winning Reality Check, Bullet Point, and the Echo Falls series for middle graders. Writing as Spencer Quinn, he is also the author of the Chet and Bernie series—Dog on It, Thereby Hangs a Tail, and To Fetch a Thief. He and his wife live in Massachusetts with their dog, Audrey.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/70/92/9780060737092.jpg', 'title_long': 'Into the Dark (Echo Falls Mystery)', 'edition': '1', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.98 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 0.98}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 304, 'date_published': '2008-03-25', 'subjects': ["Children's Books", 'Arts, Music & Photography', 'Performing Arts', 'Growing Up & Facts of Life', 'Family Life', 'Literature & Fiction', 'Action & Adventure', 'Mysteries & Detectives'], 'authors': ['Peter Abrahams'], 'title': 'Into the Dark (Echo Falls Mystery)', 'isbn13': '9780060737092', 'msrp': 17.89, 'binding': 'Library Binding', 'isbn': '0060737093', 'isbn10': '0060737093'}}