{'book': {'publisher': 'Smithsonian', 'synopsis': 'On July 14, 1853, the four warships of America\'s East Asia Squadron made for Kurihama, 30 miles south of the Japanese capital, then called Edo. It had come to pry open Japan after her two and a half centuries of isolation and nearly a decade of intense planning by Matthew Perry, the squadron commander. The spoils of the recent Mexican Spanish–American War had whetted a powerful American appetite for using her soaring wealth and power for commercial and political advantage.<br/>Perry\'s cloaking of imperial impulse in humanitarian purpose was fully matched by Japanese self–deception. High among the country\'s articles of faith was certainty of its protection by heavenly power. A distinguished Japanese scholar argued in 1811 that "Japanese differ completely from and are superior to the peoples of...all other countries of the world."<br/>So began one of history\'s greatest political and cultural clashes.<br/>In Breaking Open Japan, George Feifer makes this drama new and relevant for today. At its heart were two formidable men: Perry and Lord Masahiro Abe, the political mastermind and real authority behind the Emperor and the Shogun. Feifer gives us a fascinating account of "sealed off" Japan and shows that Perry\'s aggressive handling of his mission had far reaching consequences for Japan – and the United States – well into the twentieth if not twenty–first century.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/43/21/9780060884321.jpg', 'title_long': 'Breaking Open Japan: Commodore Perry, Lord Abe, and American Imperialism in 1853', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.35 Pounds, Width: 1.29 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.29}, 'weight': {'unit': 'pounds', 'value': 1.35}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 416, 'date_published': '2006-10-17', 'subjects': ['History', 'Americas', 'United States', 'Asia', 'Japan', 'World'], 'authors': ['George Feifer'], 'title': 'Breaking Open Japan: Commodore Perry, Lord Abe, and American Imperialism in 1853', 'isbn13': '9780060884321', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0060884320', 'isbn10': '0060884320'}}