{"book": {"publisher": "Collins Reference", "synopsis": "“Instantly my favorite guide to the city. Walsh has a phenomenal eye and an almost fanatical attention to detail." — Luc Sante, author of Low Life<br/>An urban exploration of the oddities and artifacts of New York City’s past that are hidden in plain view across the boroughs—from the World’s first Hall of Fame in the Bronx to the remnants of the original Penn Station in Manhattan<br/>Perfect for lifelong New Yorkers as well as first-time visitors to the city, Forgotten New York is a guide to the quirky elements that fall through the cracks of other guidebooks. Kevin Walsh has put together a stunning collection of houses dating back to the Dutch, yellow brick roads, gas-lit lampposts that time forgot, churches that look like space ships, tropical parrots in Brooklyn, and miles of grand old movie theaters that are now drug stores.<br/>An at-a-glance guide to the history and architecture of the city, it’s also an urban explorer walking tour of the five boroughs, complete with comprehensive maps and extensive photos. This is the real story of New York brought to life by the only person who could tell it—a real New Yorker who loves his city.", "language": "en", "image": "https://images.isbndb.com/covers/40/06/9780060754006.jpg", "title_long": "Forgotten New York: Views of a Lost Metropolis", "edition": "Illustrated", "dimensions": "Height: 10 Inches, Length: 6.5 Inches, Weight: 1.67110394596 pounds, Width: 0.88 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.5}, "width": {"unit": "inches", "value": 0.88}, "weight": {"unit": "pounds", "value": 1.67110394596}, "height": {"unit": "inches", "value": 10}}, "pages": 384, "date_published": "2006-09-26", "subjects": ["Arts & Photography', 'Architecture', 'History', 'Americas', 'United States', 'Sports & Outdoors', 'Hiking & Camping', 'Excursion Guides', 'Travel', 'Northeast', 'New York'], 'authors": ["Kevin Walsh'], 'title": "Forgotten New York: Views of a Lost Metropolis", "isbn13": "9780060754006", "msrp": 14.27, 'binding": "Paperback", "isbn": "0060754001", "isbn10": "0060754001"}}