{"book": {"publisher": "Harper Paperbacks", "synopsis": "In 1946, Elizabeth Short traveled to Hollywood to become famous and see her name up in lights. Instead, the dark-haired beauty became immortalized in the headlines as the "Black Dahlia" when her nude and bisected body was discovered in the weeds of a vacant lot. Despite the efforts of more than four hundred police officers and homicide investigators, the heinous crime was never solved. Now, after endless speculation and false claims, bestselling author Donald H. Wolfe discovers startling new evidence—buried in the files of the Los Angeles District Attorney\"s Office for more than half a century.<br/>With the aid of archival photos, news clippings, and investigative reports, Wolfe documents the riveting untold story that names the brutal murderer—the notorious Mafia leader, Benjamin 'Bugsy' Siegel—and the motive—an unwanted pregnancy resulting from Short\'s involvement with the most powerful figure in Los Angeles, Norman Chandler. But Wolfe goes even further to unravel the large-scale cover-up behind the case. Wolfe\'s extensive research, based on the evidence he discovered in the recently opened LADA files, makes The Black Dahlia Files the authoritative work on the murder that has drawn endless scrutiny but remained unsolved—until now.', 'language": "en", "image": "https: //images.isbndb.com/covers/25/00/9780060582500.jpg", "title_long": "The Black Dahlia Files: The Mob, the Mogul, and the Murder That Transfixed Los Angeles", "edition": "Annotated", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 1.21 Pounds, Width: 1.19 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1.19}, "weight": {"unit": "pounds", "value": 1.21}, "height": {"unit": "inches", "value": 9}}, "pages": 448, "date_published": "2006-09-05", "subjects": ["Biographies & Memoirs', 'True Crime', 'Murder & Mayhem', 'Organized Crime', 'Politics & Social Sciences', 'Social Sciences', 'Criminology'], 'authors": ["Don Wolfe'], 'title": "The Black Dahlia Files: The Mob, the Mogul, and the Murder That Transfixed Los Angeles", "isbn13": "9780060582500", "msrp": 15.95, "binding": "Paperback", "related": {"ePub": "0062035207"}, "isbn": "0060582502", "isbn10": "0060582502", "other_isbns": [{'isbn": "9780062035202", "binding": "print"}]}}