{'book': {'publisher': 'Harper Perennial', 'synopsis': '"Jeff Pearlman has captured the swagger of the \'86 Mets. You don\'t have to be a Mets fan to enjoy this book—it\'s a great read for all baseball enthusiasts." —Philadelphia Daily News<br/>Award-winning Sports Illustrated baseball writer Jeff Pearlman returns to an innocent time when a city worshipped a man named Mookie and the Yankees were the second-best team in New York.<br/>It was 1986, and the New York Mets won 108 regular-season games and the World Series, capturing the hearts (and other assorted body parts) of fans everywhere. But their greatness on the field was nearly eclipsed by how bad they were off it. Led by the indomitable Keith Hernandez and the young dynamic duo of Dwight Gooden and Darryl Strawberry, along with the gallant Scum Bunch, the Amazin’s left a wide trail of wreckage in their wake—hotel rooms, charter planes, a bar in Houston, and most famously Bill Buckner and the hated Boston Red Sox.<br/>With an unforgettable cast of characters—including Doc, Straw, the Kid, Nails, Mex, and manager Davey Johnson—this “affectionate but critical look at this exciting season” (Publishers Weekly) celebrates the last of baseball’s arrogant, insane, rock-and-roll-and-party-all-night teams, exploring what could have been, what should have been, and what never was.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/73/36/9780060507336.jpg', 'title_long': 'The Bad Guys Won!', 'edition': 'Reprint', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 0.6 Pounds, Width: 0.68 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 0.68}, 'weight': {'unit': 'pounds', 'value': 0.6}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 304, 'date_published': '2005-04-26', 'subjects': ['Biographies & Memoirs', 'Historical', 'United States', 'History', 'Americas', 'Sports & Outdoors', 'Baseball', 'Biographies'], 'authors': ['Jeff Pearlman'], 'title': 'The Bad Guys Won!', 'isbn13': '9780060507336', 'msrp': 13.99, 'binding': 'Paperback', 'isbn': '0060507330', 'isbn10': '0060507330'}}