{"book": {"publisher": "Amistad", "synopsis": "The astounding yet true rags-to-riches saga of a homeless father who raised and cared for his son on the mean streets of San Francisco and went on to become a crown prince of Wall Street<br/>At the age of twenty, Milwaukee native Chris Gardner, just out of the Navy, arrived in San Francisco to pursue a promising career in medicine. Considered a prodigy in scientific research, he surprised everyone and himself by setting his sights on the competitive world of high finance. Yet no sooner had he landed an entry-level position at a prestigious firm than Gardner found himself caught in a web of incredibly challenging circumstances that left him as part of the city\"s working homeless and with a toddler son. Motivated by the promise he made to himself as a fatherless child to never abandon his own children, the two spent almost a year moving among shelters,
        "HO-tels," soup lines, and even sleeping in the public restroom of a subway station.<br/>Never giving in to despair, Gardner made an astonishing transformation from being part of the city\'s invisible poor to being a powerful player in its financial district.<br/>More than a memoir of Gardner\'s financial success, this is the story of a man who breaks his own family\'s cycle of men abandoning their children. Mythic, triumphant, and unstintingly honest, The Pursuit of Happyness conjures heroes like Horatio Alger and Antwone Fisher, and appeals to the very essence of the American Dream.', 'language": "en", "image": "https: //images.isbndb.com/covers/48/78/9780060744878.jpg", "title_long": "The Pursuit of Happyness: An NAACP Image Award Winner", "edition": "Film tie-in edition", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 0.55 Pounds, Width: 0.72 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 0.72}, "weight": {"unit": "pounds", "value": 0.55}, "height": {"unit": "inches", "value": 8}}, "pages": 320, "date_published": "2006-10-24", "subjects": ["Self-Help', 'Success', 'Biographies & Memoirs', 'Community & Culture', 'Black & African American', 'Memoirs', 'Professionals & Academics', 'Business', 'Humor & Entertainment', 'Humor', 'Essays', 'Self-Help & Psychology', 'Business & Professional', 'Reference', 'Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies', 'Self Service', 'Custom Stores'], 'authors": ["Chris Gardner'], 'title": "The Pursuit of Happyness: An NAACP Image Award Winner", "isbn13": "9780060744878", "msrp": 15.99, "binding": "Paperback", "related": {"ePub": "0061750581"}, "isbn": "0060744871", "isbn10": "0060744871", "other_isbns": [{'isbn": "9780061750588", "binding": "print"}]}}