{'book': {'publisher': 'HarperCollins', 'synopsis': 'Fifteen-year-old Peer Ulfsson is haunted by his past. Forced to live with his evil uncles under the eerie shadows of Troll Fell, he nearly fell prey to their plan to sell children to the trolls. Now Peer lives with his friend Hilde\'s family, but can he ever truly belong? And will Hilde ever share his deeper feelings?<br/>One rainy night, Peer watches in shock as his neighbor Kersten pushes her baby daughter into his arms and then disappears into the sea. Rumor says that Kersten is a seal woman who has returned to her ocean home, and the millpond witch, Granny Green-teeth, seems intent on taking the "seal baby." Peer also discovers that the mill, abandoned when his uncles joined the troll kingdom, is running again -- all on its own?<br/>With angry trolls, mysterious seal people, a mischievous house spirit, and three unusual babies in the mix, Peer and Hilde have their hands full and more!Katherine Langrish returns to the magical world of her acclaimed debut, troll fell, in this second story set in an extraordinary land by the sea filled with Viking legends and lore.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/30/71/9780060583071.jpg', 'title_long': 'Troll Mill', 'edition': 'First U.S. Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.22 Pounds, Width: 0.97 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.97}, 'weight': {'unit': 'pounds', 'value': 1.22}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 288, 'date_published': '2006-01-24', 'subjects': ["Children's Books", 'Growing Up & Facts of Life', 'Friendship, Social Skills & School Life', 'Literature & Fiction', 'Action & Adventure', 'Fairy Tales, Folk Tales & Myths', 'Norse', 'Science Fiction & Fantasy', 'Fantasy & Magic'], 'authors': ['Katherine Langrish'], 'title': 'Troll Mill', 'isbn13': '9780060583071', 'msrp': 1.99, 'binding': 'Hardcover', 'isbn': '006058307X', 'isbn10': '006058307X'}}