{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': 'Over the course of twenty-five years, Dr. Helen Morrison has profiled more than eighty serial killers around the world. What she learned about them will shatter every assumption you\'ve ever had about the most notorious criminals known to man.Judging by appearances, Dr. Helen Morrison has an ordinary life in the suburbs of a major city. She has a physician husband, two children, and a thriving psychiatric clinic. But her life is much more than that. She is one of the country\'s leading experts on serial killers, and has spent as many as four hundred hours alone in a room with depraved murderers, digging deep into killers\' psyches in ways no profiler before ever has.<br/>In My Life Among the Serial Killers, Dr. Morrison relates how she profiled the Mad Biter, Richard Otto Macek, who chewed on his victims\' body parts, stalked Dr. Morrison, then believed she was his wife. She did the last interview with Ed Gein, who was the inspiration for Alfred Hitchcock\'s Psycho. John Wayne Gacy, the clown-obsessed killer of young men, sent her crazed Christmas cards and gave her his paintings as presents. Then there was Atlanta child killer Wayne Williams; rapist turned murderer Bobby Joe Long; England\'s Fred and Rosemary West, who killed girls and women in their "House of Horrors"; and Brazil\'s deadliest killer of children, Marcelo Costa de Andrade.<br/>Dr. Morrison has received hundreds of letters from killers, read their diaries and journals, evaluated crime scenes, testified at their trials, and studied photos of the gruesome carnage. She has interviewed the families of the victims -- and the spouses and parents of the killers -- to gain a deeper understanding of the killer\'s environment and the public persona he adopts. She has also studied serial killers throughout history and shows how this is not a recent phenomenon with psychological autopsies of the fifteenth-century French war hero Gilles de Rais, the sixteenth-century Hungarian Countess Bathory, H. H. Holmes of the late ninteenth century, and Albert Fish of the Roaring Twenties.<br/>Through it all, Dr. Morrison has been on a mission to discover the reasons why serial killers are compelled to murder, how they choose their victims, and what we can do to prevent their crimes in the future. Her provocative conclusions will stun you.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/40/81/9780060524081.jpg', 'title_long': "My Life Among the Serial Killers: Inside the Minds of the World's Most Notorious Murderers", 'edition': 'Reprint', 'dimensions': 'Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.34 Pounds, Width: 0.77 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 0.77}, 'weight': {'unit': 'pounds', 'value': 0.34}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 304, 'date_published': '2005-01-25', 'subjects': ['Biographies & Memoirs', 'Memoirs', 'Professionals & Academics', 'Social Scientists & Psychologists', 'True Crime', 'Serial Killers', 'Health, Fitness & Dieting', 'Mental Health', 'Psychology & Counseling', 'Forensic Psychology', 'Medical Books', 'Medicine', 'Internal Medicine', 'Psychology', 'General', 'Politics & Social Sciences', 'Social Sciences', 'Criminology', 'Self Service', 'Custom Stores'], 'authors': ['Dr. Helen Morrison', 'Harold Goldberg'], 'title': "My Life Among the Serial Killers: Inside the Minds of the World's Most Notorious Murderers", 'isbn13': '9780060524081', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'related': {'Kindle Edition': '0061809594', 'ePub': '0061809594'}, 'isbn': '0060524081', 'isbn10': '0060524081', 'other_isbns': [{'isbn': '9780061809590', 'binding': 'print'}]}}