{'book': {'publisher': 'William Morrow', 'synopsis': "The modern woman has enough hassles without having to put up with the antics of the man in her life. Why endure another day of snoring, football, and wet towels on the floor? With this hilarious, fully illustrated guide, learn 101 reasons why you should dump your chump and hook up with a cat!<br/>So, besides the fact that your man's just not that into you, can he scratch his ear with his foot? Is he adorable when he pounces off the fridge onto your shoulder? Do you get to watch him nudge another man aside and eat his food? And can you improve his mood by tossing a fuzzy mousie for him to chase?<br/>Of course not. There; that's four reasons to dump him and get a cat instead! Plus, you never have to remember how your cat takes his coffee. You don't need to pretend to your cat that you haven't had many other cats. And if your cat thinks your friends are hot, so what?<br/>For every woman who's had enough of men, 101 Reasons to Dump Your Man and Get a Cat is the perfect gift—chock-full of humor, inspiration, and great advice. Why look for love in all the wrong places when it's right across the room chasing its own tail?", 'language': 'en', 'image': 'https://images.isbndb.com/covers/47/41/9780060884741.jpg', 'title_long': '101 Reasons to Dump Your Man and Get a Cat', 'dimensions': 'Height: 7.25 Inches, Length: 5.25 Inches, Weight: 1.05 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.05}, 'height': {'unit': 'inches', 'value': 7.25}}, 'pages': 224, 'date_published': '2006-10-31', 'subjects': ['Humor & Entertainment', 'Humor', 'Cats, Dogs & Animals', 'Love, Sex & Marriage', 'Crafts, Hobbies & Home', 'Pets & Animal Care', 'Cats', 'Literature & Fiction', 'Humor & Satire', 'Satire'], 'authors': ['Molly Katz'], 'title': '101 Reasons to Dump Your Man and Get a Cat', 'isbn13': '9780060884741', 'msrp': 14.95, 'binding': 'Hardcover', 'related': {'ePub': '0062069500'}, 'isbn': '0060884746', 'isbn10': '0060884746', 'other_isbns': [{'isbn': '9780062069504', 'binding': 'print'}]}}