{'book': {'publisher': 'William Morrow', 'synopsis': "Writer Jacob Winter is a man of principle and practicality. Unequivocally faithful to his wife, Laura, and devoted to their son, Max, Jacob is a tireless worker. He does not cheat at games, does not cheat on his taxes, does not drink or take any drugs, not even the medication his former therapist prescribed for an overactive imagination.<br/>To keep his racing mind in check, he has learned to order his life into a routine. He wakes up at the same time every morning, goes to bed at the same time every night. He grounds himself in reality, does not engage in speculation or indulge himself with fantasies of sex or success.<br/>But when Jacob stumbles upon the unexpected -- his wife having an affair -- all of his restraints come crashing down, overrun by blind rage. When he awakens from his rampage, he finds himself locked in jail, his meticulously controlled world spinning out of orbit. And his troubles have only just begun.<br/>Bailed out of jail by ethnobotanist Alix Callahan, a mysterious woman from his past, Jacob cannot comprehend why she would suddenly reappear or why she would help him. Nor does he understand why he is drawn into her obsessive relationship with her bisexual lover, July, a sultry Americanized rain-forest Indian. As much as he tries to distance himself from both women, Jacob and July are suddenly and inexorably thrown together when they watch helplessly as Alix plunges from the top of a high-level bridge. Or does she?<br/>As Jacob becomes the focus of an intensive murder investigation, he struggles with his wayward mind to make sense of his shattered marriage and maintain his relationship with his son while at the same time resisting July's consuming love and divining the mystery of Alix's apparent suicide. His search leads him to a Florida prison, an ancient shamanistic Colombian Indian tribe, and disturbing truths about himself.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/73/71/9780060087371.jpg', 'title_long': 'Green Girls: A Novel of Suspense', 'edition': 'First Edition', 'dimensions': 'Height: 9.5 Inches, Length: 6.25 Inches, Weight: 1.45 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.45}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 384, 'date_published': '2002-12-03', 'subjects': ['Literature & Fiction', 'Contemporary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense'], 'authors': ['Michael Kimball'], 'title': 'Green Girls: A Novel of Suspense', 'isbn13': '9780060087371', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060087374', 'isbn10': '0060087374'}}