{'book': {'publisher': 'Katherine Tegen Books', 'synopsis': "The thrilling Newbery Medal–winning classic about a girl lost on the Alaskan tundra and how she survives with the help of a wolf pack.<br/>Julie of the Wolves is a staple in the canon of children’s literature and the first in the Julie trilogy. The survival theme makes it a good pick for readers of wilderness adventures such as My Side of the Mountain, Hatchet, or Island of the Blue Dolphins.<br/>This edition, perfect for classroom or home use, includes John Schoenherr’s original scratchboard illustrations throughout, as well as bonus materials such as an introduction written by Jean Craighead George’s children, the author’s Newbery acceptance speech, selections from her field notebooks, a discussion guide, and a further reading guide.<br/>To her small village, she is known as Miyax; to her friend in San Francisco, she is Julie. When her life in the village becomes dangerous, Miyax runs away, only to find herself lost in the Alaskan wilderness.<br/>Miyax tries to survive by copying the ways of a pack of wolves and soon grows to love her new wolf family. Life in the wilderness is a struggle, but when she finds her way back to civilization, Miyax is torn between her old and new lives. Is she the Miyax of her human village—or Julie of the wolves?<br/>Don't miss any of the books in Jean Craighead George's groundbreaking series: Julie of the Wolves, Julie, and Julie's Wolf Pack.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/94/44/9780060219444.jpg', 'title_long': 'Julie of the Wolves (Julie of the Wolves, 1)', 'edition': '1', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Width: 0.73 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.73}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 192, 'date_published': '1972-11-30', 'subjects': ['Teen & Young Adult', 'Literature & Fiction', 'Classics', 'Action & Adventure', 'Girls & Women', 'Social & Family Issues'], 'authors': ['Jean Craighead George'], 'title': 'Julie of the Wolves (Julie of the Wolves, 1)', 'isbn13': '9780060219444', 'msrp': 17.89, 'binding': 'Paperback', 'isbn': '0060219440', 'isbn10': '0060219440'}}