{'book': {'publisher': 'Harper', 'synopsis': 'I turned and faced the road we\'d come down, my face hard and set. The kids moved on without me. I could still see a slight glow and the murky, gray smoke reaching above the trees, where it spread to the south....<br/>When I thought they were out of earshot, I took a deep breath. "You lied to me," I whispered toward the building, to all the people it represented, to the hours I\'d spent on those hard, split-log seats, and to my childish epiphanies born there .... "You lied," I said. "These are my best friends now."<br/>Rare is the gift of a writer who is able to conjure up the voices of very different worlds, to give them heat and power and make them sing. Such is the talent of Nancy E. Turner. Her beloved first novel, These Is My Words, opened readers to the challenges of a woman\'s life in the nineteenth-century Southwest. Now this extraordinary writer shifts her gaze to a very different world -- East Texas in the years of the Second World War -- and to the life of a young woman named Philadelphia Summers, known against her will as Frosty.<br/>From the novel\'s harrowing opening scene, Frosty\'s eyes survey the landscape around her -- white rural America -- with the awestruck clarity of an innocent burned by sin. In her mother and sisters she sees fear and small-mindedness; in the eyes of local boys she sees racial hatred and hunger for war. When that war finally comes, it offers her a chance for escape -to California, and the caring arms of Gordon Benally a Native-American soldier. But when she returns to Texas she must face the rejection of a town still gripped by suspicion -- and confront the memory of the crime that has marked her soul since adolescence.<br/>Propelled by the quiet power of one woman\'s voice, The Water and the Blood is a moving and unforgettable portrait of an America of haunted women and dangerous fools -- an America at once long perished and with us still.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/43/01/9780060394301.jpg', 'title_long': 'The Water and the Blood: A Novel', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.5 Inches, Weight: 1.65 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.65}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 416, 'date_published': '2001-10-02', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'Small Town & Rural', 'Psychological', 'Literary'], 'authors': ['Nancy E Turner'], 'title': 'The Water and the Blood: A Novel', 'isbn13': '9780060394301', 'msrp': 26, 'binding': 'Hardcover', 'isbn': '0060394307', 'isbn10': '0060394307'}}