{"book": {"publisher": "Greenwillow Books", "synopsis": "Discover the world of the Queen’s Thief<br/>New York Times-bestselling author Megan Whalen Turner’s entrancing and award-winning Queen’s Thief novels bring to life the world of the epics and feature one of the most charismatic and incorrigible characters of fiction, Eugenides the thief. Megan Whalen Turner’s Queen’s Thief novels are rich with political machinations and intrigue, battles lost and won, dangerous journeys, divine intervention, power, passion, revenge, and deception. Perfect for fans of Leigh Bardugo, Marie Lu, Patrick Rothfuss, and George R. R. Martin.<br/>The brilliant thief Eugenides has visited the Queen of Attolia’s palace one too many times, leaving small tokens and then departing unseen. When his final excursion does not go as planned, he is captured by the ruthless queen. The Queen’s Thief novels have been praised by writers, critics, reviewers, and fans and have been honored with glowing reviews, “best of” citations, and numerous awards, including the Los Angeles Times Book Prize, a Newbery Honor, the Andre Norton Award shortlist, and the Mythopoeic Fantasy Award. Discover and rediscover the stand-alone companions, The Queen of Attolia, The King of Attolia, A Conspiracy of Kings, and Thick as Thieves, all epic novels set in the world of the Queen’s Thief.<br/>A Booklist Top 10 Fantasy Books for Youth<br/>ALA Popular Paperbacks for Young Adults<br/>A New York Public Library Book for the Teen Age<br/>Parent’s Choice Gold Award<br/>A Bulletin of the Center for Children’s Books Blue Ribbon Book<br/>“The Queen’s Thief books awe and inspire me. They have the feel of a secret, discovered history of real but forgotten lands. The plot-craft is peerless, the revelations stunning, and the characters flawed, cunning, heartbreaking, exceptional. Megan Whalen Turner’s books have a permanent spot on my favorites shelf, with space waiting for more books to come.”—Laini Taylor, New York Times-bestselling author of the Daughter of Smoke and Bone novels and Strange the Dreamer<br/>"Unforgettable characters, plot twists that will make your head spin, a world rendered in elegant detail—you will fall in love with every page of these stories. Megan Whalen Turner writes vivid, immersive, heartbreaking fantasy that will leave you desperate to return to Attolia again and again.'—Leigh Bardugo, New York Times-bestselling author of the The Grisha Trilogy and Six of Crows<br/>“Megan Whalen Turner proves to be one of the brightest creative talents. With each book, she continues to add new levels and new luster to her sparkling imagination.”—Lloyd Alexander, Newbery Medalist and National Book Award-winning author of The Chronicles of Prydain<br/>“Readers will be spellbound.”—Kirkus Reviews (starred review)<br/>“Turner’s storytelling is so sure that readers will want to go along with her—and discover whatever it is that Eugenides will do next.”—Publishers Weekly (starred review)<br/>“[An
        ] intense read . . . thoroughly involving and wholly satisfying on all fronts.”—The Horn Book (starred review)", "language": "en", "image": "https: //images.isbndb.com/covers/18/29/9780060841829.jpg", "title_long": "The Queen of Attolia (The Queen"s Thief, Book 2)", 'edition": "Reissue", "dimensions": "Height: 7.625 Inches, Length: 5.125 Inches, Weight: 0.5 Pounds, Width: 0.736 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.125}, "width": {"unit": "inches", "value": 0.736}, "weight": {"unit": "pounds", "value": 0.5}, "height": {"unit": "inches", "value": 7.625}}, "pages": 368, "date_published": "2006", "subjects": ["Reference', 'Teen & Young Adult', 'Literature & Fiction', 'Action & Adventure', 'Science Fiction & Fantasy', 'Fantasy'], 'authors": ["Megan Whalen Turner'], 'title": "The Queen of Attolia (The Queen"s Thief, Book 2)", 'isbn13": "9780060841829", "msrp": 6.99, "binding": "Paperback", "isbn": "0060841826", "isbn10": "0060841826", "other_isbns": [{'isbn": "9780061968464", "binding": "print"}]}}