{'book': {'publisher': 'William Morrow Cookbooks', 'synopsis': 'Until the 1960s, nearly all Chinese food served in the United States was Cantonese. Egg Foo Yung. Barbecued Spareribs. Egg Drop Soup. But with the opening of his Shun Lee restaurants more than forty years ago, Michael Tong and his chefs introduced the spicy regional foods of Sichuan and Hunan and the red-cooked dishes of Shanghai to New Yorkers—and eventually to all of the United States. Crispy Orange Beef. Lake Tung Ting Prawns. Crispy Sea Bass. Dry Sautéed String Beans. Hot and Sour Cabbage. Scallion Pancakes. These dishes originated at Shun Lee, and are now on nearly every Chinese restaurant menu across North America.<br/>Now, in his first cookbook, Tong shares his most popular recipes from the Hunan, Sichuan, and Shanghai regions of China. Who says Chinese food is difficult to prepare at home? With The Shun Lee Cookbook, even novices have nothing to worry about. All the recipes have been tested and modified for home kitchens. If adapting a recipe for the home—like Beijing duck—proved to be impossible, Tong omitted it. The result is a collection of easy-to-make but dazzling dishes. And perhaps the best part is that they can all be made with ingredients found in supermarkets everywhere.<br/>Chinese favorites such as Hot and Sour Soup, Sichuan Boiled Dumplings, Dry Sautéed Green Beans, and Kung Pao Shrimp are included. There are also new dishes such as Peppery Dungeness Crab, Singapore-Style Rice Noodles with Curry, Red-Cooked Beef Short Ribs, and Hunan Lamb with Scallions.<br/>In addition to the recipes The Shun Lee Cookbook includes tips for stocking home pantries with Chinese staples, and there are more than fifty color photographs of the finished dishes throughout.<br/>Why order take-out when you can take home The Shun Lee Cookbook?', 'language': 'en', 'image': 'https://images.isbndb.com/covers/40/72/9780060854072.jpg', 'title_long': 'The Shun Lee Cookbook', 'edition': 'First Edition', 'dimensions': 'Height: 9.5 Inches, Length: 7.5 Inches, Weight: 2.25 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.5}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 2.25}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 272, 'date_published': '2007-02-06', 'subjects': ['Cookbooks, Food & Wine', 'Regional & International', 'Asian'], 'authors': ['Michael Tong'], 'title': 'The Shun Lee Cookbook', 'isbn13': '9780060854072', 'msrp': 29.95, 'binding': 'Hardcover', 'related': {'ePub': '0062045911'}, 'isbn': '0060854073', 'isbn10': '0060854073', 'other_isbns': [{'isbn': '9780062045911', 'binding': 'print'}]}}