{'book': {'publisher': 'HarperTeen', 'synopsis': 'In the final book in the Old Kingdom trilogy, master of fantasy and globally bestselling author Garth Nix returns to the fantastic world of Sabriel for an unforgettable conclusion. "Breathtaking, bittersweet, and utterly unforgettable.” *<br/>After centuries in captivity, the Destroyer is nearly free.<br/>Beneath the earth, a malignant force lies waiting, greedy for freedom from its ancient prison. As the Old Kingdom falls once more into a realm of darkness and terror, the people look desperately to the Abhorsen, the scourge of the Dead, to save them. Yet Abhorsen Sabriel is lost, missing in Ancelstierre.<br/>Only Lirael has any chance of stopping the Destroyer. With her companions Sameth, Mogget and the Disreputable Dog, she travels across the Old Kingdom in a race against time, battling Shadow Hands and dark necromancers to reach Ancelstierre before it is too late. But what hope can one young woman have against a terrible evil with the power to destroy life itself?<br/>This eagerly awaited conclusion to Garth Nix’s extraordinary trilogy of Old Kingdom books is a complex and vividly imagined story, powerful, terrifying and compelling.<br/><br/>“Terror, courage, bitterness, love, desperation, and sacrifice all swirl together in an apocalyptic climax that pits both Life and Death together against the destruction of everything." —Kirkus*', 'language': 'en', 'image': 'https://images.isbndb.com/covers/87/37/9780060528737.jpg', 'title_long': 'Abhorsen (Old Kingdom)', 'edition': 'Reprint', 'dimensions': 'Height: 6.75 Inches, Length: 4.1875 Inches, Weight: 0.55 Pounds, Width: 1.32 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.1875}, 'width': {'unit': 'inches', 'value': 1.32}, 'weight': {'unit': 'pounds', 'value': 0.55}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 518, 'date_published': '2004', 'subjects': ['Science Fiction & Fantasy', 'Fantasy', 'Epic', 'Romantic', 'Teen & Young Adult', 'Literature & Fiction', 'Action & Adventure'], 'authors': ['Garth Nix'], 'title': 'Abhorsen (Old Kingdom)', 'isbn13': '9780060528737', 'msrp': 8.99, 'binding': 'Paperback', 'isbn': '0060528737', 'isbn10': '0060528737', 'other_isbns': [{'isbn': '9780061975103', 'binding': 'print'}]}}