{'book': {'publisher': 'William Morrow', 'synopsis': 'The sea was our common home, and I felt our connection went back a very long way -- to a time that predated man\'s emergence from the water.<br/>In 1996, Francisco "Pipín" Ferreras, a native Cuban and a world champion in the dangerous and controversial sport of free diving, met Audrey Mestre, a beautiful French marine biology student who had sought him out in Cabo San Lucas for her research. A passionate romance immediately bloomed between the two, and their love was bonded by a shared fascination with and devotion to the ocean. When the couple moved back to Miami, Audrey took up the sport herself and quickly proceeded to break the female world record (115 meters). They soon became free diving\'s power couple, testing the limits of their wills and bodies by descending to unthinkable depths, training and touring together, encouraging and motivating each other.<br/>Then, on October 12, 2002, in a dive off the coast of the Dominican Republic, tragedy struck: Audrey\'s attempt to break the world record with a dive of 170 meters ended in her death. Suddenly, Pipín -- haunted by questions, reeling from the loss of his soul mate -- could no longer find solace in the sea that had always been his true home.<br/>Now, for the first time, Pipín tells his story. He shares the heart-pounding adventure and fierce competition that fuel the sport of free diving and his own addiction to it. He addresses the controversy that has followed him throughout his career and that spun out of control after Audrey\'s death. And he relates the haunting story of his relationship with Audrey -- a unique and complicated tale of love and obsession taken to extreme depths.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/41/62/9780060564162.jpg', 'title_long': 'The Dive: A Story of Love and Obsession', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 3.2407952514 Pounds, Width: 0.9 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.9}, 'weight': {'unit': 'pounds', 'value': 3.2407952514}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 288, 'date_published': '2004-07-27', 'subjects': ['Biographies & Memoirs', 'Travelers & Explorers', 'Sports & Outdoors', 'Biographies', 'Water Sports', 'Travel', 'Caribbean', 'Cuba', 'Specialty Travel', 'Adventure'], 'authors': ['Pipin Ferreras'], 'title': 'The Dive: A Story of Love and Obsession', 'isbn13': '9780060564162', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0060564164', 'isbn10': '0060564164'}}