{'book': {'publisher': 'Avon', 'synopsis': "Judith Michael is beloved around the world for powerful stories of love and family. Now this renowned author returns with a richly emotional tale of the many kinds of love and the collision of good and evil that threatens to tear a family apart.<br/>Sara Elliott has been forced to give up the life she's dreamed of to return home to Chicago and take charge of her sisters and brother. She finds a job and settles into the house she grew up in, building a life for ten-year-old Doug and teenagers Carrie and Abby.<br/>But Sara has another brother, Mack, now twenty, who left home three years earlier. Suddenly he reappears, cheerful and unconcerned, as if he had never broken his promise to stay and help Sara with the children and the house. With bewildering volatility, Mack swings from kindness to cruelty, affection to hostility, keeping the family always on edge, his past and present a mystery. But with expensive gifts, storytelling, and the excitement of his presence, he is winning over the children, and sometimes the four of them stand together against Sara.<br/>Mack challenges all Sara has achieved in trying to be a mother and keep her family together. And he does it at a time when she is confronted by crises at work that spill over into her home. Suddenly, events seem to be speeding past and Sara feels she cannot slow them down to regain control.<br/>And then, when she thinks her life has room only for work and family, she meets Reuben Lister, a client from New York. As Sara helps him find and furnish a house and explore the city, they discover a closeness neither has known before and share new ways of dealing with conflicts each has always faced alone. Together, Sara and Reuben find answers to the questions: What is a mother? What is a parent? What is a family?<br/>This is Judith Michael's most poignant exploration of the pressures and joys facing modern adults and children, in a story that will resonate with everyone for its universal themes and discoveries.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/92/94/9780060599294.jpg', 'title_long': 'The Real Mother: A Novel', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.55 Pounds, Width: 1.33 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.33}, 'weight': {'unit': 'pounds', 'value': 1.55}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 432, 'date_published': '2005-02-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Psychological', 'Contemporary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Psychological Thrillers'], 'authors': ['Judith Michael'], 'title': 'The Real Mother: A Novel', 'isbn13': '9780060599294', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060599294', 'isbn10': '0060599294'}}