{'book': {'publisher': 'HarperCollins', 'synopsis': "You just got your ice cream from the ice-cream man, but he was so busy that he forgot to take your money. You should: Put the money back in your pocket and eat your ice cream. Get his attention and tell him that you didn't pay yet. Eat your ice cream fast and tell him you never got it. Tell him you gave him a five-dollar bill and you didn't get any change.<br/>Which would you do? Judge Judy challenges you to choose!<br/>As a Family Court judge and on her popular TV courtroom show, Judge Judy has seen the consequences of people making the wrong choices. She knows that a sense of morality is developed at an early stage, but parents often need help teaching their kids how to make good decisions. Judge Judy Sheindlin's Win Or Lose By How You Choose! is the answer.<br/>In her first book for children, Judge Judy asks kids questions that reflect dilemmas they're faced with every day, such as what to do when you borrow a friend's bike and accidentally break it. But she doesn't tell kids what to do -- she provides a series of multiple choice answers and asks them to decide which is the right response. Judge Judy encourages parents and children to talk through the answers together, exploring the choices and examining the consequences of each course of action.<br/>Along with Bob Tore's hilarious artwork, Judge Judy's witty, wise questions and answers challenge kids to make winning choices -- for life!", 'language': 'en', 'image': 'https://images.isbndb.com/covers/78/01/9780060287801.jpg', 'title_long': "Judge Judy Sheindlin's Win or Lose by How You Choose", 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 9 Inches, Weight: 1.1904962148 Pounds, Width: 0.45 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 9}, 'width': {'unit': 'inches', 'value': 0.45}, 'weight': {'unit': 'pounds', 'value': 1.1904962148}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 80, 'date_published': '2000-02-07', 'subjects': ["Children's Books", 'Growing Up & Facts of Life', 'Family Life', 'Friendship, Social Skills & School Life'], 'authors': ['Judge Judy Sheindlin'], 'title': "Judge Judy Sheindlin's Win or Lose by How You Choose", 'isbn13': '9780060287801', 'msrp': 15.99, 'binding': 'Hardcover', 'isbn': '0060287802', 'isbn10': '0060287802'}}