{"book": {"publisher": "Harper Perennial Modern Classics", "synopsis": "The shorter works of one of the world’s greatest writers, including the classics The Gambler and Notes From the Underground.<br/>The short works of Dostoevsky exist in the very large shadow of his astonishing longer novels, but they too are among the best works in the history of literature. The Gambler chronicles Dostoevsky’s own addiction, which he eventually overcame. Many have argued that Notes From the Underground contains several keys to understanding the themes of the longer novels, like Crime and Punishment and The Idiot. Those stories are joined here by other classics, including White Nights and The Eternal Husband.<br/>In the introduction to this volume, Ronald Hingley writes: “It is admittedly impossible to evaluate or understand Dostoevsky’s major work properly without taking into account his less voluminous writings, (and) it is also true that many of his shorter works are masterpieces in their own right—as it is hoped the reader may remind himself or discover for the first time...”", "language": "en", "image": "https: //images.isbndb.com/covers/64/61/9780060726461.jpg", "title_long": "Great Short Works of Fyodor Dostoevsky (Harper Perennial Modern Classics)", "edition": "Reissue", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 1.39 Pounds, Width: 1.23 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 1.23}, "weight": {"unit": "pounds", "value": 1.39}, "height": {"unit": "inches", "value": 8}}, "pages": 768, "date_published": "2004-07-06", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Short Stories & Anthologies', 'Anthologies', 'World Literature', 'Russian & Soviet', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Fyodor Dostoevsky'], 'title": "Great Short Works of Fyodor Dostoevsky (Harper Perennial Modern Classics)", "isbn13": "9780060726461", "msrp": 16.99, 'binding": "Paperback", "isbn": "0060726466", "isbn10": "0060726466"}}