{'book': {'publisher': 'Harper Perennial', 'synopsis': 'In the spirit of Alvin Toffler’s Future Shock, a social critique of our obsession with choice, and how it contributes to anxiety, dissatisfaction and regret. This paperback includes a new P.S. section with author interviews, insights, features, suggested readings, and more.<br/>Whether we’re buying a pair of jeans, ordering a cup of coffee, selecting a long-distance carrier, applying to college, choosing a doctor, or setting up a 401(k), everyday decisions-both big and small-have become increasingly complex due to the overwhelming abundance of choice with which we are presented.<br/><br/>We assume that more choice means better options and greater satisfaction. But beware of excessive choice: choice overload can make you question the decisions you make before you even make them, it can set you up for unrealistically high expectations, and it can make you blame yourself for any and all failures. In the long run, this can lead to decision-making paralysis, anxiety, and perpetual stress. And, in a culture that tells us that there is no excuse for falling short of perfection when your options are limitless, too much choice can lead to clinical depression.<br/><br/>In The Paradox of Choice, Barry Schwartz explains at what point choice-the hallmark of individual freedom and self-determination that we so cherish-becomes detrimental to our psychological and emotional well-being. In accessible,', 'language': 'en', 'image': 'https://images.isbndb.com/covers/56/96/9780060005696.jpg', 'title_long': 'The Paradox of Choice: Why More Is Less', 'edition': 'New edition', 'dimensions': 'Height: 8 Inches, Length: 5.3125 Inches, Weight: 0.51588169308 Pounds, Width: 0.684685 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.3125}, 'width': {'unit': 'inches', 'value': 0.684685}, 'weight': {'unit': 'pounds', 'value': 0.51588169308}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 304, 'date_published': '2005-01-18', 'subjects': ['Self-Help', 'Business & Money', 'Management & Leadership', 'Decision-Making & Problem Solving', 'Personal Finance', 'Skills', 'Decision Making', 'Health, Fitness & Dieting', 'Psychology & Counseling', 'Social Psychology & Interactions', 'Science & Math', 'Behavioral Sciences', 'Politics & Social Sciences', 'Social Sciences', 'Popular Culture', 'Anthropology', 'Cultural', 'Self Service', 'Custom Stores'], 'authors': ['Barry Schwartz'], 'title': 'The Paradox of Choice: Why More Is Less', 'isbn13': '9780060005696', 'msrp': 15.99, 'binding': 'Paperback', 'isbn': '0060005696', 'isbn10': '0060005696', 'other_isbns': [{'isbn': '9780061748998', 'binding': 'print'}]}}