{'book': {'publisher': 'Harper', 'synopsis': '"It was suddenly chic to be \'targeted\' by Andrew...It also became chic to claim a deep personal friendship with Versace, to infer that one might, but for a trick of fate, have been with Versace at the very moment of his \'assassination,\' as it had once been chic to reveal one\'s invitation to Cielo Drive in the evening of the Tate slayings, an invitation only declined because of car trouble or a previuos engagement. Versace\'s friends no less than Andrew\'s friends were helpless not to make hay off the carcass, for the narrative itself excluded from existence all relevant persons who failed to appear, to put their two cents in...and because the narrative had the force of a psychic avalanche it provided the seque ferom the previous marrivtie, extricated the public eye form the previous keyhole, the Andrew narrative, in effect, solved the JonBenét Ramsey murder case, as that case had finally wrapped up the O. J. Simpson case, which in turn had closed the Menendez case, the Andrew mystery would ultimately be solved by the death of Princess Di..." -- from Three Month Fever<br/>In Three Month Fever, his first book-length work of nonfiction, Gary Indiana presents the 1997 killing spree of Andrew Cunanan as a peculiarly contemporary artifact, an alloy in which reality and myth have been inseparably combined. The case generated an astonishing sequence of news reports in which the suspect became a "monster," "serial killer," "high-priced homosexual prostitute," "pervert," "master of disguise," "chameleon," and so forth. In reality, this figure of dread bore little resemblance to the scary sociopath of legend.<br/>In following Cunanan\'s "trail of death," Indiana presents a riveting, fully realized portrait of a very bright, even brilliant young man whom people liked. He had charisma, great looks, and money that he spent very freely on others. He was a sympathetic listener with a phenomenal memory for names, faces, and virtually anything he read or saw. But he didn\'t fit in anywhere, and he couldn\'t solve the problem of how to live.<br/>He was trying to do better, to come from a better place, to have a better background. He made up stories about himself that made him feel more like other people or made him seem more interesting than he thought he was.<br/>He wanted to be loved for himself. The two people he thought might love him for himself didn\'t, and he ended up killing them. This was probably the last thing he wanted to do.<br/>Andrew was compulsively social, and as long as he could establish some intercourse with the outside world he could function, even if he had to conceal the ugly secrets he was accumulating. He could hang out in gay bars in Chicago while on the run, come to New York and live in a bathhouse, go to movies, pick people up. Even after the killing in New Jersey, his crimes were below the threshold of most people\'s awareness.<br/>But in Miami he found himself trapped, the very places where he expected to "blend in" were informed about who he was and what he looked like. It was isolation he could not deal with--and that led to his total disintegration and the death of Gianni Versace.<br/>Three Month Fever is a tour de force in which Indiana reveals how Andrew Cunanan fell apart over time and what he might have sounded like in his own mind. Rarely has a writer immersed himself in the mind of a killer with such startling effect. Gary Indiana has created a new form of true crime that is as insightful as it is riveting.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/14/50/9780060191450.jpg', 'title_long': 'Three-Month Fever: The Andrew Cunanan Story', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.12 Inches, Weight: 1.1684499886 Pounds, Width: 0.93 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.12}, 'width': {'unit': 'inches', 'value': 0.93}, 'weight': {'unit': 'pounds', 'value': 1.1684499886}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 272, 'date_published': '1999-03-24', 'subjects': ['Biographies & Memoirs', 'True Crime', 'Murder & Mayhem'], 'authors': ['Gary Indiana'], 'title': 'Three-Month Fever: The Andrew Cunanan Story', 'isbn13': '9780060191450', 'msrp': 25, 'binding': 'Hardcover', 'isbn': '0060191457', 'isbn10': '0060191457'}}