{'book': {'publisher': 'William Morrow Cookbooks', 'synopsis': "Warning: This is a no-holds-barred book of decadence. Do you keep unsalted butter in your freezer? Not afraid of a little saturated fat? Then indulge -- if you dare!<br/>The recipes in Jeremy Jackson's Desserts That Have Killed Better Men Than Me pack a one-two butter-and-sugar punch. Have a lick of Snice Cream (that's Fresh Snow Ice Cream) or slurp down a Banana Smoothie. Chomp on Chocolate-Dipped Ranger Cookies or dive into a Chocolate Sinkhole. Just be prepared to defend your bounty. These desserts are so delicious that a food fight might start over the last piece of cake!<br/>Don't be fooled by the simple ingredients and easy-to-follow directions. Jeremy's desserts are not to be taken lightly. They're not for the faint of heart -- or stomach. Danger lurks beneath that delectable layer of Chocolate Ganache. So suit up in a pair of elastic waist pants, arm yourself with a fork and a giant glass of milk, and prepare for battle.<br/>If you can survive Three-Lemon Cheesecake and My School Lunch Cream Puffs, you can probably handle the Peach Pie with Almond Crumb Topping. Polish that off and you just might be ready for the Hanging-Crust Rhubarb Cobbler.<br/>In the world of desserts, there is no room for mediocrity. Desserts That Have Killed Better Men Than Me has no filler or predictable, so-so recipes (and absolutely no almond bark!), just good, honest, and deadly delicious ones -- with plenty of heavy cream.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/71/29/9780060527129.jpg', 'title_long': 'Desserts That Have Killed Better Men Than Me', 'edition': '1', 'dimensions': 'Height: 8.25 inches, Length: 5.5 Inches, Weight: 0.65 Pounds, Width: 0.75 inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.65}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 160, 'date_published': '2004-03-02', 'subjects': ['Cookbooks, Food & Wine', 'Baking', 'Desserts'], 'authors': ['Jeremy Jackson'], 'title': 'Desserts That Have Killed Better Men Than Me', 'isbn13': '9780060527129', 'msrp': 14.95, 'binding': 'Hardcover', 'isbn': '0060527129', 'isbn10': '0060527129'}}