{'book': {'publisher': 'William Morrow', 'synopsis': "In The Eight Human Talents, Gurmukh, an internationally renowned Kundalini Yoga teacher, explains ancient methods for creating true health of the body, mind, and spirit. She shares the remarkable stories of healing and recovery she has observed in almost thirty years of teaching Kundalini Yoga to everyone from school teachers and waiters to Hollywood celebrities like Cindy Crawford, Courtney Love, and Madonna. Her teaching has helped world-class athletes and paraplegics; she has also worked with infants and seniors. Anyone can benefit from these simple yoga and meditation techniques, which can revolutionize your physical, mental, and spiritual well-being.<br/>The yoga she practices invokes eight chakras, energy centers of our bodies that are the seat of the eight the human talents. These eight uniquely human talents include Acceptance, Creativity, Commitment, Compassion, Truth, Intuition, Boundlessness, and Radiance. Each human talent has a corresponding shadow emotion, namely, Resentment, Guilt, Anger, Fear, Denial, Depression, and Grief. When there is an imbalance in one of the chakras and an overabundance of its shadow side, we sometimes see the creation of illness.<br/>If you have ever longed to increase your creativity, intuition, compassion, health, and prosperity, The Eight Human Talents is for you. If you ever wished that you could escape the fear or anger that cripples you, this book will give you simple, practical tools to change your life profoundly. All that is required is a belief in the possibility of change and a commitment of as little as three minutes a day. Gurmukh makes Eastern wisdom accessible to everyone. The Eight Human Talents will inspire you with stories from her own life and the lives of students who have used these teachings to transform their physical, emotional, and spiritual health. Gurmukh's gentle, wise, and witty counsel has helped thousands of students to make a quantum leap toward happinss, and she can help you, too!", 'language': 'en', 'image': 'https://images.isbndb.com/covers/54/89/9780060195489.jpg', 'title_long': 'The Eight Human Talents', 'edition': '1', 'dimensions': 'Height: 9.75 Inches, Length: 6.5 Inches, Weight: 1.2 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.2}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 272, 'date_published': '2000-08-22', 'subjects': ['Health, Fitness & Dieting', 'Exercise & Fitness', 'Yoga', 'Religion & Spirituality'], 'authors': ['Gurmukh', 'Cathryn Michon'], 'title': 'The Eight Human Talents', 'isbn13': '9780060195489', 'msrp': 25, 'binding': 'Hardcover', 'isbn': '0060195487', 'isbn10': '0060195487'}}