{'book': {'publisher': 'William Morrow', 'synopsis': "In their quest for cellulite reduction and a sexy self-image, Ellie Simpson, a Dublin nanny, and her three best friends -- Maggie, a secretary; Pam, a divorced mother of two; and Toni, a nurse -- have tried them all: Atkins, Weight Watchers, South Beach, Cabbage Soup -- even the Avocado and Rice Krispies Gut-Cleansing Regime! But thus far they've had no better luck losing five pounds than they have had finding lasting love.<br/>To cope with their middle-aged cottage-cheese thighs and date nights spent more often than not at home on the couch, they decide to form the WWW -- Women Watching Weight -- Club, meeting weekly to talk sex, spider veins, and the grim digestive realities of their latest diet -- all while indulging in calorie-packed takeout and drinking wine and beer without the slightest trace of guilt (followed by their weekly weigh-in and a group vow to definitely start their diets again tomorrow!).<br/>With one another's unwavering support, the WWW girls face the ups and downs of their love lives, careers, and waistlines. But when they make a bet that the first WWW member to lose seven pounds will be entitled to be set up on a date by the other three, Ellie finds herself torn between her loyalty to her best friends in the WWW and her own deepening feelings for the one man who just might be everything she's ever wanted.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/53/55/9780060825355.jpg', 'title_long': 'The WWW Club: A Novel of Sex and Bonbons', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6.25 Inches, Weight: 1.355 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.355}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 368, 'date_published': '2006-05-02', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'Short Stories & Anthologies', 'Anthologies', "Women's Fiction", 'World Literature', 'Asian', 'United States', 'Asian American', 'Literary', 'Science Fiction & Fantasy', 'Science Fiction', 'Self Service', 'Custom Stores'], 'authors': ['Anita Notaro'], 'title': 'The WWW Club: A Novel of Sex and Bonbons', 'isbn13': '9780060825355', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060825359', 'isbn10': '0060825359'}}