{'book': {'publisher': 'William Morrow', 'synopsis': 'New York Times Bestseller<br/>Award-winning and New York Times bestselling author Laura Lippman’s Tess Monaghan—first introduced in the classic Baltimore Blues—must track down a missing wife and unravel the secrets in her marriage that led her to flee.<br/>“A hair raising ride.”—Boston Globe<br/>Mark Rubin\'s family is missing—and the police won\'t get involved because all the evidence indicates that his wife left willingly. So the successful Baltimore furrier turns to Tess Monaghan, hoping she can help him find his wife and three children. Tess doesn\'t quite know what to make of Rubin, who doles out vitally important information in grudging dribs and drabs. According to her client, he and his beautiful wife, Natalie, had a flawless, happy marriage. Yet one day, without any warning or explanation, Natalie gathered up their children and vanished.<br/>Tapping into a network of fellow investigators spread across the country, Tess is soon able to locate the runaway wife and the children who have been moving furtively from state to state, town to town. But the Rubins are not alone. A mysterious man is traveling with them, a stranger described by witnesses as "handsome" and "charming" but otherwise unremarkable. And the deeper Tess digs, the more she suspects that the motive behind Natalie\'s reckless flight lies somewhere in the gap between what Rubin will not say and what he refuses to believe.<br/>An intricate web of betrayal and vengeance is already beginning to unfold, as memory begets rage, and rage begets desperation…and murder. Suddenly, much more than one man\'s future happiness and stubborn pride are in peril. For the lives of three innocent children are dangling by the slenderest of threads.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/66/98/9780060506698.jpg', 'title_long': "By a Spider's Thread", 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.95 Pounds, Width: 1.17 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.17}, 'weight': {'unit': 'pounds', 'value': 0.95}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 368, 'date_published': '2004-06-29', 'subjects': ['Literature & Fiction', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Hard-Boiled', 'Women Sleuths', 'Thrillers & Suspense', 'Suspense'], 'authors': ['Laura Lippman'], 'title': "By a Spider's Thread", 'isbn13': '9780060506698', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060506695', 'isbn10': '0060506695'}}