{'book': {'publisher': 'Perennial Currents', 'synopsis': 'Unhappiness, says bestselling author Harriet Lerner, is fueled by three key emotions: anxiety, fear, and shame. They are the uninvited guests in our lives. When tragedy or hardship hits, they may become our constant companions.<br/>Anxiety can wash over us like a tidal wave or operate as a silent thrum under the surface of our daily lives. With stories that are sometimes hilarious and sometimes heartbreaking, Lerner takes us from "fear lite" to the most difficult lessons the universe sends us. We learn: how a man was "cured in a day" of the fear of rejection -- and what we can learn from his story how the author overcame her dread of public speaking when her worst fears were realized how to deal with the fear of not being good enough, and with the shame of feeling essentially flawed and inadequate how to stay calm and clear in an anxious, crazy workplace how to manage fear and despair when life sends a crash course in illness, vulnerability, and loss how "positive thinking" helps -- and harms how to be our best and bravest selves, even when we are terrified and have internalized the shaming messages of others<br/>No one signs up for anxiety, fear, and shame, but we can’t avoid them either. As we learn to respond to these three key emotions in new ways, we can live more fully in the present and move into the future with courage, clarity, humor, and hope. Fear and Other Uninvited Guests shows us how.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/15/84/9780060081584.jpg', 'title_long': 'The Dance of Fear: Rising Above Anxiety, Fear, and Shame to Be Your Best and Bravest Self', 'edition': 'Reprint', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 0.42 Pounds, Width: 0.58 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 0.58}, 'weight': {'unit': 'pounds', 'value': 0.42}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 238, 'date_published': '2005-05-03', 'subjects': ['Self-Help', 'Spiritual', 'Health, Fitness & Dieting', 'Mental Health', 'Anxiety Disorders', 'Dissociative Disorders', 'Mood Disorders', 'Post-traumatic Stress Disorder', 'Psychology & Counseling', 'Pathologies', 'Politics & Social Sciences', 'Politics & Government', 'Public Affairs & Policy'], 'authors': ['Harriet Lerner'], 'title': 'The Dance of Fear: Rising Above Anxiety, Fear, and Shame to Be Your Best and Bravest Self', 'isbn13': '9780060081584', 'msrp': 13.99, 'binding': 'Paperback', 'related': {'ePub': '0061983713'}, 'isbn': '0060081589', 'isbn10': '0060081589', 'other_isbns': [{'isbn': '9780061983719', 'binding': 'print'}]}}