{'book': {'publisher': 'Katherine Tegen Books', 'synopsis': '"A moving story of resilience and hope in which a 12-year-old girl faces the difficulties of living with her mother\'s mental illness but never gives up trying and hoping for a better future. A contemporary story with themes that are appealing to older pre-teen readers edging towards young adult reads." - Seira Wilson, Amazon Editor<br/>School Library Journal Best Book * ALA Notable Children’s Book * New York Public Library’s “One Hundred Titles for Reading and Sharing” * Chicago Public Library Best of the Best * Cooperative Children’s Book Center Choice * Connecticut Book Award Winner * American Library Association Schneider Family Book Award Winner<br/>This poignant and joyful novel is filled with meaningful moments and emotional resonance.<br/>Addie is waiting for normal. But Addie\'s mother has an all-or-nothing approach to life: a food fiesta or an empty pantry, her way or no way.<br/>Addie’s mother is bipolar, and she often neglects Addie. All-or-nothing never adds up to normal, and it can\'t bring Addie home, where she wants to be with her half-sisters and her stepfather. But Addie never stops hoping that one day, maybe, she\'ll find normal.<br/>“A heroine with spunk and spirit offers an inspiring lesson in perseverance and hope. First-rate.” —Kirkus Reviews (starred review)', 'language': 'en', 'image': 'https://images.isbndb.com/covers/08/89/9780060890889.jpg', 'title_long': 'Waiting for Normal', 'edition': '1', 'dimensions': 'Height: 7.38 Inches, Length: 5 Inches, Weight: 0.82 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 0.82}, 'height': {'unit': 'inches', 'value': 7.38}}, 'pages': 304, 'date_published': '2008-02-05', 'subjects': ["Children's Books", 'Growing Up & Facts of Life', 'Family Life', 'Fiction', 'Friendship, Social Skills & School Life', 'Literature & Fiction', 'Self Service', 'Custom Stores'], 'authors': ['Leslie Connor'], 'title': 'Waiting for Normal', 'isbn13': '9780060890889', 'msrp': 16.99, 'binding': 'Hardcover', 'isbn': '0060890886', 'isbn10': '0060890886'}}