{'book': {'publisher': 'Avon', 'synopsis': "Iced!<br/>Wedding planner extraordinaire Annabelle Archer is used to dealing with difficult personalities -- neurotic brides, despotic mothers, and prima donna bridesmaids. However, being chased from a swank hotel kitchen at knifepoint by a shrieking Chef Henri takes the cake. Soon after, Washington's most thoroughly despised culinary artist is discovered dead, impaled on an ice sculpture -- a crime which surprises no one, since revenge is, after all, a dish best served cold.<br/>Unfortunately, the police think the hotel's sometimes temperamental but always stylish catering exec (and Annabelle's good friend) Georgia Rhodes did Henri in -- so the planner and her posse set out to put the real murderer on ice. But when the corpse of a rival culinarian turns up in a walk-in freezer -- and more nasty chef-deaths quickly follow -- the suspect list suddenly shrinks . . . as do Annabelle and her cronies' chances for survival, if they get caught poking around in a killer's kitchen.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/90/41/9780060739041.jpg', 'title_long': 'For Better or Hearse: An Annabelle Archer Mystery (Annabelle Archer Mysteries)', 'dimensions': 'Height: 6.75 Inches, Length: 4.1875 Inches, Weight: 0.28 Pounds, Width: 0.68 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.1875}, 'width': {'unit': 'inches', 'value': 0.68}, 'weight': {'unit': 'pounds', 'value': 0.28}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 272, 'date_published': '2006-02-28', 'subjects': ['Literature & Fiction', "Women's Fiction", 'Domestic Life', 'Humor & Satire', 'Humorous', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Self Service', 'Custom Stores'], 'authors': ['Laura Durham'], 'title': 'For Better or Hearse: An Annabelle Archer Mystery (Annabelle Archer Mysteries)', 'isbn13': '9780060739041', 'msrp': 6.99, 'binding': 'Mass Market Paperback', 'isbn': '0060739045', 'isbn10': '0060739045'}}