{'book': {'publisher': 'Harper Perennial', 'synopsis': '“A brilliant new voice—twitchy, corny, sly, cackling and sad, but most of all, racing with vitality and goosing you to keep up. Boonville is the creepy and hilarious coming-of-age story the territory deserves—not your parents’ Vineland, but your own.” — Jonathan Lethem<br/>Boonville is the story of John Gibson, the reluctant heir of an alcoholic grandmother who fled the normalcy of her own “American family” to live in the redwoods-surrounded northern California hole in the wall town of Boonville where she is known as the “squirrel lady.” In her will, she leaves John her decrepit cabin. Needing a change from the pastel and air-conditioned life in Miami, John ditches his girlfriend and condo and heads to Boonville to claim his inheritance. He soon discovers it is not the hippie, free-loving town he assumed it was, and the locals—with the exception of Sarah McKay, a commune-reared "hippie by association"—are not happy to see a new face, especially a handsome outsider.<br/>John and Sarah are two young people actively searching for self and community in a small town of misfits, rednecks, and counter-culture burnouts. Boonville is the darkly comic tale of how they try to reassemble the facts of heredity, sexuality, personal expression, love, death, the possibility of an existence without God, and what happens whey they choose to make art from their lives.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/62/15/9780060516215.jpg', 'title_long': 'Boonville: A Novel', 'edition': 'Reprint', 'dimensions': 'Height: 0.9 Inches, Length: 8.3 Inches, Weight: 0.9 Pounds, Width: 5.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.3}, 'width': {'unit': 'inches', 'value': 5.5}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 0.9}}, 'pages': 272, 'date_published': '2003-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Coming of Age', 'Small Town & Rural', 'Literary', 'Self Service', 'Custom Stores'], 'authors': ['Robert Mailer Anderson'], 'title': 'Boonville: A Novel', 'isbn13': '9780060516215', 'msrp': 12.99, 'binding': 'Paperback', 'related': {'ePub': '0062034421'}, 'isbn': '0060516216', 'isbn10': '0060516216', 'other_isbns': [{'isbn': '9780062034427', 'binding': 'print'}]}}