{'book': {'publisher': 'William Morrow', 'synopsis': 'In the second half of the 19th century several thousand impoverished young Jewish women from Eastern Europe were forced into prostitution in the frontier colonies of Latin America, South Africa, India and parts of the United States. These unwitting Jewish women were procured for the thousands of new European immigrants who came to establish these colonies. The import of these women left a legacy in each of these countries: the rise of anti–Semitism.<br/>Bodies and Souls brings to light a dark, untold chapter in Jewish history – a topic previously hidden because of the extreme shame surrounding it. From the end of the 1860s until the beginning of WWII, thousands of young, impoverished Jewish women were sold into slavery by a notorious criminal gang of Jewish mobsters, the Zwi Migdal. By the turn of the 19th century the Zwi Migdal had established their headquarters in Buenos Aires. However, it was in Rio de Janeiro that The Society of Truth was created.<br/>The most shameful part of all of this was how the women were treated by the Jewish community. A group of these women banded together to form The Society of Truth. They stood up against the dogma that said they were impure. Herein lies the irony: this group, cast aside by their community, went on to form a new society for themselves, a society of love, honour to God and faith in each other.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/02/34/9780060090234.jpg', 'title_long': 'Bodies and Souls: The Tragic Plight of Three Jewish Women Forced into Prostitution in the Americas', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.175 Pounds, Width: 1.0039 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.0039}, 'weight': {'unit': 'pounds', 'value': 1.175}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 288, 'date_published': '2005-11-01', 'subjects': ['History', 'World', 'Jewish', 'Religion & Spirituality', 'Judaism', 'Women & Judaism', 'Politics & Social Sciences', "Women's Studies"], 'authors': ['Isabel Vincent'], 'title': 'Bodies and Souls: The Tragic Plight of Three Jewish Women Forced into Prostitution in the Americas', 'isbn13': '9780060090234', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0060090235', 'isbn10': '0060090235'}}