{'book': {'publisher': 'Katherine Tegen Books', 'synopsis': "Jess has moved to a remote island called Lume off the coast of England. Her parents are restoring an old house, and Jess discovers an abandoned cottage on their property. Inside the cottage Jess encounters an eerie presence -- something like a ghost but suffused with a comforting energy. She also finds three locked boxes. Inside each she finds antique papers that send her mind spinning.<br/>As Jess unravels the mysteries of Lume, she finds the writings of Sebastian, a boy who lived one hundred years ago and whose life contains unsettling reflections of her own. To her horror, the dangers he unearthed in 1894 now begin to threaten Jess and her family. Something dark has awoken, and Jess doesn't have much time to do something about it.<br/>Jess has a talent for solving puzzles, riddles, and codes. She is confronted with a series of riddles that she must unlock in order to save her mother from a dark and ancient threat. Jess is guided by the creepy presence in the cottage. The mysterious guide is called Epsilon, but is he a guide from the bright side or the dark?<br/>Christine Morton-Shaw has created a spectacular thriller about one girl's spine-chilling experience with the supernatural world.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/82/05/9780060728205.jpg', 'title_long': 'The Riddles of Epsilon', 'dimensions': 'Height: 8 Inches, Length: 5.5 Inches, Width: 1.21 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.21}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 384, 'date_published': '2005-04-26', 'subjects': ['Teen & Young Adult', 'Literature & Fiction', 'Social & Family Issues', 'Mysteries & Thrillers', 'Fantasy & Supernatural', 'Mystery & Detective', 'Science Fiction & Fantasy', 'Horror', 'Fantasy'], 'authors': ['Christine Morton-Shaw'], 'title': 'The Riddles of Epsilon', 'isbn13': '9780060728205', 'msrp': 17.89, 'binding': 'Library Binding', 'isbn': '0060728205', 'isbn10': '0060728205'}}