{'book': {'publisher': 'Harper Paperbacks', 'synopsis': 'The human love affair with horses is an ancient and far-reaching one. Moving effortlessly from history to literature, from science to sport, from anecdote to personal experience, Lawrence Scanlan sets out to discover the essence of our powerful, almost mystical attraction to this noble creature. Scanlan covers a wide territory: from the mythic horses of cultures long past to the real-life whisperers of today, to the timeless wild mustangs still roaming the Great Plains.<br/>As he touches on each aspect of the equine-human bond, Scanlan makes perfect sense of "horse fever" -- that curious affliction that has been known to strike both the seasoned professional and the rider who has galloped only in his or her dreams. Written in lyrical prose with wit, humor, and an eye for drama, meticulously researched and complemented by fifty compelling black-and-white photographs, Wild About Horses addresses our need to know everything we can about the horse.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/11/48/9780060931148.jpg', 'title_long': 'Wild About Horses: Our Timeless Passion for the Horse', 'edition': '1', 'dimensions': 'Height: 8 Inches, Length: 0.79 Inches, Weight: 0.85 Pounds, Width: 5.31 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 0.79}, 'width': {'unit': 'inches', 'value': 5.31}, 'weight': {'unit': 'pounds', 'value': 0.85}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 352, 'date_published': '2001-11-13', 'subjects': ['History', 'Historical Study & Educational Resources', 'Crafts, Hobbies & Home', 'Pets & Animal Care', 'Horses', 'Science & Math', 'Biological Sciences', 'Animals', 'Evolution', 'Nature & Ecology', 'Nature Writing & Essays', 'Politics & Social Sciences', 'Social Sciences', 'Folklore & Mythology', 'Anthropology', 'Cultural'], 'authors': ['Lawrence Scanlan'], 'title': 'Wild About Horses: Our Timeless Passion for the Horse', 'isbn13': '9780060931148', 'msrp': 14.99, 'binding': 'Paperback', 'isbn': '0060931140', 'isbn10': '0060931140'}}