{'book': {'publisher': 'William Morrow', 'synopsis': 'The incomparable, award-winning author of the bestselling Jane Jeffry series travels far from the contemporary Chicago suburbs to Depression-era New York State, where a brother and sister ensconced in a sprawling mansion on the banks of the Hudson long for better days...and fewer murders!<br/>After the Crash of \'29 sent the family fortune south, abruptly penniless, once-high-living Manhattanites Lily and Robert Brewster take up residence in their late great-uncle Horatio\'s estate in a small town near Hyde Park, renting out rooms to make ends meet until the gargantuan Grace and Favor Cottage is legally theirs ten years on. Though the adjustment has been difficult, the struggling siblings are finally getting used to small-town life. Lily has recently been accepted into the local Ladies League, and while she is away helping the organization do good works, Robert decides to do some much needed renovations...with rather disastrous results.<br/>Robert is tearing down a dilapidated icehouse on the property when he inadvertently stumbles upon the last thing he expects or wants: a mummified corpse. The nameless cadaver is well dressed and the obvious victim of foul play with no identifying marks except the label of an exclusive New York City tailor sewn into his "burial" clothes.<br/>While Lily works hand-in-hand with the disarmingly attractive Chief of Police Howard Walker on the local front, Robert pursues the Manhattan connection in search of an identity for their wellheeled, deceased John Doe. But a second dead body-combined with the World War I Veterans Bonus March on Washington by disgruntled ex-soldiers and a bizarre rash of vegetable pilfering -- is complicating an already complex, murderous matter in this quaint upstate community. And soon the many disparate threads of the investigation are tying up the amateur sleuthing Brewsters in a knotty mess of deception and betrayal...and leaving them dangerously exposed to the watchful eyes of a killer.<br/>Joining Jill Churchill\'s immensely popular Jane Jeffry novels in hardcover, and deliciously rich in vibrant period color and atmosphere and peopled with an unforgettable cast of unusual characters, Someone to Watch Over Me is yet another unmitigated delight from the bestselling author. It\'s a wonderful journey back to a time of hope undimmed by national calamity, and innocence undeterred by deadly adversity.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/94/18/9780060199418.jpg', 'title_long': 'Someone to Watch Over Me (Grace & Favor Mysteries, No. 3)', 'edition': 'First Edition', 'dimensions': 'Height: 8.75 Inches, Length: 5.75 Inches, Weight: 0.85 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.85}, 'height': {'unit': 'inches', 'value': 8.75}}, 'pages': 240, 'date_published': '2001-11-13', 'subjects': ['Literature & Fiction', "Women's Fiction", 'Mystery, Thriller & Suspense', 'Mystery', 'Romance', 'Contemporary'], 'authors': ['Jill Churchill'], 'title': 'Someone to Watch Over Me (Grace & Favor Mysteries, No. 3)', 'isbn13': '9780060199418', 'msrp': 24, 'binding': 'Hardcover', 'isbn': '0060199415', 'isbn10': '0060199415'}}