{'book': {'publisher': 'Harper', 'synopsis': 'On February 6, 2001, my nine-year-old daughter happened to wander into the room during a television segment marking Ronald Reagan\'s ninetieth birthday. She watched for a moment. Then she turned to me and asked, "Dad, is that the President you worked for?"<br/>What answer could I give her? How could I make her see? I wanted my daughter to recognize that the world she inhabited was freer and more prosperous because of that old, old man on television. But I also wanted her to grasp my personal debt to him, to understand all that he taught me-how to work and how to relax, how to think and how to use words, how to be a good husband, how to approach life itself...<br/>I needed to tell my children how Ronald Reagan changed my life.<br/>In 1982, as a young man, Peter Robinson was hired as a speechwriter in the Reagan White House. During the six years that followed, he was one of a core group of writers who became informal experts on Reagan, absorbing not just his political positions but his personality, manner, and way of carrying himself And the example Reagan set-as a confident, passionate, principled, generous-spirited older man-molded Robinson\'s outlook just as he was coming into his own. "Hard work. A good marriage. A certain lightness of touch," he writes. "The longer I studied Ronald Reagan, the more lessons I learned."<br/>At the core of How Ronald Reagan Changed My Life are ten of the life lessons Robinson learned from the fortieth President-principles that have guided his own life ever since. But it also offers a warm and unforgettable portrait of a great yet ordinary man who touched the individuals around him as surely as he did his millions of admirers around the world.<br/>Drawing on journal entries from his days at the White House, as well as interviews with those who knew the President best, Robinson etches his portrait with fresh observations, telling detail, and that "certain lightness of touch" that recalls the master himself The result is nothing less than a love story-an account of the profound respect and affection that one young man came to feel for the President who changed his life forever.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/39/92/9780060523992.jpg', 'title_long': 'How Ronald Reagan Changed My Life', 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.1 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.1}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 272, 'date_published': '2003-08-05', 'subjects': ['Self-Help', 'Personal Transformation', 'Biographies & Memoirs', 'Leaders & Notable People', 'Presidents & Heads of State', 'Self Service', 'Custom Stores'], 'authors': ['Peter Robinson'], 'title': 'How Ronald Reagan Changed My Life', 'isbn13': '9780060523992', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060523999', 'isbn10': '0060523999'}}