{'book': {'publisher': 'William Morrow', 'synopsis': 'Spanning more than five decades, here is a riveting true account of fighting America’s enemies around the world—told by the soldier/operative who was there<br/>I am not a hero.<br/>Billy Waugh has lurked in the shadows and on the periphery of many of the most significant events of the past half-century on active duty with U.S. Army Special Forces and the CIA fighting enemies of the United States. In Hunting the Jackal, this legendary warrior reveals the extraordinary events of his life and career, offering a point-by-point eyewitness account of the historical events in which he participated.<br/>Serving in Korea and Vietnam, Waugh was among the first Green Berets in 1963. He has helped train Libyan commandos in the Sahara Desert, while spying on Russian missile sites in Benghazi, and has worked against Caribbean drug runners. He was the first CIA operative to watch Osama Bin Laden in Khartoum “from a spot close enough to kill him had I been allowed,” and tracked him over the course of two years. In 1994 he found the notorious Carlos the Jackal in Sudan, and tailed him until he was captured—a story that until now has never been told. And, just last year, at age 72, Waugh was on the ground in Afghanistan with a joint SpecForces/CIA unit.<br/>This is his remarkable true story.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/40/94/9780060564094.jpg', 'title_long': "Hunting the Jackal: A Special Forces and CIA Ground Soldier's Fifty-Year Career Hunting America's Enemies", 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.1 Pounds, Width: 0.89 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.89}, 'weight': {'unit': 'pounds', 'value': 1.1}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 256, 'date_published': '2004-06-15', 'subjects': ['Biographies & Memoirs', 'Leaders & Notable People', 'Military', 'History', 'Intelligence & Espionage', 'Engineering & Transportation', 'Engineering'], 'authors': ['Billy Waugh', 'Tim Keown'], 'title': "Hunting the Jackal: A Special Forces and CIA Ground Soldier's Fifty-Year Career Hunting America's Enemies", 'isbn13': '9780060564094', 'msrp': 23.95, 'binding': 'Hardcover', 'isbn': '0060564091', 'isbn10': '0060564091'}}