{'book': {'publisher': 'William Morrow', 'synopsis': 'Go Spanning the World with Len Berman in this wildly entertaining, insightful, and often hilarious book that takes sports fans behind the scenes and inside locker rooms.<br/>One of the most popular television sports personalities—known for his "Spanning the World" segments on NBC\'s Today show—Len Berman delivers his unique view of the world of sports, from the bizarre to the historic, all with his characteristic wit.<br/>Over the years sports and sports reporting have changed, but Spanning the World puts it all in perspective in this irreverent take on the heroes and iconic moments. Barry Bonds massages the media: "If you put that camera in my face, I\'ll slit your throat." Mickey Mantle reveals his most pleasurable Yankee Stadium experience (it didn\'t happen on the field). Bobby Orr loses his cool and chairs start flying from the upper decks. Bill Parcells finally spills his Super Bowl–winning formula: "Power wins!" And much more ...<br/>Berman guides us through the world he knows like no one else, from intimate recollections of his heroes to postgame celebrations, exhibiting the most hilarious and shocking moments from the whole cast of characters from the last decades in sports: John McEnroe, Muhammad Ali, Larry Bird, Derek Jeter, and many more. He also addresses the more serious issues facing sports today, including steroids, overpaid stars, athletes and violence, and the place of sports in society.<br/>A must read for every sports fan, Spanning the World is an irresistible blend of humor, history, and contemporary commentary on the state of sports from the ultimate fan who has seen it all.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/75/26/9780060757526.jpg', 'title_long': 'Spanning the World: The Crazy Universe of Big-Time Sports, All-Star Egos, and Hall of Fame Bloopers', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.3 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.3}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 320, 'date_published': '2005-05-31', 'subjects': ['Literature & Fiction', 'Humor & Satire', 'Satire', 'Sports & Outdoors', 'Miscellaneous', 'Essays'], 'authors': ['Len Berman'], 'title': 'Spanning the World: The Crazy Universe of Big-Time Sports, All-Star Egos, and Hall of Fame Bloopers', 'isbn13': '9780060757526', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0060757523', 'isbn10': '0060757523'}}