{'book': {'publisher': 'William Morrow', 'synopsis': 'They were die-hard and deadly partners who made national headlines with their daring bank holdups and gun battles -- and they had a lot of laughs while they were at it. They were known as the Dillinger Gang, but at its heart was "Handsome Harry" Pierpont -- tough, fearless, intelligent, and sworn to live by no law but his own.<br/>Presented as his intimate "confessions," Harry\'s story takes us from his teenage days as a small-time crook to the pinnacle of his notoriety to his final hours in the penitentiary death house.<br/>In prison, young Harry meets equally young John Dillinger, and they form an unassailable friendship. After John is paroled he helps Harry pull off one of the most infamous prison escapes in U.S. history. Then John is jailed and Harry must in turn liberate him; but the jailbreak comes at a tragic cost and ultimately seals Harry\'s fate.<br/>In four blazing months of freedom before he meets that fate, Harry and John and their three steadfast partners -- Red, Russell, and Fat Charley -- establish themselves as the most legendary outlaw gang of the twentieth century. They rob banks. Shoot it out with police and federal agents and rival gangs. Make harrowing getaways. And all the while -- from the Midwest to Florida to Arizona, and in the company of their bold and memorable women -- they have a grand time of it.<br/>Crafted in James Carlos Blake\'s signature style of fast-paced violence, sizzling sex, and darkly raucous humor, Handsome Harry brings to life a thrilling chapter from the chronicles of American crime.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/47/81/9780060554781.jpg', 'title_long': 'Handsome Harry: A Novel', 'edition': '1', 'dimensions': 'Height: 9.5 Inches, Length: 6.25 Inches, Weight: 1.22 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.22}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 320, 'date_published': '2004-02-03', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense'], 'authors': ['James Carlos Blake'], 'title': 'Handsome Harry: A Novel', 'isbn13': '9780060554781', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060554789', 'isbn10': '0060554789'}}