{'book': {'publisher': 'Harper', 'synopsis': "Rick Beyer, the author of the acclaimed History Channel® series The Greatest Stories Never Told, returns with new historic tales, this time focusing on amazing war stories<br/>Search the annals of military history and you will discover no end of quirky characters and surprising true stories: The topless dancer who saved the Byzantine Empire; the World War I battle that was halted so a soccer game could be played; the scientist who invented a pigeon-guided missile in 1943; and don't forget the elderly pig whose death triggered an international crisis between the United States and Great Britain.<br/>This is the kind of history you'll find in The Greatest War Stories Never Told. One hundred fascinating stories drawn from two thousand years of military history, accompanied by a wealth of photographs, maps, drawings, and documents that help bring each story to life. Little-known tales told with a one-two punch of history and humor that will make you shake your head in disbelief -- but they're all true!<br/>Did You Know That: One military unit served on both sides during the Civil War The War of Jenkins's Ear was actually fought over a sea captain's ear Daniel Boone was once tried for treason A siege on Poland in 1519 gave birth to the marriage of bread and butter<br/>Discover how war can be a catalyst for change; an engine for innovation; and an arena for valor, deceit, intrigue, ambition, revenge, audacity, folly, and even silliness. Want to know how the mafia helped the United States win World War II, when the word bazooka was coined, or how Silly Putty was invented? Read on!", 'language': 'en', 'image': 'https://images.isbndb.com/covers/01/75/9780060760175.jpg', 'title_long': 'The Greatest War Stories Never Told: 100 Tales from Military History to Astonish, Bewilder, and Stupefy (The Greatest Stories Never Told)', 'edition': 'Illustrated', 'dimensions': 'Height: 7 inches, Length: 7 Inches, Weight: 0.87743980276 Pounds, Width: 0.69 inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 0.69}, 'weight': {'unit': 'pounds', 'value': 0.87743980276}, 'height': {'unit': 'inches', 'value': 7}}, 'pages': 224, 'date_published': '2005-11-01', 'subjects': ['Arts & Photography', 'Music', 'History & Criticism', 'History', 'Historical Study & Educational Resources', 'Reference', 'Military', 'United States', 'World War II', 'Encyclopedias & Subject Guides'], 'authors': ['Rick Beyer'], 'title': 'The Greatest War Stories Never Told: 100 Tales from Military History to Astonish, Bewilder, and Stupefy (The Greatest Stories Never Told)', 'isbn13': '9780060760175', 'msrp': 18.99, 'binding': 'Hardcover', 'related': {'eBook': '0062310372', 'ePub': '0062310372'}, 'isbn': '0060760176', 'isbn10': '0060760176', 'other_isbns': [{'isbn': '9780062310378', 'binding': 'print'}]}}