{'book': {'publisher': 'William Morrow', 'synopsis': "Product Description      <br/><p><i>Parts Unknown</i> is Kevin Brennan's masterfully rendered debut novel of a man's decision to leave behind the life intended for him and the turbulent emotions unleashed in his family when he attempts to make amends.</p><p>As a young man, Bill Argus abandoned his wife, their young son, and his family's dairy farm in the Sonoma County hamlet of Pianto. Now sixty-three, the once-famous photographer is overcome with the need to find forgiveness and redemption from those he left behind. Journeying back to the small, dreary California town, he is disoriented to find a ragged skeleton of the boyhood farm he remembered and his family unmoved and indifferent to his return. Bill's awkward homecoming is reported through the eyes of his second wife, Nora -- twenty years his junior -- who has her own troubled family history. Her father, much like Bill, deserted his family when Nora was just a toddler, never to return; and she has been estranged from her mother for more than half of her life. Bearing witness to Bill's reception by his brother, aunt, and his long-abandoned wife spark in Nora a revisiting of her complicated history, and soon she, too, sets off on a spiritual journey to explore her own parts unknown.</p><p>Set against the wild beauty of the California desert, this deftly imagined first novel lovingly maps the diverse terrain of the human heart as it probes the intricate bonds of family and the complex nature of forgiveness and love. Soulful and poignant, Kevin Brennan's <i>Parts Unknown</i> is a striking meditation on the elusive nature of redemption and marks the debut of a gifted new voice in fiction.</p><br/>      From Publishers Weekly      <br/>Forgiveness and retribution are key themes in newcomer Brennan's lyrical if slow-moving first novel, which tells the story of a man who abandons his responsibilities to pursue his creative needs. Bill Argus is 63 and a successful photographer of desert scenes when the novel begins. After four decades of guilt and remorse, he has finally decided to return to the tiny Northern California town of Pianto and make amends for his youthful sins. As a young man, he abandoned his 16-year-old wife, Annie, bound to him in a shotgun wedding, and left town. The story is narrated by Bill's second wife, Nora, who tenderly recounts her husband's struggles with guilt and his need to meet his son, Hayes. Nora interpolates her own fractured family life into the drama, revealing that her father abandoned her when she was only a baby. Back in Pianto, Bill and Nora find that his younger brother, Cam, picked up the pieces after Bill's departure by comforting Annie and taking Hayes under his wing. When Bill at last encounters his adult son, his decision to hide his true identity proves to be the ultimate test of will and honor. The final group photo shoot shamelessly but appropriately tugs at the heartstrings. Brennan's tone is smooth and conversational, but the frequent chronological shifts that fill in the backstory and add dimension to the characters are awkward and jarring and slow the narrative's momentum. Despite its sensitivity and poignancy, this debut lacks the adrenaline to keep it afloat. Northern California regional author appearances.<br/>Copyright 2002 Reed Business Information, Inc.<br/>      From Booklist      <br/>Realizing that you can never really go home again, but knowing that he must, photographer Bill Argus decides to revisit the town, the family, and the memories he deserted many years before. Seeking deliverance and reconciliation, 63-year-old Bill undertakes a momentous emotional and physical journey into the past to make peace with his present. Told through the somewhat jaundiced prism of his second wife's eyes, Bill's uneasy reunion with the people and life he abandoned in the harshly beautiful California desert becomes a catalyst for another journey of the soul and spirit. In relating both Bill's past and present experiences, Nora Argus must confront her own demons", 'language': 'en', 'image': 'https://images.isbndb.com/covers/27/62/9780060012762.jpg', 'title_long': 'Parts Unknown: A Novel', 'edition': 'First Edition', 'dimensions': 'Height: 9.5 Inches, Length: 6.5 Inches, Weight: 1.26 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.26}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 320, 'date_published': '2003-01-01', 'subjects': ['Literature & Fiction', 'United States', 'Literary'], 'authors': ['Kevin Brennan'], 'title': 'Parts Unknown: A Novel', 'isbn13': '9780060012762', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060012765', 'isbn10': '0060012765'}}