{"book": {"publisher": "HarperOne", "synopsis": "The life and mind of C. S. Lewis have fascinated those who have read his works. This collection of his personal letters reveals a unique intellectual journey. The first of a three-volume collection, this volume contains letters from Lewis\"s boyhood, his army days in World War I, and his early academic life at Oxford. Here we encounter the creative, imaginative seeds that gave birth to some of his most famous works.<br/>At age sixteen, Lewis begins writing to Arthur Greeves, a boy his age in Belfast who later becomes one of his most treasured friends. Their correspondence would continue over the next fifty years. In his letters to Arthur, Lewis admits that he has abandoned the Christian faith. "I believe in no religion," he says. 'There is absolutely no proof for any of them.'<br/>Shortly after arriving at Oxford, Lewis is called away to war. Quickly wounded, he returns to Oxford, writing home to describe his thoughts and feelings about the horrors of war as well as the early joys of publication and academic success.<br/>In 1929 Lewis writes to Arthur of a friend ship that was to greatly influence his life and writing. 'I was up till 2:30 on Monday talking to the Anglo-Saxon professor Tolkien who came back with me to College ... and sat discoursing of the gods and giants & Asgard for three hours ...' Gradually, as Lewis spends time with Tolkien and other friends, he admits in his letters to a change of view on religion. In 1930 he writes, 'Whereas once I would have said, \'Shall I adopt Christianity\', I now wait to see whether it will adopt me ...'<br/>The Collected Letters of C. S. Lewis, Volume I offers an inside perspective to Lewis\'s thinking during his formative years. Walter Hooper\'s insightful notes and biographical appendix of all the correspondents make this an irreplaceable reference for those curious about the life and work of one of the most creative minds of the modern era.', 'language": "en", "image": "https: //images.isbndb.com/covers/76/35/9780060727635.jpg", "title_long": "Collected Letters, Vol. 1: Family Letters, 1905-1931", "edition": "First Edition", "dimensions": "Height: 8.5 Inches, Length: 5.25 Inches, Weight: 2.56 Pounds, Width: 2.04 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.25}, "width": {"unit": "inches", "value": 2.04}, "weight": {"unit": "pounds", "value": 2.56}, "height": {"unit": "inches", "value": 8.5}}, "pages": 1072, "date_published": "2004-06-29", "subjects": ["Christian Books & Bibles', 'Christian Living', 'Spiritual Growth', 'Literature & Fiction', 'History & Criticism', 'Regional & Cultural', 'British & Irish', 'Religion & Spirituality'], 'authors": ["C. S. Lewis'], 'title": "Collected Letters, Vol. 1: Family Letters, 1905-1931", "isbn13": "9780060727635", "msrp": 34.95, 'binding": "Hardcover", "isbn": "0060727632", "isbn10": "0060727632"}}