{'book': {'publisher': 'William Morrow', 'synopsis': "In this unforgettable debut novel, John Barlow reveals how the intersection of a Victorian-era family, an irrepressible marketing wiz, and the temperance movement changed the way the world drinks. Sweeping readers back in time to a day and age when beverages didn't come by the can or the cooler and were often hard to come by at all, Intoxicated once again proves Barlow to be a writer whose “imagination appears unlimited, almost attuned to a parallel world” (New York Times Book Review).<br/>Yorkshire, 1869. When self-made Victorian businessman Isaac Brookes returns home from his wool mill in France, he cannot suspect that a chance encounter on a train will alter the gastronomical landscape of the world. But when Isaac meets, and almost kills, Rodrigo Vermilion -- a hunchback midget dressed in rags -- Vermilion sees in pragmatic Isaac a grand opportunity to improve his lot in life, and becomes determined to go into business with the Yorkshire man.<br/>Enter the Temperance Soldiers, a band of righteous social moralists who offer Vermilion the inspiration, and the idea he so desperately needs. One taste of his first Temperance Ale -- worse, he felt sure, than the ancient slime at the bottom of the pond, old frog juice, and duck droppings scooped up in a glass -- and this savvy schemer with a genius for persuasion is off and running. He soon convinces Isaac and his son to invest their fortune in an idea sure to appeal to Victorian sensibilities: Rhubarilla, a fizzy, fruity drink. And so begins the craze that will sweep the world in ways that even the irrepressible Vermilion never could have imagined.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/17/62/9780060591762.jpg', 'title_long': "Intoxicated: A Novel of Money, Madness, and the Invention of the World's Favorite Soft Drink", 'edition': '1st ptg.', 'dimensions': 'Height: 9 Inches, Length: 6.25 Inches, Weight: 1.4 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.4}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 368, 'date_published': '2006-02-07', 'subjects': ['Literature & Fiction', 'Contemporary', 'Literary'], 'authors': ['John Barlow'], 'title': "Intoxicated: A Novel of Money, Madness, and the Invention of the World's Favorite Soft Drink", 'isbn13': '9780060591762', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060591765', 'isbn10': '0060591765'}}