{'book': {'publisher': 'William Morrow', 'synopsis': "A hauntingly beautiful, wickedly funny and<br/>devastatingly moving novel of innocence<br/>and dreams that announces the arrival of<br/>a major new talent to the literary scene<br/>The attic room at 26a Waifer Avenue in the lower-middle-class London neighborhood of Neasden is a sanctuary for identical twins Georgia and Bessi Hunter. It is a private universe where fantasy reigns as well as an escape from the sadness and danger that inhabit the floors below. Here the girls share nectarines and forge their identities -- planning glorious success as the Famous Flapjack Twins -- well removed from their Nigerian mother, Ida, who, devastated by homesickness, speaks to the spirits of the family she left behind on another continent. On occasion Georgia and Bessi's older sister, Bel, and younger sister, Kemy, are admitted into their broad, bright and fanciful realm, but never their English father, who nightly bathes the wounds of his own upbringing in far too much drink.<br/>But innocence lasts for only so long -- and dreams, no matter how vivid and powerful, cannot slow the relentless incursions of the real world. Bel's transition into womanhood brings a very grown-up problem into the house that cannot be pretended away. Kemy's entire existence is redefined overnight by seductive pop-star glitter. And a terrible secret begins to threaten the twins' utopia, setting them on divergent paths toward heartrending resolutions in a world of separateness and solitude.<br/>A work of bold, lyrical beauty, telling detail and compelling characterization -- at once cheerful and thoughtful, playful and profound -- and written in a unique prose style that metamorphoses brilliantly with the passage of time, 26a will surely be one of the most-talked-about novels of this year and many years to come, and its remarkable author, Diana Evans, welcomed gratefully into the highest order of literary achievement.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/09/16/9780060820916.jpg', 'title_long': '26a: A Novel', 'edition': 'First Edition', 'dimensions': 'Height: 8.5 inches, Length: 6 inches, Weight: 0.95 Pounds, Width: 1 inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.95}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 277, 'date_published': '2005-09-06', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Coming of Age', 'Family Life', "Women's Fiction", 'Domestic Life', 'Sisters', 'Contemporary', 'Literary'], 'authors': ['Diana Evans'], 'title': '26a: A Novel', 'isbn13': '9780060820916', 'msrp': 23.95, 'binding': 'Hardcover', 'isbn': '0060820918', 'isbn10': '0060820918'}}