{'book': {'publisher': 'Rayo', 'synopsis': "When Kenny Romero, a promising high school athlete, journeys from New York City to his summer job at the Brunet dairy farm in upstate New York, he makes choices that bring him in direct confrontation with nature and challenge his more primitive instincts for survival. His fateful decision triggers a crisis with harrowing consequences for his already troubled family.<br/>Against the background of his ordeal, each character reveals a part of his or her own struggle. During the course of the summer, as Kenny and his girlfriend, Claudia, deepen their relationship, Kenny's mother, Fran, struggles with an agonizing choice. His father, Tommy Romero, reveals why, years prior, he chose to act as he did after he had been drawn into illegal activities by Kenny's uncle, Jerry Boyle, and both were dismissed from the police force. Jerry, meanwhile, learns the true identity of Gabriel Brunet, owner of the farm. At the core of the tale is the distant secret harbored by Kenny's maternal grandmother, Mary Boyle.<br/>A vivid, gripping tale of action and mystery, Blood Fugues explores the ways in which family ties and secrets spin their way into our present lives, shaping our desires, our fears, and our futures.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/27/75/9780060742775.jpg', 'title_long': 'Blood Fugues: A Novel', 'edition': 'First Edition', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.000625 Pounds, Width: 0.97 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.97}, 'weight': {'unit': 'pounds', 'value': 0.000625}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 288, 'date_published': '2005-10-04', 'subjects': ['Literature & Fiction', 'United States', 'Hispanic'], 'authors': ['Edgardo Vega Yunque'], 'title': 'Blood Fugues: A Novel', 'isbn13': '9780060742775', 'msrp': 23.95, 'binding': 'Hardcover', 'isbn': '0060742771', 'isbn10': '0060742771'}}