{"book": {"publisher": "Harper Perennial", "synopsis": "“A master of laugh-out-loud fiction . . . Pratchett has created an alternate universe full of trolls, dwarfs, wizards, and other fantasy elements, and he uses that universe to reflect our own culture with entertaining and gloriously funny results. . . . Nothing short of magical.” —Chicago Tribune<br/>In this first novel in the internationally bestselling Discworld series from legendary New York Times bestselling author Sir Terry Pratchett (and the first in the Wizards collection), the fate of the Discworld depends on the survival of a naïve—and first-ever—sightseer.<br/>A writer of brilliant imagination favorably compared to Mark Twain, Kurt Vonnegut, and Douglas Adams, Sir Terry Pratchett created a complex, satirical universe with its own set of cultures and rules, populated with wizards, witches, academics, fairies, policemen, and other creatures both fantastical and remarkably ordinary (including Death himself). Welcome to the Discworld . . . a parallel time and place that sounds very much like our own, but looks completely different—because it’s a flat world sitting on the backs of four elephants who hurtle through space balanced on a giant turtle.<br/>In this, the maiden voyage through Terry Pratchett’s ingeniously twisted alternate dimension, the well-meaning but spectacularly inept wizard Rincewind encounters something previously unknown in the Discworld: a tourist!<br/>Twoflower has arrived to take in the sights. Unfortunately, he’s cast his lot with a most inappropriate tour guide—a decision that could result in his becoming not only Discworld’s first visitor . . . but quite possibly, its last. And, of course, he’s brought Luggage along, a companion with feet—and a mind—of its own. And teeth. . . .<br/>The Discworld novels can be read in any order, but the Wizards collection includes: The Color of Magic The Light Fantastic Sourcery Eric Interesting Times The Last Continent Unseen Academicals", "language": "en", "image": "https: //images.isbndb.com/covers/59/25/9780060855925.jpg", "title_long": "The Color of Magic: A Discworld Novel (Discworld, 1)", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 0.4 Pounds, Width: 0.54 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 0.54}, "weight": {"unit": "pounds", "value": 0.4}, "height": {"unit": "inches", "value": 8}}, "pages": 240, "date_published": "2005-09-13", "subjects": ["Literature & Fiction', 'Action & Adventure', 'Fantasy', 'Humor & Satire', 'Satire', 'Science Fiction & Fantasy', 'Epic', 'Paranormal & Urban', 'Humorous'], 'authors": ["Terry Pratchett'], 'title": "The Color of Magic: A Discworld Novel (Discworld, 1)", "isbn13": "9780060855925", "msrp": 13.99, 'binding": "Paperback", "isbn": "0060855924", "isbn10": "0060855924"}}