{"book": {"publisher": "Avon", "synopsis": "From New York Times bestselling author Meg Cabot comes the hilarious story of a lovable blabbermouth who can\"t seem to stay out of trouble. . . .<br/>What\"s an American girl with a big mouth but an equally big heart to do?<br/>Lizzie Nichols has a problem, and it isn\"t that she doesn\'t have the slightest idea what she\'s going to do with her life or that she\'s blowing what should be her down payment on a cute little Manhattan apartment on a trip to London to visit her long-distance boyfriend, Andrew. But what\'s the point of planning for the future when she\'s done it again? See, Lizzie can\'t keep her mouth shut. And it\'s not just that she can\'t keep her own secrets, she can\'t keep anything to herself.<br/>This time when she opens her big mouth, her good intentions get Andrew in major hot water. So now Lizzie\'s stuck in London with no boyfriend and no place to stay until the departure date on her nonrefundable airline ticket.<br/>Fortunately, there\'s Shari, Lizzie\'s best friend and college roommate, who\'s spending her summer in southern France, catering weddings with her boyfriend, Chaz, in a sixteenth-century ch창teau. One call and Lizzie\'s on a train to Souillae. Who cares if she\'s never traveled alone in her life and only speaks rudimentary French? One glimpse of gorgeous Ch창teau Mirac -- not to mention the gorgeous Luke, the son of Ch창teau Mirac\'s owner -- and she\'s smitten.<br/>But while most caterers can be trusted to keep a secret, Lizzie\'s the exception. And no sooner has the first cork been popped than Luke hates her, the bride is in tears, and it looks like Ch창teau Mirac is in danger of becoming a lipo-recovery spa. As if things aren\'t bad enough, her ex-boyfriend Andrew shows up looking for 'closure' (or at least a loan), threatening to ruin everything, including Lizzie\'s chance at finding real love. . . .<br/>Unless she can figure out a way to use that big mouth of hers to save the day.', 'language": "en", "image": "https: //images.isbndb.com/covers/19/89/9780060851989.jpg", "title_long": "Queen of Babble: A Novel", "edition": "First Edition", "dimensions": "Height: 8.5 Inches, Length: 5.75 Inches, Weight: 1.1 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.75}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 1.1}, "height": {"unit": "inches", "value": 8.5}}, "pages": 320, "date_published": "2006-05-23", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Feel-Good', 'Women's Fiction', 'Contemporary', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Romance', 'Romantic Comedy'], 'authors": ["Meg Cabot'], 'title": "Queen of Babble: A Novel", "isbn13": "9780060851989", "msrp": 21.95, 'binding": "Hardcover", "isbn": "0060851988", "isbn10": "0060851988"}}