{"book": {"publisher": "HarperCollins", "synopsis": '“Readers new to the work of Christopher Moore will want to know two things immediately. First: Where has this guy been hiding? (Answer: In plain sight, since he has a cult following.)…[H
        ]e writes laid back fables straight out of Margaritaville, on the cusp of humor and science fiction.”―Janet Maslin, New York Times<br/><br/>Whale researcher Nathan Quinn has a problem. It’s not a new problem; in fact, it’s been around for nearly 20 million years. And Nate’s spent most of his adult life working to solve it. You see, although everybody (well, almost everybody) knows that humpback whales sing (outside of human composition, the most complex songs on the planet) no one knows why. Nate, a Ph.D. in behavior biology, intends to discover the answer to this burning question―and soon.<br/>Every winter he and Clay Demolocus, his partner in the Maui Whale Research Foundation, ply the warm waters between the islands of Maui and Lanai, recording the eerily beautiful songs of the humpbacks and returning to their lab for electronic analysis. The trouble is, Nate’s beginning to wonder if he hasn’t spent just a little too much time in the sun. Either that, or he’s losing his mind. Because today, as he was shooting an I.D. photo of a humpback tail fluke, Nate could’ve sworn he saw the words “Bite Me” scrawled across the whale’s tail. . .", "language": "en", "image": "https: //images.isbndb.com/covers/66/85/9780060566685.jpg", "title_long": "Fluke: Or, I Know Why the Winged Whale Sings (Today Show Book Club #25)", "edition": "Reprint", "dimensions": "Height: 8 inches, Length: 5.31 inches, Weight: 0.55 Pounds, Width: 0.76 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 0.76}, "weight": {"unit": "pounds", "value": 0.55}, "height": {"unit": "inches", "value": 8}}, "pages": 321, "date_published": "2004-06-15", "subjects": ["Humor & Entertainment', 'Humor', 'Self-Help & Psychology', 'Literature & Fiction', 'Genre Fiction', 'United States', 'Humor & Satire', 'Dark Humor', 'Humorous', 'Science Fiction & Fantasy', 'Fantasy', 'Magical Realism', 'Self Service', 'Custom Stores'], 'authors": ["Christopher Moore'], 'title": "Fluke: Or, I Know Why the Winged Whale Sings (Today Show Book Club #25)", "isbn13": "9780060566685", "msrp": 20.74, "binding": "Paperback", "related": {"Kindle Edition": "0061807680", "ePub": "0061807680"}, "isbn": "006056668X", "isbn10": "006056668X", "other_isbns": [{'isbn": "9780061807688", "binding": "print"}]}}