{'book': {'publisher': 'William Morrow', 'synopsis': 'A hopeless unromantic gets a<br/>crash course in love in the fourth<br/>hilarious novel from bestselling<br/>author Anna Maxted<br/>After her disaster of a marriage ends when she is justtwenty, Hannah is convinced you have to be out of yourmind (or desperate) to tie the knot. And life without ahusband at thirty-one is just fine, thank you very much.She has a steady job working as a private investigator(albeit a mediocre one); a devoted boyfriend of fiveyears, Jason; and a wonderful relationship with her dad(it\'s a shame her mother is such a lost cause). Then, ona romantic weekend retreat to a faux-ancient castle,Jason proposes marriage, leaving Hannah with nochoice but the obvious: to turn him down cold.<br/>Much to her horror, four weeks later, Jason becomesengaged to his next-door neighbor, a fine bakerand "proficient seamstress." Has Hannah blown herlast chance at a solid relationship as her familyclaims? Jason agrees to give her another chance -- butonly if she meets his terms, among them a promise todust off the many skeletons in her closet.<br/>Brimming with her characteristic blend of humorand heartache, Anna Maxted\'s Being Committed is a perceptivelook at intimacy (and its substitutes), commitmentphobia, and the power others have over us.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/66/94/9780060096694.jpg', 'title_long': 'Being Committed: A Novel', 'edition': 'First Edition', 'dimensions': 'Height: 8.75 Inches, Length: 6.25 Inches, Weight: 1.2 Pounds, Width: 1.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1.75}, 'weight': {'unit': 'pounds', 'value': 1.2}, 'height': {'unit': 'inches', 'value': 8.75}}, 'pages': 384, 'date_published': '2004-07-27', 'subjects': ['Literature & Fiction', 'Contemporary'], 'authors': ['Anna Maxted'], 'title': 'Being Committed: A Novel', 'isbn13': '9780060096694', 'msrp': 24.95, 'binding': 'Unknown Binding', 'isbn': '0060096691', 'isbn10': '0060096691', 'other_isbns': [{'isbn': '9780061850233', 'binding': 'printisbncanonical'}]}}