{'book': {'publisher': 'William Morrow', 'synopsis': "Why is everyone rushing to flee Tampa on a cruise ship to hell?<br/>Serge is back with a bullet, torn between homicide and souvenirs. So is Coleman, torn between getting hammered and getting more hammered. Then there's good ol' Jim Davenport, the E-Team, the Diaz Brothers, and Johnny Vegas, the Accidental Virgin, cranking up the fevered action as the pot boils over on a street called Lobster Lane.<br/>It's reunion time in the Sunshine State, and we're not just talking the family jamboree of that blood-soaked criminal clan, the McGraws, whose nastiest, meanest member is finally released from prison and heads south bent on revenge. On top of it all, the government is covering up a growing list of mysterious victims across Florida who may or may not be connected to a nefarious plot being hatched against national security.<br/>But wait! There's more on the horizon! Who is the oddly familiar femme fatale named Rachael? Is Serge wrong that guns, drugs, and strippers don't mix? What sets the Non-Confrontationalists off on a rampage? What finally brings Coleman and Lenny together? Will they succeed in building the biggest bong ever? And can Serge surf a rogue wave to victory?<br/>So batten the hatches, don the life jackets, and take cover as all these questions and more are answered in the latest adventure from the acclaimed author of Hurricane Punch.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/96/98/9780060829698.jpg', 'title_long': 'Atomic Lobster: A Novel (Serge Storms)', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.23 Pounds, Width: 1.13 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.13}, 'weight': {'unit': 'pounds', 'value': 1.23}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 352, 'date_published': '2008-01-22', 'subjects': ['Literature & Fiction', 'United States', 'Humor', 'Humor & Satire', 'Humorous', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Crime'], 'authors': ['Tim Dorsey'], 'title': 'Atomic Lobster: A Novel (Serge Storms)', 'isbn13': '9780060829698', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060829699', 'isbn10': '0060829699'}}