{'book': {'publisher': 'Ecco', 'synopsis': 'With comparisons to Flaubert, Chekhov, and Faulkner, 0. Henry Award-winner John Biguenet earned wide acclaim for his debut short-story collection, The Torturer\'s Apprentice. In his much anticipated first novel, Oyster, he demonstrates the same mastery of craft and rigor of vision that led critics across the country to join Robert Olen Butler in praising this "important new writer."<br/>Set on the Louisiana coast in 1957, Oyster recounts the engrossing tale of a deadly rivalry between two families. To avoid ruin after years of declining oyster crops, Felix and Mathilde Petitjean offer their young daughter, Therese, in marriage to 52-year-old Horse Bruneau, who holds the papers on their boat and house. Bruneau has spent his life as Felix\'s rival for both the Petitjeans\' century-old oyster beds and, as we learn, Mathilde. But as Therese explains to Horse one night as they float in a pirogue alone in the marsh, "I don\'t get bought for the price of no damn boat."<br/>These characters inhabit a harsh environment in which people save themselves, if they are to be saved at all. The rapid sequence of events of the opening of the novel is typical of the sudden violence that is never more than an insult away in the muddy wastes of the marsh. People work there without a margin, their boats mortgaged to the next harvest of shrimp or oysters, their work one of the most dangerous of daily occupations, their emotions scraped raw by the grievances they cultivate and pass down to their children as the only lasting inheritance of a life of poverty.<br/>The spiraling violence of Oyster and the seething passions behind it drive an unpredictable tale of murder and revenge in which two women and the men who desire them play out a drama as elemental and inexorable as a Greek tragedy.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/83/67/9780060198367.jpg', 'title_long': 'Oyster: A Novel', 'edition': 'First Edition', 'dimensions': 'Height: 9.75 Inches, Length: 7 Inches, Weight: 1.3 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.3}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 304, 'date_published': '2002-06-04', 'subjects': ['Literature & Fiction', 'United States', 'Literary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense'], 'authors': ['John Biguenet'], 'title': 'Oyster: A Novel', 'isbn13': '9780060198367', 'msrp': 1.99, 'binding': 'Hardcover', 'isbn': '0060198362', 'isbn10': '0060198362'}}