{'book': {'publisher': 'William Morrow', 'synopsis': "The Sky Is Falling A spellbinding novel of glamour, sex, power,and murder that spans the globe<br/>If America had a royal family, the Winthrops would wear the crown. The popular, charismatic Winthrops have captured the imagination of the world with their public service, their enormous charity, and their glamorous lives. But in a single year, all five members of the family are killed in a series of accidents.<br/>Dana Evans, a beautiful young anchorwoman with a Washington television network, believes there is something more sinister behind their deaths. She begins an investigation and starts uncovering compelling evidence that she can hardly believe.<br/>In her determined pursuit of the truth, Dana never anticipated the cat-and-mouse chase that leads her through a half-dozen countries in search of a remorseless killer. As she closes in on her suspect, the shocking secrets she then unearths place Dana and her young son in dire jeopardy and -- in an unexpected turn of events -- Dana becomes the hunted.<br/>Can Dana outwit her pursuers and expose the truth that will astound the world? Readers should prepare themselves for the breathtaking journey through the skillful twists and turns of the plot that are Sidney Sheldon's hallmark.<br/>A dynamite thriller filled with all the elements that have made his previous works phenomenal bestsellers, The Sky Is Falling is Sidney Sheldon at his sizzling best.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/83/43/9780060198343.jpg', 'title_long': 'The Sky Is Falling: A Novel', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.12 Inches, Weight: 1 Pounds, Width: 1.09 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.12}, 'width': {'unit': 'inches', 'value': 1.09}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 317, 'date_published': '2000-09-12', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Thrillers & Suspense', 'Spies & Politics', 'Suspense', 'Crime'], 'authors': ['Sidney Sheldon'], 'title': 'The Sky Is Falling: A Novel', 'isbn13': '9780060198343', 'msrp': 26, 'binding': 'Hardcover', 'related': {'ePub': '0061752223'}, 'isbn': '0060198346', 'isbn10': '0060198346', 'other_isbns': [{'isbn': '9780061752223', 'binding': 'print'}]}}