{'book': {'publisher': 'William Morrow', 'synopsis': 'There is no scientist in the world like Dr. Bill Bass. A pioneer in forensic anthropology, Bass created the world\'s first laboratory dedicated to the study of human decomposition—three acres of land on a hillside in Tennessee where human bodies are left to the elements. His research at "the Body Farm" has revolutionized forensic science, helping police crack cold cases and pinpoint time of death. But during a forensics career that spans half a century, Bass and his work have ranged far beyond the gates of the Body Farm. In this riveting book, the bone sleuth explores the rise of modern forensic science, using fascinating cases from his career to take readers into the real world of C.S.I.<br/>Some of Bill Bass\'s cases rely on the simplest of tools and techniques, such as reassembling—from battered torsos and a stack of severed limbs—eleven people hurled skyward by an explosion at an illegal fireworks factory. Other cases hinge on sophisticated techniques Bass could not have imagined when he began his career: harnessing scanning electron microscopy to detect trace elements in knife wounds; and extracting DNA from a long-buried corpse, only to find that the female murder victim may have been mistakenly identified a quarter-century before.<br/>In Beyond the Body Farm, readers will follow Bass as he explores the depths of an East Tennessee lake with a twenty-first-century sonar system, in a quest for an airplane that disappeared with two people on board thirty-five years ago; see Bass exhume fifties pop star "the Big Bopper" to determine what injuries he suffered in the plane crash that killed three rock and roll legends on "the day the music died"; and join Bass as he works to decipher an ancient Persian death scene nearly three thousand years old. Witty and engaging, Bass dissects the methods used by homicide investigators every day, leading readers on an extraordinary journey into the high-tech science that it takes to crack a case.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/52/99/9780060875299.jpg', 'title_long': 'Beyond the Body Farm: A Legendary Bone Detective Explores Murders, Mysteries, and the Revolution in Forensic Science', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.86 Pounds, Width: 1.04 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.04}, 'weight': {'unit': 'pounds', 'value': 0.86}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 304, 'date_published': '2007-09-04', 'subjects': ['Biographies & Memoirs', 'True Crime', 'Murder & Mayhem', 'Law', 'Criminal Law', 'Forensic Science', 'Evidence', 'Specialties', 'Science & Math', 'Research', 'Medical Books', 'Medicine', 'Internal Medicine', 'Politics & Social Sciences', 'Social Sciences', 'Criminology'], 'authors': ['Dr. Bill Bass', 'Jon Jefferson'], 'title': 'Beyond the Body Farm: A Legendary Bone Detective Explores Murders, Mysteries, and the Revolution in Forensic Science', 'isbn13': '9780060875299', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0060875291', 'isbn10': '0060875291'}}