{'book': {'publisher': 'Dey Street Books', 'synopsis': 'When I Knew is a collection of smart, hilarious, and often poignant stories about that revelation for all gay men and women: when they first knew. In this gorgeously illustrated, cleverly designed, and colorful book, acclaimed fashion and celeb-rity photographer Robert Trachtenberg brings humor and style to the EUREKA! moments of more than eighty contributors, including B. D. Wong, Arthur Laurents, Simon Doonan, Stephen Fry, Marc Shaiman, Michael Musto, and more. Also mixed in are tales about when parents knew and when everyone else knew, as well as laugh-out-loud coming-out stories.<br/>Readers will fall in love with these anecdotes, from the seven-year-old who looked under the television set to sneak a peek under Tarzan\'s loincloth, to the inquisitive grandmother who asked her grandson, "You don\'t like a girl to get married? You prefer a boy?", to the courageous field trip participant who passed up the universal favorite burger-and-fry combo in favor of the fruit plate with cottage cheese.<br/>Filled with original art by New Yorker illustrator Tom Bachtell, historical images, and personal photographs from the contributors, When I Knew is a vibrant and witty celebration of that sometimes glorious, sometimes painful, but always captivating moment when everything suddenly makes sense.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/14/67/9780060571467.jpg', 'title_long': 'When I Knew', 'edition': 'First Edition', 'dimensions': 'Height: 10 Inches, Length: 8 Inches, Weight: 1.3448197982 Pounds, Width: 0.3 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8}, 'width': {'unit': 'inches', 'value': 0.3}, 'weight': {'unit': 'pounds', 'value': 1.3448197982}, 'height': {'unit': 'inches', 'value': 10}}, 'pages': 128, 'date_published': '2005-05-31', 'subjects': ['Humor & Entertainment', 'Humor', 'Self-Help & Psychology', 'Literature & Fiction', 'Short Stories & Anthologies', 'Anthologies', 'Politics & Social Sciences', 'Social Sciences', 'Gender Studies', 'LGBTQ+ Demographic Studies'], 'authors': ['Robert Trachtenberg'], 'title': 'When I Knew', 'isbn13': '9780060571467', 'msrp': 22.99, 'binding': 'Paperback', 'isbn': '0060571462', 'isbn10': '0060571462'}}