{'book': {'publisher': 'Harper Perennial', 'synopsis': '“A page-turner…deeply moving, beautifully written, and most inspiring. When I reached the last page, my heart was filled with joy and gratitude.” — Nien Chang, author of Life and Death in Shanghai<br/>An emotionally charged and lyrically written memoir about a remarkable odyssey from a Burmese hill tribe and a land torn by civil war to Cambridge University.<br/>It was during a tour on a trip through Burma that John Casey, a Cambridge don, first met Pascal Khoo Thwe, who was moonlighting in a Chinese restaurant to support himself as a student at Mandalay University. Thwe was born a member of the Padaung tribe in Burma where political turmoil and poverty are ever-present realities.<br/>Thwe left school to join the student rebels during the great insurrection of 1988, but remained in touch with Casey. He was forced to flee the country. It was his connection to Casey that enabled him to emigrate to England where he was admitted to Cambridge University. Despite his humble beginnings and the oppression he faced, Pascal Khoo Thwe brings us into a world forgotten by the West, but one that readers will not soon forget.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/52/33/9780060505233.jpg', 'title_long': 'From the Land of Green Ghosts: A Burmese Odyssey', 'edition': 'Reprint', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 0.63 Pounds, Width: 0.76 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 0.76}, 'weight': {'unit': 'pounds', 'value': 0.63}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 336, 'date_published': '2003-12-02', 'subjects': ['Biographies & Memoirs', 'Community & Culture', 'Asian American & Asian', 'Historical', 'Asia', 'Leaders & Notable People', 'Political', 'Memoirs', 'Travelers & Explorers', 'History', 'China', 'Southeast Asia', 'Literature & Fiction', 'Essays & Correspondence', 'Essays', 'Reference', 'Writing, Research & Publishing Guides', 'Writing', 'Travel', 'Myanmar', 'Self Service', 'Custom Stores'], 'authors': ['Pascal Khoo Thwe'], 'title': 'From the Land of Green Ghosts: A Burmese Odyssey', 'isbn13': '9780060505233', 'msrp': 13.99, 'binding': 'Paperback', 'isbn': '0060505230', 'isbn10': '0060505230'}}