{'book': {'publisher': 'Avon', 'synopsis': "Writing with her trademark wit and humour, Elaine Fox brings us another wonderfully charming contemporary romance about a beauty who finally finds love that is more than just skin deep.<br/>Life can be difficult when you're stunningly beautiful. For Roxanne Rayeaux, a Sports Illustrated swimsuit model, beauty had its costs. Not only did she have to worry constantly about how she looked, but she was considered stupid by strangers. She became romantically involved with a man who turned out to be married. So Roxanne pitched the world of diets and philanderers and moved her orange cat, Cheeto (the closest she could come to that forbidden food) to Virginia to open a restaurant. She went looking for some peace and tranquillity and instead inherited the restaurant's contentious, but sexy bartender, Steve Serrano.<br/>An average joe most of his life, Steve cannot deny Roxanne's obvious physical charms but thinks she is stuck up and pretentious -- not his type. Roxanne, suspicious of Steve's motives after a rash of break-ins occurs at the restaurant and a string of bad publicity appears in the local gossip column, cannot let her guard down around him. Besides he's not her type.<br/>If only they weren't so darned attracted to each other...", 'language': 'en', 'image': 'https://images.isbndb.com/covers/05/97/9780060740597.jpg', 'title_long': 'Special of the Day', 'edition': '1', 'dimensions': 'Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.4 Pounds, Width: 0.96 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 0.96}, 'weight': {'unit': 'pounds', 'value': 0.4}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 384, 'date_published': '2005-03-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Romance', 'Contemporary', 'Historical', 'New Adult & College'], 'authors': ['Elaine Fox'], 'title': 'Special of the Day', 'isbn13': '9780060740597', 'msrp': 5.99, 'binding': 'Mass Market Paperback', 'related': {'ePub': '0061752657'}, 'isbn': '0060740590', 'isbn10': '0060740590', 'other_isbns': [{'isbn': '9780061752650', 'binding': 'print'}]}}