{'book': {'publisher': 'Harper Business', 'synopsis': 'You start a conversation with someone you manage, a conversation about a project that could be going better. You want to improve their performance and think you know what they should do. You estimate the conversation should only take a few minutes, yet somehow 45 minutes later you\'re still going around in circles. Sound familiar?<br/>Unfortunately, improving human performance involves one of the hardest challenges in the known universe: changing the way people think. In constant demand as a coach, speaker, and consultant to companies around the world, David Rock has proven the secret to leading people (and living and working with them) is found in the space between our ears. "If people are being paid to think," he writes, "isn\'t it time the business world found out what the thing doing the work, the brain, is all about?"<br/>Supported by the latest groundbreaking research, Quiet Leadership provides, for the first time, a brain-based approach that will help busy leaders, executives, and managers improve their own and their colleagues\' performance.<br/>Quiet Leadership is for the CEO who wants to be more effective at inspiring his or her leadership team, but has just a few minutes each week to speak to them. It\'s for the executive who\'d like to get a manager to plan more effectively, but can\'t seem to work out how. It\'s for the manager who wants to inspire the sales team, but isn\'t sure how to do it. It\'s for the human resources professional who is ready to take on changing the culture of a whole organization. It\'s for the parent or caregiver who wants to reach new levels of communication and understanding with their family members.<br/>Quiet leaders are masters at bringing out the best performance in others. They improve the thinking of people around them—literally improving the way their brains process information—without telling anyone what to do. Given how many people in today\'s companies are being paid to think and analyze, improving our thinking is one of the fastest ways to improve performance.<br/>Quiet Leadership offers a practical, six-step guide to making permanent workplace performance change by unleashing higher productivity, new levels of morale, and greater job satisfaction. Above all, Quiet Leadership will give you the clarity and strength that comes from mastering and using powerful insights that teach you to perform and succeed, at the highest level.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/59/03/9780060835903.jpg', 'title_long': 'Quiet Leadership: Six Steps to Transforming Performance at Work', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.26986262912 Pounds, Width: 0.97 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.97}, 'weight': {'unit': 'pounds', 'value': 1.26986262912}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 288, 'date_published': '2006-04-11', 'subjects': ['Self-Help', 'Business & Money', 'Management & Leadership', 'Leadership & Motivation', 'Management', 'Personal Finance', 'Budgeting & Money Management', 'Health, Fitness & Dieting', 'Psychology & Counseling', 'Social Psychology & Interactions'], 'authors': ['David Rock'], 'title': 'Quiet Leadership: Six Steps to Transforming Performance at Work', 'isbn13': '9780060835903', 'msrp': 24.99, 'binding': 'Hardcover', 'isbn': '0060835907', 'isbn10': '0060835907'}}