{'book': {'publisher': 'William Morrow', 'synopsis': 'The party never ends when event planner/sleuth Madeline Bean is throwing it! The delectable creation of award-winning, number one Los Angeles Times bestselling author Jerrilyn Farmer, the irrepressible Mad Bean is back for big laughs and big trouble on the Big Island.<br/>Madeline Bean has planned phenomenal parties for Hollywood heavyweights of every ego size, but now she\'s cooking up something very special for one of her own -- a hip, surprise-destination bachelorette weekend at a fabulous-doesn\'t-do-it-justice resort in Hawaii for cherished employee and bride-to-be Holly Nichols. This hysterical riff on a luau will have everything. Tiki lamps. Hula lessons. A dead body washing in on the warm island tides. Okay, that wasn\'t in the original party plan.<br/>The uninvited corpse isn\'t the only shocker throwing a monkey wrench in the proceedings. Holly is getting cold feet about the whole engagement thing -- due, in large part, to a slight indiscretion in her past that may have left her not exactly single. Hey, what happens in Vegas is supposed to stay in Vegas, isn\'t it?<br/>But Madeline\'s not going to let a few little glitches like a mysterious preexisting husband and an island murder spoil Holly\'s wedding shower extravaganza -- not while there are still passion-fruit martinis to quaff and buff surfer boys to ogle. All she has to do is hunt down the first "Mr. Holly," who vanished the morning after, and get him to do the right thing. That, and keep a killer who\'s in their midst from leaving behind any more gruesome party favors. And then there\'s that freaking volcano that\'s making annoying ready-to-erupt noises ...', 'language': 'en', 'image': 'https://images.isbndb.com/covers/72/91/9780060587291.jpg', 'title_long': 'The Flaming Luau of Death: A Madeline Bean Novel (Madeline Bean Mysteries)', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Width: 0.85 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.85}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 240, 'date_published': '2005-03-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', "Women's Fiction", 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Cozy', 'Thrillers & Suspense', 'Suspense'], 'authors': ['Jerrilyn Farmer'], 'title': 'The Flaming Luau of Death: A Madeline Bean Novel (Madeline Bean Mysteries)', 'isbn13': '9780060587291', 'msrp': 23.95, 'binding': 'Hardcover', 'isbn': '0060587296', 'isbn10': '0060587296'}}