{'book': {'publisher': 'Harper Business', 'synopsis': 'Cullen has created a humorous and poignant chronicle of her travels around the country to discover how Americans -- baby boomers, in particular -- are reinventing the rites of dying. What she discovered is that the people who reinvented youth, redefined careers, and reconceived middle age have created a new attitude toward the afterlife. They no longer want to take death lying down; instead, they\'re taking their demise into their own hands and planning the after-party.<br/>Cullen begins her journey at a national undertakers\' convention in Nashville, where she checks out the latest in death merchandise. Traveling with her newborn infant on her back, she hears stories of modern-day funerals: lobster-shaped caskets and other unconventional containers for corpses; the booming cremation industry that has spawned a slew of "end-trepreneurs," including a company that turns cremated remains into diamonds; and even mishaps like dove releases gone horribly wrong.<br/>Cullen tours the country\'s first "green" cemetery in South Carolina, meets a mummification advocate at his pyramid in Utah, and visits the Frozen Dead Guy Days festival in Colorado. She crashes a Hmong funeral in Minneapolis and a tango funeral in Washington, D.C.<br/>Eye-opening, funny, and unforgettable, Remember Me gives an account of the ways in which Americans are designing new occasions to mark death -- by celebrating life.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/68/32/9780060766832.jpg', 'title_long': 'Remember Me: A Lively Tour of the New American Way of Death', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.01 Pounds, Width: 0.85 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.85}, 'weight': {'unit': 'pounds', 'value': 1.01}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 240, 'date_published': '2006-08-01', 'subjects': ['Business & Money', 'Science & Math', 'History & Philosophy', 'Politics & Social Sciences', 'Social Sciences', 'Popular Culture', 'Anthropology', 'Cultural', 'Sociology', 'Death'], 'authors': ['Lisa Takeuchi Cullen'], 'title': 'Remember Me: A Lively Tour of the New American Way of Death', 'isbn13': '9780060766832', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060766832', 'isbn10': '0060766832'}}