{'book': {'publisher': 'Amistad', 'synopsis': "Merging comprehensive research and grand storytelling, Mr. and Mrs. Prince reveals the true story of a remarkable pre-Civil War African-American family, as well as the challenges that faced African-Americans who lived in the North versus the slaves who lived in the South.<br/>Both accomplished people, Lucy Terry was a devoted wife and mother, and the first known African-American poet. Abijah Prince, her husband, was a veteran of the French and Indian Wars and an entrepreneur. Together they pursued what would become the cornerstone of the American dream—having a family and owning property where they could live, grow, and prosper. Owning land in both Vermont and Massachusetts, they were well on their way to settling in when bigoted neighbors tried to run them off. Rather than fleeing, they asserted their rights, as they would do many times, in court.<br/>Here is a story that not only demonstrates the contours of slavery in New England but also unravels the most complete history of a pre-Civil War black family known to exist. Illuminating and inspiring, Mr. and Mrs. Prince uncovers the lives of those who could have been forgotten and brings to light a history that's intrigued but eluded many until now.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/07/32/9780060510732.jpg', 'title_long': 'Mr. and Mrs. Prince: How an Extraordinary Eighteenth-Century Family Moved Out of Slavery and into Legend', 'edition': '1st ptg.', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.9 Pounds, Width: 0.93 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.93}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 272, 'date_published': '2008-01-22', 'subjects': ['Self-Help', 'Relationships', 'Marriage', 'Biographies & Memoirs', 'Community & Culture', 'Black & African American', 'Historical', 'United States', 'Leaders & Notable People', 'Military', 'History', 'Americas', 'Historical Study & Educational Resources', 'World', 'Politics & Social Sciences', 'Sociology', 'Race Relations'], 'authors': ['Gretchen Holbrook Gerzina'], 'title': 'Mr. and Mrs. Prince: How an Extraordinary Eighteenth-Century Family Moved Out of Slavery and into Legend', 'isbn13': '9780060510732', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060510730', 'isbn10': '0060510730'}}