{"book": {"publisher": "HarperCollins", "synopsis": ""A terrific yarn, full of smart detection and hip good humor" (Stephen King)<br/>Behind the Curtain is the second book in the Echo Falls mystery series by bestselling crime novelist Peter Abrahams, following the acclaimed Down the Rabbit Hole. Perfect for middle school readers looking for a good mystery.<br/>In this "deliciously plotted, highly satisfying adventure' (Kirkus), the Sherlock Holmes-loving eight-grade heroine, Ingrid, starts to see some alarming signs of trouble in her home. Her dad is surfing the internet in search of a job when Ingrid had no idea his job was in jeopardy. Her brother, Ty, is trying to succeed on the high school football team—perhaps at the cost of his health. And Ingrid\'s beloved soccer coach is replaced by an icy newcomer who seems a little too savvy to be in it for the postgame pizza.<br/>True to her hero, Sherlock Holmes, Ingrid begins fishing around to find out who\'s really pulling the strings in her hometown of Echo Falls. But one morning, while en route to the dreaded MathFest, Ingrid is kidnapped and locked in the trunk of a car. Even if she escapes, will anyone believe her story?<br/>The third and final book in this Edgar Award-nominated series is Into the Dark.', 'language": "en", "image": "https: //images.isbndb.com/covers/70/47/9780060737047.jpg", "title_long": "Behind the Curtain (Echo Falls Mystery, 2)", "edition": "First Edition", "dimensions": "Height: 8.5 Inches, Length: 5.75 Inches, Weight: 1.01 Pounds, Width: 1.25 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.75}, "width": {"unit": "inches", "value": 1.25}, "weight": {"unit": "pounds", "value": 1.01}, "height": {"unit": "inches", "value": 8.5}}, "pages": 352, "date_published": "2006-04-25", "subjects": ["Children's Books', 'Arts, Music & Photography', 'Performing Arts', 'Growing Up & Facts of Life', 'Family Life', 'Literature & Fiction', 'Action & Adventure', 'Mysteries & Detectives'], 'authors": ["Peter Abrahams'], 'title": "Behind the Curtain (Echo Falls Mystery, 2)", "isbn13": "9780060737047", "msrp": 15.99, 'binding": "Hardcover", "isbn": "0060737042", "isbn10": "0060737042"}}