{'book': {'publisher': 'HarperCollins', 'synopsis': 'About the Author      Laura Ruby is a Chicago-based writer and author of LILY\x92S GHOSTS, a mystery novel for children. A Parent\x92s Choice Silver Honor Award winner and a nominee for the 2004 Edgar Award for Best Juvenile Mystery, LILY\x92S GHOSTS was also selected for Chicago Public Library\x92s "Best of the Best" and the New York Public Library\x92s "Books for the Teen Age" lists. She writes short fiction for adults, which has appeared in such magazines as Other Voices, The Florida Review, and Literal Latte. As a child, Laura liked to ask people nosy questions such as "If everyone in the world was either a jerk or a creep, which one are you?" and "Would you rather have the power of invisibility or the power to fly?" She discovered that there are an awful lot of jerks flying around this world and not nearly enough invisible creeps. THE WALL AND THE WING is her tribute to them both.      Product Description      In a future New York where most people can fly and cats are a rarity, a nondescript resident of Hope House for the Homeless and Hopeless discovers that although she is shunned as a "leadfoot," she has the surprising ability to become invisible.      Review      "No need to compare to Harry Potter; with The Wall and the Wing, American fantasy takes full flight." (Esme Raji Codell, author of Educating Esme and The Diary of a Fairy Godmother)"A most engaging read." (Bookseller (London))"Witty and ironic, Ruby\'s sharp writing propels the story to an exhilarating climax" (Voice of Youth Advocates (VOYA) (Starred Review))"A wonderful combination of the buddy novel and pure fantasy. An excellent adventure, smartly written and wholly original." (www.bookslut.com)"Intriguing, offbeat fantasy. Readers will look forward to the upcoming sequel." (ALA Booklist)"Fast-paced wackiness told with humor, often black, that will have young readers giggling even as they cheer." (School Library Journal)', 'language': 'en', 'image': 'https://images.isbndb.com/covers/25/69/9780060752569.jpg', 'title_long': 'The Wall and the Wing', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 1.15 Pounds, Width: 1.09 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.09}, 'weight': {'unit': 'pounds', 'value': 1.15}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 336, 'date_published': '2006-03-01', 'subjects': ["Children's Books", 'Growing Up & Facts of Life', 'Family Life', 'Literature & Fiction', 'Science Fiction & Fantasy', 'Fantasy & Magic'], 'authors': ['Laura Ruby'], 'title': 'The Wall and the Wing', 'isbn13': '9780060752569', 'msrp': 17.89, 'binding': 'Library Binding', 'isbn': '0060752564', 'isbn10': '0060752564'}}