{'book': {'publisher': 'Harper', 'synopsis': 'National Bestseller<br/>In this inspiring book, bestselling author Wayne Dyer draws from various spiritual traditions to help us unplug from the material world and awaken to the divine with.<br/><br/>With his trademark wit, wisdom, and humor, bestselling author Wayne Dyer offers compelling testimony on the power of love, harmony, and service. When confronted with a problem, be it ill health, financial worries, or relationship difficulties, we often depend on intellect to solve it. In this radical book, Dyer shows us that there is an omnipotent spiritual force at our fingertips that contains the solution to our problems.<br/>The first part of the book provides the essential foundation for spiritual problem solving, drawing from the wisdom of Patanjali, a Yogi mystic; the second half is organized around the prayer of Saint Francis of Assisi, whose legacy is one of love, harmony, and service. Each chapter contains specific practical applications for applying the teachings of these wise men to everyday problems, including affirmations, writing exercises, and guided meditations.<br/>Profound and thought provoking, yet filled with pragmatic advice, There\'s a Spiritual Solution to Every Problem is a book about self-awareness and tapping the healing energy within all of us. As Dyer writes, "Thinking is the source of problems. Your heart holds the answer to solving them.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/23/03/9780060192303.jpg', 'title_long': "There's a Spiritual Solution to Every Problem", 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 6.12 Inches, Weight: 1.23 Pounds, Width: 0.97 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.12}, 'width': {'unit': 'inches', 'value': 0.97}, 'weight': {'unit': 'pounds', 'value': 1.23}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 288, 'date_published': '2001-08-21', 'subjects': ['Self-Help', 'Motivational', 'Personal Transformation', 'Spiritual', 'Christian Books & Bibles', 'Christian Living', 'Spiritual Growth', 'Self Help', 'Religion & Spirituality'], 'authors': ['Wayne W Dyer'], 'title': "There's a Spiritual Solution to Every Problem", 'isbn13': '9780060192303', 'msrp': 24, 'binding': 'Hardcover', 'isbn': '0060192305', 'isbn10': '0060192305'}}