{'book': {'publisher': 'Rayo', 'synopsis': '“Stella Pope Duarte is a writer who will not be stopped. Her story takes its power from a larger love, and the quest here is as pressing as any I’ve read. This is a novel that looks at a rocky, uncertain time, with the intention of helping. It does." — Ron Carlson, author of The Hotel Eden and At the Jim Bridge<br/>An inspiring novel about family, the memories of war, and a woman who valiantly rallies herself and those she loves into reconciling with the past<br/>Stella Pope Duarte’s strong and musical voice is reminiscent of Laura Esquivel and Alice Hoffman. Let Their Spirits Dance is a moving, spirited story of a family who takes a trip to the Vietnam Memorial thirty years after the war, and whose trip evolves into a spiritual journey, towards healing and redemption.<br/>Teresa Ramirez, is a schoolteacher from El Cielito in Arizona. Still haunted by the death of her brother Jesse in the Vietnam War. Her mother cherishes the memory of her son’s words to her as he boarded the plane for Vietnam, when he told her she would hear his voice again. When Teresa’s ailing mother sees a photograph of the Vietnam War Memorial, she makes a vow to touch his name on the Wall, and this begins a journey that changes the lives of Teresa and her family forever.<br/>In this powerfully evocative novel, Pope Duarte connects family, friends, and an entire nation with the names on the Wall, honoring the men and women who served in Vietnam as well as those who watched and waited, but never forgot.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/82/47/9780060548247.jpg', 'title_long': 'Que Bailen Sus Espiritus: Una Novela (Spanish Edition)', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 0.65 Pounds, Width: 0.79 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 0.79}, 'weight': {'unit': 'pounds', 'value': 0.65}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 352, 'date_published': '2003-11-04', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'Family Life', 'Short Stories & Anthologies', 'Short Stories', 'World Literature', 'United States', 'Anthologies', 'Hispanic'], 'authors': ['Stella Pope Duarte'], 'title': 'Que Bailen Sus Espiritus: Una Novela (Spanish Edition)', 'isbn13': '9780060548247', 'msrp': 1.99, 'binding': 'Paperback', 'isbn': '006054824X', 'isbn10': '006054824X'}}