{'book': {'publisher': 'Harper Business', 'synopsis': 'In a perfect corporate world, intellect, hard work, and professionalism would be recognized and rewarded regardless of the color of your skin. Kenneth Arroyo Roldan is here to tell you that nobody works in a perfect corporate world. Stellar performance alone will not determine corporate advancement—minorities need to learn and follow the rules of corporate politics. As one African American employee who started as a systems analyst at Xerox observed, "The reality was that despite your ability, if you weren\'t playing politics correctly, you would be derailed."<br/>In Minority Rules, Roldan gives a dose of tough love to minorities in corporate America while educating their majority counterparts. As the CEO of the top U.S. head-hunting firm specializing in placing minorities in fast track jobs, Roldan watched as minority superstars hired at Fortune 500 companies bailed out, disappointed and rejected after only a few years. The problem, Roldan says, is that minorities are not adequately prepared psychologically or culturally for corporate careers. In a six-step plan, he explains how to surmount the obstacles, play corporate hardball, and succeed as a minority in the workplace. Corporate culture is unforgiving to minorities, but it is possible to rise to the top with Roldan as your guide.<br/>With refreshing candor, Roldan prepares minorities both psychologically and culturally for corporate careers. Forget about using affirmative action and discrimination lawsuits to level the playing field. The only way to win is to know the landscape and master the rules of the game—from finding the right mentor to learning the art of networking to focusing on self-reliance, patience, and most of all, performance. Roldan shows minorities how to climb to the top jobs—and keep them.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/20/54/9780060852054.jpg', 'title_long': 'Minority Rules: Turn Your Ethnicity Into a Competitive Edge', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.1794731017 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 1.1794731017}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 304, 'date_published': '2006-08-29', 'subjects': ['Self-Help', 'Business & Money', 'Business Culture', 'Motivation & Self-Improvement', 'Job Hunting & Careers', 'Guides', 'Job Hunting', 'Management & Leadership', 'Motivational', 'Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies'], 'authors': ['Kenneth Arroyo Roldan', 'Gary Stern'], 'title': 'Minority Rules: Turn Your Ethnicity Into a Competitive Edge', 'isbn13': '9780060852054', 'msrp': 1.99, 'binding': 'Hardcover', 'related': {'eBook': '0062325124', 'ePub': '0062325124'}, 'isbn': '0060852054', 'isbn10': '0060852054', 'other_isbns': [{'isbn': '9780062325129', 'binding': 'print'}]}}