{'book': {'publisher': 'William Morrow', 'synopsis': "Practical advice and information from the world's foremost experts on autism -- and a mother's own hard-won lessons from helping her son recover from the disorder<br/>When Karen Siff Exkorn's son, Jake, was diagnosed with autism, she struggled to pull together comprehensive information about the disorder. Fortunately, she was able to educate herself quickly, and her extensive at-home treatment of her son led to his amazing full recovery. But the journey wasn't easy, and now, in The Autism Sourcebook, Siff Exkorn offers parents the wisdom she wishes she'd had at the beginning.<br/>Recent studies show that there is a worldwide epidemic of autism. More than 1.5 million people are affected in the United States alone, with one in every 166 children diagnosed. Early detection and early intervention are two of the key factors in improving prognosis -- but too often, writes Siff Exkorn, parents get bogged down in denial or confusion about the still mysterious disorder, and are unable to take the necessary steps. Providing accessible medical information gleaned from the world's foremost experts, Siff Exkorn offers an inside look at families with children who have autism, and ties in her own firsthand experience as a parent. The author shares valuable knowledge about the following: What the diagnosis really means Understanding and accessing treatment options Knowing your child's rights in the school system Coping with common marital and familial stress Making the stigma of autism a thing of the past<br/>With extensive appendices, including the Modified Checklist for Autism in Toddlers, Diagnostic Criteria for the Five Pervasive Developmental Disorders, and carefully selected lists of Internet resources, recommended readings, and top autism organizations worldwide, The Autism Sourcebook is the single most comprehensive, practical resource available to parents and loved ones of children with autism.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/98/85/9780060799885.jpg', 'title_long': 'The Autism Sourcebook: Everything You Need to Know About Diagnosis, Treatment, Coping, and Healing', 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.55 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.55}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 432, 'date_published': '2005-09-27', 'subjects': ['Biographies & Memoirs', 'Community & Culture', 'People with Disabilities', 'Professionals & Academics', 'Medical', 'Health, Fitness & Dieting', 'Diseases & Physical Ailments', 'Nervous System', 'Psychology & Counseling', 'Parenting & Relationships', 'Disabilities & Hyperactivity', 'Medical Books', 'Psychology', 'General', 'Self Service', 'Custom Stores'], 'authors': ['Karen Siff Exkorn'], 'title': 'The Autism Sourcebook: Everything You Need to Know About Diagnosis, Treatment, Coping, and Healing', 'isbn13': '9780060799885', 'msrp': 27.95, 'binding': 'Hardcover', 'isbn': '0060799889', 'isbn10': '0060799889'}}