{'book': {'publisher': 'Rayo', 'synopsis': '¡Por fin llega el día! Sí, Lucy Oliveira se casa, y todo a pesar de un pequeño problema: su familia está maldecida y su matrimonio está predestinado a fracasar. Todos que la conocen están de acuerdo: simplemente no existen esperanzas. Pero la superstición de los Oliveiras no contaba con las tres mejores amigas de Lucy-- Cristina, Mercedes y Annette --quienes están decididas a que llegue al altar y disfrute de un matrimonio duradero y feliz. Y lo logran-- o por lo menos así parece ser. Cuando Lucy escapa corriendo del banquete de boda, todos los trapos salen al aire, y a cada una le toca enfrentar sus propios problemas. Juntas salen de viaje hacia las montañas de Nuevo México en busca de una famosa curandera que se supone puede cambiarle la vida a las personas. La aventura en sí fortalece la amistad que comparten las cuatro amigas, les enseña a valorar sus vidas y a aprovechar al máximo todo lo que ya tienen. Pero lo que encuentran no es lo que se esperaban ... Desesperada es una novela encantadora sobre el poder de la amistad, llena de risas, amor y hasta un poquito de magia.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/14/94/9780060751494.jpg', 'title_long': 'Desesperada: Una Novela (Spanish Edition)', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 0.61 Pounds, Width: 0.83 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 0.83}, 'weight': {'unit': 'pounds', 'value': 0.61}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 368, 'date_published': '2005-06-28', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'Friendship', "Women's Fiction", 'Contemporary', 'World Literature', 'United States', 'Hispanic', 'Science Fiction & Fantasy', 'Fantasy', 'Paranormal & Urban'], 'authors': ['Lynda Sandoval'], 'title': 'Desesperada: Una Novela (Spanish Edition)', 'isbn13': '9780060751494', 'msrp': 13.99, 'binding': 'Paperback', 'isbn': '0060751495', 'isbn10': '0060751495'}}