{'book': {'publisher': 'William Morrow', 'synopsis': '"Like everyone, I am born naked."<br/>With this opening line of Naslund\'s compelling new novel, a very human Marie Antoinette invites readers to live her story as she herself experiences it. From the lush gardens of Versailles to the lights and gaiety of Paris, the verdant countryside of France, and finally the stark and terrifying isolation of a prison cell, the young queen\'s life is joyful, poignant, and harrowing by turns. As her world of unprecedented royal splendor crumbles, the charming Marie Antoinette matures into a heroine of inspiring stature, one whose nobility arises not from the circumstance of her birth but from her courageous spirit.<br/>Marie Antoinette was a child of fourteen when her mother, the Empress of Austria, arranged for her to leave her family and her country to become the wife of the fifteen-year-old Dauphin, the future King of France. Coming of age in the most public of arenas, the young queen embraces her new family and the French people, and she is embraced in return. Eager to be a good wife and strong queen, she shows her new husband nothing but love and encouragement, though he repeatedly fails to consummate their marriage and in doing so, fails to give her the thing she—and the people of France—desire most: a child and an heir to the throne.<br/>Deeply disappointed and isolated in her own intimate circle apart from the social life of the court, the queen allows herself to remain ignorant of the country\'s growing economic and political crises. She entrusts her soul to her women friends, her music teacher, her hairdresser, the ambassador from Austria, and a certain Swedish count so handsome that admirers label him "the Picture." When her innocent and well-chaperoned pilgrimage to watch the sun rise is viciously misrepresented in satiric pamphlets as a drunken orgy, the people begin to turn against her. Poor harvests, bitter winters, war debts, and poverty precipitate rebellion and revenge as the royal family and many nobles are caught up in a murderous time known as "the Terror."<br/>With penetrant insight into new historical scholarship and with wondrous narrative skill, Naslund offers an intimate, fresh, and dramatic re-creation of this compelling woman that goes beyond popular myth. Abundance reveals a compassionate and spontaneous Marie Antoinette who rejected the formality and rigid protocol of the court; an enchanting and tenderhearted outsider who was loved by her adopted homeland and people until she became the target of revolutionary cruelty and violence; a dethroned queen whose depth of character sustained her in even the worst of times.<br/>Once again, Sena Jeter Naslund has shed new light on an important moment of historical change and made that time as real to us as the one we are living now. Exquisitely detailed, beautifully written, heartbreaking and powerful, Abundance is a novel that is impossible to put down.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/53/93/9780060825393.jpg', 'title_long': 'Abundance: A Novel of Marie Antoinette', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.85 Pounds, Width: 1.65 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.65}, 'weight': {'unit': 'pounds', 'value': 1.85}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 560, 'date_published': '2006-10-03', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'United States', 'Contemporary'], 'authors': ['Sena Jeter Naslund'], 'title': 'Abundance: A Novel of Marie Antoinette', 'isbn13': '9780060825393', 'msrp': 26.95, 'binding': 'Hardcover', 'isbn': '0060825391', 'isbn10': '0060825391'}}