{'book': {'publisher': 'Harper', 'synopsis': '"Dan Neuharth\'s book demystifies much within our pasts that can hurt our intimate relationships in ways we may not even realize. If You Had Controlling Parents helps spark understanding and acceptance across generations." — John Gray, Ph.D., author of Men Are from Mars, Women Are from Venus<br/>Do you sometimes feel as if you are living your life to please others? Do you give other people the benefit of the doubt but second-guess yourself? Do you struggle with perfectionism, anxiety, lack of confidence, emotional emptiness, or eating disorders? In your intimate relationships, have you found it difficult to get close without losing your sense of self?<br/>If so, you may be among the fifteen million adults in the United States who were raised with unhealthy parental control. In this groundbreaking bestseller by accomplished family therapist Dan Neuharth, Ph.D., you\'ll discover whether your parents controlled eating, appearance, speech, decisions, feelings, social life, and other aspects of your childhood—and whether that control may underlie problems you still struggle with in adulthood. Packed with inspiring case studies and dozens of practical suggestions, this book shows you how to leave home emotionally so you can improve assertiveness, boundaries, and confidence, quiet you "inner critics," and bring more balance to your moods and relationships. Offering compassion, not blame, Dr. Neuharth helps you make peace with your past and avoid overcontrolling your children and other loved ones.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/19/17/9780060191917.jpg', 'title_long': 'If You Had Controlling Parents: How to Make Peace with Your Past and Take Your Place in the World', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.12 Inches, Weight: 1.1 Pounds, Width: 0.93 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.12}, 'width': {'unit': 'inches', 'value': 0.93}, 'weight': {'unit': 'pounds', 'value': 1.1}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 272, 'date_published': '1998-09-09', 'subjects': ['Self-Help', 'Relationships', 'Interpersonal Relations', 'Health, Fitness & Dieting', 'Mental Health', 'Psychology & Counseling', 'Applied Psychology', 'Parenting & Relationships', 'Family Relationships', 'Parent & Adult Child'], 'authors': ['Dan Neuharth'], 'title': 'If You Had Controlling Parents: How to Make Peace with Your Past and Take Your Place in the World', 'isbn13': '9780060191917', 'msrp': 25, 'binding': 'Hardcover', 'isbn': '0060191910', 'isbn10': '0060191910'}}