{"book": {"publisher": "HarperTorch", "synopsis": "The author of the bestselling Dead Witch Walking makes her hardcover debut with this spellbinding new supernatural adventure featuring the highly original Rachel Morgan.<br/>Things are going well for Rachel Morgan, witch, independent runner, and one-third of the runner service Vampiric Charms. She’s got a business, friends, even a semi-regular—and always-sexy—boyfriend. So what if Kisten is a vampire? So’s her roommate Ivy....<br/>But an unexpected call for help sends her out of Cincinnati on a desperate trip to rescue the son of her business partner Jenks. It’s fun at first, even with dealing with a human-sized Jenks (you cannot believe how much trouble a 6-foot pixy can cause, especially when he looks like a supermodel...), but the road trip quickly turns dangerous when confronting an old love becomes a fight for survival.<br/>For seeing Nick Sparagmos again is the least of Rachel’s problems--the ancient, mystical statue he has stolen holds the key to sinister, wild magic that can change humans into Weres. And for the first time in milennia, the Were packs are banding together to overthrow human and Inderlander alike. The fight that follows will shake Rachel’s very soul...and she will never be the same.", "language": "en", "image": "https: //images.isbndb.com/covers/81/93/9780060788193.jpg", "title_long": "A Fistful of Charms", "dimensions": "Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.6 Pounds, Width: 1.09 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 4.19}, "width": {"unit": "inches", "value": 1.09}, "weight": {"unit": "pounds", "value": 0.6}, "height": {"unit": "inches", "value": 6.75}}, "pages": 544, "date_published": "2006", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Romance', 'Vampires', 'Fantasy', 'Science Fiction & Fantasy', 'Paranormal & Urban', 'Romantic', 'Self Service', 'Custom Stores'], 'authors": ["Kim Harrison'], 'title": "A Fistful of Charms", "isbn13": "9780060788193", "msrp": 7.99, "binding": "Mass Market Paperback", "related": {"Kindle Edition": "0061743674", "ePub": "0061743674"}, "isbn": "0060788194", "isbn10": "0060788194", "other_isbns": [{'isbn": "9780061743672", "binding": "print"}]}}