{'book': {'publisher': 'Harper Business', 'synopsis': 'What do being a feng shui advisor, marketing consultant, and vice president of the United States have in common? The inimitable Stanley Bing presents a tasteful pile of these and other bullshit jobs, and explains how to snag one for yourself.<br/>From bestselling author and business guru Stanley Bing comes an indispensable guide for the contemporary working person—specifically, a worker who is ambitious, greedy, and lazy. In his helpful, witty, straight-shooting style, Bing, who based his entire career and several bestselling books on his own very special brand of bullshit, guides the reader through a plethora of bullshit jobs that pay well and demand very little knowledge or effort.<br/>Walmart greeters, executive headhunters, aromatherapists: The people lucky enough to have secured this type of bullshit employment are everywhere, in virtually every field—from ayurvedic healing to zoo management. Bing’s handy reference explains the myriad benefits of such bullshit ways to earn a living, and details steps readers should take to land a bullshit job of their own.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/47/94/9780060734794.jpg', 'title_long': '100 Bullshit Jobs...And How to Get Them', 'edition': 'First Edition', 'dimensions': 'Height: 7.12 Inches, Length: 5 Inches, Weight: 0.89066753848 Pounds, Width: 1.14 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5}, 'width': {'unit': 'inches', 'value': 1.14}, 'weight': {'unit': 'pounds', 'value': 0.89066753848}, 'height': {'unit': 'inches', 'value': 7.12}}, 'pages': 320, 'date_published': '2006-05-02', 'subjects': ['Self-Help', 'Success', 'Business & Money', 'Job Hunting & Careers', 'Job Hunting', 'Humor & Entertainment', 'Humor', 'Self-Help & Psychology', 'Business & Professional', 'Literature & Fiction', 'Humor & Satire', 'Satire'], 'authors': ['Stanley Bing'], 'title': '100 Bullshit Jobs...And How to Get Them', 'isbn13': '9780060734794', 'msrp': 19.95, 'binding': 'Hardcover', 'isbn': '0060734795', 'isbn10': '0060734795'}}