{'book': {'publisher': 'William Morrow', 'synopsis': "Combat silent inflammation --<br/>the most serious health<br/>threat you never heard of<br/>Heart disease is the #1 killer of Americans.<br/>Cancer is the #1 fear of Americans.<br/>Dementia is the #1 concern of Americans.<br/>What do these devastating illnesses have in common? All three have been linked to silent inflammation, a condition that occurs when the body's natural immune response goes awry. Silent inflammation can continue undetected for years, continually assaulting the heart, arteries, and even the brain -- and you will not even know it.<br/>New research confirms that obesity is a primary cause of silent inflammation. And inflammation is the smoking gun that links excess body fat to today's epidemic rise in heart disease, cancer, dementia, and countless other health threats. Although the science of this relationship is complex, the bottom line is simple: If not detected and reversed, silent inflammation will devastate generations of Americans and bankrupt an increasingly stressed health care system. The medical establishment appears to be ignorant about this problem, politicians don't talk about it -- and yet virtually everyone in the country is affected by it.<br/>In his number one New York Times bestseller The Zone, Dr. Barry Sears revolutionized the way we think about nutrition when he showed that a high-carbohydrate diet is a real risk to our health. Now, with eye-opening new research in the field of hormonal control and nutrition, Dr. Sears offers the first comprehensive plan to combat silent inflammation. This important book gives us the tools and tests we need to assess the current level of silent inflammation in our bodies -- and determine our future health.<br/>As you'll discover, the Zone dietary plan -- including supplements of high-dose, ultra-refined fish oil -- is the best way to get the hormonal control you need to reduce inflammation. In The Anti-Inflammation Zone, Dr. Sears shows exactly what steps to follow to reduce your risk of each disease and condition, or to reverse it if you have it already -- in only thirty days. And the Zone Lifestyle Program includes a week of delicious Zone-friendly meals, easy home exercises, and important stress-reducing methods -- all of which work together to put you on a path toward wellness that will improve the rest of your life.<br/>The day you start fighting silent inflammation is the day that you start to slow down the aging process -- and all the chronic diseases that come with it. Welcome to the Anti-Inflammation Zone -- and the return to wellness.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/54/63/9780060595463.jpg', 'title_long': "The Anti-Inflammation Zone: Reversing the Silent Epidemic That's Destroying Our Health", 'edition': '51329th', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.55 Pounds, Width: 1.29 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.29}, 'weight': {'unit': 'pounds', 'value': 1.55}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 416, 'date_published': '2004-12-28', 'subjects': ['Cookbooks, Food & Wine', 'Special Diet', 'Low Carbohydrate', 'Health, Fitness & Dieting', 'Diets & Weight Loss', 'Low Carb', 'Other Diets', 'Diseases & Physical Ailments', 'Heart Disease'], 'authors': ['Barry Sears'], 'title': "The Anti-Inflammation Zone: Reversing the Silent Epidemic That's Destroying Our Health", 'isbn13': '9780060595463', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0060595469', 'isbn10': '0060595469'}}