{'book': {'publisher': 'Mariner Books', 'synopsis': "THE CLASSIC BOOK THAT HAS INSPIRED MILLIONS<br/>A penetrating examination of how we live and how to live better<br/>Few books transform a generation and then establish themselves as touchstones for the generations that follow. Zen and the Art of Motorcycle Maintenance is one such book. This modern epic of a man’s search for meaning became an instant bestseller on publication in 1974, acclaimed as one of the most exciting books in the history of American letters. It continues to inspire millions.<br/><br/>A narration of a summer motorcycle trip undertaken by a father and his son, Zen and the Art of Motorcycle Maintenance becomes a personal and philosophical odyssey into fundamental questions on how to live. The narrator's relationship with his son leads to a powerful self-reckoning; the craft of motorcycle maintenance leads to an austerely beautiful process for reconciling science, religion, and humanism. Resonant with the confusions of existence, this classic is a touching and transcendent book of life.<br/>This new edition contains an interview with Pirsig and letters and documents detailing how this extraordinary book came to be.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/94/62/9780060589462.jpg', 'title_long': 'Zen and the Art of Motorcycle Maintenance: An Inquiry into Values', 'edition': 'First Edition', 'dimensions': 'Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.6 Pounds, Width: 1.12 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 1.12}, 'weight': {'unit': 'pounds', 'value': 0.6}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 540, 'date_published': '2006-04-25', 'subjects': ['Biographies & Memoirs', 'Memoirs', 'Travelers & Explorers', 'Health, Fitness & Dieting', 'Mental Health', 'Emotions', 'Literature & Fiction', 'Contemporary', 'Reference', 'Writing, Research & Publishing Guides', 'Writing', 'Religion & Spirituality', 'Buddhism', 'Zen', 'Medical Books', 'Psychology', 'General', 'Politics & Social Sciences', 'Philosophy', 'Eastern', 'Movements'], 'authors': ['Robert M Pirsig'], 'title': 'Zen and the Art of Motorcycle Maintenance: An Inquiry into Values', 'isbn13': '9780060589462', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'related': {'eBook': '0061907995', 'ePub': '0061907995'}, 'isbn': '0060589469', 'isbn10': '0060589469', 'other_isbns': [{'isbn': '9780061907999', 'binding': 'ebook'}]}}