{'book': {'publisher': 'William Morrow', 'synopsis': 'Ralph "Sonny" Barger first gained the attention of the book world with his bestselling memoir Hell\'s Angel. Now he uses what he’s learned from a life insidea subculture few will ever know to create his no-holds-barred first novel, giving readers a taste of thecamaraderie, the pain, and the thrills of what it’s like to live life on two wheels.<br/>Everett John "Patch" Kinkade just wants to be left alone. The former president of the Infidelz, the most powerful motorcycle club in California, Patch has grown weary of the responsibilities and burdens that come with the mantle of leadership. He leaves California for Arizona, determined to start a new life and to put a few hundred miles between him and the tragedy that tore his family apart.<br/>But it isn\'t long before a new crisis pulls Patch back to his old stomping grounds. Tension between the Infidelz and a rival club, the 2Wheelers, erupts one night in a lethal free-for-all, littering a casino with the corpses of club members and ordinary citizens alike. The newspapers call it a war, and Patch knows he must return to help the club, either by making peace or by charging into battle.Now it\'s not just his life at stake, but the lives of the rest of the Infidelz as well, and Patch would fight the Grim Reaper himself to protect his brothers. Prepared to destroy any man who crosses his path, even if it means confronting the demons from his past, Patch gases up his Harley, sharpens his blade, and heads out on the highway for what could be his final ride.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/25/12/9780060532512.jpg', 'title_long': 'Dead in 5 Heartbeats: A Novel', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.5 Pounds, Width: 1.05 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.05}, 'weight': {'unit': 'pounds', 'value': 0.5}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 320, 'date_published': '2003-09-23', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'United States', 'Engineering & Transportation', 'Automotive', 'Motorcycles', 'Romance', 'Action & Adventure', 'Sports & Outdoors', 'Miscellaneous', 'Motor Sports'], 'authors': ['Ralph "Sonny" Barger', 'Kent Zimmerman', 'Keith Zimmerman'], 'title': 'Dead in 5 Heartbeats: A Novel', 'isbn13': '9780060532512', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060532513', 'isbn10': '0060532513'}}