{'book': {'publisher': 'William Morrow', 'synopsis': 'What do a chamber pot, a famous poet, a family feud, and a long-ago suitor all have in common? In this delicious laugh-out-loud new novel of love and loss, rivalry and reconciliation, treasure and trash, by acclaimed author Mameve Medwed (Mail, The End of an Error), we see what happens when past and present collide. . . .<br/>Elizabeth Barrett Browning might have written about the length and breadth of love, but Abby Randolph has given up on all that, preferring to spend her time between her cluttered "needs work" apartment and the overcrowded antiques mart -- the optimistically named Objects of Desire. Yet Abby can\'t help but wonder what happened to her earlier passionate self who rejected the path set out for her, dropping out of Harvard and falling headfirst into an ill-fated love affair. . . .<br/>Then the Antiques Roadshow comes to town, and Abby turns up at the crack of dawn, artifact in hand, standing alongside thousands of Boston\'s hopefuls. But there, among the carousel horses, pipe sets, potbellied stoves, and bedraggled stuffed animals, it is Abby\'s rather ordinary -- and squalid -- piece of porcelain that gets the star treatment.<br/>Abby is barely able to enjoy her good news, for the moment the show airs, life comes back at her at full force. Everything changes: friendship, finances, family, love affairs, career, her view of others, and the way she sees herself.<br/>With this, her fourth novel, Medwed once again returns to Cambridge and, in her "sardonic, funny voice" (Chicago Tribune), "homes in on the rarified self-important atmosphere of our Ivy League institutions -- and the reflected snobbishness of the people who serve them" (New York Times Book Review).<br/>This novel is a gift to anyone who goes to a flea market or watches Antiques Roadshow, anyone who has ever defied expectations, or, especially, anyone who has never been able to extinguish an old flame.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/11/96/9780060831196.jpg', 'title_long': 'How Elizabeth Barrett Browning Saved My Life: A Novel', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.09 Pounds, Width: 0.93 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.93}, 'weight': {'unit': 'pounds', 'value': 1.09}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 272, 'date_published': '2006-03-14', 'subjects': ['Literature & Fiction', 'Genre Fiction', "Women's Fiction", 'United States', 'Humor', 'Humor & Satire', 'Contemporary', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Romance', 'Historical'], 'authors': ['Mameve Medwed'], 'title': 'How Elizabeth Barrett Browning Saved My Life: A Novel', 'isbn13': '9780060831196', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060831197', 'isbn10': '0060831197'}}