{'book': {'publisher': 'William Morrow', 'synopsis': 'Two of America\'s favorite mommies bring their edgy, hysterically funny and right-on-target look at life in the sac. Cul-de-sac, that is. Caryl Kristensen and Marilyn Kentz, two suburbanites who developed a stand-up routine that led to an ABC sitcom and later a talk show, will have readers saying to themselves, "It feels so good to know I\'m not alone," and perhaps, "Thank God that wasn\'t my kid."<br/>Meeting first as neighbors in a Petaluma cul-de-sac,"The Mommies" juggled babies, Little League, Halloween, teenagers and the secret, unwritten rules of suburban behavior. From their early dreams of glamorous bohemianism to the dirty reality of dirty diapers and carpools, motherhood may have brought its share of sacrifice, but it also sparked real friendships and strong support from the rest of the mothers out there. Now everybody\'s favorite neighbors, the Mommies tell it like you\'re over for morning coffee.<br/>Caryl and Marilyn on:<br/>Teenagers: Living with teenagers is like watching Jeopardy every night; after a while you start thinking, "Maybe I am stupid."<br/>Kids in general: There are two kinds of kids: those who grow up and become lawyers and those who need them. I have both kinds.<br/>Body Image: Don\'t you think cellulite looks a little better tan?<br/>Childbirth: The epidural was better than the sex that got me there.<br/>Fashion: The rule is this -- if you\'re wearing something that\'s hurting you, chances are it\'s hurting someone else.<br/>The Motherload, like the best of Erma Bombeck, is a savvy, savagely amusing book that speaks to the tired parent in all of us.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/18/01/9780060191801.jpg', 'title_long': "The Motherload: When Your Life's on Spin Cycle and You Just Can't Get the Lid up", 'edition': 'First Edition', 'dimensions': 'Height: 8.75 Inches, Length: 6 Inches, Weight: 0.95 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.95}, 'height': {'unit': 'inches', 'value': 8.75}}, 'pages': 256, 'date_published': '1998-04-15', 'subjects': ['Humor & Entertainment', 'Humor', 'Parenting & Relationships', 'Parenting'], 'authors': ['Caryl Kristensen', 'Marilyn Kentz'], 'title': "The Motherload: When Your Life's on Spin Cycle and You Just Can't Get the Lid up", 'isbn13': '9780060191801', 'msrp': 22, 'binding': 'Hardcover', 'isbn': '0060191805', 'isbn10': '0060191805'}}