{"book": {"publisher": "Avon", "synopsis": "Who will be the last unmarried man standing?<br/>No man in his right mind would want to get married, but every duke, earl, and viscount knows that a fellow must do his duty in the end. So four of London"s most desirable gentlemen make a wager—the prize going to the one who remains unwed the longest.<br/>Gideon Pearsall, Viscount Warton, thinks he has a fair shot at winning. After all, he"s managed to enjoy the favors of many a lady while resisting the parson"s noose. Even when he's stopped dead in his tracks by the most scandalous woman in all of London—Judith, Lady Chester—he vows to have her bedded but never wedded.<br/>Beautiful, and more than a little bit naughty, Judith has always kept herself within the bounds of respectability, even while playing by her own rules. And the experience has taught her to avoid marriage. She has no desire to resist Warton's hot kisses, and his tempting touch is impossible to ignore.<br/>But soon both Judith and Gideon can't help but wonder . . . is it possible to be a little bit wicked and still follow your heart?', 'language": "en", "image": "https: //images.isbndb.com/covers/26/24/9780060882624.jpg", "title_long": "A Little Bit Wicked (Last Man Standing, Book 1)", "edition": "Reissue", "dimensions": "Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.4 Pounds, Width: 0.96 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.19}, "width": {"unit": "inches", "value": 0.96}, "weight": {"unit": "pounds", "value": 0.4}, "height": {"unit": "inches", "value": 6.75}}, "pages": 384, "date_published": "2006-12-26", "subjects": ["Literature & Fiction', 'Genre Fiction', 'United States', 'Contemporary', 'Romance', 'Historical', 'American', 'Victorian', 'Regency'], 'authors": ["Victoria Alexander'], 'title": "A Little Bit Wicked (Last Man Standing, Book 1)", "isbn13": "9780060882624", "msrp": 6.99, "binding": "Mass Market Paperback", "related": {"Kindle Edition": "0061796778", "ePub": "0061796778"}, "isbn": "006088262X", "isbn10": "006088262X", "other_isbns": [{'isbn": "9780061796777", "binding": "print"}]}}