{'book': {'publisher': 'William Morrow', 'synopsis': "matchmaker⟊anis Spindel offers proven strategies on dating and mating for women of any age looking for a committed and loving relationship.<br/>Janis Spindel brings over a decade of experience to her book, which lays out a clear road map for women who are single but don't want to be. Get Serious About Getting Married explains how to get ready for the mating, dating, and marriage scene, how to define what you are looking for in a mate, and how to let go of preconceived notions about the perfect man. Janis's program emphasizes that you have to love yourself before a man can love you.<br/>The book describes a practical method by which women can achieve lasting and satisfying relationships, breaking down the search for a mate into four parts:<br/>㟐reparation: Janis encourages her readers to improve their personalities, their bodies, and their souls, and then to prioritize their goals and get in touch with their values before embarking on their search for a life partner. She will emphasize trust and open and honest communication in dating, since these qualities are the foundation of long–lasting love.<br/>㟃reation of Opportunity: Janis swears that good single men DO exist, and that they can be found just about anywhere using her step–by–step program. Once a woman looks good, feels good, and is clear about her priorities, the book offers numerous suggestions about how women can ⦥t out there⟡nd meet someone栴 any age. There will be lists of meeting ⣯s and don'ts⟡nd the pleasures and pitfalls of numerous dating–and–mating scenarios.<br/>㟍aking a Match: This takes a woman through the early period of dating, when important decisions about a potential mate must be made, and the advice in this section will help a woman to analyse whether a man would make a good husband.<br/>㟍oving Toward Marriage: This section covers what it takes to make that final step towards the altar, and how to keep the romance of the relationship alive forever.<br/>Filled with courtship flow–charts, interactive progress reports, self–analysis checklists, questionnaires, weekly and monthly to–do tips, and candid, age–specific advice on sexual ethics, it will address all of the questions, concerns, and needs of single women who are looking for love.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/87/32/9780060578732.jpg', 'title_long': 'Get Serious About Getting Married: 365 Proven Ways to Find Love in Less Than a Year', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.15 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.15}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 304, 'date_published': '2004-12-28', 'subjects': ['Self-Help', 'Relationships', 'Interpersonal Relations', 'Love & Romance', 'Marriage', 'Politics & Social Sciences', 'Social Sciences'], 'authors': ['Janis Spindel', 'Karen Kelly'], 'title': 'Get Serious About Getting Married: 365 Proven Ways to Find Love in Less Than a Year', 'isbn13': '9780060578732', 'msrp': 22.95, 'binding': 'Hardcover', 'isbn': '0060578734', 'isbn10': '0060578734'}}