{'book': {'publisher': 'William Morrow', 'synopsis': "On December 26,1983, Art Berg was on his way to see his fiancée when his car went off the road. A broken neck left him a quadriplegic. Doctors immediately began to impose limits on his life: He would not walk, hold a job, or have children. Those doctors never could have guessed that the man lying before them was determined to prevail, and would, in fact, one day wear his own Super Bowl ring. In The Impossible Just Takes a Little Longer, Berg recounts his harrowing and inspirational story while imparting larger lessons about life, fear, and passion.<br/>Doctors insisted that Berg would need an electric wheelchair, as a manually operated one would be too taxing for his withered arms. But he knew they were wrong. Ultimately, in his hand-powered wheelchair, Berg set a world record in an ultramarathon. And less than a decade after his accident, he had established a thriving career as a motivational speaker, giving more than 150 speeches around the country each year.<br/>But success did not arrive without deep struggles with discouragement, frustration, anger, and often overwhelming uncertainty. He had to ask himself many tough questions and teach himself to find happiness. While Berg suffers from physical paralysis, he understands that hundreds of thousands of people suffer from emotional paralysis: They feel beaten down by fate, lost, and unfulfilled. Instead of knowing the exhilaration of life's possibilities, they are paralyzed by its limitations. Through his own inspiring journey back to a mobile, satisfying, passion filled life, Berg has learned many important lessons that will help anyone frozen by fear or frustration: Courageous people are not unafraid.<br/>The problem isn't what you can't do, it's what you won't do.<br/>Don't let a bad day turn into a bad life.<br/>Remember, some miracles take time.<br/>Adversity does not lead us away from our best ambitions, but closer to them.<br/><br/>The Impossible Just Takes a Little Longer is not just the story of one man's happiness; it is a reflection on what happiness means. Art Berg found his own success and built his own peace. In these pages, he doesn't define what his readers' hopes should be; instead, he leads them to ways to define those hopes for themselves.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/99/06/9780060199906.jpg', 'title_long': 'The Impossible Just Takes a Little Longer: Living with Purpose and Passion', 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.1 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.1}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 240, 'date_published': '2002-03-05', 'subjects': ['Self-Help', 'Motivational'], 'authors': ['Art Berg'], 'title': 'The Impossible Just Takes a Little Longer: Living with Purpose and Passion', 'isbn13': '9780060199906', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0060199903', 'isbn10': '0060199903'}}