{'book': {'publisher': 'William Morrow', 'synopsis': 'We always hear how everyone in America is firmly planted in red or blue. They\'re permanently conservative or irreversibly liberal. But are we all really that locked in to the left or the right? Is America still a place where it\'s possible to change someone\'s mind and get them to cross over to the other side of the ideological fence? Is it possible to do that to yourself?<br/>For John Moe, it simply wasn\'t enough to just read the Wall Street Journal editorial page a little more often or buy a framed picture of Barry Goldwater. He went in all the way, drinking deep from all aspects of the conservative universe to see if he could become that which he encountered.<br/>Raised in a family of proud left-wingers (except for his late father, whose fondness for Nixon he is forced to confront) and living in deeply liberal Seattle most of his life, Moe set out to determine if what we believe is based on environment or actual conviction. Was there actually a conservative trapped inside him all along, just yearning to be set free? Moe puts himself on a strict conservative regimen: He resets his radio dials from NPR to Rush Limbaugh, goes head-to-head with some of today\'s most influential conservative thinkers for a series of "conversion sessions," makes pilgrimages to the Ronald Reagan and Richard M. Nixon museums, spends the Fourth of July in the most Bush-friendly county in the country, attempts to set his inner Charlton Heston loose at a gun range, flies cross-country to be nearer to Toby Keith, and test-drives the type of massive gas-guzzling SUV so feared and loathed by liberals (and becomes uncomfortably fond of it). Through it all he tries to maintain positive standing with his lefty wife and young but already liberal kids, including their four-year-old son, who joins the Sierra Club. These are but a few of the adventures chronicled in Moe\'s hilarious and timely first book.<br/>Conservatize Me will strike a powerful chord with millions of disgruntled Americans ready for a fresh, humorous, and highly entertaining look at our country\'s political landscape. Moe\'s sharply observed prose will have enormous appeal for anyone interested in a new perspective on debates that have, for years, preoccupied our country and dominated our bestseller lists. Will Moe end up getting a Dick Cheney tattoo and swearing loyalty to the Christian Coalition? Will he get a Dennis Kucinich tattoo and dedicate his life to cooking vegan food at protest rallies? Read Conservatize Me and find out.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/40/10/9780060854010.jpg', 'title_long': 'Conservatize Me: How I Tried to Become a Righty with the Help of Richard Nixon, Sean Hannity, Toby Keith, and Beef Jerky', 'edition': 'First Edition', 'dimensions': 'Height: 8.5 Inches, Length: 5.5 Inches, Weight: 1 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 320, 'date_published': '2006-10-03', 'subjects': ['Humor & Entertainment', 'Humor', 'Political', 'Literature & Fiction', 'Humor & Satire', 'Satire', 'Politics & Social Sciences', 'Social Sciences', 'Popular Culture', 'Sociology', 'Politics & Government', 'Ideologies & Doctrines'], 'authors': ['John Moe'], 'title': 'Conservatize Me: How I Tried to Become a Righty with the Help of Richard Nixon, Sean Hannity, Toby Keith, and Beef Jerky', 'isbn13': '9780060854010', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060854014', 'isbn10': '0060854014'}}