{"book": {"publisher": "Harper Perennial Modern Classics", "synopsis": "One of The Atlantic’s Great American Novels<br/>“If one had to identify the single most influential shaping force in modern Black literary history, one would probably have to point to Wright and the publication of Native Son.” – Henry Louis Gates Jr.<br/>"The most powerful American novel to appear since The Grapes of Wrath." —The New Yorker<br/>When it was first published in 1940, Native Son established Richard Wright as a literary star. In the decades since, Wright\"s masterpiece—hailed by Newsweek as 'a novel of tremendous power and beauty'—has become a revered classic that remains as timely and relevant today as when it first appeared.<br/>Set in Chicago in the 1930s, Native Son is the story of Bigger Thomas, a young Black man caught in a downward spiral after killing a young white woman in a brief moment of panic. Written with the distinctive rhythm of a modern crime story, this formidable work is both a condemnation of social injustice and an unsparing portrait of the Black experience in America, revealing the tragic effect of poverty, racism, and hopelessness on the human spirit. 'I wrote Native Son to show what manner of men and women our \'society of the majority\' breeds, and my aim was to depict a character in terms of thw living tissue and texture of daily consciousness,' Wright explained.<br/>This edition of Native Son—the restored text established by the Library of America—is the novel as Wright intended it to be published. It also includes an essay by Wright titled, How 'Bigger' was Born,along with notes on the text.', 'language": "en", "image": "https: //images.isbndb.com/covers/75/63/9780060837563.jpg", "title_long": "Native Son (Perennial Classics)", "edition": "1", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 0.85 Pounds, Width: 1.23 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 1.23}, "weight": {"unit": "pounds", "value": 0.85}, "height": {"unit": "inches", "value": 8}}, "pages": 544, "date_published": "2023-01-10", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Historical', 'United States', 'Black & African American', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Richard Wright'], 'title": "Native Son (Perennial Classics)", "isbn13": "9780060837563", "msrp": 10.99, "binding": "Paperback", "isbn": "006083756X", "isbn10": "006083756X", "other_isbns": [{'isbn": "9780061935411", "binding": "print"}]}}