{'book': {'publisher': 'William Morrow', 'synopsis': "If any of this sounds familiar, you're not alone. We've become a nation of lonely serial daters, consumed by work, suspicious of romance, so unsure of finding lasting love that we settle for dispiriting blind dates and the company of friends. In short, we've forgotten how to fall in love.<br/>But help is on the way. In Why Can't I Pall in Love? Shmuley Boteach, author of the international bestseller Kosher Sex, offers hope for anyone who wonders why love is so hard to find. Bringing love into your life, he counsels, is about more than just sizing up candidates and waiting for a ring. It's about finding your way back to innocence -- back to the Garden, where Adam and Eve invented romance.<br/>Combining anecdotes with practical tips, Boteach proposes a radical new approach to love, an approach designed to help singles and those in long-term relationships alike. And his Twelve LoveSteps program describes measures anyone can take to make the dream of love a reality, including: Heal your love wound Call a moratorium on dating Let go of people who are wasting your time Recapture your mental virginity<br/>Filled with helpful exercises -- including a Declaration of Dependence to be signed and shared with potential mates -- Why Can't I Fall in Love? offers a refreshingly positive strategy to help you embrace love...and change your life.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/34/65/9780060393465.jpg', 'title_long': "Why Can't I Fall in Love? A 12-Step Program", 'edition': 'First Edition', 'dimensions': 'Height: 9.5 Inches, Length: 6.5 Inches, Weight: 1.15 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.15}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 304, 'date_published': '2001-05-15', 'subjects': ['Self-Help', 'Relationships', 'Interpersonal Relations', 'Love & Romance', 'Parenting & Relationships', 'Religion & Spirituality', 'Judaism'], 'authors': ['Rabbi Shmuley Boteach'], 'title': "Why Can't I Fall in Love? A 12-Step Program", 'isbn13': '9780060393465', 'msrp': 25, 'binding': 'Hardcover', 'isbn': '0060393467', 'isbn10': '0060393467'}}