{"book": {"publisher": "Harper Perennial", "synopsis": "Now a TV series on FOX starring Morris Chestnut, Yaya DaCosta, Nadine Ellis, and Joe Morton.<br/>"Fascinating. . . . [Graham] has made a major contribution both to African-American studies and the larger American picture." —New York Times<br/>Debutante cotillions. Million-dollar homes. Summers in Martha\"s Vineyard. Membership in the Links, Jack & Jill, Deltas, Boule, and AKAs. An obsession with the right schools, families, social clubs, and skin complexion. This is the world of the black upper class and the focus of the first book written about the black elite by a member of this hard-to-penetrate group.<br/>Author and TV commentator Lawrence Otis Graham, one of the nation\'s most prominent spokesmen on race and class, spent six years interviewing the wealthiest black families in America. He includes historical photos of a people that made their first millions in the 1870s. Graham tells who\'s in and who\'s not in the group today with separate chapters on the elite in New York, Los Angeles, Washington, Chicago, Detroit, Memphis, Atlanta, Philadelphia, Nashville, and New Orleans. A new Introduction explains the controversy that the book elicited from both the black and white communities.', 'language": "en", "image": "https: //images.isbndb.com/covers/43/80/9780060984380.jpg", "title_long": "Our Kind of People: Inside America"s Black Upper Class", 'edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 0.77 Pounds, Width: 1.04 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 1.04}, "weight": {"unit": "pounds", "value": 0.77}, "height": {"unit": "inches", "value": 8}}, "pages": 448, "date_published": "1999-12-22", "subjects": ["History', 'Americas', 'United States', 'Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies', 'Sociology', 'Class'], 'authors": ["Lawrence Otis Graham'], 'title": "Our Kind of People: Inside America"s Black Upper Class", 'isbn13": "9780060984380", "msrp": 10.99, "binding": "Paperback", "related": {"eBook": "0061870811", "ePub": "0061870811"}, "isbn": "0060984384", "isbn10": "0060984384", "other_isbns": [{'isbn": "9780061870811", "binding": "ebook"}]}}