{'book': {'publisher': 'Harper Perennial', 'synopsis': '“Limbaugh’s meticulously researched book is a devastating indictment of liberal intolerance-and a call to arms for all true believers of religious liberty to reclaim their rightful place in the public square.”―Michelle Malkin, nationally syndicated columnist and author of Invasion<br/><br/>This New York Times bestseller is that rare phenomenon, a book with a startling argument which makes its case with quiet force. David Limbaugh (brother of Rush Limbaugh) argues that the principles of the Founding Fathers are being subverted with the elimination of school prayer, with students being forbidden from wearing Christian symbols such as a simple cross or in the story of Christianity in America being eradicated from history textbooks. This persuasive book shows that our social engineers inculcate a hatred of Christianity and its values in the name of “diversity” and “tolerance” and “multiculturalism.”<br/>Limbaugh contrasts our current condition of American education with the traditional place of prominence the Bible formerly held in schools. What is now held to be unconstitutional by our courts was what the Founders intended; activist judges in our courts are doing their best to eliminate Christianity from public life, says Limbaugh.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/20/73/9780060732073.jpg', 'title_long': 'Persecution: How Liberals Are Waging War Against Christianity', 'edition': 'Reprint', 'dimensions': 'Height: 8 Inches, Length: 5.3125 Inches, Weight: 0.9 Pounds, Width: 1.16 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.3125}, 'width': {'unit': 'inches', 'value': 1.16}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 464, 'date_published': '2004-09-07', 'subjects': ['Christian Books & Bibles', 'Christian Living', 'History', 'World', 'Religious', 'Religion & Spirituality', 'Religious Studies', 'Church & State', 'Politics & Social Sciences', 'Social Sciences', 'Popular Culture', 'Politics & Government', 'Ideologies & Doctrines', 'Specific Topics', 'Self Service', 'Custom Stores'], 'authors': ['David Limbaugh'], 'title': 'Persecution: How Liberals Are Waging War Against Christianity', 'isbn13': '9780060732073', 'msrp': 16.99, 'binding': 'Paperback', 'isbn': '0060732075', 'isbn10': '0060732075'}}