{'book': {'publisher': 'William Morrow', 'synopsis': "The maestro of pulse-pounding suspense delivers an explosive new white-knuckle thriller featuring deputy U.S. Marshal Tim Rackley -- a lawman driven by honor, morality, and a thirst for justice. The leader of one of the country's most violent biker gangs, Den Laurey should have been behind bars. But thanks to a daring escape on an L.A. freeway, several deputy marshals are dead and Laurey is riding free. Rackley, back on the Service's warrant squad, is in hot pursuit of the outlaw and his ruthless gang -- with a media whirlwind and the entire Los Angeles law-enforcement community driving him.<br/>Just when Laurey is within his grasp, circumstances force Rackley to let him go -- with devastating results. A few miles up the road, a sheriff's deputy is attacked: Tim's pregnant wife, Dray. Driven by guilt, Tim vows to hunt Laurey down -- a search that will lead him into a dark world of deception and lies, a world of criminals and undercover cops, drugs and mutilation. And the key to the violent puzzle lies in the discarded corpses of women -- women for whom Tim must seek justice when no one else will. With the stakes rising, Tim must unravel a horrifying secret and confront a deadly terror that reaches from the back alleys of Mexico to the poppy fields of Afghanistan ... and threatens to explode on the dark streets of L.A.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/14/10/9780060731410.jpg', 'title_long': 'Troubleshooter: A Novel', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.25 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.25}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 320, 'date_published': '2005-08-30', 'subjects': ['Literature & Fiction', 'United States', 'Contemporary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Spies & Politics', 'Suspense'], 'authors': ['Gregg Hurwitz'], 'title': 'Troubleshooter: A Novel', 'isbn13': '9780060731410', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060731419', 'isbn10': '0060731419'}}