{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': '"Here\'s the deal. You are in the biggest, most important growth spurt of your life. This is the most critical time for you to learn to eat right and treat your body with the respect—and the nutrition—it deserves."<br/>–from The Diet for Teenagers Only<br/>Teenage girls face a relentless assault on their self-esteem: television, the Internet, and magazines all barrage young women with images of perfection—and that perfection is closely linked with being thin. Over the last decade, this has led to larger health issues like eating disorders and even increased obesity. In The Diet for Teenagers Only, Carrie Wiatt and Barbara Schroeder give teenagers the dietary weapons they need to fight back and make smart, independent decisions by answering their most burning questions… Just what is a calorie, anyway? What\'s the best way to lose ten pounds? Or do I really need to lose that weight? I think I may have an eating disorder. What should I do? I hate eating breakfast. Can I just skip it?<br/>A breakthrough diet plan specifically tailored for teenagers and their rapidly changing bodies and lifestyles, The Diet for Teenagers Only is written in a conversational, lighthearted voice. Filled with practical tips and must-have information, you\'ll find: color cutouts of favorite foods that clarify what portion sizes should look like recommended 7–day meal plans for different calorie needs—and create-your-own-menu options easy-to-follow recipes and grocery shopping tips a complete illustrated exercise program to boost energy and strengthen young bodies a personal food diary for charting daily progress<br/>For teenagers who struggle with food and their weight, or for those who simply want a head start on designing a smart and satisfying lifestyle, The Diet for Teenagers Only serves up fun, safe, and inspirational ways to be healthy whithout losing sight of the larger picture: While striving to improve your body can be a very healthy goal, learning to love your body is a far more important achievement—and one that will last a lifetime!', 'language': 'en', 'image': 'https://images.isbndb.com/covers/36/16/9780060793616.jpg', 'title_long': 'The Diet for Teenagers Only', 'edition': '1', 'dimensions': 'Height: 9.12 Inches, Length: 7.38 Inches, Weight: 1.11 Pounds, Width: 0.64 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.38}, 'width': {'unit': 'inches', 'value': 0.64}, 'weight': {'unit': 'pounds', 'value': 1.11}, 'height': {'unit': 'inches', 'value': 9.12}}, 'pages': 256, 'date_published': '2005-05-03', 'subjects': ["Children's Books", 'Growing Up & Facts of Life', 'Health', 'Health, Fitness & Dieting', 'Diets & Weight Loss', 'Other Diets', 'Exercise & Fitness', 'For Children', 'Teen & Young Adult', 'Personal Health', 'Diet & Nutrition', 'Fitness & Exercise', 'Social Issues'], 'authors': ['Barbara Schroeder', 'Carrie Wiatt'], 'title': 'The Diet for Teenagers Only', 'isbn13': '9780060793616', 'msrp': 19.99, 'binding': 'Paperback', 'isbn': '0060793619', 'isbn10': '0060793619'}}