{'book': {'publisher': 'Avon', 'synopsis': "SEALS THE WARRIOR BREED: ENDURING FREEDOM<br/>Jay H. Riker<br/>The tenth book in the successful SEALS THE WARRIOR BREED series finds the elite members of the Navy SEALs facing their first test in combat after September 11th – in Afghanistan.<br/>In the past, the SEALs have fought for different reasons. In World War II, they fought for freedom, determined to halt the Nazi war machine before it was too late. In Vietnam, they fought for loyalty, willing to risk their lives if it meant protecting their fellow soldiers. Now the place is Afghanistan, and the SEALs will be fighting for something even more personal––revenge.<br/>In the first military action after September 11th, the SEALs are assigned to Afghanistan, the home of the Taliban and a breeding ground for Islamic fundamentalist terrorists. The SEALs know that the men responsible for the most deadly attack on American soil in the country's history could be around the next dune, or inside the next village, and they're determined to get the job done...no matter the cost.<br/>The ever–expanding fan base interested in the U.S. Navy SEALs. This is the fiction series about that elite force.<br/>Fans of the previous books in this series.<br/>Readers who enjoy H.Jay Riker's new submarine series, The Silent Service.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/59/76/9780060585976.jpg', 'title_long': 'Seals the Warrior Breed: Enduring Freedom', 'edition': 'First Edition', 'dimensions': 'Height: 6.75 Inches, Length: 4.1875 Inches, Weight: 0.45 Pounds, Width: 1.08 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.1875}, 'width': {'unit': 'inches', 'value': 1.08}, 'weight': {'unit': 'pounds', 'value': 0.45}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 432, 'date_published': '2005-11-29', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'War', 'United States', 'Contemporary', 'Self Service', 'Custom Stores'], 'authors': ['H. Jay Riker'], 'title': 'Seals the Warrior Breed: Enduring Freedom', 'isbn13': '9780060585976', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'isbn': '0060585978', 'isbn10': '0060585978'}}