{'book': {'publisher': 'William Morrow Cookbooks', 'synopsis': 'At 278 pounds, Susan Maria Leach couldn\'t fit into a roller coaster seat, couldn\'t tie a bathrobe around herself, couldn\'t even ride with her husband on the back of his Harley. Enough was enough. Susan underwent gastric bypass weight loss surgery. Now Susan weighs in at a mere 135 pounds. Her book, Before & After, is the story of her incredible journey from being too big to enjoy her life, to being able to truly enjoy life to its fullest.<br/>Now Susan can fit into that roller coaster seat, completely tie that robe, and ride on the back of her husband\'s Harley.<br/>More than one hundred thousand people had weight loss surgery in 2003, and as those pounds continue to drop, the number of people opting for the surgery continues to rise.<br/>Part memoir and part cookbook, Before & After includes a foreword by Susan\'s surgeon, comments from a nutritionist, and a section on frequently asked questions. It is an intimate account of Susan\'s own transformation, as well as a universal guide for those who have undergone or are considering the procedure.<br/>After her own success, Susan participated in support groups for weight loss surgery patients. There, she discovered that people had as many questions about life after surgery as they had about the operation itself. Before & After answers those questions and many more. An accomplished home cook and longtime culinary enthusiast, Susan quickly became known as the "lady with the recipes."<br/>Determined not to give up good food and a flexible lifestyle, Susan worked hard to develop recipes that meet her nutritional requirements, yet are delicious and satisfying for her, her family, and her guests. The 100 recipes -- which include everything from Roasted Salmon with Mango Salsa and Italian Meatballs to Belgian Chocolate Cheesecake and Lemon Meringue Pie -- make about four servings, but each comes with a measured serving for WLS people along with a calorie/carb/fat/protein count. Susan has recipes for every step of the way, from tastes-like-the-real-thing milk shakes for those first post-op days to an entire Thanksgiving menu. Before & After is a journal of Susan\'s own inspirational story, where she shares her ups and downs, her tips and techniques, but mostly it\'s a book about hope for anyone who has a serious weight problem.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/72/24/9780060567224.jpg', 'title_long': 'Before and After: Living and Eating Well After Weight Loss Surgery', 'edition': '1', 'dimensions': 'Height: 9.48817 Inches, Length: 6.49605 Inches, Weight: 0.95 Pounds, Width: 1.25984 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.49605}, 'width': {'unit': 'inches', 'value': 1.25984}, 'weight': {'unit': 'pounds', 'value': 0.95}, 'height': {'unit': 'inches', 'value': 9.48817}}, 'pages': 272, 'date_published': '2004-05-04', 'subjects': ['Biographies & Memoirs', 'Memoirs', 'Professionals & Academics', 'Culinary', 'Cookbooks, Food & Wine', 'Special Diet', 'Weight Loss', 'Health, Fitness & Dieting', 'Diets & Weight Loss', 'Other Diets'], 'authors': ['Susan Maria Leach'], 'title': 'Before and After: Living and Eating Well After Weight Loss Surgery', 'isbn13': '9780060567224', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060567228', 'isbn10': '0060567228'}}