{'book': {'publisher': 'Ecco', 'synopsis': 'Winner of the National Book Critics Circle Award for Fiction and a finalist for the National Book Award<br/>“Brilliantly done . . . grand, intimate, and joyous.” —New York Times Book Review<br/>From the PEN/Hemingway Award-winning author of the critically acclaimed short story collection, Brief Encounters with Che Guevara, comes Billy Lynn\'s Long Halftime Walk ("The Catch-22 of the Iraq War" —Karl Marlantes).<br/>Three minutes and forty-three seconds of intensive warfare with Iraqi insurgents—caught on tape by an embedded Fox News crew—has transformed the eight surviving men of Bravo Squad into America’s most sought-after heroes. Now they’re on a media-intensive nationwide tour to reinvigorate public support for the war. On this rainy Thanksgiving Day, the Bravos are in Texas Stadium, slated to be part of the halftime show.<br/>Among the Bravos is nineteen-year-old Specialist Billy Lynn. Surrounded by patriots sporting flag pins on their lapels and support our troops bumper stickers, he is thrust into the company of the team’s owner and his coterie of wealthy colleagues; a born-again cheerleader; a veteran Hollywood producer; and supersized players eager for a vicarious taste of war. Over the course of this day, Billy will drink and brawl, yearn for home and mourn those missing, face a heart-wrenching decision and discover pure love and a bitter wisdom far beyond his years.<br/>Poignant, riotously funny, and exquisitely heartbreaking, Billy Lynn’s Long Halftime Walk is a searing and powerful novel that has cemented Ben Fountain’s reputation as one of the finest writers of his generation.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/55/95/9780060885595.jpg', 'title_long': "Billy Lynn's Long Halftime Walk", 'edition': '1st', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.15 Pounds, Width: 1.05 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.05}, 'weight': {'unit': 'pounds', 'value': 1.15}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 320, 'date_published': '2012-05-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'TV, Movie, Video Game Adaptations', 'Political', 'War', 'Coming of Age', 'United States', 'Humor & Satire', 'Dark Humor', 'Literary'], 'authors': ['Ben Fountain'], 'title': "Billy Lynn's Long Halftime Walk", 'isbn13': '9780060885595', 'msrp': 25.99, 'binding': 'Hardcover', 'isbn': '0060885599', 'isbn10': '0060885599', 'other_isbns': [{'isbn': '9780062096821', 'binding': 'print'}]}}