{'book': {'publisher': 'Harper', 'synopsis': "Whether you're a casual player or a No-Limit Texas Hold 'Em champion, apply your poker skills to the world of business -- and gain the edge that will help you rake in the big pots!<br/>What if your job was as much fun as a poker game? What if business followed the same rules and strategies that are used in Texas Hold 'Em? What if your career was an exciting game filled with challenging opponents and chances to win big?<br/>Well, it can be -- and All In: Poker Night Lessons for Winning Big at Your Career will show you how. The business world is very similar to poker. It's a game where anticipating your opponent's next move and making educated guesses at the cards he or she is holding is just as important as knowing how to play your own hand and having a strategy for how you want to be perceived by others. Winning at poker -- and in business -- demands an understanding of human psychology, an educated foundation in the game itself, and the courage to go all in -- putting everything you have on the line at the right time, against the right opponents.<br/>All you have to know are the basic rules of poker -- the theories and ideas that can be applied to all facets of the business world. From the student hunting for that first job to the CEO out to beat the competition, anyone who is looking for a way to take control of their career and have fun while doing it will want to play their next hand with a copy of All In by their side. It may not land you a seat at the final table of the World Series of Poker, but it may land you a seat in the corner office.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/34/86/9780060873486.jpg', 'title_long': 'All In: Poker Night Lessons for Winning Big at Your Career', 'edition': 'First Edition', 'dimensions': 'Height: 8.5 Inches, Length: 5.75 Inches, Weight: 0.9 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 224, 'date_published': '2005-11-01', 'subjects': ['Business & Money', 'Job Hunting & Careers', 'Guides', 'Humor & Entertainment', 'Puzzles & Games', 'Poker'], 'authors': ['Geoff Graber'], 'title': 'All In: Poker Night Lessons for Winning Big at Your Career', 'isbn13': '9780060873486', 'msrp': 24.95, 'binding': 'Hardcover', 'related': {'eBook': '0062041479', 'ePub': '0062041479'}, 'isbn': '0060873485', 'isbn10': '0060873485', 'other_isbns': [{'isbn': '9780062041470', 'binding': 'print'}]}}