{'book': {'publisher': 'William Morrow', 'synopsis': "There are places that can remake you -- slippery, gray places. Places that hold their secrets in the fog and whisper them on the wind. And when Brandy, a floundering, trashy, Latin-spewing cocktail waitress, finds herself drifting across the line between the ordinary world and just such a place, something fearsome and beautiful happens. Something changes.<br/>Sweeping across centuries and into the Aleutian Islands of Alaska's Bering Sea, And She Was begins with a decision and a broken taboo when three starving Aleut mothers decide to take their fate into their own hands and survive the devastation of Russian conquest. The shadow of their heroic and tragic decision reaches forward across the generations, and as cultural upheavals undulate through the Aleutian chain, their descendants are willing to risk even more as the gold rush and World War II internment threatens their people's survival.<br/>Two hundred and fifty years later, by the time Brandy steps ashore in the 1980s, Unalaska Island has absorbed their dark secret, a secret that is both salvation and shame. Brandy doesn't know why she's there. She's too old and too smart to be drifting so close to the edge of the known world. As usual, she is following a man with curly hair and no long-range goals. She takes a job slinging drinks at the notoriously dangerous Elbow Room, studies Aleutian history, learns to ride a motorcycle, and with a practiced psyche avoids thinking about her withered past and her abandoned future. She is fighting her own battle for survival, a battle she does not even recognize.<br/>But the island's secret follows her -- in the odd bathroom graffiti, the old Aleut women who hike in the night, the unexplained deaths clouding the island, and the enigmatic smile of a young Aleut woman sketched centuries before. Brandy begins to pay attention. She begins to long for her life to change.<br/>In a tense interplay between past and present, And She Was explores Aleut history, taboos, mummies, conquest, survival, and the seamy side of the 1980s in a fishing boomtown at the edge of the world. It leaps across time and culture to a lost woman, who more than anything needs to understand the gray shades between heroism and evil, between freedom and bondage, between this place and the rest of her life.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/77/02/9780060597702.jpg', 'title_long': 'And She Was: A Novel', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.2 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 1.2}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 304, 'date_published': '2006-02-07', 'subjects': ['Literature & Fiction', 'Genre Fiction', "Women's Fiction", 'United States', 'Romance', 'Historical', 'American', '20th Century', 'Time Travel'], 'authors': ['Cindy Dyson'], 'title': 'And She Was: A Novel', 'isbn13': '9780060597702', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060597704', 'isbn10': '0060597704'}}