{"book": {"publisher": "Harper Entertainment", "synopsis": "What if an aging, unsuccessful Minnesota author of history books with names like Old von Steuben Had a Farm: The German-American Settlement of the Midwest decided he could write a book every bit as vapid and ridiculous as the books that sold four hundred times more copies than his own? Well, he would write Death Rat, of course, the thrilling tale of a man who battles prejudice, his inner demons, and a cunning six-foot-long rat.<br/>And what if he was told by publishers that, at sixty years of age, though his book was a thrilling read, he just didn’t look the part of a virile writer of gripping adventure books featuring cunning six-foot-long rats? Well, he would cook up a scheme so outrageous, it would incur the wrath of Gus Bromstad, the beloved author of the homespun Dogwood Downs series of books. And it would stir up the bizarre religious fervor of King Leo, the libidinous funk superstar whose CD “LoveDeathTomorrowJelly” was one of the biggest sellers of the decade. And it would throw him into a strange symbiotic relationship with the entire town of Holey, Minnesota, population 38.<br/>Such is the fate of one Pontius Feeb, the hapless author of Death Rat. . . and perhaps the fate of all who attempt to write gripping novels featuring cunning six-foot-long rats.", "language": "en", "image": "https: //images.isbndb.com/covers/47/29/9780060934729.jpg", "title_long": "Mike Nelson"s Death Rat!", "edition": "1", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 0.551155655 Pounds, Width: 0.76 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 0.76}, "weight": {"unit": "pounds", "value": 0.551155655}, "height": {"unit": "inches", "value": 8}}, "pages": 336, "date_published": "2003-04-15", "subjects": ["Literature & Fiction', 'Humor & Satire', 'Satire', 'Dark Humor', 'Humorous', 'Science Fiction & Fantasy', 'Fantasy', 'Science Fiction', 'Cyberpunk', 'Self Service', 'Custom Stores'], 'authors": ["Michael J Nelson'], 'title": "Mike Nelson"s Death Rat!", 'isbn13": "9780060934729", "msrp": 15.99, "binding": "Paperback", "related": {"ePub": "0062561928"}, "isbn": "0060934727", "isbn10": "0060934727", "other_isbns": [{'isbn": "9780062561923", "binding": "print"}]}}