{'book': {'publisher': 'Rayo', 'synopsis': 'Beltrán Soler es du Chile, una tierra que se mueve. Es, además, un sismólogo que sabe mucho sobre las placas tectónicas pero poco de la vida. Encerrado en su universo de datos sísmicos, libros científicos y catástrofes naturales, se protege del mundo que lo rodea. Pero a miles de kilómetros por encima del suelo que tanto analiza, en un avión camino a Los Ángeles -- la capital del cine, y la ciudad en la que creció -- tiene una conversación que le gatilla un sismo interno. De repente se le vienen a la mente las cincuenta películas más importante de su vida, aquellos filmes a la vez divertidos y absurdos que más lo afectaron durante su infancia y adolescencia durante los años sesenta y setenta.<br/>Desde Willy Wonka y la Fábrica de Chocolates a Encuentros Cercanos del Tercer Tipo, pasando por las ruidosas cintas de catástrofe como ¡Terremoto! y los filmes futuristas de los setenta como Fuga en el Siglo XXIII, se conecta con su pasado, acordándose de las películas que vio, las personas con las que las vio y hasta de los teatros a los que fue. De recuerdo en recuerdo, de película en película, Beltrán reconstruye la historia de su excéntrica y disfuncional familia, y descubre que las películas que vio -- las que le gustaron y las que no -- fueron las que lo definieron como persona.<br/>Ambientada en los dos mundos extrañamente paralelos de la suburbana California de Nixon, y el frío Santiago de Chile de Pinochet, esta ágil y contemporánea novela nos precipita en el universo cinematográfico de un adolescente que busca escapar de una existencia fragmentada, atrapada entre dos idiomas, dos culturas y dos familias que sin embargo ven las mismas películas. Escrita en el lenguaje dinámico y vivaz que ha hecho de Alberto Fuguet un escritor reconocido a nivel mundial, Las Películas de Mi Vida es una novela sobre el cine y sobre cómo las películas que vemos se vuelven parte de quienes somos.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/94/03/9780060559403.jpg', 'title_long': 'Las Peliculas de Mi Vida: Una Novela (Spanish Edition)', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.25 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 1.25}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 304, 'date_published': '2003-10-14', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'TV, Movie, Video Game Adaptations', 'Coming of Age', 'World Literature', 'European', 'Literary'], 'authors': ['Alberto Fuguet'], 'title': 'Las Peliculas de Mi Vida: Una Novela (Spanish Edition)', 'isbn13': '9780060559403', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060559403', 'isbn10': '0060559403'}}