{'book': {'publisher': 'William Morrow Cookbooks', 'synopsis': '"Traditional Judaism injects sanctification into the ordinary habits of everyday life.Keeping kosher helps us pause and think about what we eat, and how we eat it, and elevates the act of eating."<br/>What does it mean to keep kosher? Many may be familiar with the basics: no bacon, no shrimp, no cheeseburgers. But the Jewish dietary laws go deeper than that, and How to Keep Kosher explores the ins and outs. Why are some foods deemed kosher while others are not? Why can\'t you mix meat and dairy dishes? How do you turn a nonkosher kitchen into a kosher one? Do you really need multiple sets of everything -- dishes, pots, pans, and utensils? How do you keep track of what\'s what?<br/>Whether you are thinking about adopting a kosher lifestyle or already have a kosher home and just want tounderstand what it is all about, Lisë Stern\'s How to Keep Kosher is essential reading. You will learn about the biblicaland historical origins of keeping kosher, the development of the kosher certification system, specific food preparation requirements for Shabbat, Passover, and otherholidays, and how to actually set up a kosher kitchen.<br/>In straightforward language, drawing upon explanations from the Torah and Talmud, along with interviews with rabbis, academics, and laypeople who keep kosher, Lisë explores all aspects of Judaism\'s ancient dietary traditions as they are carried out in today\'s kitchen, with its range of modern appliances -- dishwashers, food processors, and microwave ovens. For the first time, one book explains both Conservative and Orthodox perspectives on kashrut, as well as opinions from other Jewish affiliations.<br/>When Lisë was nine, her parents decided to make the change -- transform their home to a kosher one -- as a core part of their evolving commitment to Judaism. Because Lisë experienced the transition as a child and keeps a kosher home today, she is uniquely qualified to explain all aspects of this traditional practice.<br/>Setting up a kosher kitchen lays the foundation for implementing the tradition; the proof is in the potato pudding. As Lisë notes, the Talmud says, "Room can always be found in one\'s stomach for sweet things," and the wealth of information is sweetened with more than forty recipes for Shabbat dinners and lunches as well as holiday and festival celebrations. Traditional recipes include Chicken Soup with My Mother\'s Ethereal Matzo Balls, Sliced Potato–Onion Kugel, and Hamantashen; new classics are Chilled Cucumber–Yogurt Soup, Rosemary Sweet Potato Kugel, Enchilada Lasagna, and Chocolate-Flecked Meringues.<br/>Stern\'s How to Keep Kosher is an inclusive, user-friendly handbook filled with answers to the fundamental who, what, where, when, why, and how questions surrounding the Jewish dietary laws -- making these laws both accessible and appealing.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/50/03/9780060515003.jpg', 'title_long': 'How to Keep Kosher: A Comprehensive Guide to Understanding Jewish Dietary Laws', 'edition': 'First Edition', 'dimensions': 'Height: 9.5 Inches, Length: 7.75 Inches, Weight: 1.6 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.75}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 1.6}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 320, 'date_published': '2004-08-17', 'subjects': ['Cookbooks, Food & Wine', 'Regional & International', 'Special Diet', 'Kosher', 'Health, Fitness & Dieting', 'Diets & Weight Loss', 'Other Diets', 'Religion & Spirituality', 'Judaism', 'Jewish Life', 'Religious Studies', 'Ethics', 'Politics & Social Sciences', 'Social Sciences'], 'authors': ['Lise Stern'], 'title': 'How to Keep Kosher: A Comprehensive Guide to Understanding Jewish Dietary Laws', 'isbn13': '9780060515003', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060515007', 'isbn10': '0060515007'}}