{"book": {"publisher": "Ecco", "synopsis": "On October 25, 1946, in a crowded room in Cambridge, England, the great twentieth-century philosophers Ludwig Wittgenstein and Karl Popper came face to face for the first and only time. The meeting -- which lasted ten minutes -- did not go well. Their loud and aggressive confrontation became the stuff of instant legend, but precisely what happened during that brief confrontation remained for decades the subject of intense disagreement.<br/>An engaging mix of philosophy, history, biography, and literary detection, Wittgenstein"s Poker explores, through the Popper/Wittgenstein confrontation, the history of philosophy in the twentieth century. It evokes the tumult of fin-de-siécle Vienna, Wittgentein"s and Popper"s birthplace; the tragedy of the Nazi takeover of Austria; and postwar Cambridge University, with its eccentric set of philosophy dons, including Bertrand Russell. At the center of the story stand the two giants of philosophy themselves -- proud, irascible, larger than life -- and spoiling for a fight.', 'language": "en", "image": "https: //images.isbndb.com/covers/66/48/9780060936648.jpg", "title_long": "Wittgenstein"s Poker: The Story of a Ten-Minute Argument Between Two Great Philosophers", 'edition": "Reprint", "dimensions": "Height: 7.12 Inches, Length: 5.31 Inches, Weight: 0.62 Pounds, Width: 0.83 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 0.83}, "weight": {"unit": "pounds", "value": 0.62}, "height": {"unit": "inches", "value": 7.12}}, "pages": 368, "date_published": "2002-09-17", "subjects": ["History', 'Europe', 'Great Britain', 'World', 'Politics & Social Sciences', 'Philosophy', 'Modern'], 'authors": ["David Edmonds', 'John Eidinow'], 'title": "Wittgenstein"s Poker: The Story of a Ten-Minute Argument Between Two Great Philosophers", 'isbn13": "9780060936648", "msrp": 13.99, 'binding": "Paperback", "isbn": "0060936649", "isbn10": "0060936649"}}