{'book': {'publisher': 'Harper Business', 'synopsis': "Today's shopping culture is turning the shopper into a zombie—and the thrill of the hunt into the robotic management of inventory. We are in danger of losing a resonant personal ritual, replaced by the boring habitual. For millions of us, the sizzle of a daily shopping experience has devolved into a relentless acquisition of the okay, available, and cheap. Why are we willing to pay $3.50 for a latte at Starbucks, but bristle at a 10-cent increase in the price of toothpaste? Why do we drive miles out of our way to buy a bag of 100 razor blades for 50 cents less than at our local store, and then spend $3.99 on a tub of pretzels that we don't need? We're wasting our time and money at the cost of our patience and good will.<br/>In Shopportunity!—a manifesto-cum-exposé—marketing expert Kate Newlin looks behind the aisles of our best-known retailers to reveal that the dopamine rush of getting a good deal is confusing shoppers' wants with their needs. Packed with perceptive reporting, Shopportunity! provides an insider's view of how marketers create a brand and the overwhelming power of retailers to interfere with the transformational joys that great brands bring to our daily lives. It is time for shoppers to revolutionize their shopping experience and take the power away from retailers.<br/>One generation of marketers has hooked three generations on the addiction of price promotion, and it has wreaked havoc on our waistlines, credit ratings, and life experience. From Wal-Mart to Macy's, Ralph Lauren, Whole Foods, and the Home Shopping Network, Newlin reveals what the world's leading retailers really know about us, and what it takes to kick the addiction to getting the best deal possible. Culminating in a Shopper's Bill of Rights, Shopportunity! will liberate shoppers—as well as the manufacturers and retailers who serve them—from the tyranny of the cheap.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/84/04/9780060888404.jpg', 'title_long': 'Shopportunity!: How to Be a Retail Revolutionary', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.9810570659 Pounds, Width: 0.89 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.89}, 'weight': {'unit': 'pounds', 'value': 0.9810570659}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 256, 'date_published': '2006-09-19', 'subjects': ['Business & Money', 'Industries', 'Retailing', 'Marketing & Sales', 'Marketing', 'Processes & Infrastructure', 'E-Commerce', 'Purchasing & Buying', 'Computers & Technology', 'Business Technology', 'Web Marketing'], 'authors': ['Kate Newlin'], 'title': 'Shopportunity!: How to Be a Retail Revolutionary', 'isbn13': '9780060888404', 'msrp': 23.95, 'binding': 'Hardcover', 'related': {'eBook': '0061751839', 'ePub': '0061751839'}, 'isbn': '0060888407', 'isbn10': '0060888407', 'other_isbns': [{'isbn': '9780061751837', 'binding': 'print'}]}}