{'book': {'publisher': 'Rayo', 'synopsis': "Beltr치n Soler is from Chile, a land in constant movement. A seismologist who knows more about the science of tectonic plate movement than about life, he is cocooned in a world of seismic data, scientific articles, and natural disasters. Beltr치n believes he can protect himself from the world around him by losing himself to theoretical pursuits, but thousands of feet above the ground he so meticulously analyzes, on a flight to L.A. -- the capital of film and the city in which he was raised -- he has a conversation that sparks in him a firestorm of nostalgia. Suddenly, Beltr치n finds himself recalling the fifty most important movies of his life -- films both precious and absurd that affected him during his childhood and adolescence in the 1960s and '70s.<br/>From Willy Wonka and the Chocolate Factory to Close Encounters of the Third Kind to kitschy disaster films such as Earthquake!, as well as cult classics of '70s sci-fi such as Logan's Run, Beltr치n connects with his past by remembering the films he saw, the people with whom he saw them, and even the theaters in which they were shown. Recalling one movie after another, he reconstructs the unusual history of his eccentric and dysfunctional family, coming to terms with his obsession with the movies that helped define him -- often whether he wanted them to or not.<br/>Set in the oddly parallel worlds of Nixon's suburban California and Pinochet's Santiago de Chile, this ingenious novel throws us into the claustrophobic world of an adolescent who tries to escape from a tumultuous and fragmented existence, one caught between two languages, two cultures, and two families that watch the same movies. Written in the eloquent, compelling, and often hilarious style that has brought Alberto Fuguet world renown, The Movies of My Life is a book about film and about how movies embed themselves in our souls, helping us all share a blinding fondness for the magic of make-believe.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/46/22/9780060534622.jpg', 'title_long': 'The Movies of My Life', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.25 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 1.25}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 304, 'date_published': '2003-10-14', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'TV, Movie, Video Game Adaptations', 'World Literature', 'European', 'Contemporary', 'Literary'], 'authors': ['Alberto Fuguet', 'Ezra E. Fitz'], 'title': 'The Movies of My Life', 'isbn13': '9780060534622', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060534621', 'isbn10': '0060534621'}}