{'book': {'publisher': 'Katherine Tegen Books', 'synopsis': "The second book in the internationally bestselling Septimus Heap series by Angie Sage, featuring the funny and fantastic adventures of a wizard apprentice and his quest to become an ExtraOrdinary Wizard.<br/>New York Times Bestselling Series<br/>“Terrifically entertaining. Fans of the first book will be delighted with this sequel to Septimus’s story.” —VOYA (starred review)<br/>“Readers will find themselves quickly immersed in this imaginative world, moving from one well-crafted adventure to another at a suspenseful pace.” —SchoolLibrary Journal<br/>It's been a year since Septimus Heap discovered his real family and true calling to be a wizard. As Apprentice to ExtraOrdinary Wizard Marcia Overstrand, he is learning the fine arts of Conjurations, Charms, and other Magyk, while Jenna is adapting to life as the Princess and enjoying the freedom of the Castle.<br/>But there is something sinister at work. Marcia is constantly trailed by a menacing Darke Shadow, and Septimus's brother Simon seems bent on a revenge no one understands. Why is the Darke Magyk still lingering?<br/>Bringing fantasy to new heights, Angie Sage continues the journey of Septimus Heap with her trademark humor and all of the clever details readers have come to love.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/73/60/9780060577360.jpg', 'title_long': 'Flyte (Septimus Heap, Book 2)', 'edition': 'Reprint', 'dimensions': 'Height: 1.16 Inches, Length: 7.21 Inches, Weight: 0.83 Pounds, Width: 5.58 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.21}, 'width': {'unit': 'inches', 'value': 5.58}, 'weight': {'unit': 'pounds', 'value': 0.83}, 'height': {'unit': 'inches', 'value': 1.16}}, 'pages': 532, 'date_published': '2007-03-27', 'subjects': ["Children's Books", 'Growing Up & Facts of Life', 'Family Life', 'Literature & Fiction', 'Action & Adventure', 'Humor', 'Science Fiction & Fantasy', 'Fantasy & Magic', 'Geography & Cultures', 'Royalty', 'Self Service', 'Custom Stores'], 'authors': ['Angie Sage'], 'title': 'Flyte (Septimus Heap, Book 2)', 'isbn13': '9780060577360', 'msrp': 7.99, 'binding': 'Paperback', 'related': {'ePub': '006175708X'}, 'isbn': '0060577363', 'isbn10': '0060577363', 'other_isbns': [{'isbn': '9780061757082', 'binding': 'print'}]}}