{'book': {'publisher': 'William Morrow', 'synopsis': 'Why not live at 60 feeling like you did at 35? In The RealAge® Makeover, Dr. Roizen makes sense of recent critical medical findings, including 129 factors that affect the rate of aging, and offers 74 steps that will reduce or even prevent 80% of the diseases that make you feel older. With all this information, Roizen believes you can control your genes to a very large degree.<br/>In the last several years, Dr. Roizen and his team have learned much more about the aging process. The RealAge® Makeover makes sense of recent critical medical findings -- important new research on inflammation in your arteries, stress reduction, chronic disease management, hormone replacement therapy, and other choices you can make to keep aging at a distance. You’ll also find the latest on vitamins and other supplements, which are age-reducing, which are aging, and which ones to avoid if you are taking certain medications. Roizen then offers more than seventy ways to reduce or even prevent 80 percent of the diseases that make you feel older. For example, coffee or the right kind of chocolate in moderate amounts can help reduce inflammation, preserving your arteries, joints, and memory. But the wrong choice can lead to needless aging and loss of energy, such as taking too much Vitamin A. AndThe RealAge® Makeover tells you how much (in years) each choice is worth so you can make the choices that are meaningful to you.<br/>More potent than any statistic or finding, however, are the personal stories interwoven throughout the book—more than 50 success stories from readers who followed the RealAge® program and made themselves over significantly. They became younger biologically and are living happier, healthier lives.<br/>Now readers have more opportunity than ever to turn back their biological clocks and feel, look, and be younger. Join the RealAge® Revolution and give yourself a RealAge® Makeover!', 'language': 'en', 'image': 'https://images.isbndb.com/covers/68/20/9780060196820.jpg', 'title_long': 'The RealAge Makeover: Take Years off Your Looks and Add Them to Your Life', 'edition': 'Revised, Updated', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.7 Pounds, Width: 1.57 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.57}, 'weight': {'unit': 'pounds', 'value': 1.7}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 528, 'date_published': '2004-04', 'subjects': ['Health, Fitness & Dieting', 'Beauty, Grooming, & Style', 'Style & Clothing', 'Nutrition', 'Aging', 'Beauty, Grooming & Style', 'Diets & Nutrition', 'Longevity', 'Parenting & Relationships'], 'authors': ['Michael F Roizen M.D.'], 'title': 'The RealAge Makeover: Take Years off Your Looks and Add Them to Your Life', 'isbn13': '9780060196820', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060196823', 'isbn10': '0060196823'}}