{'book': {'publisher': 'Avon', 'synopsis': "Everyone in society knows that the marriage of Lord and Lady Hammond is an unhappy one. Everyone knows they have barely spoken to one another in over nine years. But what no-one in society knows are the reasons why ...<br/>Lady Viola Courtland was a romantic and impulsive young girl when she fell instantly in love with the handsome and dashing Viscount Hammond. Unbeknownst to Viola, John Hammond had already given his heart to the only woman he would ever love—his cousin's wife—but he was in dire financial straits and desperately needed to marry a wealthy heiress. In Viola, he thought he had found the perfect woman—beautiful and rich with a sweet nature. But Viola was neither practical nor sensible when it came to marriage, for she fully expected her husband to love her and was determined to settle for nothing less. Soon, however, John's secret was unwittingly revealed, but by then they were married and it was too late. Until one day, John finally came to his senses and prayed it wasn't too late to win back the love of his very own wife.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/47/38/9780060774738.jpg', 'title_long': 'The Marriage Bed (Guilty Series, 3)', 'edition': 'Reissue', 'dimensions': 'Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.39 Pounds, Width: 0.96 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 0.96}, 'weight': {'unit': 'pounds', 'value': 0.39}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 384, 'date_published': '2005-06-28', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Erotica', 'Historical', 'Romantic', 'Victorian', 'Romance', 'Ancient World', 'Scottish', 'Regency', 'Western'], 'authors': ['Laura Lee Guhrke'], 'title': 'The Marriage Bed (Guilty Series, 3)', 'isbn13': '9780060774738', 'msrp': 6.99, 'binding': 'Mass Market Paperback', 'related': {'ePub': '0061737070'}, 'isbn': '0060774738', 'isbn10': '0060774738', 'other_isbns': [{'isbn': '9780061737077', 'binding': 'print'}]}}