{'book': {'publisher': 'Amistad', 'synopsis': 'The incredible story of what happened when two outsiders―one an emerging champion who happens to be Jewish, the other, the first black player to win Wimbledon―pair up not only to form a winning team, but also an enduring friendship.<br/><br/>Althea Gibson first met Angela Buxton at an exhibition match in India. On the surface, the two women couldn’t be more different. The daughter of sharecroppers and fiercely competitive, Althea Gibson was born in the American South and turned to athletics in an effort to belong to a community that would welcome her. Angela Buxton, the granddaughter of Russian Jews, grew up in Liverpool. England, where her father ran a successful business. But they both faced their share of prejudice, particularly on the tennis circuit, where they were excluded from tournaments and clubs because of race and religion.<br/>At the 1956 Wimbledon, despite their athletic prowess, both were shunned by the other female players and found themselves without doubles partners. Undaunted, they decided to play together. And though they had never so much as practiced together―they triumphed. In Nobody’s Darlings, Bruce Schoenfeld delivers an unexpected story of two underdogs who refused to let bigotry stop them both on the court and off. Here too is the story of a remarkable friendship.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/65/28/9780060526528.jpg', 'title_long': 'The Match: Althea Gibson & Angela Buxton: How Two Outsiders--One Black, the Other Jewish--Forged a Friendship and Made Sports History', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.25002102554 Pounds, Width: 1.05 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.05}, 'weight': {'unit': 'pounds', 'value': 1.25002102554}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 320, 'date_published': '2004-06-01', 'subjects': ['Biographies & Memoirs', 'Community & Culture', 'Black & African American', 'Sports & Outdoors', 'Biographies', 'Miscellaneous', 'History of Sports', 'Racket Sports', 'Tennis', 'Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies', "Women's Studies"], 'authors': ['Bruce Schoenfeld'], 'title': 'The Match: Althea Gibson & Angela Buxton: How Two Outsiders--One Black, the Other Jewish--Forged a Friendship and Made Sports History', 'isbn13': '9780060526528', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060526521', 'isbn10': '0060526521'}}