{"book": {"publisher": "Ecco", "synopsis": "<p>because i was bad in my last life.<br>because allah has willed it.<br>because the rich do nothing for the poor.<br>because the poor do nothing for themselves.<br>because it is my destiny.</p><br/><p>These are just some of the answers to the simple yet groundbreaking question William T. Vollmann asks in cities and villages around the globe: "Why are you poor?' In the tradition of James Agee\'s Let Us Now Praise Famous Men, Vollmann\'s Poor People struggles to confront poverty in all its hopelessness and brutality, its pride and abject fear, its fierce misery and its quiet resignation. Poor People allows the poor to speak for themselves, explaining the causes and consequences of their impoverishment in their own cultural, social, and religious terms. </p><br/><p>There is the alcoholic mother in Buddhist Thailand, sure that her poverty is punishment for transgressions in a former life, and her ten-year-old daughter, whose faith in her own innocence gives her hope that her sin in the last life was simply being rich. There is the Siberian-born beggar who pins her woes on a tick bite and a Gypsy curse more than a half century ago, and the homeless, widowed Afghan women who have been relegated to a 'respected' but damning invisibility. There are Big and Little Mountain, two Japanese salarymen who lost their jobs suddenly and now live in a blue-tarp hut under a Kyoto bridge. And, most haunting of all, there is the faded, starving beggar-girl, staring empty-eyed on the back steps of Bangkok\'s Central Railroad Station, whose only response to Vollmann\'s query is simply,
        "I think I am rich."</p><br/><p>The result of Vollmann\'s fearless journey is a look at poverty unlike any other. Complete with more than 100 powerfully affecting photographs—taken of the interviewees by the author himself—this series of vignettes and searing insights represents a tremendous step toward an understanding of this age-old social ill. With intense compassion and a scrupulously unpatronizing eye, Vollmann invites his readers to recognize in our fellow human beings their full dignity, fallibility, pride, and pain, and the power of their hard-fought resilience.</p>', 'language": "en", "image": "https: //images.isbndb.com/covers/88/25/9780060878825.jpg", "title_long": "Poor People", "edition": "First Edition", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 1 Pounds, Width: 1.41 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1.41}, "weight": {"unit": "pounds", "value": 1}, "height": {"unit": "inches", "value": 9}}, "pages": 464, "date_published": "2007", "subjects": ["Politics & Social Sciences', 'Social Sciences', 'Poverty'], 'authors": ["William T. Vollmann'], 'title": "Poor People", "isbn13": "9780060878825", "msrp": 29.95, 'binding": "Hardcover", "isbn": "0060878827", "isbn10": "0060878827"}}