{'book': {'publisher': 'Harper', 'synopsis': 'For most of us, that perfect retort or witty reply often escapes us when we need it most, only to come to mind with perfect clarity when it\'s too late to be useful. The twentieth-century writer Heywood Broun described this all-too-common phenomenon when he wrote "Repartee is what we wish we\'d said."<br/>In Viva la Repartee, Dr. Mardy Grothe, author of Oxymoronica, has lovingly assembled a collection of masterfully composed -- and perfectly timed -- replies that have turned the tables on opponents and adversaries. This delightful volume is a celebration of the most impressive retorts, ripostes, rejoinders, comebacks, quips, ad-libs, bon mots, off-the-cuff comments, wisecracks, and other clever remarks ever to come out of the mouths -- and from the pens -- of people throughout history. Touching on all areas of human endeavor, including politics, the arts, literature, sports, relationships, and even the risqué, the book features contributions from Oscar Wilde, Mark Twain, Dorothy Parker, Mae West, Groucho Marx, Winston Churchill, Dolly Parton, and scores more.<br/>As entertaining as it is intellectually enriching, Viva la Repartee is sure to capture the attention of language lovers and is the perfect antidote for anyone who\'s ever thought I wish I\'d said that!', 'language': 'en', 'image': 'https://images.isbndb.com/covers/94/80/9780060789480.jpg', 'title_long': "Viva la Repartee: Clever Comebacks and Witty Retorts from History's Great Wits and Wordsmiths", 'dimensions': 'Height: 7.12 Inches, Length: 5.5 Inches, Weight: 0.75 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 0.75}, 'height': {'unit': 'inches', 'value': 7.12}}, 'pages': 304, 'date_published': '2005-11-01', 'subjects': ['Reference', 'Quotations', 'Words, Language & Grammar'], 'authors': ['Dr. Mardy Grothe'], 'title': "Viva la Repartee: Clever Comebacks and Witty Retorts from History's Great Wits and Wordsmiths", 'isbn13': '9780060789480', 'msrp': 11.98, 'binding': 'Hardcover', 'related': {'eBook': '0061758442', 'ePub': '0061758442'}, 'isbn': '0060789484', 'isbn10': '0060789484', 'other_isbns': [{'isbn': '9780061758447', 'binding': 'print'}]}}