{'book': {'publisher': 'Amistad', 'synopsis': 'An important book of epic scope on America’s first racially integrated, religiously-inspired political movement for change―The Underground Railroad, a movement peopled by daring heroes and heroines, and everyday folk<br/><br/>For most, the mention of the Underground Railroad evokes images of hidden tunnels, midnight rides, and hairsbreadth escapes. Yet the Underground Railroad’s epic story is much more morally complex and politically divisive than even the myths suggest. Against a backdrop of the country’s westward expansion,which brought together Easterners who had engaged in slavery primarily in the abstract alongside slaveholding Southerners and their slaves, arose a clash of values that evolved into a fierce fight for nothing less than the country’s soul. Beginning six decades before the Civil War, freedom-seeking blacks and pious whites worked together to save tens of thousands of lives, often at the risk of great physical danger to themselves. Not since the American Revolution had the country engaged in an act of such vast and profound civil disobedience that not only subverted federal law but also went against prevailing mores.<br/>Flawlessly researched and uncommonly engaging, Bound for Canaan, shows why it was the Underground Railroad and not the Civil Rights movement that gave birth to this country’s first racially-integrated, religiously-inspired movement for social change.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/43/19/9780060524319.jpg', 'title_long': "Bound for Canaan: The Epic Story of the Underground Railroad, America's First Civil Rights Movement", 'edition': 'Reprint', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 1.01 Pounds, Width: 0.95 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 0.95}, 'weight': {'unit': 'pounds', 'value': 1.01}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 592, 'date_published': '2006-01-10', 'subjects': ['History', 'Americas', 'United States', 'Historical Study & Educational Resources', 'Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies', 'Sociology', 'Race Relations', 'Politics & Government', 'Specific Topics'], 'authors': ['Fergus M. Bordewich'], 'title': "Bound for Canaan: The Epic Story of the Underground Railroad, America's First Civil Rights Movement", 'isbn13': '9780060524319', 'msrp': 14.08, 'binding': 'Paperback', 'related': {'eBook': '0061739618', 'ePub': '0061739618'}, 'isbn': '0060524316', 'isbn10': '0060524316', 'other_isbns': [{'isbn': '9780061739613', 'binding': 'print'}]}}