{'book': {'publisher': 'Harper Paperbacks', 'synopsis': "The medical correspondent for women's health on the Today show, bestselling author and a regular on Oprah, Dr. Judith Reichman explains exactly why we age, how we age, and what we can do to slow down the aging process.<br/>Targeted for women in their forties and fifties, Slow Your Clock Down shows women how to extend the minutes and hours of their bodies' internal and external clocks.<br/>As a practicing physician in Los Angeles, Dr. Reichman has followed and treated many women who, despite advancing years (and in LA, this is defined as anyone over the age of forty), continue to feel young, vital, creative and healthy. She has helped women overcome many of the gynaecological problems related to hormonal changes and age. Dr. Reichman's patients have fought and even thwarted heart disease, diabetes, osteoporosis, obesity and cancer. In her first bestselling book she voiced the Baby Boomer's battle cry I'm Too Young to Get Old. She has continued to do so in her next two books: I'm Not in the Mood and Relax, This Won't Hurt.<br/>In this book, Dr. Reichman uses the characteristic, sharp, incisive voice that has made her one of the country's foremost commentators on health issues. She addresses the aging effects of women's hormonal changes, offers a healthy anti–aging diet, exercise, and vitamin regimen, and discusses how to stay young mentally, emotionally, and physically, providing women with invaluable, medically based methods to maximize well living and minimise aging.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/72/80/9780060527280.jpg', 'title_long': 'Slow Your Clock Down', 'edition': 'First Edition', 'dimensions': 'Height: 8 Inches, Length: 5.3125 Inches, Weight: 0.76279942652 Pounds, Width: 1.00901 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.3125}, 'width': {'unit': 'inches', 'value': 1.00901}, 'weight': {'unit': 'pounds', 'value': 0.76279942652}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 448, 'date_published': '2005-03-01', 'subjects': ['Health, Fitness & Dieting', "Women's Health", 'General'], 'authors': ['Judith Reichman'], 'title': 'Slow Your Clock Down', 'isbn13': '9780060527280', 'msrp': 14.95, 'binding': 'Paperback', 'isbn': '0060527285', 'isbn10': '0060527285'}}