{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': 'The ultimate guide to finding your soul mate -- for the smart, sophisticated 35+ woman<br/>Are you looking for the right man with whom to spend the rest of your life? Still waiting for "the one" and fed up with dates that go nowhere? Janis Spindel, called a "matchmaker extraordinaire" by the New York Post, has all the advice you need to help you find your perfect match. With more than seven hundred marriages to her credit, Spindel lays out a clear road map for women who are single -- but don\'t want to be. She explains how to set your priorities, update your look, maximize your dating opportunities, and enter into a lasting and satisfying commitment. Get ready to succeed with helpful questionnaires, sidebars, lively tips, and candid, age-specific advice geared toward women who are already established in their lives and careers.<br/>And here\'s the great news: The marriage of your dreams is within reach! Prepare to laugh, prepare to do some serious thinking, and prepare to find the love of your life with this ultimate guide to unlocking your soul mate\'s heart -- and your own.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/40/74/9780060834074.jpg', 'title_long': 'Get Serious About Getting Married: 365 Proven Ways to Find Love in Less Than a Year', 'edition': 'Reprint', 'dimensions': 'Height: 0.78 Inches, Length: 8.84 Inches, Weight: 0.87 Pounds, Width: 6.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.84}, 'width': {'unit': 'inches', 'value': 6.5}, 'weight': {'unit': 'pounds', 'value': 0.87}, 'height': {'unit': 'inches', 'value': 0.78}}, 'pages': 282, 'date_published': '2006-01-03', 'subjects': ['Self-Help', 'Relationships', 'Dating', 'Interpersonal Relations', 'Love & Romance', 'Marriage', 'Sex', 'Health, Fitness & Dieting', 'Sexual Health'], 'authors': ['Janis Spindel'], 'title': 'Get Serious About Getting Married: 365 Proven Ways to Find Love in Less Than a Year', 'isbn13': '9780060834074', 'msrp': 14.95, 'binding': 'Paperback', 'isbn': '0060834072', 'isbn10': '0060834072'}}