{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': 'Allison Holloway may be one of the last holdouts: a true reality TV junkie. (Hey, there\'s no shame in admitting you enjoy watching the Donald say "You\'re fired!" for the millionth time.) But when her boss signs up their interior design firm for Kamikaze Makeover, Allison knows things are never going to be the same again. Dozens of cameras are set to tape every embarrassing moment as two teams compete for $3 million by executing a bold design concept using unorthodox materials (sex toys, anyone? ). As if that wasn\'t bad enough, a hunky producer tries to seduce Allison with fine champagne and limo rides, while an equally hunky Dave wants to introduce her to the finer things in his life like beer and basketball games, and a piranhalike press hounds her day and night - and let\'s not forget the vibrator wall art. Will Allison ever get her life back? Will she finally find her prince after kissing so many frogs? Join Allison as she fights back against the lies, the double-dealing, and the backstabbing to prove that she\'s a survivor even a gooey round of pudding wrestling can\'t defeat.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/31/13/9780060773113.jpg', 'title_long': 'Reality TV Bites: A Novel', 'dimensions': 'Height: 8 Inches, Length: 5.32 Inches, Weight: 0.5 Pounds, Width: 0.76 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.32}, 'width': {'unit': 'inches', 'value': 0.76}, 'weight': {'unit': 'pounds', 'value': 0.5}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 304, 'date_published': '2006-06-27', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Feel-Good', "Women's Fiction", 'Contemporary', 'United States', 'Literary', 'Romance', 'Romantic Comedy'], 'authors': ['Shane Bolks'], 'title': 'Reality TV Bites: A Novel', 'isbn13': '9780060773113', 'msrp': 14.99, 'binding': 'Paperback', 'related': {'ePub': '0061751960'}, 'isbn': '0060773111', 'isbn10': '0060773111', 'other_isbns': [{'isbn': '9780061751967', 'binding': 'print'}]}}