{"book": {"publisher": "William Morrow Paperbacks", "synopsis": "The beautiful, serene village of Molena Point, California is the type of place where people go to get away from the harsher realities of life––which is what attracted classic film star Patty Rose to buy the village inn, and settle down to enjoy her golden years. But as the town gathers to celebrate and honor the beautiful, aging actress with a festival of her old films, Patty is brutally murdered––to the horror and shock of this peaceful burg.<br/>A gentle tortoiseshell cat, Kit, has been enjoying a retreat to the animal–loving actress"s inn, where she"s spending time with her feline friends Dulcie, and the slick tomcat sleuth, Joe Grey. But her relaxation is cut short when she hears the gunshots that end Patty"s life, and sees her dead body sprawled on the inn's front steps. She glimpses the killer racing into the parking garage, and soon follows his trail.<br/>Joe and Dulcie must now follow the naïve Kit's trail, and keep her from getting into serious trouble. To complicate matters, Joe discovers that Dulcie has been hiding a runaway child––one of the lucky humans that these special cats choose to talk to––who has now been kidnapped, likely by the same man who killed their famous friend. In the end, the little girl's abduction leads them to Patty's killer, and the feline friends are all united––but they all must mourn a departed friend as they stand beside the newly laid grave of Patty Rose.', 'language": "en", "image": "https: //images.isbndb.com/covers/81/14/9780060578114.jpg", "title_long": "Cat Cross Their Graves: A Joe Grey Mystery (Joe Grey Mystery Series, 10)", "edition": "Reprint", "dimensions": "Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.42 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.19}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 0.42}, "height": {"unit": "inches", "value": 6.75}}, "pages": 400, "date_published": "2005-09-27", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Women's Fiction', 'Contemporary', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Cozy', 'Supernatural', 'Amateur Sleuths', 'Thrillers & Suspense', 'Suspense', 'Science Fiction & Fantasy', 'Fantasy', 'Self Service', 'Custom Stores'], 'authors": ["Shirley Rousseau Murphy'], 'title": "Cat Cross Their Graves: A Joe Grey Mystery (Joe Grey Mystery Series, 10)", "isbn13": "9780060578114", "msrp": 6.99, "binding": "Mass Market Paperback", "related": {"ePub": "0061740128"}, "isbn": "0060578114", "isbn10": "0060578114", "other_isbns": [{'isbn": "9780061740121", "binding": "print"}]}}