{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': '“Powerful….A gripping tale that is a mystery only in the same sense as To Kill a Mockingbird was….Brilliant, insightful, moving.”<br/>—Chicago Sun-Times<br/>There are excellent reasons why New York Times bestselling author Laura Lippman has won the Edgar®, Agatha, Anthony, Nero Wolfe, and every other major award the mystery genre has to offer. To the Power of Three is just one of those reasons. Lippman’s brilliant and disturbing tale of three inseparable high school girlfriends in an affluent Baltimore suburb who share dark secrets literally until death, To the Power of Three is this “writing powerhouse” (USA Today), who has “exploded the boundaries of the mystery genre to become one of the most significant social realists of our time” (Madison Smartt Bell) operating at the very top of her game. Not merely crime fiction, but fiction that gets to the deep psychological, emotional, and human roots of a terrible crime, Lippman’s novel is one that will not be easily forgotten—a must read for fans of Kate Atkinson, Tana French, Jodi Picoult, and Harlan Coben', 'language': 'en', 'image': 'https://images.isbndb.com/covers/67/35/9780060506735.jpg', 'title_long': 'To the Power of Three', 'edition': 'Reprint', 'dimensions': 'Height: 6.75 Inches, Length: 4.19 Inches, Weight: 1.01 Pounds, Width: 1.12 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 1.12}, 'weight': {'unit': 'pounds', 'value': 1.01}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 448, 'date_published': '2006-06-27', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Hard-Boiled', 'Thrillers & Suspense', 'Suspense', 'Crime', 'Self Service', 'Custom Stores'], 'authors': ['Laura Lippman'], 'title': 'To the Power of Three', 'isbn13': '9780060506735', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'isbn': '0060506733', 'isbn10': '0060506733'}}