{'book': {'publisher': 'William Morrow', 'synopsis': 'Things are starting to sizzle in the kitchen. Can you take the heat?<br/>Want to know what\'s in The Rock\'s Famous Rock-Bottom Pancakes? What Chyna eats to make her the Ninth Wonder of the World? What dishes can make even Stone Cold Steve Austin smile? Here\'s your chance to find out. If you think you can handle it, you too can eat like a World Wrestling Federation Superstar. Champion wrestlers need fuel -- lots of it -- and quick and delicious meals are a priority, not an option.<br/>In Can You Take the Heat?, the Superstars of the World Wrestling Federation serve up their favorite meals...with a whole lot of "Attitude." And to make it even better, each mouthwatering recipe is introduced by good ol\' J.R., who offers the behind-the-scenes "dish" on each meal and the wrestlers who love it, peppering the book with plenty of down-home Federation flavor.<br/>Get started with out-of-this-world appetizers like Sgt. Slaughter\'s Mess Hall Dip, Mick Foley\'s Knuckle Sandwiches, and Chyna\'s Guacamole Salad.<br/>Move on to the main-event recipes: Stone Cold\'s Rattlesnake Rib Rub, the Hardy Boyz\' Chicken-Fried Steak, Triple H\'s Swordfish a Ia Helmsley, J.R.\'s Tex-Mex Stew, Big Boss Man\'s "Pepper" Steak, Rikishi\'s Rump Roast, and Mean Street Posse Potpie. And if you\'re watching your waistline, you\'ll even find some lighter fare like Ivory\'s One-Pan Fish Dinner and Tori\'s Maple Barbecue Chicken.<br/>Now throw on some killer tag team side dishes: Too Cool\'s "Home Boy" Fries, Al Snow Peas, Billy Gunn\'s Grilled Badd Ass-paragus, and Acolytes\' Beer Bread.<br/>Getting full? Well, don\'t tap out, because we\'ve saved the best for last: Smackdown desserts like Kane\'s Red Velvet Cake, McMahon Millionaire Pie, and Stone Cold Cinnamon Ice Cream.<br/>A hardcore cookbook that will have all those fancy-pants recipe books running for cover, Can You Take the Heat? dishes up delicious, stick-to-your-ribs meals that will satisfy even the biggest appetites.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/37/86/9780060393786.jpg', 'title_long': 'CAN YOU TAKE THE HEAT?: The WWF Is Cooking!', 'edition': 'First Edition', 'dimensions': 'Height: 9.5 Inches, Length: 7.5 Inches, Weight: 1.25 Pounds, Width: 0.875 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.5}, 'width': {'unit': 'inches', 'value': 0.875}, 'weight': {'unit': 'pounds', 'value': 1.25}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 224, 'date_published': '2000-10-24', 'subjects': ['Cookbooks, Food & Wine', 'Regional & International', 'U.S. Regional', 'Sports & Outdoors', 'Individual Sports', 'Wrestling'], 'authors': ['Jim "J.R." Ross'], 'title': 'CAN YOU TAKE THE HEAT?: The WWF Is Cooking!', 'isbn13': '9780060393786', 'msrp': 26, 'binding': 'Hardcover', 'isbn': '0060393785', 'isbn10': '0060393785'}}