{"book": {"publisher": "Eminent Lives", "synopsis": "“Michael Korda has delivered a jewel of a short life of Ulysses S. Grant, a general deadly on the battlefield and unprepossessing off it. As a biographer Korda is Grant-like himself: unambiguous, decisive, clear. The book is a joy to read.” --Larry McMurtry, Pulitzer Prize-winning author of Lonesome Dove<br/>The first officer since George Washington to become a four-star general in the United States Army, Ulysses S. Grant was a man who managed to end the Civil War on a note of grace, and was the only president between Andrew Jackson and Woodrow Wilson to serve eight consecutive years in the White House. The son of an Ohio tanner, he has long been remembered as a brilliant general but a failed president whose second term ended in financial and political scandal. But now acclaimed, bestselling author Michael Korda offers a dramatic reconsideration of the man, his life, and his presidency. Ulysses S. Grant is an evenhanded and stirring portrait of a flawed leader who nevertheless ably guided America through a pivotal juncture in its history.", "language": "en", "image": "https: //images.isbndb.com/covers/01/54/9780060590154.jpg", "title_long": "Ulysses S. Grant: The Unlikely Hero (Eminent Lives)", "edition": "First Edition", "dimensions": "Height: 7.12 Inches, Length: 5 Inches, Weight: 0.6 Pounds, Width: 0.74 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 0.74}, "weight": {"unit": "pounds", "value": 0.6}, "height": {"unit": "inches", "value": 7.12}}, "pages": 176, "date_published": "2004-09-28", "subjects": ["Biographies & Memoirs', 'Historical', 'United States', 'Leaders & Notable People', 'Military', 'Presidents & Heads of State', 'History', 'Americas', 'Self Service', 'Custom Stores'], 'authors": ["Michael Korda'], 'title": "Ulysses S. Grant: The Unlikely Hero (Eminent Lives)", "isbn13": "9780060590154", "msrp": 21.99, 'binding": "Hardcover", "isbn": "0060590157", "isbn10": "0060590157"}}