{"book": {"publisher": "HarperCollins Espanol", "synopsis": "Unas meses después que el joven Alexander Cold se internara con suabuela en el corazón del Amazonas en busca de una legendaria Bestia, vivirá otra aventura. En esta ocasión, la reportera Kate Cold acompaña a su nieto y a Nadia, la mejor amiga de Alexander, junto con los fotógrafos de la International Geographic, en un viaje a otro remoto rincón del mundo. La misión del equipo es adentrarse en un reino prohibido, oculto en los picos helados del Himalaya, y localizar el legendario dragón de oro, una estatua sagrada y oráculo invaluable capaz de presagiar el futuro del reino.<br/>En su carrera para llegar a la estatua antes de que sea destruida por la avaricia de un intruso, Alexander y Nadia deben usar el poder espiritual de sus animales totémicos: el Jaguar y el Águila. Con la ayuda de un sabio monje budista, su joven discípulo, el príncipe heredero, y una feroz tribu de guerreros Yeti, Alexander y Nadia lucharán para proteger el reino del dragón de oro.", "language": "es", "image": "https: //images.isbndb.com/covers/17/17/9780060591717.jpg", "title_long": "El Reino del Dragon de Oro (Spanish Edition)", "edition": "Spanish-language Edition", "dimensions": "Height: 7.62 Inches, Length: 5.12 Inches, Weight: 0.6 Pounds, Width: 0.86 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.12}, "width": {"unit": "inches", "value": 0.86}, "weight": {"unit": "pounds", "value": 0.6}, "height": {"unit": "inches", "value": 7.62}}, "pages": 432, "date_published": "2004-09-07", "subjects": ["Children's Books', 'Growing Up & Facts of Life', 'Family Life', 'Action & Adventure', 'Science Fiction & Fantasy', 'Fantasy & Magic', 'Geography & Cultures', 'Explore the World', 'Literature & Fiction', 'Women's Fiction', 'Contemporary', 'Teen & Young Adult', 'Social & Family Issues', 'Fantasy'], 'authors": ["Isabel Allende'], 'title": "El Reino del Dragon de Oro (Spanish Edition)", "isbn13": "9780060591717", "msrp": 8.99, 'binding": "Paperback", "isbn": "0060591714", "isbn10": "0060591714"}}