{'book': {'publisher': 'William Morrow Cookbooks', 'synopsis': 'On a trip to Turkey as a young woman, chef Ana Sortun fell in love with the food and learned the traditions of Turkish cooking from local women. Inspired beyond measure, Sortun opened her own restaurant in Cambridge, Massachusetts, the award-winning Oleana, where she creates her own interpretations of dishes incorporating the incredible array of delicious spices and herbs used in eastern regions of the Mediterranean.<br/>In this gorgeously photographed book, Sortun shows readers how to use this philosophy of spice to create wonderful dishes in their own homes. She reveals how the artful use of spices and herbs rather than fat and cream is key to the full, rich flavors of Mediterranean cuisine -- and the way it leaves you feeling satisfied afterward. The book is organized by spice, detailing the ways certain spices complement one another and how they flavor other foods and creating in home cooks a kind of sense-memory that allows for a more intuitive use of spice in their own dishes. The more than one hundred tantalizing spice categories and recipes include: Beef Shish Kabobs with Sumac Onions and Parsley Butter Chickpea and Potato Terrine Stuffed with Pine Nuts, Spinach, Onion, and Tahini Crispy Lemon Chicken with Za’atar Golden Gazpacho with Condiments Fried Haloumi Cheese with Pear and Spiced Dates<br/>Absolutely alive with spices and herbs, Ana Sortun’s recipes will intrigue and inspire readers everywhere.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/22/82/9780060792282.jpg', 'title_long': 'Spice: Flavors of the Eastern Mediterranean', 'edition': 'First Edition', 'dimensions': 'Height: 9.12 Inches, Length: 1.35 Inches, Weight: 2.8 Pounds, Width: 7.38 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 1.35}, 'width': {'unit': 'inches', 'value': 7.38}, 'weight': {'unit': 'pounds', 'value': 2.8}, 'height': {'unit': 'inches', 'value': 9.12}}, 'pages': 400, 'date_published': '2006-05-02', 'subjects': ['Cookbooks, Food & Wine', 'Cooking by Ingredient', 'Herbs, Spices & Condiments', 'Regional & International', 'Asian', 'European', 'Middle Eastern', 'History', 'Middle East', 'Egypt', 'Travel', 'Africa', 'Asia', 'General'], 'authors': ['Ana Sortun'], 'title': 'Spice: Flavors of the Eastern Mediterranean', 'isbn13': '9780060792282', 'msrp': 23.32, 'binding': 'Hardcover', 'related': {'Kindle Edition': '0062336517', 'ePub': '0062336517'}, 'isbn': '0060792280', 'isbn10': '0060792280', 'other_isbns': [{'isbn': '9780062336514', 'binding': 'print'}]}}