{'book': {'publisher': 'Amistad', 'synopsis': "Barack Obama is arguably the most dynamic political figure to grace the American stage since John F. Kennedy. His meteoric rise from promise to power has stunned even the cynics and inspired a legion of devout followers.<br/><br/>For anyone who wants to know more about the man, David Mendell's Obama is essential reading. Mendell, who covered Obama for the Chicago Tribune, had far-reaching access to the Chicago politician as Obama climbed the ladder to the White House, the details of which he shares in this compelling biography. Positioning Obama as the savior of a fumbling Democratic party, Mendell reveals how Obama conquered Illinois politics and paved the way brick by brick for a galvanizing, historic presidential run.<br/><br/>With a new afterword by the author, which includes a fresh perspective on Barack Obama following his two historic terms as the first African-American president, and with exclusive interviews with family members and top advisers, and details on Obama's voting record, David Mendell offers a complete, complex, and revealing portrait. This book is a must-read for anyone interested in American politics in general and President Barack Obama in particular.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/82/09/9780060858209.jpg', 'title_long': 'Obama: From Promise to Power', 'edition': 'Illustrated', 'dimensions': 'Height: 1.31 Inches, Length: 9.24 Inches, Weight: 1.543235834 Pounds, Width: 6.42 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 9.24}, 'width': {'unit': 'inches', 'value': 6.42}, 'weight': {'unit': 'pounds', 'value': 1.543235834}, 'height': {'unit': 'inches', 'value': 1.31}}, 'pages': 416, 'date_published': '2007-08-14', 'subjects': ['Biographies & Memoirs', 'Community & Culture', 'Black & African American', 'Historical', 'United States', 'Leaders & Notable People', 'Military', 'Political', 'Presidents & Heads of State', 'History', 'Americas', 'Politics & Social Sciences', 'Politics & Government', 'Elections & Political Process', 'Self Service', 'Custom Stores'], 'authors': ['David Mendell'], 'title': 'Obama: From Promise to Power', 'isbn13': '9780060858209', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0060858206', 'isbn10': '0060858206'}}