{'book': {'publisher': 'Smithsonian', 'synopsis': 'In October 2004, a team of Australian and Indonesian anthropologists led by Mike Morwood and Raden Pandji Soejono stunned the world with their announcement of the discovery of the first example of a new species of human, Homo floresiensis, which they nicknamed the "Hobbit." This was no creation of Tolkien\'s fantasy, however, but a tool-using, fire-making, cooperatively hunting person. The more Morwood and his colleagues revealed about the find, the more astonishing it became: standing only three feet tall with brains a little larger than a can of cola, the Hobbits forced anthropologists and everyone to reconsider what it means to be human.<br/>Morwood\'s work was no ordinary academic exercise. Along the way he had to tread warily through the cultural landscape of Indonesia—he has an embarrassing mishap with some hard-to-chew pork—and he demonstrated that sometimes the life of a real archaeologist can be a bit like Indiana Jones\'s when he risked his neck in an ocean-going raft to experience how ancient Indonesians might have navigated the archipelago.<br/>Even more, Morwood had to navigate the rock shoals of an archaeological bureaucracy that could be obtuse and even spiteful, and when the Hobbits became embroiled in scientific controversy—as no find of such magnitude could avoid—it proved easy for Morwood to get nearly swamped with trouble. Finds were stolen and damaged, and the backbiting was fierce. But the light of science, once brightened, is difficult to dim, and the story of the indefatigable Morwood\'s fight to defend his find discovery is an inspiration.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/90/80/9780060899080.jpg', 'title_long': 'A New Human: The Startling Discovery and Strange Story of the "Hobbits" of Flores, Indonesia', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.06 Pounds, Width: 0.96 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.96}, 'weight': {'unit': 'pounds', 'value': 1.06}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 272, 'date_published': '2007-05-08', 'subjects': ['Science & Math', 'Biological Sciences', 'Anatomy', 'Biology', 'Evolution', 'Politics & Social Sciences', 'Anthropology', 'Physical', 'Archaeology'], 'authors': ['Mike Morwood', 'Penny van Oosterzee'], 'title': 'A New Human: The Startling Discovery and Strange Story of the "Hobbits" of Flores, Indonesia', 'isbn13': '9780060899080', 'msrp': 25.95, 'binding': 'Hardcover', 'related': {'eBook': '0061971413'}, 'isbn': '0060899085', 'isbn10': '0060899085', 'other_isbns': [{'isbn': '9780061971419', 'binding': 'ebook'}]}}