{'book': {'publisher': 'Rayo / HarperCollins', 'synopsis': "“Ben Saenz’s vivid imagination captures all that is beautiful, agonizing and redemptive in the crossings we make through borders of geography and culture. But it is in the interior journeys of the psyche and the soul that we must find salvation; Saenz’s brilliant prose penetrates to that core and he finds and exposes that truth. A reader can ask for no more than this: to be spellbound by a story, and to come to the last page with a sense of having been being changed and allowed to carry something of it away.” —Abraham Verghese, author of My Own Country<br/>From award-winning poet Benjamin Alire Sáenz comes a haunting novel depicting the cruelties of cultural displacement and the resilience of those who are left in its aftermath.<br/><br/>In Perfect Light is the story of two strong-willed people who are forever altered by a single tragedy. After Andés Segovia's parents are killed in a car accident when he is still a young boy, his older brother decides to steal the family away to Juárez, Mexico. That decision, made with the best intentions, sets into motion the unraveling of an American family.<br/>Years later, his family destroyed, Andés is left to make sense of the chaos—but he is ill-equipped to make sense of his life. He begins a dark journey toward self-destruction, his talent and brilliance brought down by the weight of a burden too frightening and maddening to bear alone. The manifestation of this frustration is a singular rage that finds an outlet in a dark and seedy El Paso bar—leading him improbably to Grace Delgado.<br/>Recently confronted with her own sense of isolation and mortality, Grace is an unlikely angel, a therapist who agrees to treat Andés after he is arrested in the United States. The two are suspicious of each other, yet they slowly arrive at a tentative working relationship that allows each of them to examine his and her own fragile and damaged past.<br/>With the urgent, unflinching vision of a true storyteller and the precise, arresting language of a poet, Sáenz's In Perfect Light bears witness to the cruelty of circumstance and, more than offering escape, the novel offers the possibility of salvation.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/92/07/9780060779207.jpg', 'title_long': 'In Perfect Light', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.25 Pounds, Width: 1.09 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.09}, 'weight': {'unit': 'pounds', 'value': 1.25}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 328, 'date_published': '2005-08-09', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Family Saga', 'Historical', 'Family Life', 'United States', 'Hispanic', 'Literary', 'Self Service', 'Custom Stores'], 'authors': ['Benjamin Alire Sáenz'], 'title': 'In Perfect Light', 'isbn13': '9780060779207', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060779209', 'isbn10': '0060779209'}}