{'book': {'publisher': 'Smithsonian', 'synopsis': 'To a collector, there is no joy parallel to finding that elusive home-run ball, or a jersey worn by a legendary player. Smithsonian Baseball: Inside the World\'s Finest Private Collections celebrates the abiding passion for our national pastime, as witnessed by the dedication of the sport\'s most devoted collectors.<br/>The first book of its kind, Smithsonian Baseball features revealing stories and lavish photography highlighting 21 of the best private collections of baseball memorabilia in existence. From a rare copy of the first written rules of the game (1848) to Mark McGwire\'s record-shattering home-run ball (1998), these impressive collections span baseball\'s entire history. Some of the game\'s most historically significant artifacts are part of these private collections, yet most have never before been seen by the public. Marvel at the memorabilia as you read about the historical background of the objects and get to know each collector\'s passions and motivations. Some of the collections are all-encompassing; others focus on a specific era or type of memorabilia -- game-used bats, for example, or folk art, or celluloid pin-back buttons. One collection features only relics and memorabilia from the grand old ballparks of the past; another comprises items from overseas exhibition tours of the late 19th and early 20th centuries. Some of the most valuable vintage photographs and advertising displays as well as the most sought-after baseball cards are in these collections, including the famous T206 Honus Wagner, the highest professionally graded set of 1915 Cracker Jacks, and a gem-mint condition 1952 Topps Mickey Mantle. A father-daughter collecting duo has an impressive collection of World Series scorecards and programs, dating back to the inaugural series in 1903.<br/>The book also includes seven "tips" essays. The hobby\'s leading experts offer advice on collecting and authenticating artifacts, and show how to build and organize your own impressive 19th-century memorabilia or baseball card collection. Weigh the benefits of having a general collection versus a very narrow one. Find out how to store and display your collectibles. Learn to distinguish between an original first-generation photograph versus a wire photo, a vintage jersey worn at home games as opposed to one worn on the road, a player\'s game-used bat and one made for retail sale -- and much, much more. It\'s the perfect gift for any baseball fan, young or old, a baseball collectible in its own right.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/85/15/9780060838515.jpg', 'title_long': "Smithsonian Baseball: Inside the World's Finest Private Collections", 'edition': 'First Edition', 'dimensions': 'Height: 11.625 Inches, Length: 9.25 Inches, Weight: 3.8 Pounds, Width: 0.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 9.25}, 'width': {'unit': 'inches', 'value': 0.25}, 'weight': {'unit': 'pounds', 'value': 3.8}, 'height': {'unit': 'inches', 'value': 11.625}}, 'pages': 296, 'date_published': '2005-09-27', 'subjects': ['Arts & Photography', 'Photography & Video', 'Collections, Catalogues & Exhibitions', 'History', 'Americas', 'United States', 'Crafts, Hobbies & Home', 'Antiques & Collectibles', 'Sports Memorabilia & Cards', 'Sports & Outdoors', 'Baseball'], 'authors': ['Stephen Wong'], 'title': "Smithsonian Baseball: Inside the World's Finest Private Collections", 'isbn13': '9780060838515', 'msrp': 29.95, 'binding': 'Hardcover', 'isbn': '0060838515', 'isbn10': '0060838515'}}