{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': "At last, a book about eating (and eating well) or health -- from Andrew Weil, the brilliantly innovative and greatly respected doctor who has been instrumental in transforming the way Americans think about health. Now Dr. Weil -- whose nationwide bestsellers Spontaneous Healing and Eight Weeks to Optimum Health have made us aware of the body's capacitiy to heal itself -- provides us with a program for improving our well-being by making informed choices about how and what we eat.<br/>Dr. Weil makes clear how an optimal diet can both supply the basic needs of the body and fortify the body's defenses and mechanisms of healing. And he always stresses that good food -- and the good feeling it engenders at the table -- is not only a delight but also necessary to our well being so that eating for health means enjoyable eating.<br/>Eating Well for Optimum Health is a hugely practical and inspiring book about food, diet and nutrition that stands to change -- for the better and the healthier -- our most fundamental ideas about eating.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/95/86/9780060959586.jpg', 'title_long': 'Eating Well for Optimum Health: The Essential Guide to Bringing Health and Pleasure Back to Eating', 'edition': '1ST QUILL', 'dimensions': 'Height: 8 Inches, Length: 5.3125 Inches, Weight: 0.55 Pounds, Width: 0.720721 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.3125}, 'width': {'unit': 'inches', 'value': 0.720721}, 'weight': {'unit': 'pounds', 'value': 0.55}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 320, 'date_published': '2001-03-06', 'subjects': ['Health, Fitness & Dieting', 'Diets & Weight Loss', 'Other Diets', 'Nutrition', 'Self Service', 'Custom Stores'], 'authors': ['Andrew Weil'], 'title': 'Eating Well for Optimum Health: The Essential Guide to Bringing Health and Pleasure Back to Eating', 'isbn13': '9780060959586', 'msrp': 10.4, 'binding': 'Paperback', 'isbn': '0060959584', 'isbn10': '0060959584'}}