{"book": {"publisher": "Harper", "synopsis": '#1 New York Times bestselling author Elizabeth George delivers an explosive,
        "absolutely riveting" novel (Entertainment Weekly) that delves into the events leading up to the shocking murder of Inspector Lynley’s wife.<br/><br/>The brutal, inexplicable death of Inspector Thomas Lynley’s wife, Helen, has left Scotland Yard shocked and searching for answers. Even more horrifying is that the trigger was apparently pulled by a twelve-year-old boy.<br/>That story begins on the other side of London in rough North Kensington, where the three, mixed-race, virtually orphaned Campbell children are bounced first from their grandmother to their aunt. The oldest, fifteen-year-old Ness, is headed for trouble as fast as her high-heeled boots will take her. That leaves the middle child, Joel, to care for the youngest, Toby. No one wants to put it into words, but something clearly isn’t right with Toby.<br/>Before long, there are signs that Joel himself has problems. A local gang starts harassing him and threatening his brother. To protect his family, Joel ends up making a pact with the devil—a move that leads straight to the front doorstep of Thomas Lynley.<br/>The anatomy of a murder, the story of a family in crisis, What Came Before He Shot Her is a powerful and emotional novel, full of deep psychological insights, that only the incomparable Elizabeth George could write.', 'language": "en", "image": "https: //images.isbndb.com/covers/56/28/9780060545628.jpg", "title_long": "What Came Before He Shot Her", "edition": "First Edition", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 1.78 Pounds, Width: 1.28321 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1.28321}, "weight": {"unit": "pounds", "value": 1.78}, "height": {"unit": "inches", "value": 9}}, "pages": 560, "date_published": "2006-10-17", "subjects": ["Mystery, Thriller & Suspense', 'Mystery', 'Police Procedurals', 'Women Sleuths', 'Thrillers & Suspense', 'Psychological Thrillers', 'Suspense'], 'authors": ['Elizabeth George'], 'title": "What Came Before He Shot Her", "isbn13": "9780060545628", "msrp": "0.00", "binding": "Hardcover", "isbn": "0060545623", "isbn10": "0060545623"}}