{'book': {'publisher': 'William Morrow', 'synopsis': 'From Arthurian legend to ancient Byzantium, from richly imagined worlds to breathtakingly re-created historical epochs, the novels of Stephen R. Lawhead weave a splendid tapestry of mysticism, heroism, adventure, revelation, and faith. Now the acclaimed author brings to magnificent life one of the most revered and remarkable figures of Celtic legend.<br/>He enters the world as Succat Morgannwg, born of a noble Welsh family in the golden age of Britain. But at age sixteen he is violently torn from his family and home by Irish raiders and sold as a slave to a brutal king. So begin seven years of toil, abuse, and servitude -- and an education that will ultimately turn his path toward the extraordinary.<br/>Rescued by the king\'s druids from almost certain death, young Succat soon learns the arts of healing and song, and the mystical ways of a secretive order whose teachings tantalize and tempt, hinting at a wisdom and faith deeper than he can imagine.<br/>Yet he will not rest until he sheds the yoke of slavery and returns to his homeland across the sea. When the miracle of opportunity appears, he leaps -- pursuing his dream of freedom through horrific war and shattering tragedy, through great love and greater loss -- from a decimated Wales to the bloody battlefields of Gaul to the fading majesty of Rome. In the twilight of a once supreme empire, he is transformed yet again by a divine hand and a passionate vision of "Truth against the world." And from a friend and mentor, he receives the name that will become legend: Patricius.<br/>A magnificent epic that sweeps across decades and continents, Stephen R. Lawhead\'s Patrick is an exhilarating adventure based on exhaustive research and newly emergent historical discovery -- a masterful and unforgettable portrait of a slave, soldier, lover, hero, and saint . . . a man whose life mirrored the cataclysmic world into which he was born, and whose memory will outlast the ages.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/28/16/9780060012816.jpg', 'title_long': 'Patrick: Son of Ireland', 'edition': 'First Edition', 'dimensions': 'Height: 9.5 Inches, Length: 6.25 Inches, Weight: 1.65 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 1.65}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 464, 'date_published': '2003-03-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'Contemporary'], 'authors': ['Stephen R Lawhead'], 'title': 'Patrick: Son of Ireland', 'isbn13': '9780060012816', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0060012811', 'isbn10': '0060012811'}}