{'book': {'publisher': 'William Morrow', 'synopsis': "Who are the women of Windsor? We know them as Elizabeth, the Queen; Elizabeth, the Queen Mother; Princess Margaret; Anne, the Princess Royal. Their images have been with us on film and in print for more than a century, like priceless artifacts that call to mind a grander era. Seen at a distance, they appear unknowable. But each is an individual, a real woman, with an extraordinary story to tell. Now, Catherine Whitney reveals what happens behind the palace doors, giving us an intimate glimpse into the private lives of these public figures.<br/>Elizabeth, the Queen: Born to duty, adored by her parents, Elizabeth swore as a teenager to serve her country above all else . . . and she has lived up to her promise, even when her crown has been a burden. This once-lively young woman has sacrificed self-interest and personal joy for her subjects for over sixty years. In public, the queen never puts a step wrong. In private, she herself knows she has made many mistakes. She has sacrificed motherhood for majesty, and seen her four children each make errors with devastating consequences. Yet, no matter what happens, the queen perseveres.<br/>Elizabeth, the Queen Mother: Hitler was afraid of her, the English people adored her. Her kind, sparkling blue eyes and cheerful manner belied a backbone of steel, and few dared to cross her. She raised her eldest daughter to serve and her youngest daughter to sparkle. But while her love of the people, and of her family, has never been in question, the Queen Mother was made of much sterner stuff than anyone has ever known -- until now.<br/>Princess Margaret: Beautiful, talented, vivacious, and complex . . . Margaret was the Diana of her day. But the promise of her youth was destroyed when she was betrayed by her sister, now the queen, who needlessly forced her to give up the man she loved. Troubled and adrift, with only a slight role to fill, Margaret became the object of public ridicule, yet she was something her sister was not: a wonderful mother.<br/>Princess Anne: Her father's favorite, arguably the most intelligent of the queen's four children. Yet Anne is forever forced to take second place to her older brother, Charles. Hardworking, hard-headed, and hot-tempered, Anne has been dismissed as an acerbic frump more at home with horses than people, especially in comparison with her ill-fated sister-in-law, Diana. Yet there is a passionate side to this complex woman, one hidden from view.<br/>These four women have shaped the world, each in her own way. Now at last their stories can be told.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/58/42/9780060765842.jpg', 'title_long': 'The Women of Windsor: Their Power, Privilege, and Passions', 'edition': 'First Edition', 'dimensions': 'Height: 9.75 Inches, Length: 6.5 Inches, Weight: 1.15 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.15}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 272, 'date_published': '2006-04-11', 'subjects': ['Biographies & Memoirs', 'Historical', 'Europe', 'Leaders & Notable People', 'Royalty', 'History', 'Americas', 'United States', 'Great Britain'], 'authors': ['Catherine Whitney'], 'title': 'The Women of Windsor: Their Power, Privilege, and Passions', 'isbn13': '9780060765842', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060765844', 'isbn10': '0060765844'}}