{"book": {"publisher": "William Morrow", "synopsis": "You\"ve met the Italian mob<br/>in The Godfather, now welcome<br/>to the real-life world of Irish<br/>America\"s own murderous clan<br/>of organized crime<br/>The man who has remained silent for more than a decade finally speaks, revealing the gritty true story of his life inside the infamous South Boston Irish mob led by the elusive, Machiavellian kingpin Whitey Bulger, who to this day remains on the lam as one of the world\"s Ten Most Wanted criminals, second only to Osama bin Laden.<br/>John 'Red' Shea was a top lieutenant in the South Boston Irish mob, rising to this position at the age of twenty-one. Thus began his tutelage under the notorious Irish godfather James 'Whitey' Bulger. An ice-cold enforcer with a legendary red-hot temper, Shea was a legend among his Southie peers in the 1980s. From the first delivery truck he robbed at thirteen to the start of his twelve-year federal sentence for drug trafficking at twenty-seven, Shea was a portrait in American crime -- a terror, brutal and ruthlessly ambitious. Drug dealer, loan shark, money launderer, and multimillion-dollar narcotics kingpin, Shea was at the pinnacle of power -- until the feds came knocking and eventually obliterated the legendary mob in a well-orchestrated sweep of arrests, fueled by insider tips to the FBI and DEA.<br/>While Bulger\'s other top men turned informant to save their own hides, Shea alone kept his code of honor and his mouth shut -- loyalty that earned him a dozen years of hard time even as the man he was protecting turned out to be, himself, a rat. For in the end, in a remarkable show of betrayal, Bulger turned out to be the FBI\'s 'main man' and top informant -- tipping off the feds for decades while still managing to operate one of the most murderous and profitable organized crime outfits of all time.<br/>In Rat Bastards, Shea brings that mysterious world and gritty urban Irish American street culture into sharp focus by telling his own story -- of his fatherless upbringing, his apprenticeship on the tough streets of Southie, and his love affair with trouble, boxing, and then the gangster life. In prose that is refreshingly honest, personal, and surprisingly tender, Shea tells his harrowing, unflinching, and unapologetic story. A man who did the crime, did the time, and held fast to the Irish code of silence, which he was raised to follow at any cost, Shea remains a man of honor and in doing so has become a living legend. One of the last of a dying breed, a true stand-up guy.<br/>Shea expects no forgiveness and makes no excuses for the life he chose. His story is intense, compelling, and in your face.', 'language": "en", "image": "https: //images.isbndb.com/covers/71/67/9780060837167.jpg", "title_long": "Rat Bastards: The Life and Times of South Boston"s Most Honorable Irish Mobster", 'edition": "First Edition", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 1.25 Pounds, Width: 1.03 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1.03}, "weight": {"unit": "pounds", "value": 1.25}, "height": {"unit": "inches", "value": 9}}, "pages": 304, "date_published": "2006-03-14", "subjects": ["Self-Help', 'Personal Transformation', 'Biographies & Memoirs', 'Community & Culture', 'Women', 'Leaders & Notable People', 'Rich & Famous', 'Memoirs', 'True Crime', 'Crime & Criminal Biographies', 'Self Service', 'Custom Stores'], 'authors": ["John 'Red' Shea'], 'title": "Rat Bastards: The Life and Times of South Boston"s Most Honorable Irish Mobster", 'isbn13": "9780060837167", "msrp": 24.95, 'binding": "Hardcover", "isbn": "0060837160", "isbn10": "0060837160"}}