{"book": {"publisher": "Harper Perennial", "synopsis": "In this follow-up to his international bestsellers Anam Cara and Eternal Echoes, John O’Donohue turns his attention to the subject of beauty—the divine beauty that calls the imagination and awakens all that is noble in the human heart<br/>Beauty is a gentle but urgent call to awaken. O"Donohue opens our eyes, hearts, and minds to the wonder of our own relationship with beauty by exposing the infinity and mystery of its breadth. His words return us to the dignity of silence, profundity of stillness, power of thought and perception, and the eternal grace and generosity of beauty"s presence.<br/>In this masterful and revelatory work, O"Donohue encourages our greater intimacy with beauty and celebrates it for what it really is: a homecoming of the human spirit. As he focuses on the classical, medieval, and Celtic traditions of art, music, literature, nature, and language, O'Donohue reveals how beauty's invisible embrace invites us toward new heights of passion and creativity even in these uncertain times of global conflict and crisis.', 'language": "en", "image": "https: //images.isbndb.com/covers/72/61/9780060957261.jpg", "title_long": "Beauty: The Invisible Embrace", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 0.47 Pounds, Width: 0.61 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 0.61}, "weight": {"unit": "pounds", "value": 0.47}, "height": {"unit": "inches", "value": 8}}, "pages": 272, "date_published": "2005-03-01", "subjects": ["Self-Help', 'Personal Transformation', 'Religion & Spirituality', 'New Age & Spirituality', 'Celtic', 'Spiritualism', 'Worship & Devotion', 'Inspirational', 'Politics & Social Sciences', 'Philosophy', 'Religious'], 'authors": ["John O'Donohue'], 'title": "Beauty: The Invisible Embrace", "isbn13": "9780060957261", "msrp": 13.99, 'binding": "Paperback", "isbn": "0060957263", "isbn10": "0060957263"}}