{"book": {"publisher": "Harper Perennial", "synopsis": "In twenty-two wonderfully articulate essays, Barbara Kingsolver raises her voice in praise of nature, family, literature, and the joys of everyday life while examining the genesis of war, violence, and poverty in our world<br/>From the author of High Tide in Tucson, comes Small Wonder, a new collection of essays that begins with a parable gleaned from recent news: villagers search for a missing infant boy and find him, unharmed, in the cave of a dangerous bear that has mothered him like one of her own. Clearly, our understanding of evil needs to be revised. What we fear most can save us. From this tale, Barbara Kingsolver goes on to consider the chasm between the privileged and the poor, which she sees as the root cause of violence and war in our time. She writes about her attachment to the land, to nature and wilderness, trees and mountains-the place from which she tells her stories. Whether worrying about the dangers of genetically engineered food crops, or creating opportunities for children to feel useful and competent - like growing food for the family’s table - Kingsolver looks for small wonders, where they grow, and celebrates them.", "language": "en", "image": "https: //images.isbndb.com/covers/40/83/9780060504083.jpg", "title_long": "Small Wonder: Essays", "edition": "Reprint", "dimensions": "Height: 0.82 Inches, Length: 7.96 Inches, Weight: 0.0016093745126 Pounds, Width: 5.32 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 7.96}, "width": {"unit": "inches", "value": 5.32}, "weight": {"unit": "pounds", "value": 0.0016093745126}, "height": {"unit": "inches", "value": 0.82}}, "pages": 288, "date_published": "2003-04-15", "subjects": ["Literature & Fiction', 'Essays & Correspondence', 'Essays', 'History & Criticism', 'Movements & Periods', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Barbara Kingsolver'], 'title": "Small Wonder: Essays", "isbn13": "9780060504083", "msrp": 10.99, "binding": "Paperback", "related": {"ePub": "0061868647"}, "isbn": "0060504080", "isbn10": "0060504080", "other_isbns": [{'isbn": "9780061868641", "binding": "print"}]}}