{'book': {'publisher': 'William Morrow', 'synopsis': "Becky Weston might be brave, funny, and smart, but she's scarcely living the life of her dreams. A single mother, she's put herself through six years of night law school after her divorce. She has a headstrong teenage daughter and an eccentric elderly mother who demand what's left of her time. Long gone are the predivorce trappings of affluence -- the Spanish-style house with a view of the Pacific, the Volvo in the garage; now she can barely make the payments on her tiny house in the upscale Southern California community of La Jolla. And what's a first wife to do when her ex-husband dies and leaves his younger, sexier, and greedier second wife wielding the purse strings on all of his assets? There's no time even to think about looking for a relationship, and as the oldest new associate in the aspiring law firm where Becky started out as the receptionist, she's expected to devote the second half of her now manless life to nothing but work. When glamorous anti-aging guru Bobbie Crystol, the author of a bestselling book about life extension, strides into the firm and offers Becky the chance to represent her interests on the West Coast, the offer seems too good to be true. No matter that Dr. Crystol -- who brandishes designer outfits and earrings like Christmas ornaments on steroids -- turns out to be Becky's archnemesis from college. The firm needs the business and Becky needs the client. But when some of the doctor's patients leave the life-extension spa sicker than when they entered, Becky begins to have doubts about the frantic pursuit of longevity at the expense of living well. Trying to hang on to both her legal career and her integrity, Becky not only learns to let go of bad choices but also devises a foolproof exit strategy, a strategy that proves to have unexpected dividends....", 'language': 'en', 'image': 'https://images.isbndb.com/covers/34/85/9780060953485.jpg', 'title_long': 'Exit Strategies: A Novel', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.125 Inches, Weight: 1.25 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.125}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 1.25}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 304, 'date_published': '2002-01-01', 'subjects': ['Literature & Fiction', 'Literary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Legal'], 'authors': ['Catherine Todd'], 'title': 'Exit Strategies: A Novel', 'isbn13': '9780060953485', 'msrp': 23.95, 'binding': 'Hardcover', 'isbn': '0060953489', 'isbn10': '0060953489'}}