{'book': {'publisher': 'Amistad', 'synopsis': "In Erica Simone Turnipseed's captivating follow-up to A Love Noire, heartache fans the flames of lust when freethinking Noire and Innocent, her urbane African ex, reunite.<br/>Noire and Innocent are both having a thirtysomething crisis. His former identity as a successful investment banker and eligible bachelor has disappeared. A beleaguered graduate student, she's got no money, no man, and no Ph.D., yet. A year of predoctoral research in Haiti leaves Noire drained. And a trip home to Côte d'Ivoire offers Innocent little more than intermittent sexual gratification. In the aftermath of 9/11, Innocent and Noire are back in New York City and find solace in each other's bed. But even that arrangement collapses under the weight of Innocent's revelation that he has unfinished business in Africa. For Innocent and Noire, patching together their unraveling lives becomes an exercise in hope and humility. With Hunger, Turnipseed lives up to the promise of A Love Noire and has matured into a writer who fearlessly explores the intersection of sex, love, identity, and loss in a cross-cultural context.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/73/00/9780060797300.jpg', 'title_long': 'Hunger: A Novel', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.8 Pounds, Width: 0.89 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.89}, 'weight': {'unit': 'pounds', 'value': 0.8}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 256, 'date_published': '2006-08-22', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'Feel-Good', "Women's Fiction", 'Contemporary', 'United States', 'Black & African American', 'Erotica', 'Humorous', 'Poetry', 'Romantic', 'Science Fiction', 'Humor & Satire', 'Dark Humor', 'Romance', 'Romantic Comedy'], 'authors': ['Erica Simone Turnipseed'], 'title': 'Hunger: A Novel', 'isbn13': '9780060797300', 'msrp': 23.95, 'binding': 'Hardcover', 'isbn': '0060797304', 'isbn10': '0060797304'}}