{'book': {'publisher': 'Harper', 'synopsis': 'Product Description      "Tap-tapping the keys and out come the words on this little screen, and who will read them I hardly know. I could be dead by the time anyone actually gets to read them, as dead as, say, Tolstoy. Or Shakespeare. Does it matter, when you read, if the person who wrote still lives?" These are the words of Jake Mishkin, whose seemingly innocent job as an intellectual property lawyer has put him at the center of a deadly conspiracy and a chase to find a priceless treasure involving William Shakespeare. As he awaits a killer-or killers-unknown, Jake writes an account of the events that led to this deadly endgame, a frantic chase that began when a fire in an antiquarian bookstore revealed the hiding place of letters containing a shocking secret, concealed for four hundred years. In a frantic race from New York to England and Switzerland, Jake finds himself matching wits with a shadowy figure who seems to anticipate his every move. What at first seems like a thrilling puzzle waiting to be deciphered soon turns into a dangerous game of cat-and-mouse, where no one-not family, not friends, not lovers-is to be trusted. Moving between twenty-first-century America and seventeenth-century England, The Book of Air and Shadows is a modern thriller that brilliantly re-creates William Shakespeare\'s life at the turn of the seventeenth century and combines an ingenious and intricately layered plot with a devastating portrait of a contemporary man on the brink of self-discovery...or self-destruction.      Review      “Few thrillers will surpass [this book] when it comes to energetic writing, compellingly flawed characters, literary scholarship and mathematical conundrums.” (USA Today)“A smart thriller. Gruber’s themes may be lofty but his people are fully fleshed. An engaging adventure.” (Boston Globe)“If you love books, make room on the shelf for a new guilty pleasure.” (Washington Post)“An intricately crafted and literate work (that) should give the (thriller) genre a good shake.” (Denver Post)“Fearless, intricate and intelligent. Stylish and confident prose. Dialogue that respects a reader’s intelligence. A smart and original plot.” (Seattle Times)“A dead genius, a sleuthing couple with romantic chemistry, and some bad guys...it’s a fun party.” (Entertainment Weekly)“Very good...ingenious and suspenseful.” (Maclean\'s)“Entertaining. A wild ride.” (Charlotte Observer, Best Books of Summer)“Smart and irreverent.” (Arizona Republic)“(An) intoxicating mix of fact, fiction, secret codes and ancient conspiracies...well-written and cleverly told. A terrific thriller.” (Edmonton Journal (Canada))“A crackling whodunit. Characters (with) rich inner lives that transmute genre fiction into literature.” (Dallas Morning News)“(An) entertaining thriller with Da Vinci Code appeal but far better writing.” (Ventura County Star)“Finely-honed prose, ambitious structure and captivating characters...This is a whip-smart adventure that surpasses its competitors with dexterity.” (Rocky Mountain News)“Quirky, flawed characters, tricksy first-person narration, and nimble, witty prose. Gruber is the real deal.” (Salon.com)“Another one of [Gruber’s] patently intricate thrillers.” (TheMorningNews.com)“Gruber is no ordinary writer.” (Milwaukee Journal Sentinel)“A gripping literary thriller. A taut novel that offers ingenious puzzles plus murderous threats along the way.” (Seattle Post-Intelligencer)“MIchael Gruber pulls out all the stops (in) an elaborate game of cat-and-mouse.” (Newsday)“(An) intelligent thrill ride.” (Tampa Tribune)“Ingenious...engaging...a gripping, satisfying read.” (Publishers Weekly (starred review))“A wonderful book, brimming with energy, suspense, wit and fascinating details about the rare book business. A fast-paced yarn that is part Henry James, part James Bond. (Chicago Tribune)“A wild ride of a thriller. The characters have depth, histories and believability.” (Wichita Eagle)“Gruber deftly raises the thriller stakes and acc', 'language': 'en', 'image': 'https://images.isbndb.com/covers/44/76/9780060874476.jpg', 'title_long': 'Book of Air and Shadows, The', 'pages': 384, 'date_published': '2008', 'subjects': ['Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense'], 'authors': ['Michael Gruber'], 'title': 'Book of Air and Shadows, The', 'isbn13': '9780060874476', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'isbn': '0060874473', 'isbn10': '0060874473'}}