{'book': {'publisher': 'Avon', 'synopsis': "It's a deadly winter for archaeologist Emma Fielding as she tracks a killer in an old New Hampshire hotel, in this fifth mystery from real-life archaeologist Dana Cameron.<br/>Archaeologist Emma Fielding should be on top of the world. Her teaching job secure and home life stable, she arrives at an archaeological conference at a famous old New Hampshire hotel, having outrun the winter storm that's paralysing the East Coast. A rising star in the field, she's in the midst of friends she's known all her life, celebrating the work of Professor Garrison, a venerable legend in the field.<br/>When Garrison is found dead on the iced-over lake outside the snow-bound hotel, however, Emma realizes that everyone has something to hide, including herself. While the police determine whether Garrison's death was an accident, suicide, or murder, Emma's intimate knowledge of her colleagues hasn't prepared her for what they're concealing, even from themselves. Emma is also forced to face the fact that the dead man was no friend of hers (or her grandfather Oscar) and that everyone-colleagues, police, and herself included-wonders why her view of him is so very different.<br/>The presence of Emma's old flame Duncan brings up bitter memories she'd rather were left buried deep in the past: Duncan wants something from her and Emma can't tell whether it is an opportunity to rekindle their relationship or a way to ensure her silence permanently. Professional jealousies and infighting would be enough added to Garrison's mysterious death, but a series of thefts and attacks in the isolated hotel make the stranded archaeologists ask whether a vengeful ghost has returned, practiced criminals are targeting the conference, or one of their own number has finally succumbed to an array of deadly temptations.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/46/37/9780060554637.jpg', 'title_long': 'More Bitter Than Death (Emma Fielding Mysteries, No. 5)', 'dimensions': 'Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.35 Pounds, Width: 0.84 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 0.84}, 'weight': {'unit': 'pounds', 'value': 0.35}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 336, 'date_published': '2005-05-24', 'subjects': ['Literature & Fiction', 'Genre Fiction', "Women's Fiction", 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Cozy', 'Amateur Sleuths', 'Thrillers & Suspense', 'Suspense', 'Self Service', 'Custom Stores'], 'authors': ['Dana Cameron'], 'title': 'More Bitter Than Death (Emma Fielding Mysteries, No. 5)', 'isbn13': '9780060554637', 'msrp': 6.99, 'binding': 'Mass Market Paperback', 'related': {'Kindle Edition': '0061749796', 'ePub': '0061749796'}, 'isbn': '0060554630', 'isbn10': '0060554630', 'other_isbns': [{'isbn': '9780061749797', 'binding': 'print'}]}}