{'book': {'publisher': 'William Morrow', 'synopsis': '"Worldwide diabetes epidemic predicted."-- Reuters, Semptember 8, 1998<br/>Diabetes is the seventh leading cause of death in the United States, and many of the 2,200 people in the United States diagnosed with diabetes each day are unaware they have it until major complications arise. Prevention and treatment of diabetes have become an urgent priority, as the global diabetes have a serious impact on the aging American population. Particularly alarming is type 2, or "late-onset" diabetes, a chronic illness that impairs the body\'s ability to use the insulin it produces to regulate blood sugar levels. In The Diabetes Cure, Vern Cherewatenko, M.D., has developed an innovative program to cure type 2 diabetes using HCA--hydroxycitric acid--to enhance the effectiveness of the body\'s own insulin.<br/>HCA is an herbal compound found naturally in the brindle berry and is sold over the counter. Taken in conjunction with the mineral chromium, HCA can improve your body\'s response to insulin without resorting to some of the "harder" and more expensive glucose-control drugs on the market. Best of all, there are no side effects. Dr. Cherewatenko counts HCA and chromium consumption as one of the nine steps to curing diabetes--others presented and discussed comprehensively in the book include exercise, stress reduction, healthy eating habits, and frequent doctor visits.<br/>Dr. Cherewatenko also provides important warning signs that can help prevent diabetes in those determined to be at highest risk. And if you already have the disease, he will show you how to halt it\'s progression and possibly reverse its debilitating effects. With the aid of the nine simple steps outlined in The Diabetes Cure, you can beat diabetes and get your health in order.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/21/05/9780060192105.jpg', 'title_long': 'The Diabetes Cure: A Natural Plan that Can Slow, Stop, Even Cure Type 2 Diabetes', 'edition': 'First Edition', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.9259415004 Pounds, Width: 0.97 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.97}, 'weight': {'unit': 'pounds', 'value': 0.9259415004}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 288, 'date_published': '1999-01-27', 'subjects': ['Health, Fitness & Dieting', 'Alternative Medicine', 'Diseases & Physical Ailments', 'Diabetes', 'Nutrition'], 'authors': ['Dr. Vern Cherewatenko', 'Paul Perry'], 'title': 'The Diabetes Cure: A Natural Plan that Can Slow, Stop, Even Cure Type 2 Diabetes', 'isbn13': '9780060192105', 'msrp': 1.99, 'binding': 'Hardcover', 'isbn': '0060192100', 'isbn10': '0060192100'}}