{"book": {"publisher": "Greenwillow Books", "synopsis": "Award-winning author Sid Fleischman blends the broadly comic with the deeply compassionate in this memorable novel, winner of the Newbery Medal.<br/><br/>A Prince and a Pauper . . . Prince Brat and his whipping boy inadvertently trade places after becoming involved with dangerous outlaws. The two boys have nothing in common and even less reason to like each other. But when they find themselves taken hostage after running away, they are left with no choice but to trust each other. "A rollicking tale of adventure and mistaken identity . . . . Robust scenes and characters are vividly evoked."—Kirkus Reviews<br/>This briskly told tale of high adventure, taut with suspense and rich with colorful characters, was named an ALA Notable Book. Sid Fleischman\"s celebrated novel features brief, action-packed chapters and includes black-and-white illustrations by Caldecott Honor artist Peter Sís. 'An 18th century tale about the escapades of a resourceful orphan and a spoiled young prince. . . . Full of adventure, suspense, humor, and lively characters.'—The New York Times', 'language": "en", "image": "https: //images.isbndb.com/covers/12/26/9780060521226.jpg", "title_long": "The Whipping Boy", "edition": "Reprint", "dimensions": "Height: 7.62 Inches, Length: 5.12 Inches, Weight: 0.16 Pounds, Width: 0.19 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.12}, "width": {"unit": "inches", "value": 0.19}, "weight": {"unit": "pounds", "value": 0.16}, "height": {"unit": "inches", "value": 7.62}}, "pages": 96, "date_published": "2003-04-15", "subjects": ["Children's Books', 'Growing Up & Facts of Life', 'Friendship, Social Skills & School Life', 'Literature & Fiction', 'Action & Adventure', 'Fairy Tales, Folk Tales & Myths', 'Humor', 'Geography & Cultures', 'Royalty', 'Self Service', 'Custom Stores'], 'authors": ["Sid Fleischman'], 'title": "The Whipping Boy", "isbn13": "9780060521226", "msrp": 6.99, 'binding": "Paperback", "isbn": "0060521228", "isbn10": "0060521228"}}