{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': "Dear Reader,<br/>Welcome to the wonderful world of the Cynsters! When I embarked onthe stories of the Cynster clan, I knew they fascinated me, but I had no idea how much they would appeal to readers. This volume contains the books that first introduced readers to the glittering, glamorous, passionate, and sometimes dangerous lives of the Cynster cousins and their ducal dynasty.<br/>In Devil's Bride, the head of the dynasty, Devil Cynster, 6th Duke of St. Ives, is caught in a compromising position with a governess. He astonishingly offers marriage, but Honoria Anstruther-Wetherby has no interest. Devil is convinced, yet someone is not so enthused, and accidents start to occur. Can Devil convince Honoria that marrying him will be a more exciting adventure than anything she's dreamed? And if he succeeds, will they both survive?<br/>In A Rake's Vow, Vane Cynster, Devil's cousin and closest friend, determined to avoid Cupid's dart, takes refuge at his godmother's country house, where fate throws Patience Debbington literally into his arms. Vane is impressed; Patience is not. But as both become embroiled in a mystery involving ghosts, thefts, and ultimately attempted murder, Patience learns that she can place her trust in this rake's vow, because it's one that comes from the heart.<br/>I hope you enjoy your first exciting taste of the Cynster world -- let the romance, adventure, mystery, and sheer passion sweep you away!<br/>WARNING: The Cynsters are addictive.<br/>Stephanie Laurens", 'language': 'en', 'image': 'https://images.isbndb.com/covers/75/24/9780060847524.jpg', 'title_long': "Devil's Bride and A Rake's Vow", 'edition': 'First Edition', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 1.3 Pounds, Width: 1.77 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 1.77}, 'weight': {'unit': 'pounds', 'value': 1.3}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 784, 'date_published': '2005-08-09', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'Romance'], 'authors': ['Stephanie Laurens'], 'title': "Devil's Bride and A Rake's Vow", 'isbn13': '9780060847524', 'msrp': 10.95, 'binding': 'Paperback', 'isbn': '0060847522', 'isbn10': '0060847522'}}