{'book': {'publisher': 'William Morrow', 'synopsis': '"I don\'t quit. I keep going."<br/>–Hillary Rodham Clinton<br/>She is, quite simply, the most famous, most complex, most loved/hated/admired/reviled woman -- perhaps person -- in America. And, whether she fulfills her life\'s ambition or not, she can already lay claim to being the first woman ever considered a serious contender for the presidency.<br/>From the beginning, there have been the inevitable comparisons to Argentina\'s legendary Eva Perón. Sex, power, money, lies, scandal, tragedy, and betrayal were the things that defined the lives of both women. Yet most of what we know about Hillary Rodham Clinton is seen in the context of her tumultuous marriage to the 42nd President. Now a power in the Senate, Hillary waits for the right moment to make her own run for the White House.<br/>In the style of his #l New York Times bestsellers The Day Diana Died and The Day John Died, as well as Jack and Jackie, Jackie After Jack, George and Laura and Sweet Caroline, Christopher Andersen draws on important sources -- many speaking here for the first time -- to paint a startling portrait of America\'s most controversial woman. Among the revelations: How U.S. history has been shaped -- and will continue to be shaped -- by the arrangement between Hillary and Bill known as "The Plan." Important new details about the role Hillary played in the scandalous eleventh hour pardons of armed radicals, drug dealers, tax cheats, embezzlers, money launderers and more. How the outgoing First Lady registered like a bride at a gift store and left the White House with $400,000 worth of "gifts" belonging to the American people. How JFK Jr. almost thwarted her Senate plans. New details about Hillary\'s relationship with Vince Foster. How Hillary has coped with Bill\'s hundreds of affairs, and the new women in her husband\'s life. What Martha Stewart did for Hillary, and how Hillary repaid her. How Hillary is using the 2004 elections as a springboard to her own future presidential candidacy—regardless of who wins.<br/>Whatever the ultimate judgment of history, the ongoing saga of Hillary Clinton\'s inexorable rise to power continues to stir passions, and to make her the American Evita.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/25/40/9780060562540.jpg', 'title_long': "American Evita: Hillary Clinton's Path to Power", 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.220462262 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 0.220462262}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 304, 'date_published': '2004-07-06', 'subjects': ['Biographies & Memoirs', 'Community & Culture', 'Women', 'Historical', 'United States', 'Leaders & Notable People', 'Military', 'Political', 'Professionals & Academics', 'Educators', 'History', 'Americas', 'World', 'Women in History'], 'authors': ['Christopher Andersen'], 'title': "American Evita: Hillary Clinton's Path to Power", 'isbn13': '9780060562540', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0060562544', 'isbn10': '0060562544'}}