{'book': {'publisher': 'William Morrow', 'synopsis': 'The #1 New York Times Bestseller<br/>In Juiced, Jose Canseco, one of the most electrifying and controversial athletes ever to step onto the baseball diamond, shares the untold story of his rise to fame and fall from grace, including a never-before-seen look behind the curtains into the history, dangers, truths, and lies about baseball’s dark secret: steroids.<br/>When Jose Canseco burst into the Major Leagues in the 1980s, he changed the sport—in more ways than one. No player before him possessed his mixture of speed and power, which allowed him to become the first man in history to belt 40+ home runs and swipe 40+ bases in the same season. He won the Rookie of the Year, the MVP award, and a World Series ring.<br/>He was a dynamo on the field, and a magnet for trouble off it. From his frequent run-ins with police, to his wild and often highly public love life, Canseco broke the mold of the big-time athlete and ushered in a new era of super-athletes with outrageous salaries and rock-star lifestyles. But behind the gaudy stats and the glitz and glamour of his public life, Canseco cultivated a dark secret, one that would alter the game of baseball and the way we view our heroes forever. Canseco made himself a guinea pig of the blossoming performance-enhancing drugs movement that was only just beginning to take hold in Major League Baseball. Anabolic steroids, human growth hormones—Canseco mixed, matched, and experimented to such a degree that he became known throughout the league as “The Chemist.” He passed his knowledge on to trainers and fellow players, and before long performance-enhancing drugs were running rampant throughout the league.<br/>Today, this issue has crept out of the closet and burst into the headlines as players balloon to herculean proportions and hundred-year-old records are not just broken, but demolished. In this shocking autobiography, Canseco sheds light on a life of dizzying highs and debilitating lows—and also provides the answers to questions about steroids and the Major Leagues that millions of sports fans are only now beginning to ask.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/64/07/9780060746407.jpg', 'title_long': "Juiced: Wild Times, Rampant 'Roids, Smash Hits, and How Baseball Got Big", 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 304, 'date_published': '2005-02-14', 'subjects': ['Biographies & Memoirs', 'Community & Culture', 'Hispanic & Latin', 'Sports & Outdoors', 'Biographies', 'Baseball'], 'authors': ['Jose Canseco'], 'title': "Juiced: Wild Times, Rampant 'Roids, Smash Hits, and How Baseball Got Big", 'isbn13': '9780060746407', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0060746408', 'isbn10': '0060746408'}}