{'book': {'publisher': 'Ecco - Harper', 'synopsis': "At the turn of the 19th century in England, a young, beautiful Mary Ann Bulkeley gives birth to a redheaded baby girl of uncertain paternity. Before the sensitive tomboy turns ten, the family determines she should be raised and schooled as a boy.<br/>So begins The Doctor, a provocative, illuminating novel based on a true story about a brilliant female physician who is compelled to live as a man under the name James Miranda Barry. Patricia Duncker, the author of Hallucinating Foucault, traces Barry's incredible life over the course of five decades and across three continents, from his cross-dressing child genius days to medical school in Edinburgh, Scotland; from his glorious career as a military surgeon to his adventures as a celebrated duelist and social figure known throughout the world.<br/>During his travels around the Empire, Barry challenged the antiquated medical beliefs of the time, fought off outbreaks of cholera and yellow fever, and dueled reluctantly over a young woman's honor. The Doctor tells Barry's story for the first time, and it is filled with an extraordinary and vivid collection of characters. There's the Venezuelan revolutionary general with an enormous moustache and a poetry addiction. The shabbily eccentric English aristocrat and his serpent look-alike sister. And then there's Alice Jones, the ruthless and gorgeous kitchenmaid--all legs, black curls and ambition--who is the object of Barry's enduring affection.<br/>Barry's accomplishments were many, as were the secrets he guarded. When his mysterious origins are finally revealed, we witness The Doctor's intriguing, anguished finale. This richly inventive and entertaining tale of dark family secrets, adultery, and colonial history is a transforming contemplation on the substance of gender, the power of will, and an unforgettable portrait of a brilliant mind.<br/>Patricia Duncker was born in the West Indies and educated at Oxford and Cambridge. Her novel, Hallucinating Foucault, won Britain's 1996 McKitterick Prize for best first novel. She teaches writing, literature, and feminist theory at the University of Wales, and lives in Wales and France.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/60/11/9780060196011.jpg', 'title_long': 'The Doctor', 'edition': '1st U.S', 'dimensions': 'Height: 9.75 Inches, Length: 6.5 Inches, Weight: 1.5 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.5}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 371, 'date_published': '1999-01-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'United States', 'Contemporary'], 'authors': ['Patricia Duncker'], 'title': 'The Doctor', 'isbn13': '9780060196011', 'msrp': 24, 'binding': 'Hardcover', 'isbn': '0060196017', 'isbn10': '0060196017'}}