{'book': {'publisher': 'Harper', 'synopsis': 'The inspiration for the STARZ original series, The Serpent Queen — second season premiering July 12th!<br/>“A beautifully written portrait of a ruthless, subtle and fearless woman fighting for survival and power in a world of gangsterish brutality, routine assassination and religious mania. . . . Frieda has brought a largely forgotten heroine-villainess and a whole sumptuously vicious era back to life. . . . This is The Godfather meets Elizabeth.” —Simon Sebag Montefiore, author of Stalin: The Court of the Red Tsar<br/>Poisoner, besotted mother, despot, necromancer, engineer of a massacre: the dark legend of Catherine de Medici is centuries old. In this critically hailed biography, Leonie Frieda reclaims the story of this unjustly maligned queen of France to reveal a skilled ruler battling extraordinary political and personal odds.<br/>Based on comprehensive research including thousands of Catherine’s own letters, Frieda unfurls Catherine’s story from her troubled childhood in Florence to her tumultuous marriage to Henry II of France; her transformation of French culture to her reign as a queen who would use brutality to ensure her children’s royal birthright. Brilliantly executed, this enthralling biography goes beyond myth to paint a very human portrait of this remarkable figure.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/49/22/9780060744922.jpg', 'title_long': 'Catherine de Medici: Renaissance Queen of France', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.755 Pounds, Width: 1.41 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.41}, 'weight': {'unit': 'pounds', 'value': 1.755}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 464, 'date_published': '2005-01-18', 'subjects': ['Biographies & Memoirs', 'Community & Culture', 'Women', 'Historical', 'Europe', 'Leaders & Notable People', 'Royalty', 'Memoirs', 'History', 'France', 'World', 'Women in History'], 'authors': ['Leonie Frieda'], 'title': 'Catherine de Medici: Renaissance Queen of France', 'isbn13': '9780060744922', 'msrp': 29.95, 'binding': 'Hardcover', 'isbn': '0060744928', 'isbn10': '0060744928'}}