{'book': {'publisher': 'Avon', 'synopsis': 'From former detective turned noted author and dog trainer, Carol Lea Benjamin, comes the fourth book in the critically-lauded Rachel Alexander mystery series, with a sharp new package--and for the first time in mass market!<br/>Dash, Rachel Alexander\'s pit bull terrier, has come to be known as half a sleuthing team. But when not called upon to solve crimes he has another very important job: that of a therapy dog, working with people who are developmentally challenged.<br/>Lady, a mop-coated puli, was the therapy dog at Harbor View, a Greenwich Village home for "throw away" people. But now lady has vanished...and the owner of the home has been killed in a bizarre and mysterious hit-and-run accident. Rachel and Dash are the perfect duo to tackle this mystery: she can find the answers and Dash can bring a sense of calm and order to the residents.<br/>As the pieces start coming together, Rachel and Dash not only expose an ugly plot, but also help some innocent victims find justice in a world that too often ignores them.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/23/46/9780060762346.jpg', 'title_long': 'Lady Vanishes: A Rachel Alexander Mystery', 'dimensions': 'Height: 6.75 Inches, Length: 4.1875 Inches, Weight: 1.15 Pounds, Width: 0.76 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.1875}, 'width': {'unit': 'inches', 'value': 0.76}, 'weight': {'unit': 'pounds', 'value': 1.15}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 304, 'date_published': '2005-08-30', 'subjects': ['Literature & Fiction', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Romance', 'Historical'], 'authors': ['Carol Lea Benjamin'], 'title': 'Lady Vanishes: A Rachel Alexander Mystery', 'isbn13': '9780060762346', 'msrp': 6.99, 'binding': 'Mass Market Paperback', 'related': {'ePub': '0061746460'}, 'isbn': '0060762349', 'isbn10': '0060762349', 'other_isbns': [{'isbn': '9780061746468', 'binding': 'print'}]}}