{'book': {'publisher': 'Ecco', 'synopsis': "<p>In 1766 Jean-Jacques Rousseau -- philosopher, novelist, composer, educational and political provocateur -- was on the run from intolerance, persecution, and enemies who decried him as a madman, dangerous to society. David Hume, now recognized as the foremost philosopher in the English language, was universally lauded as a paragon of decency. Having willingly put himself under Hume's protection, Rousseau, with his beloved dog, Sultan, took refuge in England, where he would find safety and freedom. Yet within months, the exile had accused Hume of plotting to dishonor him. The violence of Hume's response was totally out of character, and the resulting furor involved leading figures in British and French society, and became the talk of intellectual Europe.</p><br/><p>In Rousseau's Dog, David Edmonds and John Eidinow bring their engaging style and probing analysis to the bitter and very public quarrel that turned these two giants, the most influential thinkers of the Age of Enlightenment, into the deadliest of foes. The result is a story of celebrity and its price, of shameless spin, of destroyed reputations and shattered friendships. It is a story of two men whose writings would forever shape our world but whose personalities and ideas could scarcely have had less in common. It is also the story of reason and skepticism, as epitomized by Hume, colliding with the emotionalism and highly personalized confessional style pioneered by Rousseau.</p><br/><p>As brilliantly researched as it is briskly paced, Rousseau's Dog traces the path from the Age of Enlightenment to our own Age of Celebrity and, at its core, tells a most human tale of compassion, treachery, anger, and revenge.</p>", 'language': 'en', 'image': 'https://images.isbndb.com/covers/49/08/9780060744908.jpg', 'title_long': "Rousseau's Dog: Two Great Thinkers at War in the Age of Enlightenment", 'edition': 'First Edition', 'dimensions': 'Height: 8.25 Inches, Length: 5.625 Inches, Weight: 1.15 Pounds, Width: 1.13 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.625}, 'width': {'unit': 'inches', 'value': 1.13}, 'weight': {'unit': 'pounds', 'value': 1.15}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 352, 'date_published': '2006', 'subjects': ['Biographies & Memoirs', 'Professionals & Academics', 'Philosophers', 'Religion & Spirituality', 'New Age & Spirituality', 'Angels & Spirit Guides'], 'authors': ['David Edmonds', 'John Eidinow'], 'title': "Rousseau's Dog: Two Great Thinkers at War in the Age of Enlightenment", 'isbn13': '9780060744908', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0060744901', 'isbn10': '0060744901'}}