{'book': {'publisher': 'Katherine Tegen Books', 'synopsis': "About the Author      Hilary Knight, son of artist-writers Clayton Knight and Katherine Sturges, was born in Hempstead, Long Island and grew up in the town of Roslyn. When he was six the family moved to Manhattan where he has lived ever since. In the past twenty years he has maintained an apartment in the center of New York City which doubles as his studio and houses his collection of books, programs, and recordings of theatre and film music. His first published work appeared in Mademoiselle magazine in 1952, followed by drawings in House and Garden, Good Housekeeping, and Gourmet magazines. Mr. Knight has illustrated over fifty books, nine of which he also wrote. Besides books, his work has included note and greeting cards, children's fashion advertisings, illustrations for Cricket magazine, record album covers and posters for the Broadway musicals Half A Sixpence, Hallelujah Baby!, No, No Nanette, Irene, and Gypsy.      Product Description      When their stockings come out of the wash slightly altered, which greatly confuses Santa, chaos ensues as eight animal friends discover some hilarious surprises lurking in their stockings, from Elephant who receives six diamond rings to Bug who receives a toenail clipper.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/98/61/9780060009861.jpg', 'title_long': 'A Christmas Stocking Story', 'edition': '1', 'dimensions': 'Height: 10 Inches, Length: 8 Inches, Weight: 0.94 Pounds, Width: 0.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8}, 'width': {'unit': 'inches', 'value': 0.25}, 'weight': {'unit': 'pounds', 'value': 0.94}, 'height': {'unit': 'inches', 'value': 10}}, 'pages': 48, 'date_published': '2003-10-01', 'subjects': ["Children's Books", 'Animals', 'Holidays & Celebrations', 'Christmas'], 'authors': ['Hilary Knight'], 'title': 'A Christmas Stocking Story', 'isbn13': '9780060009861', 'msrp': 15.89, 'binding': 'Library Binding', 'isbn': '0060009861', 'isbn10': '0060009861'}}