{'book': {'publisher': 'Harper Paperbacks', 'synopsis': 'Do you suffer from heartburn? Is an ulcer bothering you? Are the difficult symptoms of irritable bowel syndrome compromising your life? If so, you are not alone. One in three Americans has some sort of digestive problem. After the common cold, gastrointestinal complaints are the biggest cause of employee absenteeism in the United States. And since GI disorders are so often interrelated, many people who have them suffer from two or more at the same time.<br/>Here, in a completely revised and updated edition, is everything you need to know to find fast relief from a wide range of gastrointestinal difficulties. Whether it\'s constipation, diarrhea, gas, hemorrhoids, ulcers, heartburn, colitis, gallstones, or one of the many other digestive tract problems, Dr. Steven Peikin\'s self-help nutritional program will help keep you out of the doctor\'s office--and feeling great.<br/>Based on the latest research and his own clinical experience, Dr. Peikin prescribes a healthy diet high in fiber and low in fat, spices, lactose, and caffeine. He provides a detailed list of "flag foods" to avoid in the case of specific problems and shows you how to use exercise, over-the-counter drugs, prescription drugs, and stress management to complement the program. In this new edition, Dr. Peikin offers the latest information on the diagnosis and treatment of H. pylori, the bacterium that causes ulcers and stomach cancer; the newest remedies for severe heartburn; recommendations for avoiding colon cancer through screening and prevention; and a significantly expanded section on Inflammatory Bowel Disease.<br/>If you suffer from digestive problems, you know that gastrointestinal health can make all the difference in living comfortably from day to day. Dr. Peikin\'s classic book can show you the way.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/31/88/9780060953188.jpg', 'title_long': 'Gastrointestinal Health: A Self-Help Nutritional Program to Prevent, Cure, or Alleviate Irritable Bowel Syndrome, Ulcers, Heartburn, Gas, Constipation & Many Other Digestive, Revised Edition', 'edition': '1', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 0.655 Pounds, Width: 0.83 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 0.83}, 'weight': {'unit': 'pounds', 'value': 0.655}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 368, 'date_published': '1999-04-21', 'subjects': ['Health, Fitness & Dieting', 'Diseases & Physical Ailments', 'Irritable Bowel Syndrome', 'Ulcers & Gastritis', 'Nutrition', 'Medical Books', 'Medicine', 'Internal Medicine'], 'authors': ['Steven R. Peikin M.D.'], 'title': 'Gastrointestinal Health: A Self-Help Nutritional Program to Prevent, Cure, or Alleviate Irritable Bowel Syndrome, Ulcers, Heartburn, Gas, Constipation & Many Other Digestive, Revised Edition', 'isbn13': '9780060953188', 'msrp': 15.99, 'binding': 'Paperback', 'isbn': '0060953187', 'isbn10': '0060953187'}}