{'book': {'publisher': 'Avon', 'synopsis': "A cruel twist of fate changed Simon Blackwell's life irreparably. A man of intense passions, he resolved to deny his emotions and desires forever, taking refuge in the wilds of the moorlands and shutting himself off from the world. But on one extraordinary night, on a rare trip to London, the unthinkable occurs. An intoxicatingly beautiful stranger stirs the sensuous hunger he has sworn to resist. Simon Blackwell believed that no woman could tempt him.<br/>No woman . . . save Annabel McBride.<br/>Annabel knows nothing of Simon's secret pain. But one irresistible kiss plunges her into marriage with a man she scarcely knows, a man who hides a shattered past. She can feel the blistering heat of the fire that smolders within this exquisitely handsome man, making her yearn for much more than the union in name only he has promised her.<br/>But Simon dares not love again—for fragile love can be lost in an instant. And now Annabel must find a way to open his heart to the most glorious risk of all . . .", 'language': 'en', 'image': 'https://images.isbndb.com/covers/64/54/9780060896454.jpg', 'title_long': 'The Secret Passion of Simon Blackwell (Avon Historical Romance)', 'edition': 'April', 'dimensions': 'Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.4 Pounds, Width: 0.96 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 0.96}, 'weight': {'unit': 'pounds', 'value': 0.4}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 384, 'date_published': '2007-03-27', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'United States', 'Romance', 'Victorian', '20th Century', 'Regency'], 'authors': ['Samantha James'], 'title': 'The Secret Passion of Simon Blackwell (Avon Historical Romance)', 'isbn13': '9780060896454', 'msrp': 6.99, 'binding': 'Mass Market Paperback', 'related': {'Kindle Edition': '0061801739', 'ePub': '0061801739'}, 'isbn': '0060896450', 'isbn10': '0060896450', 'other_isbns': [{'isbn': '9780061801730', 'binding': 'print'}]}}