{'book': {'publisher': 'Greenwillow Books', 'synopsis': 'The nationally bestselling picture book about a kitten, the moon, and a bowl of milk, written by the celebrated author and illustrator Kevin Henkes, was awarded a Caldecott Medal.<br/>From one of the most celebrated and beloved picture book creators working in the field today comes a memorable new character and a suspenseful adventure just right for reading and sharing at home and in the classroom. It is Kitten\'s first full moon, and when she sees it she thinks it is a bowl of milk in the sky. And she wants it. Does she get it? Well, no . . . and yes. What a night!<br/>A brief text, large type, and luminescent pictures play second fiddle to the star of this classic picture book—brave, sweet and lucky Kitten! "Henkes\'s text, reminiscent of Margaret Wise Brown\'s work in the elemental words, rhythms, and appealing sounds, tells a warm, humorous story that\'s beautifully extended in his shimmering, gray-toned artwork."—ALA Booklist<br/>Winner of the Caldecott Medal, an ALA Notable Book, a New York Times Best Illustrated Book, and winner of the Charlotte Zolotow Award<br/>Supports the Common Core State Standards', 'language': 'en', 'image': 'https://images.isbndb.com/covers/82/81/9780060588281.jpg', 'title_long': "Kitten's First Full Moon", 'edition': 'First Edition (US) First Printing', 'dimensions': 'Height: 10 Inches, Length: 10 Inches, Weight: 1.05 Pounds, Width: 0.4 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 10}, 'width': {'unit': 'inches', 'value': 0.4}, 'weight': {'unit': 'pounds', 'value': 1.05}, 'height': {'unit': 'inches', 'value': 10}}, 'pages': 40, 'date_published': '2004-03-02', 'subjects': ["Children's Books", 'Animals', 'Cats', 'Growing Up & Facts of Life', 'Family Life', 'Literature & Fiction', 'Humor', 'Mysteries & Detectives', 'Self Service', 'Custom Stores'], 'authors': ['Kevin Henkes'], 'title': "Kitten's First Full Moon", 'isbn13': '9780060588281', 'msrp': 17.99, 'binding': 'Hardcover', 'isbn': '0060588284', 'isbn10': '0060588284'}}