{'book': {'publisher': 'William Morrow', 'synopsis': '\'Tis done.<br/>The world is a most confused and unsteady place -- especially London, center of finance, innovation, and conspiracy -- in the year 1714, when Daniel Waterhouse makes his less-than-triumphant return to England\'s shores. Aging Puritan and Natural Philosopher, confidant of the high and mighty and contemporary of the most brilliant minds of the age, he has braved the merciless sea and an assault by the infamous pirate Blackbeard to help mend the rift between two adversarial geniuses at a princess\'s behest. But while much has changed outwardly, the duplicity and danger that once drove Daniel to the American Colonies is still coin of the British realm.<br/>No sooner has Daniel set foot on his homeland when he is embroiled in a dark conflict that has been raging in the shadows for decades. It is a secret war between the brilliant, enigmatic Master of the Mint and closet alchemist Isaac Newton and his archnemesis, the insidious counterfeiter Jack the Coiner, a.k.a. Jack Shaftoe, King of the Vagabonds. Hostilities are suddenly moving to a new and more volatile level, as Half-Cocked Jack plots a daring assault on the Tower itself, aiming for nothing less than the total corruption of Britain\'s newborn monetary system.<br/>Unbeknownst to all, it is love that set the Coiner on his traitorous course; the desperate need to protect the woman of his heart -- the remarkable Eliza, Duchess of Arcachon-Qwghlm -- from those who would destroy her should he fail. Meanwhile, Daniel Waterhouse and his Clubb of unlikely cronies comb city and country for clues to the identity of the blackguard who is attempting to blow up Natural Philosophers with Infernal Devices -- as political factions jockey for position while awaiting the impending death of the ailing queen; as the "holy grail" of alchemy, the key to life eternal, tantalizes and continues to elude Isaac Newton, yet is closer than he ever imagined; as the greatest technological innovation in history slowly takes shape in Waterhouse\'s manufactory.<br/>Everything that was will be changed forever ... The System of the World is the concluding volume in Neal Stephenson\'s Baroque Cycle, begun with Quicksilver and continued in The Confusion.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/38/79/9780060523879.jpg', 'title_long': 'The System of the World (The Baroque Cycle, Vol. 3)', 'edition': 'First Edition (Stated)', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 3 Pounds, Width: 1.77 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1.77}, 'weight': {'unit': 'pounds', 'value': 3}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 912, 'date_published': '2004-09-21', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'United States', 'Science Fiction & Fantasy', 'Fantasy', 'Science Fiction'], 'authors': ['Neal Stephenson'], 'title': 'The System of the World (The Baroque Cycle, Vol. 3)', 'isbn13': '9780060523879', 'msrp': 27.95, 'binding': 'Hardcover', 'isbn': '0060523875', 'isbn10': '0060523875'}}