{'book': {'publisher': 'Regan Books', 'synopsis': 'In this lavishly illustrated book, Hollywood\'s hottest new interior designer shows readers how mixing and matching designs from different eras and adding an element of the unexpected can redefine any room–residential or commercial.<br/>With a painter\'s eye for colour, unwavering esteem for the historic, and a finely tuned sense of detail, Kelly Wearstler, one of Hollywood\'s most talked about young interior designers, has led her Los Angeles–based interior design firm, kwid (Kelly Wearstler Interior Design), to national prominence with an array of noted residential and commercial projects. Now, she shares her famous design philosophies and secrets, and inspires readers to create unexpected style in their own homes. Through full–colour photographs and sketches and informative text, Kelly explains the elements of unexpected style: inspiration, shapes and forms, graphics, texture and colour, masculine vs. feminine, and unusual details. Kelly takes readers through the creative process and shows how a Franco–Chinese piece of vintage wallpaper led her to a shopping spree in Paris and inspired the layered, classic look of the hotel Maison 140 in Beverly Hills. She explains the need for "icebreakers" in a room and how unexpected designs and details can lighten a room\'s load.<br/>This is the perfect book for anyone looking for new and creative ways to decorate their homes. Whether it\'s shopping for a bedside table, putting reflective paint on the underside of a dining room table, or finishing a ceiling with high–gloss paint, she inspires readers to add an element of the unexpected to their homes. Others will enjoy living vicariously through Kelly\'s shopping sprees throughout the US, Asia, and Europe and appreciate discovering how each item found is a starting off point for a fresh and fun room design.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/44/24/9780060394424.jpg', 'title_long': 'Modern Glamour: The Art of Unexpected Style', 'edition': 'First Edition', 'dimensions': 'Height: 10 Inches, Length: 8 Inches, Weight: 3.00710525368 Pounds, Width: 0.88 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8}, 'width': {'unit': 'inches', 'value': 0.88}, 'weight': {'unit': 'pounds', 'value': 3.00710525368}, 'height': {'unit': 'inches', 'value': 10}}, 'pages': 304, 'date_published': '2004-03-16', 'subjects': ['Arts & Photography', 'Architecture', 'Interior Design', 'Decorative Arts & Design', 'Interior & Home Design', 'Crafts, Hobbies & Home', 'Crafts & Hobbies', 'Decorating', 'Home Improvement & Design', 'Decorating & Design'], 'authors': ['Kelly Wearstler', 'Jane Bogart'], 'title': 'Modern Glamour: The Art of Unexpected Style', 'isbn13': '9780060394424', 'msrp': 45, 'binding': 'Hardcover', 'isbn': '0060394420', 'isbn10': '0060394420'}}