{'book': {'publisher': 'William Morrow', 'synopsis': 'What one piece of advice has made<br/>all the difference in your life?<br/>That was the question longtime journalist and Fox & Friends cohost E.D. Hill asked of scores of the most famous and successful figures in America—from President George W. Bush to supermodel Carol Alt. The result is Going Places, a collection of moving and instructive profiles that reveal exactly what inspires and drives our nation\'s best and brightest to survive and thrive.<br/>In the pages of Going Places, you\'ll discover how Donald Trump approaches the competition, what makes NFL star Tiki Barber a smart player on and off the field, and what life lesson television star Doris Roberts learned on a trip to Napa Valley. You\'ll follow country music star Trace Adkins\'s journey from working on a rig in the oil fields of Texas to signing a deal with Capitol Records in Nashville, and Donna de Varona\'s path to becoming the youngest member of the U.S. Olympic swim team at age thirteen. Sometimes heart wrenching, sometimes humorous, and always captivating, these portraits are sure to inform, entertain, and, most important, inspire. Sarah Ferguson, the Duchess of York, on searching for her soul in Tibet Champion bull rider Justin McBride on what it means to get a good night\'s sleep Senate Majority Leader Dr. William Frist on medicine as a currency of peace Dolly Parton on her father\'s horse-sense advice Dean Cain on rejection, perseverance, and lessons he learned from his son<br/>Sharing these stories in these figures\' own voices, Going Places reflects a vast and diverse America in which anything is possible. "It is my hope that you\'ll have this book by your bedside table and turn to it, alone or with your children, to find inspiration from wonderful people." After all, as these real-life stories illustrate, great advice can come from anyone, at any time.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/80/42/9780060828042.jpg', 'title_long': "Going Places: How America's Best and Brightest Got Started Down the Road of Life", 'edition': 'First Edition', 'dimensions': 'Height: 9.5 Inches, Length: 6.5 Inches, Weight: 1.25 Pounds, Width: 1.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1.75}, 'weight': {'unit': 'pounds', 'value': 1.25}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 320, 'date_published': '2005-10-25', 'subjects': ['Self-Help', 'Motivational', 'Biographies & Memoirs'], 'authors': ['E.D. Hill'], 'title': "Going Places: How America's Best and Brightest Got Started Down the Road of Life", 'isbn13': '9780060828042', 'msrp': 26.95, 'binding': 'Hardcover', 'isbn': '0060828048', 'isbn10': '0060828048'}}