{'book': {'publisher': 'William Morrow', 'synopsis': "Innes? Innes, it's Isabella. Isabella Velasco ... Don't ask me how I got hold of you ... We live quite close, you know, would you believe? God, you sound just the same. Just the same! ... I need to talk to you ... see you. Can you call me as soon as you can?<br/>Innes Haldane, who as a teen was deemed out of control both physically and sexually, has made every attempt to put that stage of her life behind her. Until a voice from the past leaves a message on her answering machine and an obituary with a familiar name interrupts her quiet life.<br/>In 1977, Innes was one of seven dysfunctional teenagers incarcerated in the Unit, an avant-garde psychiatric hospital on the outskirts of Edinburgh. She and her fellow inmates -- Danny, a rapist by age fourteen; Carrie, whose mother's boyfriends always found her more attractive than her drug-addict mother; Lydia, who as a grossly overweight teenager retreated into a severely manic-depressive world; Simon, whose domineering mother blamed him for the death of his twin; Alexandra, a member of thesocial upper class who revolted against her parents; and Isabella, who suffered at the hands of a prominent yet highly abusive father and a vain, jealous mother -- were forced into one another's lives, exposed to one another's pasts, and now share a collective memory.<br/>Since then, they have spent their adult lives trying to forget the unspeakable acts that sent them to the Unit and the terrible secret that occurred behind its walls. But a murderer is stalking the former patients and the only way to save themselves is by reuniting -- no matter what the emotional cost. If the killer doesn't shatter their new lives, the memories being brought back to life just might.<br/>Now Innes must contact the others before someone else finds them first ...", 'language': 'en', 'image': 'https://images.isbndb.com/covers/60/96/9780060726096.jpg', 'title_long': 'The Reunion: A Novel', 'dimensions': 'Height: 9 Inches, Length: 6.12 Inches, Weight: 1.295 Pounds, Width: 1.05 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.12}, 'width': {'unit': 'inches', 'value': 1.05}, 'weight': {'unit': 'pounds', 'value': 1.295}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 320, 'date_published': '2004-09-28', 'subjects': ['Literature & Fiction'], 'authors': ['Sue Walker'], 'title': 'The Reunion: A Novel', 'isbn13': '9780060726096', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060726091', 'isbn10': '0060726091'}}