{'book': {'publisher': 'Greenwillow Books', 'synopsis': 'Product Description      Geography is more than maps and globes, more than latitude and longitude lines, more than continents, oceans, islands, and your own neighborhood.In Got Geography! Lee Bennett Hopkins gathers vivid poems by sixteen poets and Philip Stanton creates glorious artwork to show that geography isn\'t just about finding your way. It\'s the jumping-off point for dreams and imagination.If you\'ve got geography, you\'re ready for adventure. . . .       About the Author      Noted poet Lee Bennett Hopkins has edited or authored numerous books for children, including the I Can Read Books Hamsters, Shells, and Spelling Bees; A Pet for Me: Poems; and the ALA Notable Children\'s Book Surprises. The recipient of a Christopher Award and the University of Southern Mississippi\'s Medallion for "lasting contributions to children\'s literature," Mr. Hopkins lives in Florida.Philip Stanton is the director of his own design studio, which produces everything from large-scale urban art installations to multimedia projects for movies, television, and the internet. He is the award-winning illustrator of numerous picture books published in Europe. Got Geography! is his first book to be published in the United States. He grew up in Florida and now lives with his family in Barcelona, Spain.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/60/20/9780060556020.jpg', 'title_long': 'Got Geography!', 'dimensions': 'Height: 11 Inches, Length: 8.5 Inches, Weight: 0.85 Pounds, Width: 0.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.5}, 'width': {'unit': 'inches', 'value': 0.25}, 'weight': {'unit': 'pounds', 'value': 0.85}, 'height': {'unit': 'inches', 'value': 11}}, 'pages': 32, 'date_published': '2006-02-28', 'subjects': ["Children's Books", 'Literature & Fiction', 'Poetry', 'Science, Nature & How It Works', 'Earth Sciences'], 'authors': ['Lee Bennett Hopkins'], 'title': 'Got Geography!', 'isbn13': '9780060556020', 'msrp': 17.89, 'binding': 'Library Binding', 'isbn': '0060556021', 'isbn10': '0060556021'}}