{'book': {'publisher': 'William Morrow', 'synopsis': "An extraordinary and dramatic tale of shipwrecks, underwater discovery, and the dawn of the golden age of piracy.<br/>On January 2, 1678, a fleet of French ships sank in the Caribbean Sea, one hundred miles off the Venezuelan coast, on the killer reef of Las Aves Island. These wrecks, which claimed more than 1,200 lives, proved disastrous for French naval power in the region and sparked the rise of a golden age of piracy, an era that was forever to alter the shape of the Americas. In The Lost Fleet, writer, explorer, and deep-sea diver Barry Clifford interweaves the dramatic tale of this maritime catastrophe -- and the dangerous upsurge of piracy in the world's seas -- with the contemporary account of his own expedition to document and explore the wrecks.<br/>Tracing the lives of fabled pirates like the Chevalier de Grammont, Nikolaas Van Hoorn, Thomas Paine, and Jean Comte d'Estrées, The Lost Fleet delivers a stunning portrait of a dark age, rich with historical detail and romantic drama. Toward the end of the eighteenth century, the outcasts of European society came together to form a democracy of buccaneers, settling on a string of islands off the African coast. From there, the pirates made their fame and fortune by haunting the world's oceans, wreaking havoc on the settlements along the Spanish main and -- often enlisted by French and English governments -- sacking ships, ports, and coastal towns.<br/>Now, two hundred and fifty years later, Barry Clifford has followed the pirates' destructive wake around the world all the way back to Venezuela. With the help of a remarkably accurate map, drawn by Jean Comte d'Estrées (the captain of the lost French fleet) himself, Clifford was able to locate the exact site of the disaster and the wreckage of the once mighty armada.<br/>Beautifully told, epic in scope, and steeped in period detail, The Lost Fleet is a mesmerizing account of historical discovery and underwater reclamation for anyone with a heart for adventure and history, myth, and treasure hunting.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/81/83/9780060198183.jpg', 'title_long': 'The Lost Fleet: The Discovery of a Sunken Armada from the Golden Age of Piracy', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.25 Pounds, Width: 0.93 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.93}, 'weight': {'unit': 'pounds', 'value': 1.25}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 304, 'date_published': '2002-07', 'subjects': ['History', 'Americas', 'United States', 'Europe', 'France', 'World', 'Maritime History & Piracy', 'Science & Math', 'Nature & Ecology', 'Oceans & Seas', 'Travel', 'Specialty Travel', 'Adventure'], 'authors': ['Barry Clifford'], 'title': 'The Lost Fleet: The Discovery of a Sunken Armada from the Golden Age of Piracy', 'isbn13': '9780060198183', 'msrp': 27.95, 'binding': 'Hardcover', 'isbn': '0060198184', 'isbn10': '0060198184'}}