{'book': {'publisher': 'Harper Business', 'synopsis': 'When it comes to money, are you controlled by fear? Do you live in financial chaos?Do you underestimate your worth? Are you ready to go to the next level, but can\'t seem to get there? If the answer is yes to these questions, you may be an underearner.<br/>Underearners are self-saboteurs who never live up to their earnings potential, says Barbara Stanny, a financial educator, motivational speaker, former journalist, and career counselor. Underearners tend to live paycheck to paycheck. They rarely balance their checkbooks and are often in debt. Ironically, many work incredibly hard. Yet they are ashamed to admit that money matters to them. They all have a high tolerance for low pay.<br/>The good news is that underearning is often self-imposed. By focusing on overcoming underearning, you will not only earn what you deserve, but you can live up to your full potential. With techniques and exercises that have helped thousands of people who have participated in her Overcoming Underearning™ workshops, Stanny teaches you five essential steps to financial independence. Once you understand these steps, you will be confident asking for a raise, increasing your prices, or getting a better job. "Now I\'m making more than my friends, all because I had the guts to dream and ask for more," says one Stanny fan.<br/>First, Tell the Truth: be honest about your financial situation and figure out your attitudes toward money. Second, Make a Decision: decide that you want to make more money. Third, Stretch: take action, face your fears, and be willing to be uncomfortable. Fourth, Create Community by finding supporters and asking for help. Fifth, Respect and Appreciate Money: learn to save and invest.<br/>Overcoming Underearning is filled with inspiring, real-life stories of underearners who turned their lives around. Stanny brings a message of empowerment and hope to all those who chronically undervalue themselves. "I\'m making more, working less, feeling healthier, have more energy, and I\'m so much happier," concludes another Stanny believer.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/86/16/9780060818616.jpg', 'title_long': 'Overcoming Underearning(TM): Overcome Your Money Fears and Earn What You Deserve', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.05 Pounds, Width: 0.85 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.85}, 'weight': {'unit': 'pounds', 'value': 1.05}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 240, 'date_published': '2005-12-27', 'subjects': ['Self-Help', 'Motivational', 'Personal Transformation', 'Success', 'Business & Money', 'Business Culture', 'Motivation & Self-Improvement', 'Job Hunting & Careers', 'Guides', 'Management & Leadership', 'Personal Finance'], 'authors': ['Barbara Stanny'], 'title': 'Overcoming Underearning(TM): Overcome Your Money Fears and Earn What You Deserve', 'isbn13': '9780060818616', 'msrp': 19.25, 'binding': 'Hardcover', 'isbn': '0060818611', 'isbn10': '0060818611'}}