{'book': {'publisher': 'Harper Perennial', 'synopsis': '"Prisoners of Hate offers a profound analysis of a most pressing human challenge: the causes—and prevention—of hatred. Of the many important books Aaron Beck has written, this may be his greatest gift to humanity." —Daniel Goleman, author of Emotional Intelligence<br/>World-renowned psychiatrist Dr. Aaron T. Beck has always been at the forefront of cognitive therapy research, his approach being the most rapidly growing psychotherapy today. In his most important work to date, the widely hailed father of cognitive therapy presents a revolutionary look at destructive behavior—from domestic abuse to genocide to war—and provides a solid framework for remedying these crucial problems.<br/>In this book, Dr. Beck: Illustrates the specific psychological aberrations underlying anger, interpersonal hostility, ethnic conflict, genocide, and war; Clarifies why perpetrators of evil deeds are motivated by a belief that they are doing good; Explains how the offenders are locked into distorted belief systems that control their behavior and shows how the same distortions in thinking occur in a rampaging mob as in an enraged spouse; Provides a blueprint for correcting warped thinking and belief systems and, consequently, undercutting various forms of hostility; and Discusses how the individual and society as a whole might use the tools of psychotherapy to block the psychological pathways to war, genocide, rape, and murder.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/20/08/9780060932008.jpg', 'title_long': 'Prisoners of Hate: The Cognitive Basis of Anger, Hostility, and Violence', 'edition': '1', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 0.001543235834 Pounds, Width: 0.84 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 0.84}, 'weight': {'unit': 'pounds', 'value': 0.001543235834}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 368, 'date_published': '2000-08-22', 'subjects': ['Business & Money', 'Management & Leadership', 'Systems & Planning', 'Processes & Infrastructure', 'Organizational Learning', 'Health, Fitness & Dieting', 'Mental Health', 'Emotions', 'Psychology & Counseling', 'Social Psychology & Interactions', 'Science & Math', 'Behavioral Sciences', 'Cognitive Psychology', 'Medical Books', 'Psychology', 'Cognitive', 'Politics & Social Sciences', 'Social Sciences', 'Violence in Society'], 'authors': ['Aaron T. Beck M.D.'], 'title': 'Prisoners of Hate: The Cognitive Basis of Anger, Hostility, and Violence', 'isbn13': '9780060932008', 'msrp': 16.99, 'binding': 'Paperback', 'related': {'eBook': '0062046004', 'ePub': '0062046004'}, 'isbn': '0060932007', 'isbn10': '0060932007', 'other_isbns': [{'isbn': '9780062046000', 'binding': 'print'}]}}