{'book': {'publisher': 'It Books', 'synopsis': "Part sports star, part antihero, part hip-hop icon, Allen Iverson has managed to cross over into the mainstream of American culture -- without compromise. Defiantly tattooed, with his hair in cornrows, the six-foot Philadelphia 76ers point guard is one of the most recognizable and controversial stars of the sports world. His meteoric rise from a troubled childhood in the ghetto to NBA superstardom has been marked by five straight playoff appearances, including a finals berth in 2001 and an MVP award. From his rap sheet to his rap album, fans and journalists alike hound his every move. But never before has a biographer presented a full portrait of this complicated and intensely private star -- a man whose loyalty to his family, the streets, and his friends trumps any other concern. Filled with exclusive interview material and unprecedented access to many of Iverson's inner circle, Only the Strong Survive is the first in-depth look at the truth behind this newly minted legend.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/77/45/9780060097745.jpg', 'title_long': 'Only the Strong Survive: The Odyssey of Allen Iverson', 'edition': 'Reprint', 'dimensions': 'Height: 0.66 Inches, Length: 9.03 Inches, Weight: 0.88 Pounds, Width: 6.02 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 9.03}, 'width': {'unit': 'inches', 'value': 6.02}, 'weight': {'unit': 'pounds', 'value': 0.88}, 'height': {'unit': 'inches', 'value': 0.66}}, 'pages': 262, 'date_published': '2003-10-21', 'subjects': ['Biographies & Memoirs', 'Community & Culture', 'Humor & Entertainment', 'Humor', 'Sports', 'Sports & Outdoors', 'Basketball', 'Biographies', 'Miscellaneous', 'History of Sports', 'Self Service', 'Custom Stores'], 'authors': ['Larry Platt'], 'title': 'Only the Strong Survive: The Odyssey of Allen Iverson', 'isbn13': '9780060097745', 'msrp': 14.99, 'binding': 'Paperback', 'related': {'ePub': '0061751332'}, 'isbn': '0060097744', 'isbn10': '0060097744', 'other_isbns': [{'isbn': '9780061751332', 'binding': 'print'}]}}