{'book': {'publisher': 'Harper Paperbacks', 'synopsis': 'Resolving Infertility takes readers step-by-step through the difficult medical and emotional issues surrounding this widespread problem. Here is all of the latest information on cutting-edge treatments; advice on choosing a medical team; alternative family-building options such as surrogacy, adoption, donor pregnancy, or deciding to live child-free; as well as planning finances and knowing legal options and responsibilities. Featuring decision trees to help readers navigate the major steps in the fertility journey and to find the right solution for them, Resolving Infertility is the definitive resource about a confusing and often painful medical issue. Resolve is the largest, most respected infertility education, support, and advocacy organisation in the USA with more than 100,000 members. Founded in Boston in 1974, it selves communities through local chapters in all 50 states and reaches close to a million people annually through its national help-line, website, e-mail service, and newsletter. Diane Aronson is former Executive Director of Resolve. She lives in Arlington, MA.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/79/95/9780060957995.jpg', 'title_long': 'Resolving Infertility', 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 7.375 Inches, Weight: 1.1684499886 Pounds, Width: 0.96 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.375}, 'width': {'unit': 'inches', 'value': 0.96}, 'weight': {'unit': 'pounds', 'value': 1.1684499886}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 384, 'date_published': '2001-02-01', 'subjects': ['Health, Fitness & Dieting', "Women's Health", 'Pregnancy & Childbirth', 'Parenting & Relationships', 'Fertility', 'Politics & Social Sciences', 'Politics & Government', 'Public Affairs & Policy'], 'authors': ['Resolve', 'Diane Aronson', 'Suzanne Levert'], 'title': 'Resolving Infertility', 'isbn13': '9780060957995', 'msrp': 1.99, 'binding': 'Paperback', 'isbn': '0060957999', 'isbn10': '0060957999'}}