{'book': {'publisher': 'Avon', 'synopsis': "When Steven Hudson, a wealthy widower in his late sixties, agrees to appear on a reality TV show with a group of beautiful twentysomething gold diggers, romance breaks out where he least expects it. As the head of a somewhat stodgy old–money Wall Street firm, Steven's partners are against his decision to appear on the show, but his children–especially his ne'er–do–well son, Henry–support him. While Henry is smart–he's invented many clever applications for computers–he's lazy, and has never had to work a day in his life. But if Henry can help out his father with the TV show, and end up with some of the girls who are eliminated from the show each week, how can that hurt?<br/>When Steven least expects it, love jumps up and smacks him between the eyes. Jessica James–the TV show's producer–is about thirty–nine, and a single mother with a teenage son. But unlike the siliconed and perfectly toned babes vying for Steven's love–and wallet–she is a real woman who has lived life and knows what she wants. To her great surprise, Jessie discovers she wants Steven too, despite the thirty years separating them. But not before Steven is run through the mill of hot young things who are exhaustingly energetic between the sheets. Even Henry is in for an awakening when he discovers that there is more to life than rich food, expensive drink, fine clothes, fast cars, and gorgeous women. Everyone is fair game for Cupid's arrows.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/16/75/9780060851675.jpg', 'title_long': 'Sex and the Single Zillionaire: A Novel', 'edition': 'First Edition', 'dimensions': 'Height: 9.5 Inches, Length: 6.25 Inches, Weight: 1.15 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.15}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 304, 'date_published': '2006-01-24', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Family Life', "Women's Fiction", 'Divorce', 'Domestic Life', 'Contemporary', 'Romance', 'Billionaires'], 'authors': ['Tom Perkins'], 'title': 'Sex and the Single Zillionaire: A Novel', 'isbn13': '9780060851675', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0060851678', 'isbn10': '0060851678'}}