{'book': {'publisher': 'Amistad', 'synopsis': "At last -- a book devoted to the concerns of people of color that will help you enhance and protect the health and beauty of your skin, hair, and nails. Dr. Susan Taylor, a Harvard-trained dermatologist and a beautiful woman of color, bases her advice on more than fifteen years' experience treating patients in private practice and at the first-of-its-kind Skin of Color Center in New York City, which she directs.<br/>Her quizzes, product recommendations, and patient-tested solutions provide information you can use today! She explains: What makes skin of color beautiful -- yet vulnerable: Melanin provides rich color and sun protection, but makes skin prone to scars and marks. Dr. Taylor shares cleansing, care, and cover-up techniques. Strategies for satin-smooth skin: Learn how to nip breakouts and rashes in the bud, avoiding discolorations. Scar Rx: From cuts to cosmetic surgery, Dr. Taylor explains how to prevent and camouflage disfiguring scars. Makeup made easy: Skin tones can vary on a woman's body. Dr. Taylor tells how to choose and use makeup for a perfect match year-round. Health help for hair: From short naturals to hot combs, chemical hair relaxers, braids, weaves, and locks, Dr. Taylor tells how to style hair safely to avoid damage, hair loss, and skin irritation -- whatever style readers choose. Skin cancer savvy: The danger signs are different in people of color. Dr. Taylor explains what to look for.<br/>Brown Skin offers comprehensive, culturally specific answers to help you look and feel your best, to recognize and prevent problems, and to get the right treatment for you and your family when needed.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/87/12/9780060088712.jpg', 'title_long': "Brown Skin: Dr. Susan Taylor's Prescription for Flawless Skin, Hair, and Nails", 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 7.375 Inches, Weight: 1.6 Pounds, Width: 1.09444 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.375}, 'width': {'unit': 'inches', 'value': 1.09444}, 'weight': {'unit': 'pounds', 'value': 1.6}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 304, 'date_published': '2003-05-27', 'subjects': ['Health, Fitness & Dieting', 'Beauty, Grooming, & Style', 'Cosmetics', 'Skin Care', "Women's Health", 'General', 'Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies'], 'authors': ['Susan C. Taylor'], 'title': "Brown Skin: Dr. Susan Taylor's Prescription for Flawless Skin, Hair, and Nails", 'isbn13': '9780060088712', 'msrp': 1.99, 'binding': 'Hardcover', 'isbn': '0060088710', 'isbn10': '0060088710'}}