{"book": {"publisher": "HarperVia", "synopsis": "New York Times bestselling author of The House of the Spirits, Isabel Allende celebrates the pleasures of the sensual life in this rich, joyful and slyly humorous book, a combination of personal narrative and treasury of erotic lore.<br/>Under the aegis of the Goddess of Love, Isabel Allende uses her storytelling skills brilliantly in Aphrodite to evoke the delights of food and sex. After considerable research and study, she has become an authority on aphrodisiacs, which include everything from food and drink to stories and, of course, love. Readers will find here recipes from Allende"s mother, poems, stories from ancient and foreign literatures, paintings, personal anecdotes, fascinating tidbits on the sensual art of foodand its effects on amorous performance, tips on how to attract your mate and revive flagging virility, passages on the effect of smell on libido, a history of alcoholic beverages, and much more.<br/>An ode to sensuality that is an irresistible blend of memory, imagination and the senses, Aphrodite is familiar territory for readers who know her fiction.", "language": "en", "image": "https: //images.isbndb.com/covers/01/72/9780060930172.jpg", "title_long": "Aphrodite: A Memoir of the Senses", "edition": "First Edition", "dimensions": "Height: 0.65 Inches, Length: 9.2 Inches, Weight: 1.36 Pounds, Width: 6.2 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 9.2}, "width": {"unit": "inches", "value": 6.2}, "weight": {"unit": "pounds", "value": 1.36}, "height": {"unit": "inches", "value": 0.65}}, "pages": 320, "date_published": "1999-04-07", "subjects": ["Self-Help', 'Sex', 'Biographies & Memoirs', 'Community & Culture', 'Women', 'Health, Fitness & Dieting', 'Psychology & Counseling', 'Sexuality', 'Social Psychology & Interactions', 'Literature & Fiction', 'World Literature', 'Caribbean & Latin American'], 'authors": ["Isabel Allende'], 'title": "Aphrodite: A Memoir of the Senses", "isbn13": "9780060930172", "msrp": 19.99, "binding": "Paperback", "isbn": "0060930179", "isbn10": "0060930179", "other_isbns": [{'isbn": "9780062254412", "binding": "printisbncanonical"}]}}