{"book": {"publisher": "Harper Perennial Modern Classics", "synopsis": "“Made up of poems that are so original in their style and so startlingly accomplished in their confessional voice that they helped change the direction of contemporary poetry, Ariel is a masterpiece.” — New York Observer<br/>Sylvia Plath\"s famous collection, as she intended it.<br/>When Sylvia Plath died, she not only left behind a prolific life but also her unpublished literary masterpiece, Ariel. When her husband, Ted Hughes, first brought this collection to the public, it garnered worldwide acclaim, but it wasn\"t the draft Sylvia had wanted her readers to see. This facsimile edition restores, for the first time, Plath\"s original manuscript—including handwritten notes—and her own selection and arrangement of poems. This edition also includes in facsimile the complete working drafts of her poem 'Ariel,' which provide a rare glimpse into the creative process of a beloved writer. This publication introduces a truer version of Plath\'s works, and will alter her legacy forever.', 'language": "en", "image": "https: //images.isbndb.com/covers/26/08/9780060732608.jpg", "title_long": "Ariel: The Restored Edition: A Facsimile of Plath"s Manuscript, Reinstating Her Original Selection and Arrangement (Modern Classics)", 'edition": "Reprint", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 0.61 Pounds, Width: 0.64 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 0.64}, "weight": {"unit": "pounds", "value": 0.61}, "height": {"unit": "inches", "value": 9}}, "pages": 256, "date_published": "2018-03-06", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Poetry', 'Regional & Cultural', 'Themes & Styles', 'Women Authors', 'Self Service', 'Custom Stores'], 'authors": ["Sylvia Plath'], 'title": "Ariel: The Restored Edition: A Facsimile of Plath"s Manuscript, Reinstating Her Original Selection and Arrangement (Modern Classics)", 'isbn13": "9780060732608", "msrp": 15.99, "binding": "Paperback", "related": {"Kindle Edition": "0062669443", "eBook": "0062669443"}, "isbn": "0060732601", "isbn10": "0060732601", "other_isbns": [{'isbn": "9780062669445", "binding": "ebook"}]}}