{'book': {'publisher': 'William Morrow', 'synopsis': 'As a teenager in Atlantic City in the 1960s, John O\'Neill dreamed of becoming an FBI agent. Over the next four decades, his charisma, talent, and dedication catapulted him to the top echelons of the FBI in its fight against terrorism and drew him into a world of glamour, intrigue, and power.<br/>Driven by an all-consuming desire to protect Americans, O\'Neill rose through the FBI\'s ranks and played important roles in every major terrorism investigation of the 1990s, including the bombing of the Alfred P. Murrah building in Oklahoma City, the Khobar Towers in Saudi Arabia, and the USS Cole in Yemen; the twin embassy attacks in Africa; and the capture of Ramzi Yousef, who masterminded the 1993 World Trade Center bombing. O\'Neill\'s larger-than-life personality, hard-charging style, and insistent warnings against complacency won him both fervent admirers and bitter enemies among government officials and his crime-fighting colleagues.<br/>In 1995, O\'Neill became the first agent to recognize Osama bin Laden and his Al Qaeda network as the single greatest terrorist threat to America. He campaigned relentlessly for increased cooperation between the CIA, the FBI, and U.S. and foreign governments, and made decisions that would change the face of counterterrorism. O\'Neill won the respect of many powerful figures around the world and earned a legendary reputation as a bon vivant, an innovative leader, and a bridge builder of important alliances. But O\'Neill\'s confident, charming public persona belied several professional disappointments and the growing strain of secretly maintaining a complex web of romantic relationships. When the FBI and the U.S. government continued to disregard his calls to connect the terror trail to bin Laden and his associates, O\'Neill became even more disillusioned and ultimately resigned his post at the FBI. Just days later, John O\'Neill perished helping others to safety on September 11, 2001, while on his new job as director of security at the World Trade Center. Ironically, as Louis Napoli of the joint terrorist task force said, "[O\'Neill] chased bin Laden all over the world and bin Laden caught up with him." In The Man Who Warned America, Murray Weiss weaves groundbreaking insider insight and hundreds of hardhitting interviews into a masterful tale of John O\'Neill\'s quest to save America.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/82/27/9780060508227.jpg', 'title_long': "The Man Who Warned America: The Life and Death of John O'Neill, the FBI's Embattled Counterterror Warrior", 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 5.75 Inches, Weight: 1.7416518698 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 1.7416518698}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 464, 'date_published': '2003-08-19', 'subjects': ['Biographies & Memoirs', 'Leaders & Notable People', 'Military'], 'authors': ['Murray Weiss'], 'title': "The Man Who Warned America: The Life and Death of John O'Neill, the FBI's Embattled Counterterror Warrior", 'isbn13': '9780060508227', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0060508221', 'isbn10': '0060508221'}}