{'book': {'publisher': 'William Morrow', 'synopsis': "The murder of an exotic young woman<br/>brings crime too close for comfort<br/>Murder hits close to home for Death on Demand bookstore owner Annie Darling and her beloved husband, Max. While investigating a new case, Max calls Annie to let her know he may be late getting home. He never shows up. Annie knows something dreadful has happened to him.<br/>During the search for Max, his car is found on a remote road -- with a murder weapon in the trunk and a beautiful but very dead young woman nearby. The case becomes a media sensation with Max portrayed as an unfaithful husband willing to kill to get rid of a mistress.<br/>As the evidence against Max continues to mount, chief of police Billy Cameron is called off the case. But Billy risks his career to continue the hunt for a silver car briefly seen following Max's on the night of the murder, and Annie is forced to go undercover in a desperate attempt to clear her husband's name. Risking her life, she enters the victim's unfamiliar world in the hopes of understanding how and why Max is involved. With time running out, Annie has one last chance to capture a wily murderer who just may have committed the perfect crime.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/40/23/9780060724023.jpg', 'title_long': 'Dead Days of Summer (Death on Demand Mysteries, No. 17)', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6.25 Inches, Weight: 0.85 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.85}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 288, 'date_published': '2006-03-28', 'subjects': ['Literature & Fiction', 'Genre Fiction', "Women's Fiction", 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Cozy', 'Amateur Sleuths', 'Thrillers & Suspense', 'Suspense'], 'authors': ['Carolyn Hart'], 'title': 'Dead Days of Summer (Death on Demand Mysteries, No. 17)', 'isbn13': '9780060724023', 'msrp': 23.95, 'binding': 'Hardcover', 'isbn': '0060724021', 'isbn10': '0060724021'}}