{'book': {'publisher': 'William Morrow', 'synopsis': "Twenty-seven years after she adopted her baby daughter in Ireland, Lena Molloy receives a mysterious call from Sister Monica, the nun who set up the adoption. She claims that she wants merely to tie up loose ends before she retires, but Lena, who feels both anxious and frightened after the call, is tempted to probe deeper into the meaning of their conversation. Against her husband's wishes, and accompanied by her best friend, Alma -- who is nursing a broken heart -- Lena travels to the west of Ireland on a secret mission to trace the birth parents of her daughter, Mary, an up-and-coming star in the world of opera.<br/>At first the trail seems to have gone cold. Saint Joseph's home for unmarried mothers has become an old people's home, and Sister Monica is dismissive and unforthcoming. Then a chance meeting sets Lena on a journey through Ireland and into the past, taking her through many twists and turns to an outcome she could never have anticipated.<br/>Singing Bird is a fresh, penetrating novel filled with emotional complexity, psychological suspense and Irish charm. It is a story about deeply rooted secrets, the unshakable bonds between family and friends and the constant human struggle to unearth the truth about our own personal history. Roisin McAuley's debut novel is a beguiling and timeless tale of faith and devotion that will touch everyone who reads it.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/78/87/9780060737887.jpg', 'title_long': 'Singing Bird: A Novel', 'edition': 'First U. S. Edition', 'dimensions': 'Height: 9 Inches, Length: 6.12 Inches, Weight: 1.26 Pounds, Width: 1.05 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.12}, 'width': {'unit': 'inches', 'value': 1.05}, 'weight': {'unit': 'pounds', 'value': 1.26}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 320, 'date_published': '2004-11-30', 'subjects': ['Christian Books & Bibles', 'Literature & Fiction', 'Mystery & Suspense', 'Genre Fiction', 'Family Life', 'Friendship', 'Short Stories & Anthologies', 'Short Stories', "Women's Fiction", 'Domestic Life', 'Mothers & Children'], 'authors': ['Roisin McAuley'], 'title': 'Singing Bird: A Novel', 'isbn13': '9780060737887', 'msrp': 1.99, 'binding': 'Hardcover', 'isbn': '0060737883', 'isbn10': '0060737883'}}