{'book': {'publisher': 'William Morrow', 'synopsis': "At a time when America debates its values and the world braces for religious war, Bruce Feiler, author of the New York Times bestsellers Walking the Bible and Abraham, travels ten thousand miles through the heart of the Middle East—Israel, Iraq, and Iran—and examines the question: Is religion tearing us apart . . . or can it bring us together? Where God Was Born combines the adventure of a wartime chronicle, the excitement of an archaeological detective story, and the insight of personal spiritual exploration. Taking readers to biblical sites not seen by Westerners for decades, Feiler's journey uncovers little-known details about the common roots of Judaism, Christianity, and Islam, and affirms the importance of the Bible in today's world. In his intimate, accessible style, Feiler invites readers on a never-in-a-lifetime experience: Israel Feiler takes a perilous helicopter dive over Jerusalem, treks through secret underground tunnels, and locates the spot where David toppled Goliath.<br/>Iraq After being airlifted into Baghdad, Feiler visits the Garden of Eden and the birthplace of Abraham, and makes a life-threatening trip to the rivers of Babylon.<br/>Iran Feiler explores the home of the Bible's first messiah and uncovers the secret burial place of Queen Esther. In Where God Was Born, Feiler discovers that at the birth of Western religion, all faiths drew from one another and were open to coexistence. Feiler's bold realization is that the Bible argues for interfaith harmony. It cannot be ceded to one side in the debate over values. Feiler urges moderates to take back the Bible and use its powerful voice as a beacon of shared ideals. In his most ambitious work to date, Bruce Feiler has written a brave, uplifting story that stirs the deepest chords of our time. Where God Was Born offers a rare, universal vision of God that", 'language': 'en', 'image': 'https://images.isbndb.com/covers/00/25/9780060890025.jpg', 'title_long': 'Where God Was Born Intl', 'edition': '2nd Printing', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.22 Pounds, Width: 1.29 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.29}, 'weight': {'unit': 'pounds', 'value': 1.22}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 416, 'date_published': '2005', 'subjects': ['Christian Books & Bibles', 'History', 'Middle East', 'Iran', 'Iraq', 'Israel & Palestine'], 'authors': ['Bruce Feiler'], 'title': 'Where God Was Born Intl', 'isbn13': '9780060890025', 'msrp': 18, 'binding': 'Hardcover', 'isbn': '0060890029', 'isbn10': '0060890029'}}