{'book': {'publisher': 'Harper Perennial', 'synopsis': '"To appreciate Shy Boy," writes horse gentler Monty Roberts, "you must see him or his kind running free and easy, in a wide open space." This compelling story, and the breathtaking photographs that accompany it, offer a chance to do just that. During a dramatic three-day ride across miles of high desert, Monty Roberts used all his skill to connect with the little mustang he finally befriended. In the year that followed, Shy Boy grew to love life on the farm, playfully demanding attention, and becoming fascinated by children. After a year of challenges and one frightening illness, the wild horse\'s exceptional spirit earned the respect and admiration of his trainers. And, as a result of a PBS-aired program based on his initial encounter with Roberts, Shy Boy gained international fame.<br/>Yet throughout this extraordinary year, Monty Roberts struggled with the question, "Would Shy Boy rather be free?" With trepidation, he took Shy Boy back to the wild to let him choose. The event, and its stunning conclusion, are memorably captured in these magnificent photographs and in a story that is both unforgettable and inspiring.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/28/93/9780060932893.jpg', 'title_long': 'Shy Boy: The Horse That Came in from the Wild', 'edition': 'Reprint', 'dimensions': 'Height: 9 Inches, Length: 7 Inches, Weight: 1.48 Pounds, Width: 0.64 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 0.64}, 'weight': {'unit': 'pounds', 'value': 1.48}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 256, 'date_published': '2000-10-24', 'subjects': ['Biographies & Memoirs', 'Professionals & Academics', 'Environmentalists & Naturalists', 'Regional U.S.', 'West', 'Crafts, Hobbies & Home', 'Pets & Animal Care', 'Horses', 'Reference', 'Encyclopedias & Subject Guides', 'Medical', 'Sports', 'Science & Math', 'Biological Sciences', 'Animals', 'Sports & Outdoors'], 'authors': ['Monty Roberts'], 'title': 'Shy Boy: The Horse That Came in from the Wild', 'isbn13': '9780060932893', 'msrp': 19.99, 'binding': 'Paperback', 'isbn': '0060932899', 'isbn10': '0060932899'}}