{"book": {"publisher": "Harper Perennial", "synopsis": "<p><strong>"Enthralling...A life-affirming novel, a worthy successor to Dickens."  — Philadelphia Inquirer</strong></p><br/><p><strong>“Stunning....a triumph...with an honesty at its core that seems almost shocking in this day and age.”  — Boston Globe</strong></p><br/><p>A beautifully written, tender and passionate story of a man trying to put his life in perspective. In the expert hands of Oscar Hijuelos, Mr. Ives’ Christmas speaks eloquently to the most basic and fulfilling aspects of life for all of us.</p><br/><p>Mr. Ives has a successful career in advertising, a wife and two children, and believes he has achieved the typical American dream. But the dream is shattered when his son Robert, who is studying for the priesthood, is killed at Christmas. Overwhelmed by grief and threatened by a loss of faith in humankind, Mr. Ives begins to question the very foundations of his life. </p><br/><p>Part love story—of a man for his wife, for his children, for God—and part meditation on how a person can find spiritual peace in the midst of crisis, Mr. Ives’s Christmas "is a magnificently sad and enchanting novel, a celebration, ultimately, of giving and of grace.' (Booklist)</p>', 'language": "en", "image": "https: //images.isbndb.com/covers/75/47/9780060927547.jpg", "title_long": "Mr. Ives" Christmas", 'dimensions": "Height: 8 Inches, Length: 5.3125 Inches, Weight: 0.44 Pounds, Width: 0.576577 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.3125}, "width": {"unit": "inches", "value": 0.576577}, "weight": {"unit": "pounds", "value": 0.44}, "height": {"unit": "inches", "value": 8}}, "pages": 248, "date_published": "2003", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Holidays', 'Family Life', 'United States', 'Literary'], 'authors": ["Oscar Hijuelos'], 'title": "Mr. Ives" Christmas", 'isbn13": "9780060927547", "msrp": 13.99, 'binding": "Paperback", "isbn": "0060927542", "isbn10": "0060927542"}}