{'book': {'publisher': 'Balzer + Bray', 'synopsis': 'Emily Webb is a geek.And she’s happy that way. Content hidingunder hoodies and curling up to watch oldhorror flicks, she’s never been the kind of girlwho sneaks out for midnight parties. Andshe’s definitely not the kind of girl who startsfights or flirts with other girls’ boyfriends.Until one night Emily finds herself doingexactly that . . . the same night one of herclassmates—also named Emily—is foundmysteriously murdered.<br/>The thing is, Emily doesn’t know whyshe’s doing any of this. By day, she’s the sameold boring Emily, but by night, she turnsinto a thrill seeker. With every nightfall,Emily gets wilder until it’s no longer just herpersonality that changes. Her body can dothings it never could before: Emily is nowstrong, fast, and utterly fearless. And soonEmily realizes that she’s not just comingout of her shell . . . there’s something muchbigger going on. Is she bewitched by the soulof the other, murdered Emily? Or is EmilyWebb becoming something else entirely—something not human?<br/>As Emily hunts for answers, she finds outthat she’s not the only one this is happeningto—some of her classmates are changingas well. Who is turning these teens intomonsters—and how many people will theykill to get what they want?', 'language': 'en', 'image': 'https://images.isbndb.com/covers/27/66/9780061992766.jpg', 'title_long': 'Vesper (Deviants, 1)', 'edition': 'First Edition', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.86 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 0.86}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 304, 'date_published': '2011-01-25', 'subjects': ['Teen & Young Adult', 'Literature & Fiction', 'Action & Adventure', 'Social & Family Issues', 'Science Fiction & Fantasy', 'Horror', 'Fantasy', 'Social Issues'], 'authors': ['Jeff Sampson'], 'title': 'Vesper (Deviants, 1)', 'isbn13': '9780061992766', 'msrp': 5.99, 'binding': 'Hardcover', 'isbn': '0061992763', 'isbn10': '0061992763'}}