{'book': {'publisher': 'Avon', 'synopsis': "New York Times bestselling author Stephanie Laurens knows the world of Regency London . . . especially the exclusive enclave of luxury in which the aristocracy lived in wealth and comfort. But outside that glittering circle lay another world . . . and Laurens pulls back the curtain that has hidden it from us—until now.<br/>Penelope Ashford, Portia Cynster's younger sister, has grown up with every advantage—wealth, position, and beauty. Yet Penelope is anything but a pretty face in a satin gown—forceful, willful, and blunt to a fault, she has for years devoted her considerable energy and intelligence to caring for the forgotten orphans of London's sooty and seamier streets.<br/>But now her charges are mysteriously disappearing. Desperate, Penelope turns to the one man she knows who might help her—Barnaby Adair.<br/>Handsome scion of a noble house, Adair has made a name for himself in certain circles where his powers of observation and deduction have seen him solve several serious and unsavory crimes within the ton. His pedigree, relentless intelligence, and discretion make him a deadly avenger in an elegant guise. Despite his skills—or perhaps because of them—he makes Penelope distinctly uncomfortable, but the stakes are too grave. Throwing caution to the wind, defying every rule for unmarried ladies, she appears on his doorstep late one night determined to recruit his talents.<br/>Barnaby is intrigued—both by her problem and her. Her bold beauty and undeniable brains make a striking contrast to the usual insipid ton misses. And as he's in dire need of an excuse to avoid said insipid misses, he accepts her challenge, never dreaming she and it will consume his every waking hour.<br/>Enlisting the aid of Inspector Basil Stokes of the fledgling Scotland Yard, they infiltrate the streets of London's notorious East End. But as they unravel the mystery of the missing orphans, they uncover a trail leading to the upper echelons of society and a ruthless and clever criminal adept at pulling strings who, becoming aware of them and their efforts, is only too ready to destroy all they hold dear, including their newfound understanding of the intrigues of the human heart.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/33/94/9780061243394.jpg', 'title_long': 'Where the Heart Leads: From the Casebook of Barnaby Adair', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.5 Pounds, Width: 1.29 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.29}, 'weight': {'unit': 'pounds', 'value': 1.5}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 416, 'date_published': '2008-02-05', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'Mystery, Thriller & Suspense', 'Mystery', 'Romance', 'Regency'], 'authors': ['Stephanie Laurens'], 'title': 'Where the Heart Leads: From the Casebook of Barnaby Adair', 'isbn13': '9780061243394', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0061243396', 'isbn10': '0061243396'}}