{'book': {'publisher': 'Collins Reference', 'synopsis': "Alternative health practices have had a tradition of providing relief to people for hundreds—in some cases, thousands—of years, but doctors often suggest just one course of treatment, and you may not realize how many options are available. Here is the only all-in-one guide with professional medical advice from leading practitioners in five different fields—conventional medicine, homeopathy, traditional Chinese medicine, herbalism, and naturopathy—on everything from aches and pains, sexual dysfunction, and the common cold to mind and spirit, anxiety, and general first aid. Compare traditional medicine side by side with four alternative treatments to decide what type of therapy best suits you and your family. This essential home reference offers information in symptoms, diagnosis, and treatment goals for the two hundred most common conditions, then provides advice from the five experts in an easy-to-read comparative format, along with key tips for prevention.<br/>Whether you choose an alternative or conventional treatment for your ailment, the information here will let you take control of your health care and decide what path you want to take, so that you don't have to rely solely on the advice of your general physician or the misleading suggestions found on the Internet. This is the medical reference that no home should be without.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/02/99/9780061120299.jpg', 'title_long': '1000 Cures for 200 Ailments: Integrated Alternative and Conventional Treatments for the Most Common Illnesses', 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 7 Inches, Weight: 3.9 Pounds, Width: 2.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 2.25}, 'weight': {'unit': 'pounds', 'value': 3.9}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 1008, 'date_published': '2007-02-27', 'subjects': ['Health, Fitness & Dieting', 'Alternative Medicine', 'Safety & First Aid'], 'authors': ['Victor S. Sierpina'], 'title': '1000 Cures for 200 Ailments: Integrated Alternative and Conventional Treatments for the Most Common Illnesses', 'isbn13': '9780061120299', 'msrp': 34.95, 'binding': 'Hardcover', 'isbn': '0061120294', 'isbn10': '0061120294'}}