{'book': {'publisher': 'Avon', 'synopsis': "With the success of Kinley MacGregor's latest New York Times Expanded and USA Today bestseller A Dark Champion, we are in the perfect position to republish her backlist gem Master of Desire.<br/>A Dream of Desire Awakened . . .<br/>Beautiful Lady Emily dreams of the rapture of love and the joys of marriage. The youngest daughter of an English lord at war, she is shaken by the arrival of a mysterious stranger to her father's castle. Could this breathtaking man be Emily's yearned-for lover? Indeed, Draven de Montague, Earl of Ravenswood, has come for Emily . . . but romance has nothing to do with it.<br/>In the Tender Embrace of an Enemy . . .<br/>Draven would never have entered the home of his most hated adversary had not the King himself ordered him to take in his foe's daughter for a year to forge bonds of peace between their two feuding houses. Worse still, here is a lass whose exquisite loveliness could tempt Draven to betray his sworn vow never to let anther close to his heart. Emily knows the searing heat of her passion could burn down the defenses of this proud warrior. But will the surrender of the sweet nectar of his lips and his bold, sensuous caress ignite a blaze so hot it consumes them both?", 'language': 'en', 'image': 'https://images.isbndb.com/covers/71/34/9780061087134.jpg', 'title_long': 'Master of Desire (MacAllister Series, 1)', 'edition': 'Reissue', 'dimensions': 'Height: 1.02 Inches, Length: 6.86 Inches, Weight: 0.41 Pounds, Width: 4.3 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.86}, 'width': {'unit': 'inches', 'value': 4.3}, 'weight': {'unit': 'pounds', 'value': 0.41}, 'height': {'unit': 'inches', 'value': 1.02}}, 'pages': 384, 'date_published': '2005-07-26', 'subjects': ['Romance', 'Historical'], 'authors': ['Kinley MacGregor'], 'title': 'Master of Desire (MacAllister Series, 1)', 'isbn13': '9780061087134', 'msrp': 6.99, 'binding': 'Mass Market Paperback', 'related': {'ePub': '0061747394'}, 'isbn': '0061087130', 'isbn10': '0061087130', 'other_isbns': [{'isbn': '9780061747397', 'binding': 'print'}]}}