{'book': {'publisher': 'William Morrow', 'synopsis': 'On the day she died, Constance Young was the undisputed star of morning television. But her plans to move herself and her loyal audience to another network were cancelled when she ended up at the bottom of her swimming pool. And the fabled unicorn amulet that Constance had been wearing during her final hours—a gift from King Arthur to his beloved Guinevere and the centerpiece of the upcoming Camelot exhibit at New York\'s Cloisters museum—is missing.<br/>A morning show veteran and now anchor of the KEY Evening Headlines, Eliza Blake is shocked by the death of her former colleague, and is determined to discover who wanted Constance out of the way . . . and why. To do so, she enlists the aid of three KEY News coworkers: "Jane-of-all-trades" Annabelle Murphy, who can switch from producing to sleuthing at a moment\'s notice; charming and fearless cameraman extraordinaire B.J. D\'Elia to add brains, brawn, and a much-needed male perspective to the team; and Dr. Margo Gonzalez, on-air psychiatrist, who understands the complex puzzles of the human mind. Calling themselves "The Sunrise Suspense Society," they set out to get to the bottom of the heinous murder, in a case that will test their ingenuity and their courage to the very limits.<br/>The deeper they dig, the more twisted the trail to Constance\'s killer becomes—as the list of suspects grows longer by the minute. Was it her spurned and enraged medievalist lover, or a muckraking author who blamed her for ruining her life? Perhaps money was the motive, and Constance\'s sister, jealous of her wealth and fame, was responsible. Or possibly someone at Key News was angry enough—or frightened enough—to commit cold-blooded murder. The one sure thing is that Constance Young made a lot of enemies—and now one of them is Eliza\'s enemy as well. And the closer she and the Society get to unmasking the murderer, the closer they each get to dying, suddenly . . . and brutally.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/60/70/9780061286070.jpg', 'title_long': 'When Day Breaks (Key News Thrillers, 10)', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.15 Pounds, Width: 1.09 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.09}, 'weight': {'unit': 'pounds', 'value': 1.15}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 498, 'date_published': '2007-06-05', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense', 'Crime', 'Romance', 'Romantic Suspense'], 'authors': ['Mary Jane Clark'], 'title': 'When Day Breaks (Key News Thrillers, 10)', 'isbn13': '9780061286070', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0061286079', 'isbn10': '0061286079'}}