{"book": {"publisher": "Eos", "synopsis": "From acclaimed New York Times bestselling fantasists Margaret Weis and Tracy Hickman comes the spellbinding conclusion to the epic adventure of wonder, courage, magic, and ambition that is the breathtaking world of the Sovereign Stone.<br/>Over two hundred years have passed since the mystical Sovereign Stone was shattered and the world of Loerem faced its most dangerous test ever—the rise of the dark lord Dagnarus. But now Dagnarus has stirred from the Void and seeks the utter conquest of all Loerem. Leading a seemingly unstoppable horde of bestial, powerful minions and a host of insidious undead, Dagnarus captures mortal kingdom after mortal kingdom, until he stands before the very gates of New Vinnengael, as traitors within the city plot to yield the crown to the undead lord.<br/>In the darkness and turmoil that follows, all heroes must first master their own fears and weaknesses before they can take up the fight to stop Dagnarus, and the company spreads across many lands to face many perils. Mortally wounded by a Blood-knife wielded by an undead Vrykyl knight, the Baron Shadamehr lies dying, and even the many skills of his beautiful, beloved Alise may not be able to save him. Others face desperate journeys through hostile lands and difficult tests of character. And, unsuspected, a deadly Vrykyl stalks the pecwae Bashae—and his precious burden, the human portion of the Sovereign Stone—through the streets of New Vinnengael.<br/>Yet the gods have their own plans for this imperiled land, and drawn by an unknown call, the Dominion Lords head for the Portal of the Gods, the mystical, haunted site of Dagnarus’s terrible treachery two hundred years beforehand. For if all the parts of the sundered Sovereign Stone can be reunited, the Dominion Lords can stop Dagnarus’s unholy plans for domination. But one piece is still missing. . . .<br/>As the past and present converge in a desperate race to determine the future, an unlikely hero will arise. A man who will become far more than he ever dreamed possible and who holds the fate of all Loerem in his hands. And to save Loerem he must venture into a realm of utter terror and darkness . . . into the very blackness of the Void itself.", "language": "en", "image": "https: //images.isbndb.com/covers/05/99/9780061020599.jpg", "title_long": "Journey Into the Void (Sovereign Stone Series, 3)", "edition": "1st", "dimensions": "Height: 6.75 Inches, Length: 1.18 Inches, Weight: 0.63 Pounds, Width: 4.18 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 1.18}, "width": {"unit": "inches", "value": 4.18}, "weight": {"unit": "pounds", "value": 0.63}, "height": {"unit": "inches", "value": 6.75}}, "pages": 592, "date_published": "2004-07-27", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Action & Adventure', 'Fantasy', 'Science Fiction & Fantasy', 'Epic', 'Science Fiction'], 'authors": ["Margaret Weis', 'Tracy Hickman'], 'title": "Journey Into the Void (Sovereign Stone Series, 3)", "isbn13": "9780061020599", "msrp": 1.99, "binding": "Mass Market Paperback", "related": {"ePub": "0061745979"}, "isbn": "0061020591", "isbn10": "0061020591", "other_isbns": [{'isbn": "9780061745973", "binding": "print"}]}}