{'book': {'publisher': 'Rayo', 'synopsis': 'Oscar De La Hoya, uno de los luchadores más celebrados en la historia del boxeo, nos brinda su historia franca y conmovedora sobre cómo logró el Sueño Americano: su ascenso al éxito, el poder de una ética de trabajo sólida, la dolorosa pérdida de su madre al cáncer, las trampas del estrellato, así como una perspectiva muy personal de lo que significa ser americano<br/>Hijo de padres mexicanos, De La Hoya "El Chico de Oro" ha tenido una carrera impresionante. Del boxeo a los negocios, de la industria discográfica a los logros caritativos de su fundación, su éxito es testamento de lo que uno puede lograr en los Estados Unidos. Pero, ¿quién es este hombre que ha cambiado tantas vidas; que ha impreso una huella positiva en el boxeo, deporte ante el cual muchos habían perdido toda esperanza; y que se ha convertido en un símbolo de lo que es posible para una comunidad hispana sin demasiados héroes?<br/>Un Sueño Americano responde estas preguntas.<br/>Proveniente de una familia de boxeadores, De La Hoya ha vencido a más de una docena de campeones mundiales y ha ganado seis títulos mundiales y una medalla de oro Olímpica—un momento marcado para siempre en la memoria de cualquiera que ha seguido su larga carrera. Sin embargo, en medio de la vorágine de este éxito, existía un hombre que se desviaba del camino proyectado dada su profunda confianza en la bondad de aquellos a su alrededor. Este libro es el Chico de Oro y expone sus errores más desgarradores así como sus triunfos más sensacionales.<br/>En su emocionante historia como hijo de inmigrantes—una historia americana por excelencia—hay una crónica de una vida increíble que abre una puerta a la vida privada de una figura que, para muchos, ha alcanzado el estatus de un ícono.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/51/36/9780061645136.jpg', 'title_long': 'Un sueno americano: Mi historia (Spanish Edition)', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.15 Pounds, Width: 0.97 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.97}, 'weight': {'unit': 'pounds', 'value': 1.15}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 288, 'date_published': '2008-06-10', 'subjects': ['Biographies & Memoirs', 'Community & Culture', 'Sports & Outdoors', 'Biographies', 'Boxing, Wrestling & MMA'], 'authors': ['Oscar De La Hoya', 'Steve Springer'], 'title': 'Un sueno americano: Mi historia (Spanish Edition)', 'isbn13': '9780061645136', 'msrp': 19.95, 'binding': 'Hardcover', 'isbn': '0061645133', 'isbn10': '0061645133'}}