{'book': {'publisher': 'HarperEntertainment', 'synopsis': 'The loving yet brutally honest memoir of the daughter of comedy legend Richard Pryor<br/>Rain Pryor was born in the idealistic, free-love 1960s. Her mother was a Jewish go-go dancer who wanted a tribe of rainbow children, and her father was Richard Pryor, perhaps the most compelling and brilliant comedian of his era.<br/>In this intimate, harrowing, and often hilarious memoir, Rain talks about her divided heritage, and about the forces that shaped her wildly schizophrenic childhood. In her father\'s house, she bonded with Richard\'s grandmother, Mamma, a one-time whorehouse madam who never tired of reminding Rain that she was black. In her mother\'s house, and in the home of her Jewish grandparents, Rain was a "mocha-colored Jewish princess," learning how to cook everything from kugel to beef brisket.<br/>It seemed as if Rain was blessed with the best of both worlds, but it didn\'t quite work out that way. Life at Mom\'s was unstable in the extreme, while at Richard\'s place Rain was exposed to sex and drugs before she had even learned to read. "Daddy," she told her father one day, sitting down to Thanksgiving dinner at the advanced age of eight, "the whores need to be paid."<br/>Jokes My Father Never Taught Me is both lovingly told and painfully frank: the story of a girl who grew up adoring her father even as she feared him—and feared for him—as his drug problems grew worse. In 1980 Pryor tried to kill himself by setting himself on fire, then joked that it had been an accident: "No one ever told me you couldn\'t mix cookies with two types of milk!" In his later years, Pryor succumbed to multiple sclerosis, and Rain watched in tears as her father became a shell of his former self. Once, in an unusually introspective mood, Pryor asked his daughter, "Why do you love me, Rainy, when I can be so mean?"<br/>Jokes My Father Never Taught Me answers that poignant question and many more. It is an unprecedented look at the life of a legend of comedy, told by a daughter who both understood the genius and knew the tortured man within.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/54/26/9780061195426.jpg', 'title_long': 'Jokes My Father Never Taught Me: Life, Love, and Loss with Richard Pryor', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.75 Pounds, Width: 0.81 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.81}, 'weight': {'unit': 'pounds', 'value': 0.75}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 224, 'date_published': '2006-10-31', 'subjects': ['Arts & Photography', 'Performing Arts', 'Biographies & Memoirs', 'Arts & Literature', 'Actors & Entertainers', 'Memoirs', 'Humor & Entertainment', 'Humor', 'Comedy'], 'authors': ['Rain Pryor'], 'title': 'Jokes My Father Never Taught Me: Life, Love, and Loss with Richard Pryor', 'isbn13': '9780061195426', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0061195421', 'isbn10': '0061195421'}}