{'book': {'publisher': 'Ecco', 'synopsis': 'Richard Clarke\'s dramatic statement to the grieving families during the 9/11 Commission hearings touched a raw nerve across America. Not only had our government failed to prevent the 2001 terrorist attacks, but it has proven itself, time and again, incapable of handling the majority of our most crucial national security issues, from Iraq to Katrina and beyond. This is not just a temporary failure of our current leadership—it is a systemic problem, the result of a pattern of incompetence that must be understood, confronted, and prevented.<br/>Clarke\'s first book, the number one bestseller Against All Enemies: Inside America\'s War on Terror, explained how the United States had stumbled into a struggle with violent Islamist extremists. Now, in Your Government Failed You, Clarke looks at why these unconscionable failures have continued and how America and the world can succeed against the terrorists. Yet Clarke also goes far beyond terrorism, to examine the inexcusable chain of recurring U.S. government disasters. Despite the lessons of Vietnam, there is Iraq. A trail of intelligence failures litters the Washington landscape. From Katrina to color codes and duct tape, "homeland security" has been an oxymoron. Why does the superpower continue to bobble national security?<br/>Clarke minces no words in his examination of the breadth and depth of the mediocrity, entropy, and collapse endemic in America\'s national security programs. In order for the United States to stop its string of strategic mistakes, we first need to understand why they happen. Drawing on his thirty years in the White House, Pentagon, State Department, and intelligence community, Clarke gives us a privileged, if horrifying, look into the debacle of government policies, discovering patterns in the failures and offering ways to stop the cycle once and for all.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/46/20/9780061474620.jpg', 'title_long': 'Your Government Failed You: Breaking the Cycle of National Security Disasters', 'edition': '1', 'dimensions': 'Height: 9.5 Inches, Length: 6.5 Inches, Weight: 1.55 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 1.55}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 416, 'date_published': '2008-05-27', 'subjects': ['Politics & Social Sciences', 'Politics & Government', 'United States', 'Specific Topics', 'Public Affairs & Policy'], 'authors': ['Richard A. Clarke'], 'title': 'Your Government Failed You: Breaking the Cycle of National Security Disasters', 'isbn13': '9780061474620', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0061474622', 'isbn10': '0061474622'}}