{'book': {'publisher': 'Smithsonian', 'synopsis': "Einstein's gravity theory—his general theory of relativity—has served as the basis for a series of astonishing cosmological discoveries. But what if, nonetheless, Einstein got it wrong?<br/>Since the 1930s, physicists have noticed an alarming discrepancy between the universe as we see it and the universe that Einstein's theory of relativity predicts. There just doesn't seem to be enough stuff out there for everything to hang together. Galaxies spin so fast that, based on the amount of visible matter in them, they ought to be flung to pieces, the same way a spinning yo-yo can break its string. Cosmologists tried to solve the problem by positing dark matter—a mysterious, invisible substance that surrounds galaxies, holding the visible matter in place—and particle physicists, attempting to identify the nature of the stuff, have undertaken a slew of experiments to detect it. So far, none have.<br/>Now, John W. Moffat, a physicist at the Perimeter Institute for Theoretical Physics in Waterloo, Canada, offers a different solution to the problem. The capstone to a storybook career—one that began with a correspondence with Einstein and a conversation with Niels Bohr—Moffat's modified gravity theory, or MOG, can model the movements of the universe without recourse to dark matter, and his work challenging the constancy of the speed of light raises a stark challenge to the usual models of the first half-million years of the universe's existence.<br/>This bold new work, presenting the entirety of Moffat's hypothesis to a general readership for the first time, promises to overturn everything we thought we knew about the origins and evolution of the universe.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/08/81/9780061170881.jpg', 'title_long': 'Reinventing Gravity: A Physicist Goes Beyond Einstein', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.10010668738 Pounds, Width: 0.97 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.97}, 'weight': {'unit': 'pounds', 'value': 1.10010668738}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 288, 'date_published': '2008-09-30', 'subjects': ['Science & Math', 'Astronomy & Space Science', 'Astrophysics & Space Science', 'Physics', 'Gravity', 'Relativity'], 'authors': ['John W. Moffat'], 'title': 'Reinventing Gravity: A Physicist Goes Beyond Einstein', 'isbn13': '9780061170881', 'msrp': 27.95, 'binding': 'Hardcover', 'related': {'eBook': '0061982180'}, 'isbn': '0061170887', 'isbn10': '0061170887', 'other_isbns': [{'isbn': '9780061982187', 'binding': 'ebook'}]}}