{'book': {'publisher': 'Harpers, Paperback(2008)', 'synopsis': "The world's most widely used and seminal introduction to public relations—now fully revised and updated for the 21st century with online strategies that work<br/>Every Fortune 500 corporation, movie star, and scandal queen knows that a good publicist is essential to building success and maintaining public support. But if you're a small business owner, an entrepreneur, or an undercapitalized beginner seeking an edge in a highly competitive arena, it's unlikely that you have your own high-powered publicist.<br/>Guerrilla P.R. 2.0 offers all the resources necessary to mount your own campaign and get the media exposure you need. In clear and concise language, Michael Levine, one of the top public relations counselors in the country, reveals the same procedures he uses every day to get press on major stars—and how those strategies can be utilized on little or no budget. You'll learn how to think like a publicist and map out the perfect strategy for success.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/85/23/9780061438523.jpg', 'title_long': 'Guerrilla PR 20 - Wage an Effective Publicity Campaign Without Going Broke (08) by Levine, Michael [Paperback (2008)]', 'edition': 'Updated', 'dimensions': 'Height: 8 Inches, Length: 5.3125 Inches, Weight: 0.7 Pounds, Width: 0.828829 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.3125}, 'width': {'unit': 'inches', 'value': 0.828829}, 'weight': {'unit': 'pounds', 'value': 0.7}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 368, 'date_published': '2008', 'subjects': ['Business & Money', 'Marketing & Sales', 'Public Relations'], 'authors': ['michael-levine'], 'title': 'Guerrilla PR 20 - Wage an Effective Publicity Campaign Without Going Broke (08) by Levine, Michael [Paperback (2008)]', 'isbn13': '9780061438523', 'msrp': 14.99, 'binding': 'Paperback', 'related': {'Kindle Edition': '0061982865', 'eBook': '0061982865', 'ePub': '0061982865'}, 'isbn': '0061438529', 'isbn10': '0061438529', 'other_isbns': [{'isbn': '9780061982866', 'binding': 'print'}]}}