{'book': {'publisher': 'Balzer + Bray', 'synopsis': "For eleven-year-old Gopal and his family, life in their rural Indian village is over: We stay, we starve, his baba has warned. With the darkness of night as cover, they flee to the big city of Mumbai in hopes of finding work and a brighter future. Gopal is eager to help support his struggling family until school starts, so when a stranger approaches him with the promise of a factory job, he jumps at the offer.<br/>But Gopal has been deceived. There is no factory, just a small, stuffy sweatshop where he and five other boys are forced to make beaded frames for no money and little food. The boys are forbidden to talk or even to call one another by their real names. In this atmosphere of distrust and isolation, locked in a rundown building in an unknown part of the city, Gopal despairs of ever seeing his family again.<br/>But late one night, when Gopal decides to share kahanis, or stories, he realizes that storytelling might be the boys' key to holding on to their sense of self and their hope for any kind of future. If he can make them feel more like brothers than enemies, their lives will be more bearable in the shop—and they might even find a way to escape.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/76/07/9780061857607.jpg', 'title_long': 'Boys without Names', 'edition': '1', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.89 Pounds, Width: 1.05 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.05}, 'weight': {'unit': 'pounds', 'value': 0.89}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 320, 'date_published': '2010-01-19', 'subjects': ["Children's Books", 'Growing Up & Facts of Life', 'Difficult Discussions', 'Friendship, Social Skills & School Life', 'Geography & Cultures', 'Explore the World', 'Self Service', 'Custom Stores'], 'authors': ['Kashmira Sheth'], 'title': 'Boys without Names', 'isbn13': '9780061857607', 'msrp': 16.99, 'binding': 'Hardcover', 'isbn': '0061857602', 'isbn10': '0061857602'}}