{'book': {'publisher': 'William Morrow', 'synopsis': '"I am not my breast, and I am not cancer; they are only pieces of who I am. What is my heart like, am I kind, strong, loving, compassionate. . . . Those are the things that count."<br/>I Am Not My Breast Cancer gathers the warm, loving, frank, and informed voices of more than 800 women—from every state in the nation and from continents as far away as Australia and Africa—who reveal their fears, trade advice, share experiences, and express their deepest, most intimate concerns. Nothing before this groundbreaking book has captured the real experience of breast cancer. It is essential reading for any woman with this diagnosis.<br/>I Am Not My Breast Cancer offers women the companionship of other women dealing with this disease. Ruth Peltason, who has twice undergone treatment for breast cancer, has woven their stories together while maintaining the authenticity of their voices. These are ordinary women dealing with this cancer and its many ramifications. They range in age from their early twenties to their late seventies. They are the collective face of breast cancer today. Their comments are moving, sometimes funny, always honest. They speak out on every topic, from lovemaking and intimacy to losing their hair, from juggling the day-to-day realities of being a patient, mother, wife, and coworker to the overwhelming worries about their own mortality. Remarkably, they emerge with grace and optimism and a determination not to be defined by disease.<br/>Taking the reader chronologically through the stages of diagnosis, treatment, recovery, and self-discovery, I Am Not My Breast Cancer offers women a deeper understanding of themselves and living with cancer. As Peltason writes in her introduction, "My greatest wish for this book is that it offer comfort to any woman living with breast cancer and to those who care about her. If this book is kept on the bedside table, then I hope its need is brief and its impact lasting. I Am Not My Breast Cancer speaks of courage, heroism in deeds small and large, and incredible faith and fortitude."<br/>"You can live without a breast. You cannot say the same for the human heart."', 'language': 'en', 'image': 'https://images.isbndb.com/covers/41/00/9780061174100.jpg', 'title_long': 'I Am Not My Breast Cancer: Women Talk Openly About Love and Sex, Hair Loss and Weight Gain, Mothers and Daughters, and Being a Woman with Breast Cancer', 'edition': '1', 'dimensions': 'Height: 1.26 Inches, Length: 9.26 Inches, Weight: 1.36 Pounds, Width: 6.39 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 9.26}, 'width': {'unit': 'inches', 'value': 6.39}, 'weight': {'unit': 'pounds', 'value': 1.36}, 'height': {'unit': 'inches', 'value': 1.26}}, 'pages': 379, 'date_published': '2008-01-29', 'subjects': ['Self-Help', 'Happiness', 'Personal Transformation', 'Cookbooks, Food & Wine', 'Special Diet', 'Cancer', 'Health, Fitness & Dieting', 'Diseases & Physical Ailments', "Women's Health", 'General', 'Sexual Health'], 'authors': ['Ruth Peltason'], 'title': 'I Am Not My Breast Cancer: Women Talk Openly About Love and Sex, Hair Loss and Weight Gain, Mothers and Daughters, and Being a Woman with Breast Cancer', 'isbn13': '9780061174100', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0061174106', 'isbn10': '0061174106'}}