{'book': {'publisher': 'William Morrow', 'synopsis': "Jeff Henderson was just another inner-city black kid born into a world of poverty and limited options, where crime seemed to provide the only way to get out. Raised mostly by his single mother, who struggled just to keep food on the table, Jeff dreamed big. He had to get out and he soon did by turning to what so many in his community did: dealing drugs. But Jeff was no ordinary drug dealer; by twenty-one, he was one of the top cocaine dealers in San Diego, making up to $35,000 a week. Two years later he was indicted on federal drug trafficking charges and sentenced to almost twenty years in prison. Before he knew what had hit him, he was looking at spending most of his life behind bars. The street life had been the only one he'd ever known and even incarcerated he was too hardheaded to realize that no good would come of it.<br/>That is, until he was assigned to one of the least desirable prison jobs: washing dishes. That job helped turn his whole life around. It gave him access to the prison kitchen and he became fascinated watching his fellow prisoners cook for the thousands of other inmates and prison officials. Henderson learned to cook in prison. Not cocaine, but food. And his dream was born: Once outside, he would become a chef.<br/>It was a tough, seemingly impossible journey for an ex-con. Few chefs would give him the opportunity to cook in their restaurants. And once hired, he endured racism and sabotage in the kitchen. But Henderson refused to accept rejection. Driven by a dream and an unshakable will to succeed, Chef Jeff worked hard to overcome unimaginable adversity and eventually reached the top of his profession, becoming executive chef at Café Bellagio in Las Vegas.<br/>Alive with the energy of the streets, the sober reality of prison, and the visceral thrill of being inside the fast-paced kitchens of great restaurants, Cooked is an intense, intimate tale of crime, punishment, and redemption—a deeply poignant story of how the worst wrong can lead to the most extraordinary right.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/39/07/9780061153907.jpg', 'title_long': 'Cooked: From the Streets to the Stove, from Cocaine to Foie Gras', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.75 Inches, Weight: 1.2 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.75}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.2}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 288, 'date_published': '2007-03-01', 'subjects': ['Biographies & Memoirs', 'Community & Culture', 'Black & African American', 'Professionals & Academics', 'Culinary', 'Cookbooks, Food & Wine', 'Self Service', 'Custom Stores'], 'authors': ['Jeff Henderson'], 'title': 'Cooked: From the Streets to the Stove, from Cocaine to Foie Gras', 'isbn13': '9780061153907', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0061153907', 'isbn10': '0061153907'}}