{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': "The old rules don't always apply to adopted dogs, whose training, past behaviors, and health histories may be a mystery. At last, here's the one-stop bible that acknowledges their special needs and covers every detail of daily life. In chapters reviewed by experts in veterinary medicine, nutrition, and training, pet parents will learn: Where to find your perfect canine companion All about breeds and mixed breeds and how you can adopt any type of dog Smart guidelines for adoption success Realistic expenses of dog care What to expect when you bring your new pup home (and long after) How to prevent runaways and protect your dog from all types of harm Clicker, target stick, and other re-training methods Humane ways to modify undesirable behaviors How to introduce new diets and take the guesswork out of feeding Holistic and conventional medical treatments Daily hygiene and caring for your sick pup inside and out The impact of travel and changes at home What to do when it's time to say good-bye<br/>Plus recipes, doggy workouts, heartwarming true stories of adopted dogs and their happy parents, information on saving dogs on a larger scale, and much, much more!", 'language': 'en', 'image': 'https://images.isbndb.com/covers/55/91/9780061435591.jpg', 'title_long': 'Petfinder.com The Adopted Dog Bible: Your One-Stop Resource for Choosing, Training, and Caring for Your Sheltered or Rescued Dog', 'dimensions': 'Height: 9.12 Inches, Length: 7.38 Inches, Weight: 1.8 Pounds, Width: 0.85 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.38}, 'width': {'unit': 'inches', 'value': 0.85}, 'weight': {'unit': 'pounds', 'value': 1.8}, 'height': {'unit': 'inches', 'value': 9.12}}, 'pages': 512, 'date_published': '2009-01-20', 'subjects': ['Crafts, Hobbies & Home', 'Pets & Animal Care', 'Dogs', 'Reference', 'Science & Math', 'Nature & Ecology', 'Animal Rights'], 'authors': ['Petfinder.com'], 'title': 'Petfinder.com The Adopted Dog Bible: Your One-Stop Resource for Choosing, Training, and Caring for Your Sheltered or Rescued Dog', 'isbn13': '9780061435591', 'msrp': 22.99, 'binding': 'Paperback', 'related': {'ePub': '006198471X'}, 'isbn': '0061435597', 'isbn10': '0061435597', 'other_isbns': [{'isbn': '9780061984716', 'binding': 'print'}]}}