{'book': {'publisher': 'Greenwillow Books', 'synopsis': 'The Gods have abandoned Ai Ling.<br/>Her mysterious power haunts her day and night, and she leaves home—with just the moon as her guide—overwhelmed by her memories and visions and an unbearable sense of dread. For Ai Ling knows that Chen Yong is vulnerable to corrupt enchantments from the under-world. How can she do nothing when she has the skill and power to fight at his side? A dream has told her where he is, the name of the ship he is traveling on, his destination. So she steals off and stows away on board.<br/>The ocean voyage brings with it brutal danger, haunting revelations, and new friendships, but also the premonition of a very real and terrifying threat. Zhong Ye—the powerful sorcerer whom Ai Ling believed she had vanquished in the Palace of Fragrant Dreams—is trapped in Hell, neither alive nor dead. Can he reach from beyond the grave to reunite with Silver Phoenix and destroy Chen Yong? And destroy whatever chance Ai Ling has at happiness, at love?<br/>In this sequel to the acclaimed novel Silver Phoenix, four lives are woven together and four destinies become one, now and forever.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/02/52/9780061730252.jpg', 'title_long': 'Fury of the Phoenix (Kingdom of Xia, Book 2) (Silver Phoenix, 2)', 'edition': '1', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 1 Pounds, Width: 1.17 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.17}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 368, 'date_published': '2011-03-29', 'subjects': ['Teen & Young Adult', 'Literature & Fiction', 'Girls & Women', 'Science Fiction & Fantasy', 'Fantasy'], 'authors': ['Cindy Pon'], 'title': 'Fury of the Phoenix (Kingdom of Xia, Book 2) (Silver Phoenix, 2)', 'isbn13': '9780061730252', 'msrp': 9.99, 'binding': 'Hardcover', 'related': {'ePub': '0062077066'}, 'isbn': '0061730254', 'isbn10': '0061730254', 'other_isbns': [{'isbn': '9780062077066', 'binding': 'print'}]}}