{'book': {'publisher': 'William Morrow', 'synopsis': "As companies expand their international operations, smart women who are prepared to pursue opportunities overseas can dramatically accelerate their careers, enjoying high-profile projects, bigger promotions, and impressive financial rewards.<br/>Get Ahead by Going Abroad is the go-to resource that reveals how women, single or married, can leverage this trend to showcase their skills and move up quickly on their own terms. Written by two women who did so with huge success, the book is packed with candid, instructive anecdotes and examples from their own and others' experiences, and step-by-step guidance for securing and succeeding in an international position. Yeatman and Berdan show how women at every level can benefit from an overseas posting: young professionals seeking to break out from the pack, mid-career women interested in new challenges with increased responsibility, or senior executives in pursuit of positions in executive management. Get Ahead by Going Abroad helps you get further, faster—and have fun along the way. It gives you the strategies to land the assignment, thrive in the job, and enjoy the lifestyle abroad.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/05/36/9780061340536.jpg', 'title_long': "Get Ahead by Going Abroad: A Woman's Guide to Fast-track Career Success", 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1 Pounds, Width: 0.89 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.89}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 256, 'date_published': '2007-09-04', 'subjects': ['Self-Help', 'Success', 'Business & Money', 'Job Hunting & Careers', 'Guides', 'International'], 'authors': ['C. Perry Yeatman', 'Stacie Nevadomski Berdan'], 'title': "Get Ahead by Going Abroad: A Woman's Guide to Fast-track Career Success", 'isbn13': '9780061340536', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0061340537', 'isbn10': '0061340537'}}