{"book": {"publisher": "Harper", "synopsis": "From a beloved and bestselling master of speculative fiction comes this chilling tale of a soulful loner who must overcome demons from his past -- and the demons he unwittingly unleashes -- when he starts renovating a faded Southern mansion. As Homebody eloquently proves, no contemporary writer outshines Orson Scott Card in crafting unlikely heroes or in suffusing the everyday world with an otherworldly glow.<br/>Don Lark"s cheery name belies his tragic past. When his alcoholic ex-wife killed their daughter in a car wreck, he retreated from the sort of settled, sociable lifestyle one takes for granted. Only the prospect of putting a roof over other people"s heads seems to comfort Lark, and he goes from town to town, looking for dilapidated houses he can buy, restore and resell at a profit. In Greensboro, North Carolina, Lark finds his biggest challenge yet -- a huge, sturdy, gorgeous shell that"s suffered almost a century of abuse at the hands of greedy landlords and transient tenants. As he sinks his teeth into this new project, Lark's new neighborhood starts to work its charms on him. He strikes up a romance with the wry real estate agent who sold him the house. His neighbors, two charming, chatty old ladies, ply him endlessly with delicious Southern cooking. Even Sylvie, the squatter Lark was once desperate to evict from the old house, is now growing on him.<br/>But when Lark unearths an old tunnel in the cellar, the house's enchantments start to turn ominous. Sylvie turns cantankerous, even dangerous. There's still a steady supply of food from next door, but it now comes laced with increasingly passionate pleas for Lark to vacate the house at once. In short, everybody seems to want to get rid of him. Whether this is for his own good or theirs, Lark digs in his heels for reasons even he's not sure of. He embarks on a struggle for his life -- and his friends'-- against a house with a past even more tragic than his own. If Lark wins, he gets the kind of home and community he's always dreamed of. If he loses, all is lost....', 'language": "en", "image": "https: //images.isbndb.com/covers/39/99/9780061093999.jpg", "title_long": "Homebody", "edition": "Reprint", "dimensions": "Height: 1.24 Inches, Length: 7.02 Inches, Weight: 0.49 Pounds, Width: 4.36 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.02}, "width": {"unit": "inches", "value": 4.36}, "weight": {"unit": "pounds", "value": 0.49}, "height": {"unit": "inches", "value": 1.24}}, "pages": 448, "date_published": "1999-01-06", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Horror', 'United States'], 'authors": ["Orson Scott Card'], 'title": "Homebody", "isbn13": "9780061093999", "msrp": 6.99, "binding": "Mass Market Paperback", "related": {"ePub": "0062281429"}, "isbn": "0061093998", "isbn10": "0061093998", "other_isbns": [{'isbn": "9780062281425", "binding": "print"}]}}