{'book': {'publisher': 'Balzer + Bray', 'synopsis': 'Today has to be perfect.<br/>Magic.<br/>I look at the clock.<br/>10:14 AM.<br/>Ten fourteen. One plus one is two plus four is six plus ten is sixteen minus one is fifteen minus two is thirteen. OK.<br/>I turn from the clock and walk into the hallway. "Ready."<br/>Saturday will be the third state soccer championship in a row for Jake Martin. Three. A good number. Prime. With Jake on the field, Carson City High can\'t lose because Jake has the magic: a self-created protection generated by his obsession with prime numbers. It\'s the magic that has every top soccer university recruiting Jake, the magic that keeps his family safe, and the magic that suppresses his anxiety attacks. But the magic is Jake\'s prison, because sustaining it means his compulsions take over nearly every aspect of his life.<br/>Jake\'s convinced the magic will be permanent after Saturday, the perfect day, when every prime has converged. Once the game is over, he won\'t have to rely on his sister to concoct excuses for his odd rituals. His dad will stop treating him like he is some freak. Maybe he\'ll even make a friend other than Luc.<br/>But what if the magic doesn\'t stay?<br/>What if the numbers never leave?<br/>Acclaimed author Heidi Ayarbe has created an honest and riveting portrait of a teen struggling with obsessive compulsive disorder in this breathtaking and courageous novel.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/38/62/9780061993862.jpg', 'title_long': 'Compulsion', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.85 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 0.85}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 304, 'date_published': '2011-05-03', 'subjects': ['Teen & Young Adult', 'Literature & Fiction', 'Sports', 'Social & Family Issues', 'Social Issues'], 'authors': ['Heidi Ayarbe'], 'title': 'Compulsion', 'isbn13': '9780061993862', 'msrp': 13.81, 'binding': 'Hardcover', 'related': {'Kindle Edition': '006207699X', 'ePub': '006207699X'}, 'isbn': '0061993867', 'isbn10': '0061993867', 'other_isbns': [{'isbn': '9780062076991', 'binding': 'print'}]}}