{'book': {'publisher': 'William Morrow', 'synopsis': 'Grappling with her lifelong phobia of anything slick, cheesy, or remotely claiming to provide self-empowerment, Beth Lisick wakes up on New Year\'s Day 2006 with an unprecedented feeling. She is finally able to admit to herself that she\'s grown tired of embracing the same old set of nagging problems year after year. She has no savings account. Her house feels unorganized and chaotic. She and her husband never hang out together. The last time she exercised regularly was as a member of her high school track team almost twenty years ago.<br/>Instead of turning to advice from the abundant pool of local life coaches, therapists, and healers readily available on her home turf of northern California, Beth confronts her fears head-on. She consults the multimillion-dollar-earning pros and national experts, not only reading their bestselling books but also attending their seminars and classes. In Chicago, she gets proactive with The Seven Habits of Highly Effective People. In Atlanta, she tries to get a handle on exactly why "women are from Venus," and in a highly comedic bout on the high seas of the Caribbean, she gamely sweats to the oldies on a weeklong Cruise to Lose with Richard Simmons.<br/>Throughout this yearlong experiment, Beth tries extremely hard to maintain her wry sense of humor and easygoing nature, even as she starts to fall prey to some of the experts\' ideas, ideas she thought she\'d spent her whole life rejecting. Beth doesn\'t think of herself as the typical self-help victim. But is she?', 'language': 'en', 'image': 'https://images.isbndb.com/covers/39/60/9780061143960.jpg', 'title_long': 'Helping Me Help Myself: One Skeptic, Ten Self-Help Gurus, and a Year on the Brink of the Comfort Zone', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.09790206476 Pounds, Width: 0.97 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.97}, 'weight': {'unit': 'pounds', 'value': 1.09790206476}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 288, 'date_published': '2008-01-02', 'subjects': ['Self-Help', 'Happiness', 'Personal Transformation', 'Self-Esteem', 'Success', 'Biographies & Memoirs', 'Memoirs', 'Humor & Entertainment', 'Humor', 'Self-Help & Psychology', 'Health, Fitness & Dieting', 'Psychology & Counseling', 'Literature & Fiction', 'Humor & Satire', 'Satire'], 'authors': ['Beth Lisick'], 'title': 'Helping Me Help Myself: One Skeptic, Ten Self-Help Gurus, and a Year on the Brink of the Comfort Zone', 'isbn13': '9780061143960', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0061143960', 'isbn10': '0061143960'}}