{"book": {"publisher": "Harper", "synopsis": "Amelia Lockwood doesn"t mean to sound greedy. With a fabulous career in television, a posh apartment, and four fiercely loyal and wickedly funny friends, she knows she should be counting her lucky stars. But as her thirties tick by at an alarming pace, Amelia is getting anxious about the one thing missing in her otherwise successful life—a husband!<br/>If it"s not too much to ask the universe, Amelia wants a husband—not a boyfriend, not a lover, not even a mind-bending one-night fling—but a wedding band and the Vera Wang gown of her dreams. When she sees an ad for a night course entitled How to Find a Husband over the Age of Thirty-five, she finally makes up her mind to have it all—an old-fashioned ring on her finger by the end of the year. So after twenty years of going it on her own, Amelia swallows her pride, signs up for dating boot camp, and enlists the help of a professional.<br/>Enter Ira Vandergelder—a native New Yorker with a black belt in tongue-fu, a woman who"s snappier than a crocodile handbag and more acidic than a chili finger dipped in your eye—who trains the hopelessly romantic Amelia to apply business marketing principles to the world of dating, to become goal-driven and to pursue her dream husband in exactly the same way she'd pursue her dream job. Even if this involves tracking down all the men she's ever loved and lost before.<br/>With the constant support and biting commentary of her tight foursome of friends, Amelia revisits her bumpy romantic past—from the first love who dumped her during Live Aid to the most recent ex, officially dubbed he-who's-name-shall-forever-remain-unspoken. As Amelia recognizes that her future happiness can't wait for fate, she has to tackle lesson number one: If you can't learn from your past, how can you expect to move forward?<br/>Sharp, witty, and irresistibly funny, Remind Me Again Why I Need a Man cuts to the heart of every single man and woman out there. Claudia Carroll examines the rules of attraction in a sophisticated and refreshing way. This beautifully written novel will have your heart pounding until the final page.', 'language": "en", "image": "https: //images.isbndb.com/covers/05/32/9780061140532.jpg", "title_long": "Remind Me Again Why I Need A Man", "edition": "1", "dimensions": "Height: 8.25 Inches, Length: 5.5 Inches, Weight: 1.145 Pounds, Width: 1.3 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 1.3}, "weight": {"unit": "pounds", "value": 1.145}, "height": {"unit": "inches", "value": 8.25}}, "pages": 384, "date_published": "2007-05-01", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Humor & Satire', 'Humorous', 'Contemporary', 'Literary', 'Romance', 'New Adult & College'], 'authors": ["Claudia Carroll'], 'title": "Remind Me Again Why I Need A Man", "isbn13": "9780061140532", "msrp": 24.95, 'binding": "Hardcover", "isbn": "0061140538", "isbn10": "0061140538"}}