{"book": {"publisher": "Regan", "synopsis": "New York Times Bestseller<br/>Postsecret.com founder Frank Warren is back with a fresh and compelling companion to his wildly popular Los Angeles Times bestseller, PostSecret. For My Secret, a collectible, paper-over-board book that includes a page of vibrant, decorative stickers, Warren has personally selected never-before-seen anonymous postcards created by teens and college students from across the country. Each card bears an intimate and powerful secret—at turns inspirational, shocking, hilarious, and poetic—that is told through original illustrations, photographs, collages, and other creative means. Sample messages include:<br/>"I am avoiding you because you are socially below me.""I know the truth to the lie my parents tell... ''My friends think I was homeschooled. I spent high school in juvi.'<br/><br/>A unique and important book that will appeal to both young adults and their parents, My Secret offers a raw and revealing glimpse into the real lives of today\'s teens and twentysomethings. Choosing their own handmade postcards over email or text messages, teens and college students express their hopes, fears, and wildest confessions in a way that truly represents their diverse personalities and voices.', 'language": "en", "image": "https: //images.isbndb.com/covers/66/83/9780061196683.jpg", "title_long": "My Secret: A PostSecret Book", "edition": "Illustrated", "dimensions": "Height: 10.25 Inches, Length: 7.5 Inches, Weight: 1.47 Pounds, Width: 0.64 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.5}, "width": {"unit": "inches", "value": 0.64}, "weight": {"unit": "pounds", "value": 1.47}, "height": {"unit": "inches", "value": 10.25}}, "pages": 144, "date_published": "2006-10-24", "subjects": ["Self-Help', 'Motivational', 'Personal Transformation', 'Art Therapy & Relaxation', 'Arts & Photography', 'Collections, Catalogs & Exhibitions', 'History & Criticism', 'History', 'Other Media', 'Mixed Media', 'Graphic Design', 'Printmaking', 'Humor & Entertainment', 'Pop Culture', 'Art'], 'authors": ["Frank Warren'], 'title": "My Secret: A PostSecret Book", "isbn13": "9780061196683", "msrp": 15.63, 'binding": "Hardcover", "isbn": "0061196681", "isbn10": "0061196681"}}