{'book': {'publisher': 'William Morrow', 'synopsis': 'Tucked away in a cozy cul-de-sac on Heraldsgate Hill, Judith McMonigle Flynn hopes for smooth sailing in her longtime role as an innkeeper. But Judith\'s skill in dealing with guests is matched only by her knack for coming across corpses.<br/>Mystery lovers who enjoy madcap mayhem will have no reservations about returning to Hillside Manor in the twenty-fourth Bed-and-Breakfast book from USA Today bestselling author Mary Daheim.<br/>Judith\'s worst nightmare comes true when Vivian Flynn—husband Joe\'s first wife—moves back into the neighborhood, bringing along her newest spouse, Billy "Blunder" Buss, a former minor-league baseball player who is many years younger than his shop-worn bride. Still, the B&B business is going well and the newlyweds don\'t seem to be causing problems for the Flynns. That seemingly calm summer idyll is broken when Vivian, who has become mysteriously wealthy, announces plans to tear down her own house and the recently vacated bungalow next door so she can build a big, bad condo. Judith, along with the rest of the neighbors in the cul-de-sac, is up in arms, vowing to fight the project to the death.<br/>Vivian\'s past catches up with her when Frankie Buss comes to town. Billy and Frankie\'s late father, elderly Oklahoma rancher Potsy Buss, was married to Vivian for nine months before dying and bequeathing her his vast wealth. Frankie Buss intends to stir the pot of gold that Potsy left his widow, and he\'s trying to cut a deal with Vivian and her most recent mate, Billy. Naturally, where else would Frankie and his wife, Marva Lou, stay but at Hillside Manor?<br/>And naturally, somebody checks out . . . permanently. The "somebody" isn\'t a Buss family member, and turns out to be a "nobody" because the body can\'t be identified. To save the B&B as well as her sanity, Judith must figure out not only who did it, but who it was who was found dead in Vivian\'s backyard.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/15/49/9780061351549.jpg', 'title_long': 'Vi Agra Falls: A Bed-and-Breakfast Mystery (Bed-and-Breakfast Mysteries, 24)', 'edition': 'First Edition', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 1.05 Pounds, Width: 1.09 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.09}, 'weight': {'unit': 'pounds', 'value': 1.05}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 336, 'date_published': '2008-07-29', 'subjects': ['Literature & Fiction', 'Genre Fiction', "Women's Fiction", 'United States', 'Contemporary', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Cozy', 'Amateur Sleuths', 'Thrillers & Suspense', 'Suspense'], 'authors': ['Mary Daheim'], 'title': 'Vi Agra Falls: A Bed-and-Breakfast Mystery (Bed-and-Breakfast Mysteries, 24)', 'isbn13': '9780061351549', 'msrp': 23.95, 'binding': 'Hardcover', 'isbn': '0061351547', 'isbn10': '0061351547'}}