{'book': {'publisher': 'Balzer + Bray', 'synopsis': "The story of America and African Americans is a story of hope and inspiration and unwavering courage. In Heart and Soul, Kadir Nelson's stirring paintings and words grace 100-plus pages of a gorgeous picture book—a beautiful gift for readers of all ages, a treasure to share across generations at home or in the classroom.<br/>Heart and Soul is about the men, women, and children who toiled in the hot sun picking cotton; it's about the America ripped in two by Jim Crow laws; it's about the brothers and sisters of all colors who rallied against those who would dare bar a child from an education. It's a story of discrimination and broken promises, determination, and triumphs.<br/>Kadir Nelson's Heart and Soul—the winner of numerous awards, including the Coretta Scott King Author Award and Illustrator Honor, and the recipient of five starred reviews—is told through the unique point of view and intimate voice of a one-hundred-year-old African-American female narrator.<br/>This inspiring book demonstrates that in striving for freedom and equal rights, African Americans help our country on the journey toward its promise of liberty and justice—the true heart and soul of our nation.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/07/40/9780061730740.jpg', 'title_long': 'Heart and Soul: The Story of America and African Americans (Coretta Scott King Award - Author Winner Title(s))', 'edition': '1', 'dimensions': 'Height: 11 Inches, Length: 11 Inches, Weight: 1.94 Pounds, Width: 0.45 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 11}, 'width': {'unit': 'inches', 'value': 0.45}, 'weight': {'unit': 'pounds', 'value': 1.94}, 'height': {'unit': 'inches', 'value': 11}}, 'pages': 108, 'date_published': '2011-09-27', 'subjects': ["Children's Books", 'History', 'United States', 'Growing Up & Facts of Life', 'Difficult Discussions', 'Literature & Fiction', 'Historical Fiction', 'Biographies', 'Multicultural', 'Geography & Cultures', 'Multicultural Stories', 'Self Service', 'Custom Stores'], 'authors': ['Kadir Nelson'], 'title': 'Heart and Soul: The Story of America and African Americans (Coretta Scott King Award - Author Winner Title(s))', 'isbn13': '9780061730740', 'msrp': 19.99, 'binding': 'Hardcover', 'isbn': '0061730742', 'isbn10': '0061730742'}}