{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': "A THRILLING, PAGE-TURNING TALE OF ADVENTURE AND FORBIDDEN PASSION...<br/>Syrie James approaches Bram Stoker's classic Dracula with a breathtaking new perspective--as, for the first time, Mina Harker records the shocking story of her scandalous seduction and sexual rebirth.<br/><br/>Who is this magnetic, fascinating man? And how could one woman fall so completely under his spell?<br/><br/>Mina Harker is torn between two men. Struggling to hang on to the deep, pure love she's found within her marriage to her husband, Jonathan, she is inexorably drawn into a secret, passionate affair with a charismatic but dangerous lover. This haunted and haunting creature has awakened feelings and desires within her that she has never before known, which remake her as a woman.<br/><br/>Although everyone she knows fears him and is pledged to destroy him, Mina sees a side to him that the others cannot: a tender, romantic side; a man who's taken full advantage of his gift of immortality to expand his mind and talents; a man who is deeply in love, and who may not be evil after all. Soon, they are connected in a way she never thought humanly possible.<br/><br/>Yet to surrender is surely madness, for to be with him could end her life. It may cost Mina all she holds dear, but to make her choice she must learn everything she can about the remarkable origins and unique, sensuous powers of this man, this exquisite monster, this ... Dracula!", 'language': 'en', 'image': 'https://images.isbndb.com/covers/30/36/9780061923036.jpg', 'title_long': 'Dracula, My Love: The Secret Journals of Mina Harker', 'edition': 'Illustrated', 'dimensions': 'Height: 1.16 Inches, Length: 8.01 Inches, Weight: 0.84657508608 Pounds, Width: 5.44 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.01}, 'width': {'unit': 'inches', 'value': 5.44}, 'weight': {'unit': 'pounds', 'value': 0.84657508608}, 'height': {'unit': 'inches', 'value': 1.16}}, 'pages': 457, 'date_published': '2010-07-20', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'Horror', 'United States', 'Romance', 'Paranormal', 'Vampires', 'Fantasy', 'Werewolves & Shifters', 'Science Fiction & Fantasy', 'Paranormal & Urban', 'Romantic'], 'authors': ['Syrie James'], 'title': 'Dracula, My Love: The Secret Journals of Mina Harker', 'isbn13': '9780061923036', 'msrp': 10.99, 'binding': 'Paperback', 'related': {'ePub': '0062010425'}, 'isbn': '0061923036', 'isbn10': '0061923036', 'other_isbns': [{'isbn': '9780062010421', 'binding': 'print'}]}}