{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': "Charmaine Ryan knows only poverty and pain growing up. In the wake of a horrifying tragedy, she seeks a new life, and fate leads her into the private world of the wealthy Duvoisin clan. At first, it seems as if nothing terrible could touch this seemingly charmed family. But an ill wind blows through the halls and chambers of the Duvoisins' sprawling island retreat, carrying betrayal, deceit, and ominous peril.<br/>Quickly, Charmaine is caught up in the secrets and mystique swirling around the enigmatic family. At the center are shipping tycoon Frederic Duvoisin and his youthful wife, Colette. And there is Paul Duvoisin, a dashing seducer and Frederic's bastard son, who stirs a dangerous fascination in the two women; the scheming Agatha Ward, who will not rest until she's taken Colette's place in Frederic's heart as well as in his bed; and exiled son, John, who reenters the family fold, stoking the turmoil as he unveils truths best kept hidden. Ultimately, Charmaine chooses to stand with Colette against formidable enemies, but has she made the right decision?<br/>A sweeping, remarkable blend of adventure, romance, intrigue, and suspense, A Silent Ocean Away heralds the arrival of a glorious new voice on the historical fiction scene.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/82/36/9780061578236.jpg', 'title_long': "A Silent Ocean Away: Colette's Dominion (Colette, 1)", 'edition': '1', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 0.7 Pounds, Width: 0.94 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 0.94}, 'weight': {'unit': 'pounds', 'value': 0.7}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 373, 'date_published': '2008-10-14', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'Family Life', "Women's Fiction", 'Domestic Life', 'United States', 'Romance', 'Contemporary', '20th Century', 'Self Service', 'Custom Stores'], 'authors': ['DeVa Gantt'], 'title': "A Silent Ocean Away: Colette's Dominion (Colette, 1)", 'isbn13': '9780061578236', 'msrp': 13.95, 'binding': 'Paperback', 'related': {'ePub': '0061981796'}, 'isbn': '0061578231', 'isbn10': '0061578231', 'other_isbns': [{'isbn': '9780061981791', 'binding': 'print'}]}}