{'book': {'publisher': 'William Morrow', 'synopsis': "At forty-two, Shelley Marino desperately wants a child. Though she and her older husband, Martin, have tried during the course of their marriage, their only hope now is adoption. Martin, who has seen his share of heartbreak, can't reconcile what Shelley wants with what he knows about the world, and as the father of two grown children from a previous marriage, he is not sure he can bear the emotional challenge of fatherhood again. To love is to risk loss and Martin suddenly decides that is a gamble he can't afford to take.<br/>The pain of great loss is something that Mai, a woman who emigrated from Vietnam more than twenty years ago, knows all too well. Though Mai has attained all of the accoutrements of the American dream—a healthy business, an SUV, a house of her own—she has not allowed herself to forget the family tragedy that forced her to leave Vietnam. She has distanced herself from her life and from everyone around her—until she meets Shelley. Their budding friendship forces Mai to make a decision that will put her face-to-face with the world she left behind so long ago. And in the course of the journey the two women must make together, Shelley, too, confronts choices that will reverberate for the rest of her life.<br/>Lyrical and moving, If You Lived Here takes the reader on a journey as well, from loss to love, and shows how new beginnings can heal old wounds.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/04/89/9780061130489.jpg', 'title_long': 'If You Lived Here: A Novel', 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.1 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.1}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 336, 'date_published': '2007-02-27', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Psychological', 'United States', 'Contemporary'], 'authors': ['Dana Sachs'], 'title': 'If You Lived Here: A Novel', 'isbn13': '9780061130489', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0061130486', 'isbn10': '0061130486'}}