{'book': {'publisher': 'William Morrow', 'synopsis': "She was fifteen when she visited the therapist; still a teen when they had sex. She was twenty-five when she married him and forty-four when she killed him.<br/>In October 2002, the quiet northern California town of Orinda was rocked by murder when Susan Polk, the mother of three teenage boys, was arrested for stabbing her husband and former therapist, Dr. Felix Polk, to death. The arrest and subsequent trial quickly became one of the most talked about murder cases in the country, as spectators and reporters learned the strange history behind this shocking killing.<br/>Now in Seduced by Madness, Carol Pogash—the leading journalist working the case—has written the definitive account of the Polk family saga, offering a rich and textured re-creation of this disturbing and tragic American tale. Examining the decadent culture of California in the 1970s, Pogash looks at how, in this period of drugs and sexual exploration, a fifteen-year-old Susan found herself caught in the grasp of Felix, her therapist—who, like others in the mental health profession, fell for every passing trend in mental health therapy. Culled from years of careful research, Pogash reconstructs the vague beginnings of the couple's sexual relationship in the therapist's office, exploring how Felix's relaxed attitude toward therapy blinded him to the complex nature of Susan's mental state, and how their mutual obsession with each other sealed their fate.<br/>With lyrical prose, Pogash skillfully traces the Polks' story—from their early yearnings for one another through their flawed marriage, which produced three highly intelligent but emotionally divided sons. Weaving a complex narrative of a family who lived in multimillion dollar homes but lingered in the shadow of dysfunction, Pogash reassembles their life in the years and months before Felix's death, intimately describing what led this soft-spoken wife to murder.<br/>Three years after Felix's death, Susan Polk was tried for first degree murder, and here Pogash provides a first-hand account of the wild, media-circus trial in which Susan defended herself and cross-examined two of her sons. Illustrating how the prosecution and the court responded to Susan's volatile behavior, Pogash takes you inside the deliberation room and uncovers how jurors reached their surprising verdict.<br/>Filled with the most complete case facts and interviews available, Seduced by Madness offers an unparalleled look at one of the most captivating murder cases in recent years.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/77/08/9780061147708.jpg', 'title_long': 'Seduced by Madness: The True Story of the Susan Polk Murder Case', 'edition': 'First Edition', 'dimensions': 'Height: 9.75 Inches, Length: 6.25 Inches, Weight: 1.4 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.4}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 384, 'date_published': '2007-05-29', 'subjects': ['Biographies & Memoirs', 'True Crime', 'Murder & Mayhem'], 'authors': ['Carol Pogash'], 'title': 'Seduced by Madness: The True Story of the Susan Polk Murder Case', 'isbn13': '9780061147708', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0061147702', 'isbn10': '0061147702'}}