{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': 'It\'s a fact: the low–carb craze is everywhere. Another fact: two–thirds of Americans are still overweight and no one is getting thinner. Although low–carb diets produce short term weight loss, the results are not sustainable in the long term. Dieticians, fitness experts, and medical publications are slowly awakening to the fact that the low–carb diet isn\'t the answer to weight loss nor a solution to the obesity epidemic.<br/>What is the solution? Jorge Cruise\'s THE 3–HOUR DIET reveals that timing is the revolutionary weight loss element that has been kept secret until now. By eating small, balanced meals every three hours you reset your body\'s metabolism and achieve amazing results. Eating every three hours turns off your "starvation protection mechanism" ensuring that fat is released and fat–burning muscle preserved. So get ready to lose 2 pounds each week! All with no calorie counting, no starvation, and no deprivation. Bottom line, timing will sculpt your body slim.<br/>With his now trademark easy–to–follow instructions, accessibility, and client success stories, Jorge Cruise\'s THE 3–HOUR DIET is a fluid combination of proven success and categorical innovation. Weight loss has never been easier!', 'language': 'en', 'image': 'https://images.isbndb.com/covers/71/95/9780061237195.jpg', 'title_long': 'The 3-Hour Diet: Lose up to 10 Pounds in Just 2 Weeks by Eating Every 3 Hours!', 'edition': 'Illustrated', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.08 Pounds, Width: 0.92 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.92}, 'weight': {'unit': 'pounds', 'value': 1.08}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 368, 'date_published': '2006-12-26', 'subjects': ['Health, Fitness & Dieting', 'Diets & Weight Loss', 'Food Counters', 'Weight Loss', 'Other Diets'], 'authors': ['Jorge Cruise'], 'title': 'The 3-Hour Diet: Lose up to 10 Pounds in Just 2 Weeks by Eating Every 3 Hours!', 'isbn13': '9780061237195', 'msrp': 18.99, 'binding': 'Paperback', 'related': {'ePub': '0062045806'}, 'isbn': '0061237191', 'isbn10': '0061237191', 'other_isbns': [{'isbn': '9780062045805', 'binding': 'print'}]}}