{'book': {'publisher': 'Harper Voyager', 'synopsis': "Once or twice in a score of years, the boundlessly inventive realm of speculative fiction reveals a vision of tomorrow that dwarfs everything that came before. These are the dreams of the Asimovs and the Heinleins, the Bears and the Brins. Now Tony Daniel brilliantly dreams the future -- and reinvents humanity itself -- in an epic chronicle of civil war and transcendence that plays out on an enormous stage encompassing the solar system in its entirety -- its asteroids, its comets, and all its people, transmuted into astounding forms and living astonishing lives.<br/>Metaplanetary<br/>The human race has extended itself into the for reaches of our solar system -- and, in doing so, has developed into something remarkable and diverse and perhaps transcendent. The inner system of the Met -- with its worlds connected by a vast living network of cables -- is supported by the repression and enslavement of humanity's progeny, nanotechnological artificial intelligences -- beings whom the tyrant Amés has declared non-human. There is tolerance and sanctuary in the outer system beyond the Jovian frontier. Yet few of the oppressed ever make it past the dictator's well-patrolled boundaries.<br/>But the longing for freedom cannot be denied, whatever the risk.<br/>A priest of the mystical religion called the Greentree Way senses catastrophe approaching. A vision foretells that the future of our bitterly divided solar system rests in the hands of a mysterious man of destiny and doom who has vanished into the backwater of the Met in search of his lost love. But the priest is not the only one who grasps this man's importance. The despot Amés is after the some quarry -- and until now there has been no power in the inner solar system willing to oppose Amés and his fearsome minions.<br/>But now a line has been drawn of Neptune's moon Triton. Roger Sherman, a retired military commander from Earth's West Point and a Greentree ally, will not let Amés prevail. Though dwarfed by the strength and wealth of the Met, the cosmos under Sherman's jurisdiction will remain free at all cost -- though defiance will ensure the unspeakable onslaught of the dictator Amés's wrath -- a rage that will soon ravage the solar system. A rage that will plunge all of humankind into the fury of total war.<br/>With Metaplanetary, author Tony Daniel fulfills the great promise of his critically acclaimed earlier works. A new master has reached for the stars, with a stunning speculative masterwork of enormous scope and conceptual daring -- an adventure of grand victories and horrific villainy, both human and meta-human alike.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/14/25/9780061051425.jpg', 'title_long': 'Metaplanetary: A Novel of Interplanetary Civil War', 'edition': 'First Edition', 'dimensions': 'Height: 9.75 Inches, Length: 6.75 Inches, Weight: 1.85 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.75}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.85}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 448, 'date_published': '2001-04-10', 'subjects': ['Science Fiction & Fantasy', 'Science Fiction', 'Space Opera'], 'authors': ['Tony Daniel'], 'title': 'Metaplanetary: A Novel of Interplanetary Civil War', 'isbn13': '9780061051425', 'msrp': 26, 'binding': 'Hardcover', 'isbn': '006105142X', 'isbn10': '006105142X'}}