{'book': {'publisher': 'William Morrow', 'synopsis': "On the surface, Adam Resnick was your typical guy next door, a friendly, charismatic father of two. But he spent the first decade of his adult life winning and losing fortunes playing blackjack and betting on sports, sometimes winning and losing millions in mere hours–until, in one frenzied night, he received a phone call that was his moment of reckoning, and that sounded the death knell for his lifelong addiction.<br/>Bust is a white–knuckled story of the highs and lows of a world–class gambler. Introduced to gambling at the age of six, Resnick was a whiz kid who was winning tens of thousands by his teens. A successful businessman, he won and lost millions at the gambling tables throughout his twenties–and wrote more than 130 bad checks to cover his losses. Resnick's high–rolling lifestyle opened the door to the parties 'n' celebrities universe of Las Vegas, while at the same time introducing him to the underbelly of bookies and mobsters. He was surrounded by a host of enablers who lent him cash–often at exorbitant rates that enriched their pockets at his expense. And, finally, he found what seemed like the answer to his prayers: An insider at a family–owned Chicago bank who gave him an open line of credit. It all came to a head one fateful morning when a phone call informed him that he had 24 hours to deposit $3,000,000 into a bank account. Cornered by sure financial ruin, a prison sentence, and worse, Resnick drove to a casino in Hammond, Indiana, with a million dollars in cash . . . won up to $8 million in one night . . . and then lost it all before he left the table. In one frenzied night–captured on casino videotape–Resnick brought down that bank, and won himself a jail sentence for bank fraud.<br/>Adam Resnick's story is both moving and timely. Coming when the multi–billion–dollar gambling industry is bigger than ever and celebrity poker tournaments are the rage, this stinging indictment of gambling's dark side and portrait of a lifelong addict will draw readers who want to know more about what it is to be a high roller–the risks, the exhilaration, and the eventual collapse", 'language': 'en', 'image': 'https://images.isbndb.com/covers/13/66/9780061341366.jpg', 'title_long': 'Bust: How I Gambled and Lost a Fortune, Brought Down a Bank--and Lived to Pay for It', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6.25 Inches, Weight: 1.1 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.1}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 288, 'date_published': '2007-02-27', 'subjects': ['Biographies & Memoirs', 'True Crime', 'Crime & Criminal Biographies', 'Humor & Entertainment', 'Puzzles & Games', 'Gambling'], 'authors': ['Adam B. Resnick'], 'title': 'Bust: How I Gambled and Lost a Fortune, Brought Down a Bank--and Lived to Pay for It', 'isbn13': '9780061341366', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0061341363', 'isbn10': '0061341363'}}