{'book': {'publisher': 'HCP US (PG UK)', 'synopsis': "The murals in restaurants are on a par with the food in museums.<br/>America is an enormous frosted cupcake in the middle of millions of starving people.<br/>Critics are like pigs at the pastry cart.<br/>Describing something by relating it to another thing is the essence of metaphorical thought. It is one of the oldest activities of humankind—and one of the most impressive when done skillfully. Throughout history, many masters of metaphor have crafted observations that are so spectacular they have taken up a permanent residence in our minds.<br/>In I Never Metaphor I Didn't Like, quotation maven Dr. Mardy Grothe fixes his attention on the three superstars of figurative language—analogies, metaphors, and similes. The result is an extraordinary compilation of nearly 2,000 feats of association that will entertain, educate, and occasionally inspire quotation lovers everywhere.<br/>In this intellectual smorgasbord, the author of Oxymoronica and Viva la Repartee explains figurative language in a refreshingly down-to-earth way before taking readers on a tour of history's greatest word pictures. In chapters on wit, love, sex, stage and screen, insults, politics, sports, and more, you will find quotations from Aristotle and Maya Angelou to George Washington and Oprah Winfrey.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/81/35/9780061358135.jpg', 'title_long': "I NEVER METAPHOR I DIDN'T LIKE", 'edition': '1ST', 'dimensions': 'Weight: 0.8598028218 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 0.8598028218}}, 'pages': 336, 'date_published': '2008', 'subjects': ['Humor & Entertainment', 'Humor', 'Reference', 'Encyclopedias & Subject Guides', 'Art', 'History', 'Quotations', 'Words, Language & Grammar', 'Rhetoric'], 'authors': ['Dr. Mardy Grothe'], 'title': "I NEVER METAPHOR I DIDN'T LIKE", 'isbn13': '9780061358135', 'msrp': 12.2, 'binding': 'Paperback', 'related': {'ePub': '0061982938'}, 'isbn': '0061358134', 'isbn10': '0061358134', 'other_isbns': [{'isbn': '9780061982934', 'binding': 'print'}]}}