{'book': {'publisher': 'Avon', 'synopsis': 'From the #1 New York Times bestselling author of Vince Flynn\'s Mitch Rapp Series<br/><br/>It\'s bold. It\'s dangerous. It\'s the kind of maverick operation that has made Mark Beamon both the FBI\'s best agent and its least-likely-to-succeed screw-up.<br/>A top-secret FBI file -- buried in an anonymous government warehouse since J. Edgar Hoover\'s death -- is missing. The unlucky grad student who uncovered it is dead, and now his ex-girlfriend is on the run, accused of the murder. The only man everyone agrees can find the young woman and turn up the explosive document is "off-duty," suspended and under the threat of prosecution by the bureau itself.<br/>Beamon knows better than anyone that this is his last shot to save his career -- and his country. Tracking the young woman down, though, will be the hardest assignment he\'s ever tackled, for she\'s a gutsy world-class rock-climber who can drop out of sight anywhere in the world. And even if he finds her and the file, who can he trust when the FBI itself is under suspicion? Beamon has no room for wrong guesses -- or moves. If he blows this one, he\'ll free fall straight out of the bureau -- and straight into prison....', 'language': 'en', 'image': 'https://images.isbndb.com/covers/80/24/9780061098024.jpg', 'title_long': 'Free Fall', 'dimensions': 'Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.55 Pounds, Width: 0.99 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 0.99}, 'weight': {'unit': 'pounds', 'value': 0.55}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 496, 'date_published': '2001-02-06', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'United States', 'Contemporary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Spies & Politics', 'Suspense', 'Crime'], 'authors': ['Kyle Mills'], 'title': 'Free Fall', 'isbn13': '9780061098024', 'msrp': 7.5, 'binding': 'Mass Market Paperback', 'related': {'Kindle Edition': '0062031937', 'ePub': '0062031937'}, 'isbn': '0061098027', 'isbn10': '0061098027', 'other_isbns': [{'isbn': '9780062031938', 'binding': 'print'}]}}