{'book': {'publisher': 'Harper Perennial', 'synopsis': 'A linguist with attitude, R. L. Trask was a steadfast soldier in the never-ending War of Words, fighting the good fight for standard written English. Revered for its insight and legendary for its "cheek," Trask\'s Mind the Gaffe! is an indispensable guidebook for wordsmiths and language mavens of every stripe, providing safe passage through the ubiquitous minefields of improper usage.<br/>Artiste: This pretentious word . . . commonly means "fraud pretending to be an artist." Don\'t use it unless you mean to be insulting.<br/>Amoral, Immoral: An amoral person is one who does not know the difference between right and wrong. An immoral person knows the difference but does wrong anyway.<br/>Reaction: A reaction is a sudden and spontaneous response to a stimulus, such as jumping, shrieking, or fainting. The word is not properly used as a fancy word for any kind of considered response. If you circulate a policy document, you can ask others for their opinions, or for their criticisms, but do not ask them for their reactions unless you hope to hear responses like "I burst into uncontrollable laughter."', 'language': 'en', 'image': 'https://images.isbndb.com/covers/22/09/9780061132209.jpg', 'title_long': "Mind the Gaffe!: A Troubleshooter's Guide to English Style and Usage", 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 0.545 Pounds, Width: 0.73 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 0.73}, 'weight': {'unit': 'pounds', 'value': 0.545}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 320, 'date_published': '2006-11-21', 'subjects': ['Reference', 'Dictionaries & Thesauruses', 'English', 'Thesauruses', 'Dictionaries', 'Foreign Language Study & Reference', 'Words, Language & Grammar', 'Grammar', 'Vocabulary, Slang & Word Lists', 'Writing, Research & Publishing Guides', 'Writing'], 'authors': ['R. L. Trask'], 'title': "Mind the Gaffe!: A Troubleshooter's Guide to English Style and Usage", 'isbn13': '9780061132209', 'msrp': 13.11, 'binding': 'Paperback', 'isbn': '0061132209', 'isbn10': '0061132209'}}