{'book': {'publisher': 'Greenwillow Books', 'synopsis': "Told in alternating voices, this smart and engaging middle grade novel from the beloved Kevin Henkes is the story of two boys coming together in friendship as they struggle with family conflicts and tragedy.<br/>There are ghosts at Bird Lake, and they're haunting Mitch and Spencer. Not the Halloween kind, but ghosts of the past. Memories of how life was before—before the divorce, before the accident. Can their ghosts bring Mitch and Spencer together, as friends? Or will their secrets keep them apart?<br/>Mitch feels isolated at his grandparents’ house and can’t help hating his father, who walked out on him and his mom two and a half weeks earlier. Spencer’s family has decided it’s finally time to return to Bird Lake, years after his brother, Matty, drowned there. Both boys arrive at the lake scarred and fragile, but as they become friends, the sharp edges of their lives smooth out and, slowly, they are able to start healing.<br/>“Superbly crafted. A ‘must have’ for every library.” —School Library Journal (starred review)<br/>“In a novel as tender as his acclaimed Olive’s Ocean, Henkes probes the psyches of two boys facing family conflicts.”—Publishers Weekly (starred review)", 'language': 'en', 'image': 'https://images.isbndb.com/covers/07/69/9780061470769.jpg', 'title_long': 'Bird Lake Moon', 'edition': 'First Edition', 'dimensions': 'Height: 7.38 Inches, Length: 5 Inches, Weight: 0.63 Pounds, Width: 0.78 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5}, 'width': {'unit': 'inches', 'value': 0.78}, 'weight': {'unit': 'pounds', 'value': 0.63}, 'height': {'unit': 'inches', 'value': 7.38}}, 'pages': 192, 'date_published': '2008-04-22', 'subjects': ["Children's Books", 'Growing Up & Facts of Life', 'Family Life', 'Difficult Discussions', 'Friendship, Social Skills & School Life', 'Science, Nature & How It Works', 'Nature', 'Self Service', 'Custom Stores'], 'authors': ['Kevin Henkes'], 'title': 'Bird Lake Moon', 'isbn13': '9780061470769', 'msrp': 16.99, 'binding': 'Hardcover', 'isbn': '0061470767', 'isbn10': '0061470767'}}