{'book': {'publisher': 'HarperCollins', 'synopsis': "Cat Chant and Marianne Pinhoe have discovered something exciting—something truly precious, very strange, and valuable. An egg.<br/>An egg that has been hidden away in an attic for who-knows-how-many years. An egg protected by some strong \x93Don't Notice\x94 spells. An egg that Marianne gives to Cat, even though he lives at nearby Chrestomanci Castle. Chrestomanci himself, the strongest enchanter in the world, is sure to be interested in the egg—and interference from the Big Man is the last thing Marianne's family of secret rogue witches wants.<br/>But how much longer can the Pinhoes keep their secrets? Gammer, the leader of the clan, has gone mad, a powerful bad luck spell is wreaking havoc, and there's an unexplained plague of frogs. Not to mention the mysterious barrier Cat finds in the forest.<br/>Marianne and Cat may be the only two who can set things right. But first Marianne must accept her own powerful magic, and Cat must uncover the secrets behind the mystical Pinhoe Egg.<br/>In this new Chrestomanci book, Diana Wynne Jones is at her most magical.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/12/57/9780061131257.jpg', 'title_long': 'The Pinhoe Egg: A Chrestomanci Book', 'edition': 'Library Bound Edition', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 1.5 Pounds, Width: 1.57 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.57}, 'weight': {'unit': 'pounds', 'value': 1.5}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 528, 'date_published': '2006-10-01', 'subjects': ["Children's Books", 'Growing Up & Facts of Life', 'Family Life', 'Literature & Fiction', 'Humor', 'Science Fiction & Fantasy', 'Fantasy & Magic'], 'authors': ['Diana Wynne Jones'], 'title': 'The Pinhoe Egg: A Chrestomanci Book', 'isbn13': '9780061131257', 'msrp': 18.89, 'binding': 'Library Binding', 'isbn': '0061131253', 'isbn10': '0061131253'}}