{'book': {'publisher': 'William Morrow', 'synopsis': 'Two never-before-published novellas by one of America\'s finest living writers, Ray Bradbury.<br/>A journalist bearing terrible news leaps from a still-moving train into a small town of wonderful, impossible secrets . . .<br/>The doomed crew of a starship follow their blind, mad captain on a quest into deepest space to joust with destiny, eternity, and God Himself . . .<br/>Now and Forever is a bold new work from an incomparable artist whose stories have reshaped America\'s literary landscape; two bewitching novellas that have never before appeared in print—each distinctly different, yet uniquely Bradbury—demonstrating the breathtaking range of the master\'s talent and the irrepressible vitality of his mind, spirit, and heart.<br/>In Somewhere a Band Is Playing, a writer is drawn by poetry and dreams to tiny Summerton, Arizona, a community hidden in plain view, where no small children play, and where the residents never seem to age. Enchanted by its powerful rural magic—and by a beautiful, enigmatic lady who bears the name of an Egyptian queen—the writer sets out to uncover Summerton\'s mysteries before the inevitable arrival of a ruthless destruction.<br/>With Leviathan \'99, the author who once colonized Mars returns to the cosmos to brilliantly reimagine Herman Melville\'s classic masterwork of obsession and the sea, transforming a great whale into a worlds-devouring comet. In the year 2099, fledgling astronaut Ishmael Hunnicut Jones boards the Cetus 7, placing his fate in the hands of a relentless madman who is blindly chasing the celestial monster\'s tail. And in the merciless void, a crew of earthborn and alien star-travelers will face a divine judgment, and an "enemy" wielding the most fearsome weapon of all . . . Time.<br/>More than a half century into his remarkable career, Ray Bradbury continues to delight and astound with grand visions, lyrical prose, and provocative thought. Rich in poetry, wonder, imagination, and truth, here is proof positive that the words and stories of the inimitable Bradbury will live on . . . Now and Forever.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/15/61/9780061131561.jpg', 'title_long': "Now and Forever: Somewhere a Band Is Playing & Leviathan '99", 'edition': 'First Edition', 'dimensions': 'Height: 0.75 Inches, Length: 6 Inches, Weight: 0.86 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.86}, 'height': {'unit': 'inches', 'value': 0.75}}, 'pages': 224, 'date_published': '2007-09-04', 'subjects': ['Literature & Fiction', 'United States', 'Literary', 'Science Fiction & Fantasy', 'Science Fiction', 'Anthologies'], 'authors': ['Ray Bradbury'], 'title': "Now and Forever: Somewhere a Band Is Playing & Leviathan '99", 'isbn13': '9780061131561', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0061131563', 'isbn10': '0061131563'}}