{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': 'A FULL-LENGTH STANDALONE, a great entry into the world of Rachael Herron\'s sexy and hilarious books. From international bestseller Rachael Herron, comes a book too delightful to put down: Lucy Harrison sells books by day and volunteers with the Cypress Hollow fire department by night. Her life is just the way she likes it--full, even-keeled, and smooth--until bad-boy ex-cop Owen Bancroft comes back to town. Lucy has always been fearless, never scared about diving in to help others. When it comes to risking her heart, however, she realizes she\'s absolutely terrified. In a small town like Cypress Hollow, everyone knows your business--and there is nowhere to hide. Then Lucy and Owen are thrown together by the discovery of the lost work of local legend, knitting guru Eliza Carpenter. Now Owen, adrift and struggling to redefine himself as a civilian without a badge, will have to learn how to open himself up to life\'s new possibilities while Lucy decides just how much of herself she\'s willing to gamble on love. "Relationships are at the heart of women\'s fiction, and Herron could teach a master class on creating them." Chicklit Central "Rachael Herron charms with an emotional, heart-warming story of family, friendship and love in a town you\'ll never want to leave."--USA Today bestselling author Barbara Freethy<br/>Herron\'s characters are grounded and relatable, but her twists and turns leave you satisfied as a reader. For a good time, pack this beach read on your vacation! You\'ll love this book.<br/>"Rachael Herron seamlessly blends romance, friendship, and laughter. " Barbara Bretton, USA Today Bestselling Author Scroll up and Click Buy!', 'language': 'en', 'image': 'https://images.isbndb.com/covers/13/16/9780061841316.jpg', 'title_long': 'How to Knit a Heart Back Home: A Cypress Hollow Yarn (Cypress Hollow Yarns) (A Cypress Hollow Yarn Novel, 2)', 'dimensions': 'Height: 7.9 Inches, Length: 1 Inches, Weight: 0.61 Pounds, Width: 5.2 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 1}, 'width': {'unit': 'inches', 'value': 5.2}, 'weight': {'unit': 'pounds', 'value': 0.61}, 'height': {'unit': 'inches', 'value': 7.9}}, 'pages': 368, 'date_published': '2011-03-01', 'subjects': ['Literature & Fiction', 'United States', 'Contemporary', 'Romance'], 'authors': ['Rachael Herron'], 'title': 'How to Knit a Heart Back Home: A Cypress Hollow Yarn (Cypress Hollow Yarns) (A Cypress Hollow Yarn Novel, 2)', 'isbn13': '9780061841316', 'msrp': 12.07, 'binding': 'Paperback', 'related': {'Kindle Edition': '0062065882', 'ePub': '0062065882'}, 'isbn': '0061841315', 'isbn10': '0061841315', 'other_isbns': [{'isbn': '9780062065889', 'binding': 'print'}]}}