{'book': {'publisher': 'William Morrow', 'synopsis': 'As wry as Bill Bryson’s I’m a Stranger Here Myself, as insightful as Tracy Kidder’s House, here is smart, engaging tale of one man’s stuggle to restore his family’s new home―a decrepit old mansion―and discover himself<br/><br/>With his pregnant wife and their 18-month-old son in tow, David Giffels scoured the environs of Akron, OH, in search of the perfect house. But nothing seemed right . . . until he spotted the beautiful, decaying Guilded Era mansion. A former rubber robber baron’s domain, the once grand house does need some repair . . . okay it’s a dump. So what if, there’s “nothing holding this place up but memory,”―the assessment of his father, a structural engineer? It wouldn’t be perfect if it were easy, and Giffels relishes the challenge. He’s a committed do it yourselfer who fears a life without struggle―and Home Depot.<br/>All the Way Home follows Giffels’s funny and sometimes frustrating journey as he and his young family turns a decrepit money pit into the the home of their dreams. From outwitting squatters (both four- and two-legged) to rebuilding termite ridden walls, battling wisteria vines and finding $14,000 in Depression-era cash hidden in a bathroom wall, Giffels takes readers along on the ultimate fixer-up trip. Throughout he shows them the heart of a young man on the brink of adulthood, happily struggling with his new roles as a husband and a father―a man trying to find his way without losing himself.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/28/66/9780061362866.jpg', 'title_long': 'All the Way Home: Building a Family in a Falling-Down House', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.2 Pounds, Width: 1.08 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.08}, 'weight': {'unit': 'pounds', 'value': 1.2}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 320, 'date_published': '2008-05-27', 'subjects': ['Arts & Photography', 'Architecture', 'Urban & Land Use Planning', 'Biographies & Memoirs', 'Memoirs', 'Professionals & Academics', 'Environmentalists & Naturalists', 'Health, Fitness & Dieting', 'Aging', 'Crafts, Hobbies & Home', 'Home Improvement & Design', 'How-to & Home Improvements', 'Parenting & Relationships', 'Family Relationships', 'Science & Math', 'Biological Sciences', 'Animals', 'Nature & Ecology', 'Fauna'], 'authors': ['David Giffels'], 'title': 'All the Way Home: Building a Family in a Falling-Down House', 'isbn13': '9780061362866', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0061362867', 'isbn10': '0061362867'}}