{'book': {'publisher': 'HarperTeen', 'synopsis': 'The world knows Jack London as awriter who lived his own thrilling,real-life adventures. But there areparts of his life that have remainedhidden for many years, things even he couldn’tset down in writing. Terrifying, mysterious,bizarre, and magical —these are the SecretJourneys of Jack London.<br/><br/>We meet Jack at age seventeen, followingthousands of men and women into the YukonTerritory in search of gold. For Jack, the journeyholds the promise of another kind of fortune:challenge and adventure. But what he finds inthe wild north is something far more sinisterthan he could have ever imagined: kidnappingand slavery, the murderous nature of desperatemen, and, amidst it all, supernatural beasts ofthe wilderness that prey upon the weakness inmen’s hearts. Jack’s survival will depend on hisability to quell the demons within himself asmuch as those without.<br/>Acclaimed authors Christopher Goldenand Tim Lebbon, along with illustrator GregRuth, have crafted a masterful tale bothclassic and contemporary, a gripping originalstory of the paranormal in the tradition ofthe great Jack London.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/31/72/9780061863172.jpg', 'title_long': 'The Secret Journeys of Jack London, Book One: The Wild', 'edition': 'First Edition', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 1.12 Pounds, Width: 1.27222 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.27222}, 'weight': {'unit': 'pounds', 'value': 1.12}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 368, 'date_published': '2011-03-01', 'subjects': ['Teen & Young Adult', 'Literature & Fiction', 'Action & Adventure', 'Science Fiction & Fantasy', 'Horror', 'Fantasy', 'Self Service', 'Custom Stores'], 'authors': ['Christopher Golden', 'Tim Lebbon'], 'title': 'The Secret Journeys of Jack London, Book One: The Wild', 'isbn13': '9780061863172', 'msrp': 15.99, 'binding': 'Hardcover', 'isbn': '0061863173', 'isbn10': '0061863173'}}