{'book': {'publisher': 'Harper', 'synopsis': "Whether a lilac damask sheath trimmed in marabou, vintage Dior New Look with a nipped waist, a mini constructed of silver metallic plastic discs à la Paco Rabanne, or a streamlined black wool bouclé number, the cocktail dress is an item of fancy, personal expression, the life of the party—and has been ever since its emergence in the 1920s.<br/><br/>With an essay and a gorgeous array of imagery selected by Laird Borrelli-Persson, The Cocktail Dress is the first volume to pay homage to this fashion classic. Along with an entertaining history of the dress and its evolution, the book features a dazzling presentation of cocktail frocks throughout fashion history. This colorful gallery includes fine art and photography, runway shots and design sketches, stills from classic films, and vintage magazine covers. Included are works by painters and photographers Otto Dix, Alex Katz, Raoul Dufy, Gordon Parks, and Edward Steichen, as well as illustrations by designers Chris Benz, Cynthia Rowley, Isaac Mizrahi, and Peter Som. Throughout are alluring images of fashion and film icons clad in stunning cocktail attire, among them Louise Brooks, Joan Crawford, Grace Kelly, Audrey Hepburn, Marilyn Monroe, Wallis Simpson, Twiggy, Kate Moss, and Sarah Jessica Parker.<br/><br/>Every page features showstopping creations by the world's most renowned fashion designers, from Cristóbal Balenciaga and Christian Dior to Miuccia Prada and Alber Elbaz. The dresses are shown in full color throughout, paired with witty commentary on cocktail culture and couture from fashion personalities, fiction, and film. Extended captions at the back of the book provide details on each dress and its place in fashion history.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/61/37/9780061536137.jpg', 'title_long': 'The Cocktail Dress', 'edition': 'First Edition', 'dimensions': 'Height: 0.6 Inches, Length: 10.26 Inches, Weight: 1.30513659104 Pounds, Width: 6.96 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 10.26}, 'width': {'unit': 'inches', 'value': 6.96}, 'weight': {'unit': 'pounds', 'value': 1.30513659104}, 'height': {'unit': 'inches', 'value': 0.6}}, 'pages': 112, 'date_published': '2009-03-31', 'subjects': ['Arts & Photography', 'Fashion', 'History', 'Decorative Arts & Design', 'Design History & Criticism', 'Graphic Design', 'Commercial', 'Politics & Social Sciences', 'Social Sciences', 'Popular Culture'], 'authors': ['Laird Borrelli-Persson'], 'title': 'The Cocktail Dress', 'isbn13': '9780061536137', 'msrp': 20.07, 'binding': 'Hardcover', 'isbn': '006153613X', 'isbn10': '006153613X'}}