{'book': {'publisher': 'Ecco', 'synopsis': 'At the age of eighteen, Aaron Cohen left Beverly Hills to prove himself in the crucible of the armed forces. He was determined to be a part of Israel\'s most elite security cadre, akin to the American Green Berets and Navy SEALs. After fifteen months of grueling training designed to break down each individual man and to rebuild him as a warrior, Cohen was offered the only post a non-Israeli can hold in the special forces. In 1996 he joined a top-secret, highly controversial unit that dispatches operatives disguised as Arabs into the Palestinian-controlled West Bank to abduct terrorist leaders and bring them to Israel for interrogation and trial.<br/>Between 1996 and 1998, Aaron Cohen would learn Hebrew and Arabic; become an expert in urban counterterror warfare, the martial art of Krav Maga, and undercover operations; and participate in dozens of life-or-death missions. He would infiltrate a Hamas wedding to seize a wanted terrorist and pose as an American journalist to set a trap for one of the financiers behind the Dizengoff Massacre, taking him down in a brutal, hand-to-hand struggle. A propulsive, gripping read, Cohen\'s story is a rare, fly-on-the-wall view into the shadowy world of "black ops" that redefines invincible strength, true danger, and inviolable security.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/61/50/9780061236150.jpg', 'title_long': "Brotherhood of Warriors: Behind Enemy Lines with a Commando in One of the World's Most Elite Counterterrorism Units", 'dimensions': 'Height: 9.25 Inches, Length: 6.5 Inches, Weight: 1.2 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.2}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 288, 'date_published': '2008-04-29', 'subjects': ['Biographies & Memoirs', 'Historical', 'Middle East', 'Leaders & Notable People', 'Military', 'Memoirs', 'History', 'Israel & Palestine', 'Intelligence & Espionage', 'Politics & Social Sciences', 'Politics & Government', 'International & World Politics', 'Specific Topics'], 'authors': ['Aaron Cohen', 'Douglas Century'], 'title': "Brotherhood of Warriors: Behind Enemy Lines with a Commando in One of the World's Most Elite Counterterrorism Units", 'isbn13': '9780061236150', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0061236152', 'isbn10': '0061236152'}}