{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': "An expose of organised crime and its unholy alliance with world leaders, intelligence agencies, and law enforcement, Double Deal is a 40–year saga told with unflinching honesty by mob insider and former Chicago chief of police Michael Corbitt.<br/>Growing up poor and angry, Michael Corbitt fought his way up the ranks of greasers and street gangs until he attracted the attention of Chicago crime boss Sam Giancana, who placed him on the Willow Springs, Illinois, police force. By the time Corbitt was appointed chief of police, he'd also moved up the Outfit's ranks and was living the high life of a respected mobster.<br/>Corbitt's luck turned when he was indicted on charges of racketeering and conspiracy to commit murder. Although there was a mob contract on his life and he was facing a 20–year jail sentence, he refused to testify against organised crime figures under the witness protection programme, maintaining instead the Mafioso's code of silence – until his release from prison.<br/>Now Corbitt breaks that silence, holding back nothing–including the account of his personal involvement in the brutal murder of the wife of Chicago mob attorney Alan Masters.<br/>Corbitt bares his soul, confessing in graphic – sometimes horrific – detail a life lived as both saint and sinner, a life that moved back and forth between the conflicting worlds of the police officer and the gangster with ease.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/04/82/9780061030482.jpg', 'title_long': 'Double Deal: The Inside Story of Murder, Unbridled Corruption, and the Cop Who Was a Mobster', 'edition': 'Reprint', 'dimensions': 'Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.4629707502 Pounds, Width: 1.03 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 1.03}, 'weight': {'unit': 'pounds', 'value': 0.4629707502}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 400, 'date_published': '2004-02-24', 'subjects': ['Biographies & Memoirs', 'Historical', 'United States', 'Memoirs', 'Professionals & Academics', 'Educators', 'Law Enforcement', 'Regional U.S.', 'Midwest', 'True Crime', 'Crime & Criminal Biographies', 'Organized Crime', 'History', 'Americas', 'Politics & Social Sciences', 'Social Sciences', 'Criminology'], 'authors': ['Sam Giancana', 'Michael Corbitt', 'Bettina Giancana'], 'title': 'Double Deal: The Inside Story of Murder, Unbridled Corruption, and the Cop Who Was a Mobster', 'isbn13': '9780061030482', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'isbn': '0061030481', 'isbn10': '0061030481'}}