{'book': {'publisher': 'William Morrow', 'synopsis': "Soon to be a Netflix film<br/>William Kamkwamba was born in Malawi, a country where magic ruled and modern science was mystery. It was also a land withered by drought and hunger. But William had read about windmills, and he dreamed of building one that would bring to his small village a set of luxuries that only 2 percent of Malawians could enjoy: electricity and running water. His neighbors called him misala—crazy—but William refused to let go of his dreams. With a small pile of once-forgotten science textbooks; some scrap metal, tractor parts, and bicycle halves; and an armory of curiosity and determination, he embarked on a daring plan to forge an unlikely contraption and small miracle that would change the lives around him.<br/>The Boy Who Harnessed the Wind is a remarkable true story about human inventiveness and its power to overcome crippling adversity. It will inspire anyone who doubts the power of one individual's ability to change his community and better the lives of those around him.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/03/20/9780061730320.jpg', 'title_long': 'Boy Who Harnessed the Wind: Creating Currents of Electricity and Hope', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 273, 'date_published': '2009-09-29', 'subjects': ['Biographies & Memoirs', 'Community & Culture', 'Memoirs', 'Professionals & Academics', 'Scientists', 'Culinary', 'Engineering & Transportation', 'Engineering', 'Energy Production & Extraction', 'Science & Math', 'Technology', 'Self Service', 'Custom Stores'], 'authors': ['William Kamkwamba', 'Bryan Mealer'], 'title': 'Boy Who Harnessed the Wind: Creating Currents of Electricity and Hope', 'isbn13': '9780061730320', 'msrp': 25.99, 'binding': 'Hardcover', 'isbn': '0061730327', 'isbn10': '0061730327', 'other_isbns': [{'isbn': '9780061937699', 'binding': 'print'}]}}