{'book': {'publisher': 'William Morrow', 'synopsis': 'From the New York Times bestselling author of She Comes First and Be Honest—You\'re Not That Into Him Either comes a revolutionary 30-day program to detoxify and rejuvenate your love life<br/>The premise is simple: When it comes to sex, dating, and relationships, sometimes we get in so deep the only way out is to start over again. For many of us—whether we\'re in a relationship, or actively dating in the hopes of finding that someone special—our love lives have become a source of toxicity. Sex Detox offers a revolutionary way to start fresh and take action.<br/>Just as a physical fast will rapidly alter your metabolism and natural body chemistry, so too will a sex or dating detox impact your mind and body, enabling you to reset, rewire, and ultimately rejuvenate your love life. In this practical, life-changing guide, Ian Kerner lays out a friendly, achievable 30-day course of action that will help you turn off the noise, take a necessary pause, and rebuild your love life from the inside out.<br/>If you\'re in a relationship, you\'ll learn to see your sexual history not just as a series of physical encounters, but rather as a unique and vital part of your identity, which needs to be nurtured and fed in healthy ways. You\'ll experience the "thrill of the chaste" and learn how to touch your partner with a renewed sense of passion and possibility. If you\'re single, the dating detox will give you a chance to step off the dating treadmill, catch your breath, and recover inner strength for the road ahead. You\'ll recalibrate your aspirations to connect to potential mates from a place of strength and self-knowledge.<br/>Whether you\'re single or coupled, Sex Detox will enable you to achieve the relationship results you deserve.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/60/78/9780061136078.jpg', 'title_long': 'Sex Detox: Recharge Desire. Revitalize Intimacy. Rejuvenate Your Love Life.', 'dimensions': 'Height: 9.25 Inches, Length: 6.5 Inches, Weight: 1.2 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.2}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 256, 'date_published': '2008-01-01', 'subjects': ['Self-Help', 'Relationships', 'Interpersonal Relations', 'Love & Romance', 'Sex', 'Health, Fitness & Dieting', 'Psychology & Counseling', 'Sexuality', 'Parenting & Relationships'], 'authors': ['Ian Kerner'], 'title': 'Sex Detox: Recharge Desire. Revitalize Intimacy. Rejuvenate Your Love Life.', 'isbn13': '9780061136078', 'msrp': 24.95, 'binding': 'Hardcover', 'related': {'ePub': '0061751537'}, 'isbn': '0061136077', 'isbn10': '0061136077', 'other_isbns': [{'isbn': '9780061751530', 'binding': 'print'}]}}