{'book': {'publisher': 'Ecco', 'synopsis': "From Kimberly Seals-Allers, the creator of the Mocha Manual™ series, and coauthor Pamela McBride, a seasoned military wife, comes the ultimate guide to life, love, and logistics for military spouses, girlfriends, and female service members. Whether you're just beginning to date a military man and pondering the ins and outs of a long-distance relationship as he moves from base to base or you're a newly wed military wife, The Mocha Manual to Military Life has a host of tips for optimizing your romance. Beyond matters of the heart, the book also offers advice on everything from how to thrive during deployment to how to master military protocol to how to best build friendships among military wives. Accessible and witty, The Mocha Manual to Military Life is a fresh and timely must-read for all women—but particularly African American and Latina women—affected by military service. Written in the same informative tone as the other books in the Mocha Manual™ series, with sidebars and testimony from women who have experience navigating military life, this book is sure to be essential reading for all women engaged in some form or fashion with the military.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/04/88/9780061690488.jpg', 'title_long': 'The Mocha Manual to Military Life: A Savvy Guide for Wives, Girlfriends, and Female Service Members', 'edition': 'Original', 'dimensions': 'Height: 9.25 Inches, Length: 7.38 Inches, Weight: 1.15 Pounds, Width: 0.96 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.38}, 'width': {'unit': 'inches', 'value': 0.96}, 'weight': {'unit': 'pounds', 'value': 1.15}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 384, 'date_published': '2009-06-30', 'subjects': ['Self-Help', 'Relationships', 'Love & Romance', 'Success', 'Parenting & Relationships', 'Family Relationships', 'Military Families', 'Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies'], 'authors': ['Kimberly Seals-Allers', 'Pamela M. McBride'], 'title': 'The Mocha Manual to Military Life: A Savvy Guide for Wives, Girlfriends, and Female Service Members', 'isbn13': '9780061690488', 'msrp': 14.99, 'binding': 'Paperback', 'related': {'ePub': '0061891371'}, 'isbn': '0061690481', 'isbn10': '0061690481', 'other_isbns': [{'isbn': '9780061891373', 'binding': 'print'}]}}