{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': "In the tradition of Marisa de los Santos and Anne Tyler comes a moving debut about a young mother's year of heartbreak, loss, and forgiveness...and help that arrives from unexpected sources<br/>Four months after her husband's death, Janie LaMarche remains undone by grief and anger. Her mourning is disrupted, however, by the unexpected arrival of a builder with a contract to add a porch onto her house. Stunned, Janie realizes the porch was meant to be a surprise from her husband—now his last gift to her.<br/>As she reluctantly allows construction to begin, Janie clings to the familiar outposts of her sorrow—mothering her two small children with fierce protectiveness, avoiding friends and family, and stewing in a rage she can't release. Yet Janie's self-imposed isolation is breached by a cast of unlikely interventionists: her chattering, ipecac-toting aunt; her bossy, over-manicured neighbor; her muffin-bearing cousin; and even Tug, the contractor with a private grief all his own.<br/>As the porch takes shape, Janie discovers that the unknowable terrain of the future is best navigated with the help of others—even those we least expect to call on, much less learn to love.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/33/99/9780061673399.jpg', 'title_long': 'Shelter Me', 'edition': 'Original', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 0.7 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 0.7}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 415, 'date_published': '2008-12-30', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'TV, Movie, Video Game Adaptations', 'Family Life', 'Friendship', "Women's Fiction", 'Domestic Life', 'Contemporary', 'United States', 'Romance', 'Self Service', 'Custom Stores'], 'authors': ['Juliette Fay'], 'title': 'Shelter Me', 'isbn13': '9780061673399', 'msrp': 14.99, 'binding': 'Paperback', 'related': {'ePub': '0061977829'}, 'isbn': '0061673390', 'isbn10': '0061673390', 'other_isbns': [{'isbn': '9780061977824', 'binding': 'print'}]}}