{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': "Cursed with the ability to hear the thoughts of others, beautiful Angelica Shelton Belanov feels most comfortable when hidden away in the library of her father's English country estate. Now family duty requires that she make an appearance at a glittering gala, mingling with the cream of London society in hopes of finding a suitable husband. Assailed by the unwanted “chatter” of many minds, Angelica finds relief in the company of a handsome aristocratic stranger who remains, refreshingly, an enigma.<br/>But Prince Alexander is not like other men. The powerful leader of an Eastern clan of immortals, he has come to London to hunt down a rogue vampire who threatens the survival of his dwindling kind. Angelica can sense that Alexander is dangerous, a mystery to be unraveled at her own peril. Yet desire sears them both—she, the bewitching telepath, and he, the fearless leader who must learn to trust his heart. And unrestrained passion has strict demands that could cost them both their lives...and their souls.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/32/51/9780061373251.jpg', 'title_long': 'Under the Blood Red Moon', 'edition': '1', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 0.57 Pounds, Width: 0.76 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 0.76}, 'weight': {'unit': 'pounds', 'value': 0.57}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 324, 'date_published': '2008-09-30', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Romance', 'Paranormal', 'Historical', 'Vampires', 'Werewolves & Shifters', 'Science Fiction & Fantasy', 'Fantasy', 'Paranormal & Urban', 'Romantic', 'Self Service', 'Custom Stores'], 'authors': ['Mina Hepsen'], 'title': 'Under the Blood Red Moon', 'isbn13': '9780061373251', 'msrp': 13.95, 'binding': 'Paperback', 'related': {'ePub': '0061982210'}, 'isbn': '0061373257', 'isbn10': '0061373257', 'other_isbns': [{'isbn': '9780061982217', 'binding': 'print'}]}}