{'book': {'publisher': 'Rayo', 'synopsis': 'El camino hacia una vida más sana y llena de energía es tan simple como el té. ¡Descubre sus secretos! El té ha sido reconocido por sus increíbles beneficios para la salud. Puede ayudar a estimular el sistema inmunológico, reducir el colesterol, retrasar el proceso de envejecimiento, reducir el riesgo de la enfermedad cardíaca, el cáncer y mucho más . . . Pero ¿sabías que el té también te puede ayudar a perder peso? La dieta del té utiliza la increíble potencia adelgazante del té en un plan simple para perder peso de manera sana. Sencillamente encuentra un té que te guste, bébelo todo el día, sigue un plan simple de comidas y observa cómo el peso se esfuma de tu cuerpo. En otras palabras, el té reduce tu apetito y estimula tu metabolismo. No te preocupes, no te morirás de hambre con La dieta del té. El plan de comidas incluye sabrosas comidas basadas en el té para el desayuno, el almuerzo y la cena, así como opciones tentadoras para merendar. Todas están deliciosamente hechas con té o sea que tu comida no solo será exquisita, sino que también estarás obteniendo beneficios saludables y adelgazantes en cada bocado que disfrutes. Tomar té―y enfocar tu energía en mantenerte saludable―puede tornarse fácilmente en un nuevo estilo de vida. El camino hacia una vida más sana y llena de energía es tan simplecomo el té. ¡Descubre sus secretos!', 'language': 'es', 'image': 'https://images.isbndb.com/covers/42/47/9780061624247.jpg', 'title_long': 'La dieta del te: Como estimular tu metabolismo, reducir tu apetito y conseguir el cuerpo de tus suenos (Adelante) (Spanish Edition)', 'edition': 'Illustrated', 'dimensions': 'Height: 0.98 Inches, Length: 8.06 Inches, Weight: 0.65 Pounds, Width: 5.26 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.06}, 'width': {'unit': 'inches', 'value': 5.26}, 'weight': {'unit': 'pounds', 'value': 0.65}, 'height': {'unit': 'inches', 'value': 0.98}}, 'pages': 381, 'date_published': '2008-11-25', 'subjects': ['Self-Help', 'Personal Transformation', 'Success', 'Christian Books & Bibles', 'Christian Living', 'Self Help', 'Cookbooks, Food & Wine', 'Special Diet', 'Health, Fitness & Dieting', 'Diets & Weight Loss', 'Other Diets', 'Nutrition', 'Religion & Spirituality'], 'authors': ['Mark Ukra'], 'title': 'La dieta del te: Como estimular tu metabolismo, reducir tu apetito y conseguir el cuerpo de tus suenos (Adelante) (Spanish Edition)', 'isbn13': '9780061624247', 'msrp': 13.99, 'binding': 'Paperback', 'related': {'ePub': '0062238205'}, 'isbn': '0061624241', 'isbn10': '0061624241', 'other_isbns': [{'isbn': '9780062238207', 'binding': 'print'}]}}