{"book": {"publisher": "HarperAudio", "synopsis": "From Bernard Cornwell, the New York Times bestselling author whom the Washington Post calls "perhaps the greatest writer of historical adventure novels today," comes a saga of blood, rage, fidelity, and betrayal. In the ninth and tenth centuries, King Alfred and his heirs fought to secure the survival of the last outpost of Anglo-Saxon culture by battling the ferocious Vikings, whose invading warriors had already captured and occupied three of England\"s four kingdoms.<br/>In A.D. 866, Uhtred, a boy of ten and the son of a nobleman, is captured in the same battle that leaves his father dead. His captor is the Earl Ragnar, a Danish chieftain, who raises the boy as his own, teaching him the Viking ways of war. As a young man expected to partake in raids and bloody massacres of the English, he grapples with divided loyalties, torn between Ragnar, the warrior he loves like a father, and Alfred, whose piety and introspection leave him cold. It takes a terrible slaughter and the unexpected joys of marriage for Uhtred to discover his true allegiance -- and to rise to his greatest challenge.<br/>Performed by Jamie Glover', 'language": "en", "image": "https: //images.isbndb.com/covers/65/74/9780061126574.jpg", "title_long": "The Last Kingdom (The Saxon Chronicles Series #1)", "edition": "5", "dimensions": "Height: 5.82 Inches, Length: 5.3 Inches, Weight: 0.36 Pounds, Width: 0.8 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.3}, "width": {"unit": "inches", "value": 0.8}, "weight": {"unit": "pounds", "value": 0.36}, "height": {"unit": "inches", "value": 5.82}}, "pages": 5, "date_published": "2006-07-25", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Family Saga', 'Historical', 'Contemporary'], 'authors": ["Bernard Cornwell'], 'title": "The Last Kingdom (The Saxon Chronicles Series #1)", "isbn13": "9780061126574", "msrp": 14.95, 'binding": "Audio CD", "isbn": "0061126578", "isbn10": "0061126578"}}