{"book": {"publisher": "Harper", "synopsis": "“Brilliant. . . . A shimmering meditation on the ebb and flow of love.” — New York Times<br/>“In her elegant, sophisticated prose, Dillard tells a tale of intimacy, loss and extraordinary friendship and maturity against a background of nature in its glorious color and caprice. The Maytrees is an intelligent, exquisite novel.” — The Washington Times<br/>Toby Maytree first sees Lou Bigelow on her bicycle in postwar Provincetown, Massachusetts. Her laughter and loveliness catch his breath. Maytree is a Provincetown native, an educated poet of thirty. As he courts Lou, just out of college, her stillness draws him. He hides his serious wooing, and idly shows her his poems.<br/>In spare, elegant prose, Dillard traces the Maytrees" decades of loving and longing. They live cheaply among the nonconformist artists and writers that the bare tip of Cape Cod attracts. When their son Petie appears, their innocent Bohemian friend Deary helps care for him. But years later it is Deary who causes the town to talk.<br/>In this moving novel, Dillard intimately depicts willed bonds of loyalty, friendship, and abiding love. She presents nature"s vastness and nearness. Warm and hopeful, The Maytrees is the surprising capstone of Dillard"s original body of work.', 'language": "en", "image": "https: //images.isbndb.com/covers/95/33/9780061239533.jpg", "title_long": "The Maytrees: A Novel", "edition": "1", "dimensions": "Height: 8.25 Inches, Length: 5.62 Inches, Weight: 0.33 Pounds, Width: 0.87 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.62}, "width": {"unit": "inches", "value": 0.87}, "weight": {"unit": "pounds", "value": 0.33}, "height": {"unit": "inches", "value": 8.25}}, "pages": 216, "date_published": "2007-06-12", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Family Life', 'Women's Fiction', 'Divorce', 'Domestic Life', 'Literary'], 'authors": ["Annie Dillard'], 'title": "The Maytrees: A Novel", "isbn13": "9780061239533", "msrp": 24.95, 'binding": "Hardcover", "isbn": "0061239534", "isbn10": "0061239534"}}