{'book': {'publisher': 'Harper Business', 'synopsis': "Meet the men and women whose deeply personal philanthropy is dramatically changing the way we think about giving<br/>There are 8.6 million millionaires in the United States, and these numbers are set to rise in what will be the biggest intergenerational wealth transfer in history. As $41 trillion dollars (or over three times the national GDP) moves from the World War II generation to their baby- boomer children over the next couple of decades, it will become imperative that the beneficiaries of this wealth—even those not joining the ranks of the superrich—begin thinking about philanthropy, perhaps for the first time in their adult lives. Here they will find the personal journeys of the most successful givers of their generation.<br/>This new generation of wealth has already begun to change the face of philanthropy and to reshape the entire nonprofit sector. In Be the Change, bestselling author Lisa Endlich presents eleven compelling profiles of this twenty-first century generosity. Through candid, revealing, and often surprising interviews, readers will venture into the hearts and minds of the top names in philanthropy today—men and women who have chosen to use their immense riches and influence to meaningfully improve the lives of others in the most dramatic ways. These intimate conversations include in-depth interviews with:<br/>Melinda Gates, one of the driving forces behind the largest philanthropic organization the world has ever seen;<br/>Bob and Suzanne Wright, he's the former vice chairman of GE and longtime head of NBC Universal and their Autism Speaks has brought awareness of autism onto the national and international stage;<br/>Paul Tudor Jones, founder of Tudor Investments and the Robin Hood Foundation;<br/>Peter Bloom, founding chairman of the groundbreaking DonorsChoose.org.<br/>From Connie Duckworth, a former Goldman Sachs partner, who brings steady employment to Afghani women and education to them and their children, to Johann Olav Koss, an Olympic gold medalist who now strives to give children in the direst circumstances the chance to play, these philanthropists demonstrate that giving doesn't begin or end with a signed check. They grant Endlich exclusive access to the stories of how they learned from early failures and developed a personal, sustainable way of giving, and they also share the catalyzing moment when they saw a problem so heartbreaking they simply could not turn away. In doing so, these new philanthropists offer valuable lessons—ones that will inspire readers to start giving, keep giving, and become the change they want to see in the world.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/76/88/9780061287688.jpg', 'title_long': 'Be the Change', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.10231131 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 1.10231131}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 304, 'date_published': '2008-11-25', 'subjects': ['Business & Money', 'Politics & Social Sciences', 'Social Sciences', 'Philanthropy & Charity', 'Social Work', 'Sociology'], 'authors': ['Lisa Endlich'], 'title': 'Be the Change', 'isbn13': '9780061287688', 'msrp': 29.95, 'binding': 'Hardcover', 'related': {'eBook': '0061980056', 'ePub': '0061980056'}, 'isbn': '0061287687', 'isbn10': '0061287687', 'other_isbns': [{'isbn': '9780061980053', 'binding': 'print'}]}}