{'book': {'publisher': 'Harper', 'synopsis': 'Thrust into the media spotlight with her son Sean Wilsey\'s searing portrayal of her in his New York Times bestseller Oh the Glory of It All, the former queen of San Francisco society shares her own candid take on the fascinating events of her life.<br/>Once dubbed San Francisco\'s "Golden Girl," Montandon socialized with the cream of San Francisco society, including Danielle Steel, Alex Haley, and the Gettys. Immortalized as a character in Armistead Maupin\'s Tales of the City, she lived a seemingly perfect life in a penthouse above the San Francisco Bay, complete with her marriage to multimillionaire Al Wilsey and the birth of her son, Sean. From her lavish parties to her legendary Roundtable lunches, Montandon was always the talk of the town.<br/>Then, less than a decade later, Wilsey announced he was divorcing her, and Sean abandoned her as well—both for the affections of her once-close friend, Dede Traina. Left penniless and virtually suicidal, Montandon once again had to reinvent herself, this time as a humanitarian for peace. From Berlin to Beslan, she made it her life\'s mission to give a voice to the world\'s children and spread a message of hope in times of crisis. Oh the Hell of It All is a rich feast of a story: that of a poor girl turned rich turned poor again, in and out of love and betrayed by those closest to her, who has achieved peace in her life through devotion to something outside herself.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/60/60/9780061146060.jpg', 'title_long': 'Oh the Hell of It All: A Memoir', 'edition': 'F First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.1 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.1}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 368, 'date_published': '2007-04-10', 'subjects': ['Biographies & Memoirs', 'Leaders & Notable People', 'Rich & Famous', 'Memoirs'], 'authors': ['Pat Montandon'], 'title': 'Oh the Hell of It All: A Memoir', 'isbn13': '9780061146060', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0061146064', 'isbn10': '0061146064'}}