{'book': {'publisher': 'William Morrow', 'synopsis': 'At 8:15 in the morning, a small commuter plane carrying forty-seven passengers crashes into an apartment building in Granada Hills, California. Shock waves ripple through Los Angeles, as L.A.P.D. Lieutenant Peter Decker works overtime to calm rampant fears of a 9/11-type terror attack. But a grisly mystery lives inside the plane\'s charred and twisted wreckage: the unidentified bodies of four extra travelers. And there is no sign of an airline employee who was supposedly on the catastrophic flight.<br/>Decker and his wife, Rina, have personal reasons for being profoundly shaken by the tragedy, since the "accident" occurred frighteningly close to their daughter Hannah\'s school. Luckily, their child and her schoolmates escaped unscathed. But the fate of the unaccounted-for flight attendant—twenty-eight-year-old Roseanne Dresden—remains a question mark more than a month after the horrific event, when the young woman\'s irate stepfather calls, insisting that she was never onboard the doomed plane. Instead, he claims, she was most likely murdered by her abusive, unfaithful husband. But why, then, was Roseanne\'s name included on the passenger list?<br/>Under intense pressure from the department to come up with answers, Decker launches an investigation that carries him down a path of tragic history, dangerous secrets, and deadly lies—and leads him to the corpse of a three-decades-missing murder victim. And as the jagged pieces slowly fall into place, a frightening picture begins to form: a mind-searing portrait of unimaginable evil that will challenge Decker\'s and Rina\'s own beliefs about guilt and innocence and justice.<br/>Combining relentless suspense with intense, multilayered human drama, The Burnt House is Faye Kellerman at her mesmerizing best.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/73/25/9780061227325.jpg', 'title_long': 'The Burnt House: A Peter Decker/Rina Lazarus Novel (Decker/Lazarus Novels, 16)', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.55 Pounds, Width: 1.37 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.37}, 'weight': {'unit': 'pounds', 'value': 1.55}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 448, 'date_published': '2007-08-07', 'subjects': ['Mystery, Thriller & Suspense', 'Mystery', 'Police Procedurals', 'Thrillers & Suspense', 'Crime', 'Self Service', 'Custom Stores'], 'authors': ['Faye Kellerman'], 'title': 'The Burnt House: A Peter Decker/Rina Lazarus Novel (Decker/Lazarus Novels, 16)', 'isbn13': '9780061227325', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0061227323', 'isbn10': '0061227323'}}