{'book': {'publisher': 'Harper Voyager', 'synopsis': 'Once or twice in a score of years, the realm of science fiction reveals a vision of tomorrow of epic and transforming scope. These are the dreams of the Asimovs, the Heinleins, the Bears, and the Brins. Tony Daniel brilliantly dreamed this future in his groundbreaking Metaplanetary, and now continues with Superluminal. It is a time when individuals take astounding forms and live astonishing lives. But it is also a future at war for humankind\'s very soul.<br/>Civilization has extended itself far into the outer reaches of our solar system -- and in so doing has developed into something remarkable, diverse, and perhaps transcendent. But the inner system -- its worlds connected by a vast network of cables -- is supported by the repression and enslavement of humanity\'s progeny, nanotechnological artificial intelligences.<br/>Now the war for human civilization shifts into high gear. A pogrom against the A.I. "free converts" moves toward a Final Solution, even as the elite super-beings, called LAPs, are co-opted into Napoleon-like Director Amés\'s all-encompassing, all-powerful personality. Superluminal flight is being secretly developed, and with it a weapon that promises utter victory for Amés.<br/>But hope remains alive in the outer system with General Roger Sherman and his Federal Army. From the tattered remnants and fleeing refugees of a dozen moons and asteroids, these contentious, democratically minded warriors have been forged by the fire of battle into an effective and adaptable military force. Given time, the Federal Army stands a fighting chance to beat Amés. But the nanotech-driven war-machine of the Met is in full production, and time is the one commodity the forces of freedom lack.<br/>It is total war for humanity in all its myriad shapes: war between the vast cloudships of the outer system and the deadly armada of the Met; between massive regiments of soldiers equipped with almost unimaginable firepower. Most of all, it is war within the hearts and minds of every human being. For this is the fight that will decide, once and for all, what form -- and which way of life -- humankind will take to the stars.<br/>In Superluminal, Tony Daniel fulfills the promise of his critically acclaimed novel Metaplanetary. With gritty realism, a touch of wry humor, and -- most of all -- with an old-fashioned science fiction sense of wonder firmly in place, Daniel continues his saga of courage, sorrow, and glory brought on by total war for the soul of humanity itself.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/14/32/9780061051432.jpg', 'title_long': 'Superluminal: A Novel of Interplanetary Civil War', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.7 Pounds, Width: 1.45 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.45}, 'weight': {'unit': 'pounds', 'value': 1.7}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 480, 'date_published': '2004-05-11', 'subjects': ['Science Fiction & Fantasy', 'Science Fiction', 'Colonization'], 'authors': ['Tony Daniel'], 'title': 'Superluminal: A Novel of Interplanetary Civil War', 'isbn13': '9780061051432', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0061051438', 'isbn10': '0061051438'}}