{'book': {'publisher': 'William Morrow', 'synopsis': "For the last thirty years, Doug Schoen has been one of the most innovative people in Democratic politics, working behind the scenes as a political strategist for some of the world's most influential and respected politicians.<br/>In The Power of the Vote, Schoen offers a never–before–seen glimpse inside his most pivotal campaigns, illustrating how a kid whose political career began leafleting on New York's Upper West Side became a force that revolutionized the American political process. From the legendary New York City mayoral race of 1977 where he helped Ed Koch claim the throne of New York to his twenty years efforts to modernize Israeli politics to Bill Clinton's reelection campaign in 1996, Schoen takes the reader through the international political landscape of the last thirty years, demonstrating how politics have evolved and how he has utilized the latest technology to help candidates win the hearts and minds of the public.<br/>In addition, Schoen also details his valiant, decade–long struggle to unseat Slobodan Milosevic not with cluster bombs and air power but through diligent campaign strategy and sophisticated polling. Revealing intimate, firsthand details about the ten–year struggle in Serbia, he demonstrates that much of the conflict could have been avoided through United States support of the Serbian political process, while discussing how the most effective nation building comes not with bombs but with ballot boxes.<br/>Despite these successes, it is in his efforts with President Bill Clinton during the mid–1990s that Schoen finds his most important and ultimately successful work. Helping to reshape President Clinton's image in the wake of the Republican victories in the 1994 mid–term elections, Schoen molds the Clinton's positions anew, giving him a second life as a centrist Democrat, ensuring his reelection in 1996, and placing President Clinton within the pantheon of Democratic greats.<br/>Complete with a discussion of the strategies and tactics that will lead the Democrats back to the White House in 2008, The Power of the Vote is a true insider's tale from one of Washington's most successful and cherished personalities.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/18/89/9780061231889.jpg', 'title_long': 'The Power of the Vote: Electing Presidents, Overthrowing Dictators, and Promoting Democracy Around the World', 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 6 Inches, Weight: 1.35 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 1.35}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 416, 'date_published': '2007-04-10', 'subjects': ['Politics & Social Sciences', 'Politics & Government', 'Ideologies & Doctrines', 'International & World Politics', 'Elections & Political Process'], 'authors': ['Douglas E. Schoen'], 'title': 'The Power of the Vote: Electing Presidents, Overthrowing Dictators, and Promoting Democracy Around the World', 'isbn13': '9780061231889', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0061231886', 'isbn10': '0061231886'}}