{'book': {'publisher': 'William Morrow', 'synopsis': '“Christopher Moore is a very sick man, in the very best sense of that word.”<br/>—Carl Hiassen<br/>“[Moore’s novels] deftly blend surreal, occult, and even science-fiction doings with laugh-out-loud satire of contemporary culture.”<br/>—Washington Post<br/>“If there’s a funnier writer out there, step forward.”<br/>—Playboy<br/>Absolutely nothing is sacred to Christopher Moore. The phenomenally popular, New York Times bestselling satirist whom the Atlanta Journal-Constitution calls, “Stephen King with a whoopee cushion and a double-espresso imagination” has already lampooned Shakespeare, San Francisco vampires, marine biologists, Death…even Jesus Christ and Santa Claus! Now, in his latest masterpiece, Sacré Bleu, the immortal Moore takes on the Great French Masters. A magnificent “Comedy d’Art” from the author of Lamb, Fool, and Bite Me, Moore’s Sacré Bleu is part mystery, part history (sort of), part love story, and wholly hilarious as it follows a young baker-painter as he joins the dapper Henri Toulouse-Lautrec on a quest to unravel the mystery behind the supposed “suicide” of Vincent van Gogh.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/97/49/9780061779749.jpg', 'title_long': "Sacre Bleu: A Comedy d'Art", 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.65 Pounds, Width: 1.41 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.41}, 'weight': {'unit': 'pounds', 'value': 1.65}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 416, 'date_published': '2012-04-03', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'Feel-Good', 'United States', 'Humor', 'Humor & Satire', 'Humorous', 'Mystery, Thriller & Suspense', 'Mystery', 'Romance', 'Romantic Comedy'], 'authors': ['Christopher Moore'], 'title': "Sacre Bleu: A Comedy d'Art", 'isbn13': '9780061779749', 'msrp': 26.99, 'binding': 'Hardcover', 'isbn': '0061779741', 'isbn10': '0061779741'}}