{"book": {"publisher": "William Morrow", "synopsis": "Now available with a contemporary look, a must-have collection of riveting short stories from the New York Times bestselling author of Mystic River and Shutter Island.<br/>“Locations are vivid and crisp, characters are memorable and, most importantly, the story lines dig into you and leave their mark.” —Boston Herald<br/>When it comes to contemporary crime fiction there’s no territory quite as dangerous and unpredictable as that of New York Times bestselling author Dennis Lehane. These five short stories and a play are Lehane at his visceral best.<br/>In “Running Out of Dog,” a vet returning from Vietnam is asked to redirect the violent skills he learned overseas to deal with his hometown’s rampant population of strays. “ICU” follows a hunted man who finds refuge in the oddest place imaginable. Surprises await a gang of Texas high-school football jocks who lay siege to a luxury home in the suburbs in “Gone Down to Corpus.” And in “Mushrooms,” a simple theft triggers a series of murders that forces a disillusioned young girl to consider her next move. This collection also includes “Until Gwen” and its stage adaptation, Coronado, which expands on the trenchant tale of a morally bankrupt conman father, his ill-fated son, and the woman they have in common.<br/>In Lehane’s capable hands, each story faces unflinchingly the darkest depths of the human experience—sin and redemption, loss and longing, flesh and blood—delivering a knockout punch that’ll have readers reeling.", "language": "en", "image": "https: //images.isbndb.com/covers/96/73/9780061139673.jpg", "title_long": "Coronado: Stories", "edition": "First Edition", "dimensions": "Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.9 Pounds, Width: 0.91 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.91}, "weight": {"unit": "pounds", "value": 0.9}, "height": {"unit": "inches", "value": 8.25}}, "pages": 240, "date_published": "2006-08-08", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Short Stories & Anthologies', 'Anthologies', 'Short Stories', 'United States', 'Literary', 'Mystery, Thriller & Suspense', 'Mystery', 'Cozy', 'Self Service', 'Custom Stores'], 'authors": ['Dennis Lehane'], 'title": "Coronado: Stories", "isbn13": "9780061139673", "msrp": "0.00", "binding": "Hardcover", "isbn": "006113967X", "isbn10": "006113967X"}}