{'book': {'publisher': 'William Morrow', 'synopsis': "Finding your place in the world can be the longest trip home… In the highly anticipated follow-up to Marley & Me, John Grogan again works his magic, bringing us the story of what came first. Before there was Marley, there was a gleefully mischievous boy growing up in a devout Catholic home outside Detroit in the 1960s and '70s. Despite his loving parents' best efforts, John's attempts to meet their expectations failed spectacularly. Whether it was his disastrous first confession, the purloined swigs of sacramental wine, or the fumbled attempts to sneak contraband past his father, John was figuring out that the faith and fervor that came so effortlessly to his parents somehow had eluded him. And then one day, a strong-willed young woman named Jenny walked into his life. As their love grew, John began the painful, funny, and poignant journey into adulthood -- away from his parents' orbit and into a life of his own. It would take a fateful call and the onset of illness to lead him on the final leg of his journey -- the trip home again. With his trademark blend of humor and pathos that made Marley & Me beloved by millions, John Grogan traces the universal journey each of us must take to find our unique place in the world. Filled with revelation and laugh-out-loud humor, The Longest Trip Home will capture your heart -- but mostly it will make you want to reach out to those you love most.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/32/48/9780061713248.jpg', 'title_long': 'The Longest Trip Home: A Memoir', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.1 Pounds, Width: 1.13 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.13}, 'weight': {'unit': 'pounds', 'value': 1.1}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 352, 'date_published': '2008-10-21', 'subjects': ['Self-Help', 'Happiness', 'Personal Transformation', 'Self-Esteem', 'Biographies & Memoirs', 'Community & Culture', 'Women', 'Memoirs', 'Self Service', 'Custom Stores'], 'authors': ['John Grogan'], 'title': 'The Longest Trip Home: A Memoir', 'isbn13': '9780061713248', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0061713244', 'isbn10': '0061713244'}}