{'book': {'publisher': 'William Morrow', 'synopsis': "In New York's Long Island, in the unpredictable decade of the 1960s, a young boy laments the approaching close of summer and the advent of sixth grade. Growing up in a household with an overworked father whom he rarely sees, an alcoholic mother who paints wonderful canvases that are never displayed, an older brother who serves as both tormentor and protector, and a younger sister who inhabits her own secret world, the boy takes his amusements where he can find them. Some of his free time is spent in the basement of the family's modest home, where he and his brother, Jim, have created Botch Town, a detailed cardboard replica of their community, complete with clay figurines representing friends and neighbors. And so the time passes with a not-always-reassuring sameness—until the night a prowler is reported stalking the neighborhood.<br/>Appointing themselves ad hoc investigators, the brothers set out to aid the police—while their little sister, Mary, smokes cigarettes, speaks in other voices, inhabits alternate personas . . . and, unbeknownst to her older siblings, moves around the inanimate residents of Botch Town. But ensuing events add a shadowy cast to the boys' night games: disappearances, deaths, and spectral sightings capped off by the arrival of a sinister man in a long white car trawling the neighborhood after dark. Strangest of all is the inescapable fact that every one of these troubling occurrences seems to correspond directly to the changes little Mary has made to the miniature town in the basement.<br/>Not since Ray Bradbury's classic Dandelion Wine has a novel so richly evoked the dark magic of small-town boyhood. At once a hypnotically compelling mystery, a masterful re-creation of a unique time and place, a celebration of youth, and a poignant and disquieting portrait of home and family—all balancing on a razor's edge separating reality from the unsettlingly remarkable—The Shadow Year is a monumental new work from one of contemporary fiction's most fearless and inventive artists.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/15/20/9780061231520.jpg', 'title_long': 'The Shadow Year: A Novel', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.9 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 304, 'date_published': '2008-03-11', 'subjects': ['Literature & Fiction', 'United States'], 'authors': ['Jeffrey Ford'], 'title': 'The Shadow Year: A Novel', 'isbn13': '9780061231520', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0061231525', 'isbn10': '0061231525'}}