{'book': {'publisher': 'William Morrow', 'synopsis': '"To be a parent is and should be a calling. There is absolutely nothing as great, challenging, or rewarding as raising a child." So says Über-mom Rose Rock, who has raised 10 children in addition to caring for 17 foster children in her 40-plus years as a mother.<br/>As a mother who does not shy away from the hard conversations, Rose isn\'t afraid to present strong ideas about boundaries, discipline, choices, and consequences—and she tells it like it is. In Mama Rock\'s Rules, Rose shares the funny and highly practical lessons she learned both as a parent and an educator, while offering strategies for teaching a child to be self-reliant in this world.<br/>Written with a kicky blend of maternal spirituality and a "don\'t mess with me or you won\'t get old" sense of authority, the book spotlights 10 vital rules, each tackling a specific parenting issue. From "I Am Your Mama, Not Your Friend," which helps parents regain their authority and establish respectful relationships with their children, to "Don\'t Lie Down with Anything You Don\'t Want to Live with Forever," which takes a different approach to the often tricky conversation about sex, each topic is lovingly explained and bolstered by stories from Rose Rock\'s own childhood and parenting experiences. We will also hear from her own kids, as they share memories and anecdotes about what it was like to grow up in the Rock household.<br/>Rose\'s heartfelt and no-nonsense advice—delivered with a dose of wit and homespun humor—will resonate with thousands of parents and will inspire them to teach their kids right, whether their brood is one child or ten.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/61/20/9780061536120.jpg', 'title_long': "Mama Rock's Rules: Ten Lessons for Raising a Houseful of Successful Children", 'dimensions': 'Height: 8 Inches, Length: 6 Inches, Weight: 0.87964442538 Pounds, Width: 0.89 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.89}, 'weight': {'unit': 'pounds', 'value': 0.87964442538}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 256, 'date_published': '2008-04-08', 'subjects': ['Health, Fitness & Dieting', 'Parenting & Relationships', 'Adoption', 'Family Relationships', 'Motherhood', 'Parenting', 'Parenting Girls'], 'authors': ['Rose Rock', 'Valerie Graham'], 'title': "Mama Rock's Rules: Ten Lessons for Raising a Houseful of Successful Children", 'isbn13': '9780061536120', 'msrp': 22.95, 'binding': 'Hardcover', 'isbn': '0061536121', 'isbn10': '0061536121'}}