{'book': {'publisher': 'Smithsonian', 'synopsis': 'In The Kennedys Amidst the Gathering Storm, Will Swift presents a fresh, empathetic interpretation of the ambassadorship of Joseph Kennedy and explores the intricate, often shifting relationships among Kennedy, Chamberlain, Churchill, and, of course, Roosevelt.<br/>Arriving in London in early 1938, the Irish-Catholic Kennedys were welcomed by politicians, aristocrats, and intellectuals, all eager to court America. They finally appeared to have overcome their lifelong status as outsiders. From 1938 to 1940, the Kennedys crystallized their identity as protagonists on the world stage, making public the competitive and clannish intrafamily dynamics that would fuel their mythic rise to power. They all learned from their father\'s successes—and failures. The older children—Joe Jr., Jack, and Kathleen—took an active part in England\'s glittering, "last fling before the bombs fall" society, but all nine children charmed, their every move chronicled by the British and American media. John F. Kennedy\'s path to the White House began in London. As his father\'s political fortunes dimmed, Jack published a best-selling book and his star rose.<br/>Drawing on recently released Kennedy family archives, Joseph P. Kennedy\'s private papers, and using rare photographs of English society and the photogenic Kennedy clan, Dr. Swift, with penetrating psychological insight, brings to life this fascinating family during a dramatic one thousand day period.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/35/61/9780061173561.jpg', 'title_long': 'The Kennedys Amidst the Gathering Storm: A Thousand Days in London, 1938-1940', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.55 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.55}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 400, 'date_published': '2008-04-29', 'subjects': ['Biographies & Memoirs', 'Leaders & Notable People', 'Political', 'History', 'Europe', 'Great Britain', 'World'], 'authors': ['Will Swift'], 'title': 'The Kennedys Amidst the Gathering Storm: A Thousand Days in London, 1938-1940', 'isbn13': '9780061173561', 'msrp': 26.95, 'binding': 'Hardcover', 'related': {'eBook': '0061860239', 'ePub': '0061860239'}, 'isbn': '0061173568', 'isbn10': '0061173568', 'other_isbns': [{'isbn': '9780061860232', 'binding': 'print'}]}}