{'book': {'publisher': 'Ecco', 'synopsis': '<p>Vollmann is a relentlessly curious, endlessly sensitive, and unequivocally adventurous examiner of human existence. He has investigated the causes and symptoms of humanity\'s obsession with violence (Rising Up and Rising Down), taken a personal look into the hearts and minds of the world\'s poorest inhabitants (Poor People), and now turns his attentions to America itself, to our romanticizing of "freedom" and the ways in which we restrict the very freedoms we profess to admire.</p><br/><p>For Riding Toward Everywhere, Vollmann himself takes to the rails. His main accomplice is Steve, a captivating fellow trainhopper who expertly accompanies him through the secretive waters of this particular way of life. Vollmann describes the thrill and terror of lying in a trainyard in the dark, avoiding the flickering flashlights of the railroad bulls; the shockingly, gorgeously wild scenery of the American West as seen from a grainer platform; the complicated considerations involved in trying to hop on and off a moving train. It\'s a dangerous, thrilling, evocative examination of this underground lifestyle, and it is, without a doubt, one of Vollmann\'s most hauntingly beautiful narratives.</p><br/><p>Questioning anything and everything, subjecting both our national romance and our skepticism about hobo life to his finely tuned, analytical eye and the reality of what he actually sees, Vollmann carries on in the tradition of Huckleberry Finn, providing a moving portrait of this strikingly modern vision of the American dream.</p>', 'language': 'en', 'image': 'https://images.isbndb.com/covers/67/52/9780061256752.jpg', 'title_long': 'Riding Toward Everywhere', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 1 Pounds, Width: 1.04121 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.04121}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 288, 'date_published': '2008', 'subjects': ['Engineering & Transportation', 'Transportation', 'Railroads', 'Travel', 'Travel Writing', 'Food, Lodging & Transportation', 'Railroad Travel', 'Politics & Social Sciences', 'Social Sciences'], 'authors': ['William T. Vollmann'], 'title': 'Riding Toward Everywhere', 'isbn13': '9780061256752', 'msrp': 26.95, 'binding': 'Hardcover', 'isbn': '0061256757', 'isbn10': '0061256757'}}