{'book': {'publisher': 'William Morrow', 'synopsis': '“Steve Martini ranks among the top authors of legal thrillers.”<br/>—Pittsburgh Post-Gazette<br/>“You like Law & Order? Or even a John Grisham novel? Well, Steve Martini is one of the best of the best when it comes to crime thrillers.”<br/>—Asbury Park Press<br/>The reasons why Steve Martini is one of the most popular thriller writers around are abundantly clear in Trader of Secrets: an ingenious plot, great characters, gripping storytelling that combines the legal expertise of John Lescroart, Brad Meltzer, and Scott Turow with the heart-pounding political intrigue of Vince Flynn and Brad Thor. Superstar crime novelist Linda Fairstein says, “Take it from a prosecutor—Steve Martini has created one of the most charismatic defense attorneys in thriller fiction,” referring to Martini’s fearless yet very human series protagonist, defense attorney Paul Madriani. In Trader of Secrets the crusading lawyer is on the trail of dangerous criminals who are trying to steal state-of-the-art weapons technology…with nothing less than the future of America at stake.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/02/32/9780061930232.jpg', 'title_long': 'Trader of Secrets: A Paul Madriani Novel', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.3 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.3}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 392, 'date_published': '2011-05-31', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'United States', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Legal', 'Spies & Politics', 'Suspense', 'Crime', 'Self Service', 'Custom Stores'], 'authors': ['Steve Martini'], 'title': 'Trader of Secrets: A Paul Madriani Novel', 'isbn13': '9780061930232', 'msrp': 26.99, 'binding': 'Hardcover', 'isbn': '0061930237', 'isbn10': '0061930237'}}