{'book': {'publisher': 'William Morrow', 'synopsis': 'The luminous true story of a friendship that shed the boundaries of the doctor-patient relationship and became less a confrontation with death than a celebration of the joys of life<br/>When young gynecologic oncology fellow Lois Ramondetta was first summoned to the room of a new patient, neither she nor the forty-nine-year-old professor of religion she encountered named Deborah Sills thought they had much in common. They certainly had no idea that they were about to embark on a transcendent odyssey that would become a soul-deep friendship. Now their heartfelt story, The Light Within, follows these two women through a decade of friendship and "big lives"—husbands, children, friends, and careers—ultimately crossing the country and traveling to foreign lands, where they spoke and wrote together about the intersection of doctors, patients, and spirituality. Both women searched together and openly for answers with honesty and intimacy until Deborah passed away in the spring of 2006.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/94/15/9780061359415.jpg', 'title_long': 'The Light Within: The Extraordinary Friendship of a Doctor and Patient Brought Together by Cancer', 'edition': '1', 'dimensions': 'Height: 8.5 Inches, Length: 6 Inches, Weight: 0.95 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.95}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 272, 'date_published': '2008-05-13', 'subjects': ['Biographies & Memoirs', 'Memoirs'], 'authors': ['Lois M. Ramondetta', 'Deborah Sills'], 'title': 'The Light Within: The Extraordinary Friendship of a Doctor and Patient Brought Together by Cancer', 'isbn13': '9780061359415', 'msrp': 24.95, 'binding': 'Hardcover', 'related': {'ePub': '0061732699'}, 'isbn': '0061359416', 'isbn10': '0061359416', 'other_isbns': [{'isbn': '9780061732690', 'binding': 'print'}]}}