{'book': {'publisher': 'HarperCollins', 'synopsis': "Read and find out about why it's so important to decrease our dependence on oil in this colorfully illustrated nonfiction picture book.<br/>Look around to see what uses oil—cars, airplanes, boats, factories, and countless other machines. The world is dependent on oil as its main source of energy. Although oil is plentiful right now, the supply will eventually run out, and even worse, burning oil is very damaging to the environment. What alternatives can help us use less oil and how can we protect the environment?<br/>This is a clear and appealing science book for early elementary age kids, both at home and in the classroom. It's a Level 2 Let's-Read-and-Find-Out, which means the book explores more challenging concepts for children in the primary grades. The 100+ titles in this leading nonfiction series are: hands-on and visual acclaimed and trusted great for classrooms<br/>Top 10 reasons to love LRFOs: Entertain and educate at the same time Have appealing, child-centered topics Developmentally appropriate for emerging readers Focused; answering questions instead of using survey approach Employ engaging picture book quality illustrations Use simple charts and graphics to improve visual literacy skills Feature hands-on activities to engage young scientists Meet national science education standards Written/illustrated by award-winning authors/illustrators & vetted by an expert in the field Over 130 titles in print, meeting a wide range of kids' scientific interests<br/>Books in this series support the Common Core Learning Standards, Next Generation Science Standards, and the Science, Technology, Engineering, and Math (STEM) standards. Let's-Read-and-Find-Out is the winner of the American Association for the Advancement of Science/Subaru Science Books & Films Prize for Outstanding Science Series.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/52/80/9780061575280.jpg', 'title_long': "What's So Bad About Gasoline?: Fossil Fuels and What They Do (Let's-Read-and-Find-Out Science 2)", 'dimensions': 'Height: 8.2 Inches, Length: 10.38 Inches, Weight: 0.8 Pounds, Width: 0.38 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 10.38}, 'width': {'unit': 'inches', 'value': 0.38}, 'weight': {'unit': 'pounds', 'value': 0.8}, 'height': {'unit': 'inches', 'value': 8.2}}, 'pages': 40, 'date_published': '2009-02-17', 'subjects': ["Children's Books", 'Science, Nature & How It Works', 'Earth Sciences', 'How Things Work', 'Nature', 'Recycling & Green Living'], 'authors': ['Anne Rockwell'], 'title': "What's So Bad About Gasoline?: Fossil Fuels and What They Do (Let's-Read-and-Find-Out Science 2)", 'isbn13': '9780061575280', 'msrp': 16.99, 'binding': 'Hardcover', 'isbn': '0061575283', 'isbn10': '0061575283'}}