{'book': {'publisher': 'Amistad', 'synopsis': "In the instant number one New York Times bestseller Act Like a Lady, Think Like a Man, Steve Harvey gave millions of women around the globe insight into what men really think about love, intimacy, and commitment. In his new book he zeros in on what motivates men and provides tips on how women can use that knowledge to get more of what they need out of their relationships, whether it's more help around the house, more of the right kind of attention in the bedroom, more money in the joint bank account, or more truth when it comes to the hard questions, such as: Are you committed to building a future together? Does my success intimidate you? Have you cheated on me?<br/>In Straight Talk, No Chaser: How to Find, Keep, and Understand a Man, Steve Harvey shares information on:<br/>- How to Get the Truth Out of Your Man<br/>Tired of answers that are deceptive? Harvey lays out a three-tier, CIA-style of questioning that will leave your man no choice but to cut to the chase and deliver the truth.<br/>- Dating Tips, Decade by Decade<br/>Whether you're in your twenties and just starting to date seriously, in your thirties and feeling the tick of the biological clock, or in your forties and beyond, Steve provides insight into what a man, in each decade of his life, is looking for in a mate.<br/>- How to Minimize Nagging and Maximize Harmony at Home<br/>He said he'd cut the lawn on Saturday, and you may have been within reason to think that that meant Saturday before ten in the evening, but exploding at him is only going to ruin the mood for everyone, which means no romance. Steve shows you how to talk to your man in a way that moves him to action and keeps the peace.<br/>And there's much more, including Steve's candid answers to questions you've always wanted to ask men.<br/>Drawing on a lifetime of experience and the feedback women have shared with him in reaction to Act Like a Lady, Think Like a Man, Harvey offers wisdom on a wealth of topics relevant to both sexes today. He also gets more personal, sharing anecdotes from his own family history. Always direct, often funny, and incredibly perceptive, media personality, comedian, philanthropist, and (finally) happily married husband, Steve Harvey proves once again that he is the king of relationships.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/89/90/9780061728990.jpg', 'title_long': 'Straight Talk, No Chaser: How to Find, Keep, and Understand a Man', 'edition': 'First Edition', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.80027801106 Pounds, Width: 0.89 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.89}, 'weight': {'unit': 'pounds', 'value': 0.80027801106}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 237, 'date_published': '2010-12-07', 'subjects': ['Self-Help', 'Relationships', 'Love & Romance', 'Marriage', 'Happiness', 'Personal Transformation'], 'authors': ['Steve Harvey'], 'title': 'Straight Talk, No Chaser: How to Find, Keep, and Understand a Man', 'isbn13': '9780061728990', 'msrp': 24.99, 'binding': 'Hardcover', 'isbn': '0061728993', 'isbn10': '0061728993'}}