{'book': {'publisher': 'William Morrow', 'synopsis': "Transform Your Workplace!<br/>Imagine a company where people are excited about coming to work and giving their best efforts every day. In this innovative and engrossing business parable, Harry Paul and Ross Reck show managers at all levels how they can immediately and easily increase productivity by tapping into the discretionary effort of the people who work for them. Starting from the most basic aspect of business reality—that people intentionally regulate the amount of effort they put into their jobs based upon how they feel they're being treated—the authors point out that the most important part of the job of every manager, team leader, supervisor, and executive is to treat people in such a way that they become excited about applying all their discretionary effort toward performing their jobs.<br/>At the book's center is the story of Nancy Kim, a human resources director at a magazine that is struggling with all the problems associated with unhappy employees—low productivity and morale along with high absenteeism and turnover. After she openly challenges the CEO's new management-by-the-numbers system, she's charged with turning the situation around immediately. Filled with real-world studies, Instant Turnaround! shows anyone how to turn the workplace into a destination—a place where working hard feels like hardly working because it's engaging, enjoyable, and fulfilling.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/04/29/9780061730429.jpg', 'title_long': 'Instant Turnaround!: Getting People Excited About Coming to Work and Working Hard', 'edition': 'First Edition', 'dimensions': 'Height: 8.5 Inches, Length: 5.75 Inches, Weight: 0.7 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.7}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 176, 'date_published': '2009-04-21', 'subjects': ['Business & Money', 'Management & Leadership', 'Management', 'Motivational', 'Human Resources', 'Human Resources & Personnel Management'], 'authors': ['Harry Paul', 'Ross Reck'], 'title': 'Instant Turnaround!: Getting People Excited About Coming to Work and Working Hard', 'isbn13': '9780061730429', 'msrp': 17.75, 'binding': 'Hardcover', 'related': {'eBook': '0061865125', 'ePub': '0061865125'}, 'isbn': '0061730424', 'isbn10': '0061730424', 'other_isbns': [{'isbn': '9780061865121', 'binding': 'print'}]}}