{'book': {'publisher': 'William Morrow', 'synopsis': 'From the executive director of the ACLU, Anthony D. Romero, and award-winning journalist Dina Temple-Raston, In Defense of Our America takes a critical look at civil liberties in this country at a time when constitutional freedoms are in peril. Using the stories of real Americans on the frontlines of the fight for civil liberties., In Defense of Our America provides a look at the dangerous erosion of the Bill of Rights in the age of terror.<br/>Against the backdrop of post-9/11 America, readers are taken behind the scenes of some of the most important civil liberties cases in America. From the story of the "American Taliban" to the battle against the National Security Agency\'s warrantless spying program, In Defense of Our America tracks a roster of skirmishes in the larger fight for civil liberties in this country. It tracks an effort in Pennsylvania to force religion into the public school science curriculum and tells the story of South Dakota\'s attempts to place an outright ban on abortions in the state.<br/>In a narrative that allows the characters to tell the story, In Defense of Our America offers the first inside look at the Lindh family as they saw their son and brother, John Walker Lindh, emerge as a symbol of America\'s battle against Islamic fundamentalism. It follows Joshua Dratel, a defense attorney at the center of many legal battles over the rights of individuals suspected of terrorism, and tells the story of a modern-day Scopes trial in Dover, Pennsylvania. The book tracks the case of Matthew Limon, a gay teenager sentenced to 17 years for having consensual oral sex with a younger teenage boy in Kansas, and looks behind the reports of a broken judicial system in New Orleans after Hurricane Katrina.<br/>In Defense of Our America chronicles the stories of an array of colorful characters to illustrate the state of play in today\'s fight for civil liberties, including Cecelia Fire Thunder, the Sioux president who wanted to open an abortion clinic on her South Dakota reservation, and high school science teacher Bertha Spahr who defied a school board dominated by fundamentalist Christians by taking a stand against "intelligent design."<br/>With unparalleled access to key players in some of the landmark tests of the Constitution and the Bill of Rights, In Defense of Our America weaves together a compelling narrative that provides an unusually full look at the fight for civil liberties as Americans struggle to protect their rights and ensure their security.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/25/67/9780061142567.jpg', 'title_long': 'In Defense of Our America: The Fight for Civil Liberties in the Age of Terror', 'dimensions': 'Height: 9.25 Inches, Length: 6.5 Inches, Weight: 1.1 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.1}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 272, 'date_published': '2007-05-22', 'subjects': ['History', 'Americas', 'United States', 'Politics & Social Sciences', 'Politics & Government', 'Political Science', 'Specific Topics'], 'authors': ['Anthony D Romero', 'Dina Temple-Raston'], 'title': 'In Defense of Our America: The Fight for Civil Liberties in the Age of Terror', 'isbn13': '9780061142567', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0061142565', 'isbn10': '0061142565'}}