{'book': {'publisher': 'Rayo', 'synopsis': '¡La bulldog llamada Noelle regresa con otra mágica y misteriosa aventura! Esta vez está de vacaciones con su familia en la exótica Costa del Tesoro de Florida cuando recibe una emocionante noticia: ¡Hay un antiguo barco pirata con un gran tesoro enterrado en la arena! Noelle está ansiosa por encontrarlo. En esta animada aventura, la perrita se hace amiga de un áspero pero encantador cangrejo y otros nuevos y misteriosos animales. Pero aún más importante, ella descubre el "verdadero" tesoro enterrado en la Costa del Tesoro.<br/>Gloria Estefan, la famosa cantautora ganadora de cinco premios Grammy® y autora del best seller del New York Times Las Mágicas y Misteriosas Aventuras de una Bulldog Llamada Noelle, nos vuelve a traer a su perrita Noelle junto con algunos de sus amigos para compartir la diversión. Las brillantes ilustraciones de Michael Garland complementan perfectamente los divertidos y poéticos versos de la autora. En este cuento tierno, gracioso y lleno de vida, Noelle nos enseña que los tesoros verdaderos a veces se encuentran en los sitios más inesperados.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/61/61/9780061126161.jpg', 'title_long': 'El Tesoro de Noelle: Una Nueva Magica y Misteriosa Aventura (Spanish Edition)', 'edition': 'Har/Com', 'dimensions': 'Height: 10 Inches, Length: 10 Inches, Weight: 1 Pounds, Width: 0.322072 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 10}, 'width': {'unit': 'inches', 'value': 0.322072}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 10}}, 'pages': 32, 'date_published': '2006-10-10', 'subjects': ["Children's Books", 'Animals', 'Dogs', 'Literature & Fiction', 'Education & Reference', 'Action & Adventure', 'Geography & Cultures', 'Multicultural Stories'], 'authors': ['Gloria Estefan', 'Michael Garland'], 'title': 'El Tesoro de Noelle: Una Nueva Magica y Misteriosa Aventura (Spanish Edition)', 'isbn13': '9780061126161', 'msrp': 17.95, 'binding': 'Hardcover', 'isbn': '0061126160', 'isbn10': '0061126160'}}