{'book': {'publisher': 'William Morrow', 'synopsis': 'After learning to play guitar at the age of ten, Shawn Colvin was determined to make a life in music—a decision that would send a small-town girl out on the open road for good. In 1997, two decades after she started, she got her big break. Like the troubled would-be arsonist and survivor of her smash hit "Sunny Came Home," Colvin knows a thing or two about heartache—and setting fires. Diamond in the Rough recounts this passionate musician\'s coming-of-age, from the prairies of South Dakota to the dark smoky bars in Austin, Texas, to the world stage at the Grammys.<br/>Humorous and deeply honest, Colvin relates the experiences behind her best-loved songs in vivid color in this memoir. Diamond in the Rough captures her years of touring cross-country in bands and vans full of guys; falling in and out of love; meeting heroes like Joni Mitchell; searching for her musical identity; and making friendships that would last a lifetime. It is also an unflinching account of Colvin\'s struggles—weathering addiction and depression, learning to care for not only herself but also a child—and, always, channeling those experiences into song.<br/>With the wit, lyricism, and empathy that have characterized Colvin\'s performances and inspired audiences worldwide, Diamond in the Rough looks back over a rich lifetime of highs and lows with stunning insight and candor. In its pages, we witness the inspiring story of a woman honing her artistry, finding her voice, and making herself whole.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/95/98/9780061759598.jpg', 'title_long': 'Diamond in the Rough: A Memoir', 'edition': 'Illustrated', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.84657508608 Pounds, Width: 0.85 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.85}, 'weight': {'unit': 'pounds', 'value': 0.84657508608}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 240, 'date_published': '2012-06-05', 'subjects': ['Self-Help', 'Personal Transformation', 'Biographies & Memoirs', 'Arts & Literature', 'Actors & Entertainers', 'Composers & Musicians', 'Community & Culture', 'Women', 'Memoirs', 'Humor & Entertainment'], 'authors': ['Shawn Colvin'], 'title': 'Diamond in the Rough: A Memoir', 'isbn13': '9780061759598', 'msrp': 25.99, 'binding': 'Hardcover', 'isbn': '0061759597', 'isbn10': '0061759597'}}