{'book': {'publisher': 'Ecco', 'synopsis': 'The year is 1929, and newlyweds George and Serena Pemberton travel from Boston to the North Carolina mountains where they plan to create a timber empire. Although George has already lived in the camp long enough to father an illegitimate child, Serena is new to the mountains – but she soon shows herself to be the equal of any man, overseeing crews, hunting rattlesnakes, even saving her husband’s life in the wilderness. Together this lord and lady of the woodlands ruthlessly kill or vanquish all who fall out of favor. Yet when Serena learns that she will never bear a child, she sets out to murder the son George fathered without her. Mother and child begin a struggle for their lives, and when Serena suspects George is protecting his illegitimate family, the Pembertons’ intense, passionate marriage starts to unravel as the story moves toward its shocking reckoning. Rash’s masterful balance of violence and beauty yields a riveting novel that, at its core, tells of love both honored and betrayed. “Serena catapults Ron Rash to the front ranks of the best American novelists.” – Pat Conroy “A complex and compelling study of human greed and the grimmest of lusts – that for wealth and power...An epic achievement.” – Jeffrey Lent, bestselling author of In the Fall.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/08/51/9780061470851.jpg', 'title_long': 'Serena: A Novel', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6.12 Inches, Weight: 1.3 Pounds, Width: 1.21 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.12}, 'width': {'unit': 'inches', 'value': 1.21}, 'weight': {'unit': 'pounds', 'value': 1.3}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 384, 'date_published': '2008-10-07', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'United States', 'Literary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Psychological Thrillers', 'Self Service', 'Custom Stores'], 'authors': ['Ron Rash'], 'title': 'Serena: A Novel', 'isbn13': '9780061470851', 'msrp': 24.99, 'binding': 'Hardcover', 'isbn': '0061470856', 'isbn10': '0061470856'}}