{'book': {'publisher': 'William Morrow', 'synopsis': "Travel writer Poke Rafferty is ready to let go of his Looking for Trouble series of travel books and the dangerous lifestyle that goes with it, and settle down in Bangkok with his fiancée, Rose, and his newly adopted daughter, Miaow. But trouble isn't ready to let go of Poke. Enter the one person Poke least wants to see in the entire world—a person whose emotional hold on Poke is absolute. With him come a box of rubies, a wad of fraudulent identity papers, and—in pursuit of those things—one of the most dangerous gangsters in China.<br/>Add to that Rose's innocent involvement in a North Korean counterfeiting operation and an off-the-tracks agent of the American Secret Service who's dying to put Poke behind bars, and Poke and his family find themselves in a complicated and potentially deadly situation. Getting them all out alive will take every skill Poke has.<br/>Once again, Hallinan has created a complex, emotionally satisfying thriller with edge-of-your-seat suspense and a cast of characters so real you'll feel you know them. Sharp as a razor and full of heart-pounding surprises, The Fourth Watcher firmly establishes Hallinan as a brilliant new voice in the world of suspense.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/72/54/9780061257254.jpg', 'title_long': 'The Fourth Watcher: A Novel of Bangkok', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.5 Inches, Weight: 1.15 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.15}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 320, 'date_published': '2008-06-24', 'subjects': ['Literature & Fiction', 'United States', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense'], 'authors': ['Timothy Hallinan'], 'title': 'The Fourth Watcher: A Novel of Bangkok', 'isbn13': '9780061257254', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0061257257', 'isbn10': '0061257257'}}