{'book': {'publisher': 'Ecco', 'synopsis': 'Senator Chuck Hagel has long been admired by his colleagues on both sides of the Senate floor for his honesty, integrity, and common-sense approach to the challenges of our times. The Los Angeles Times has praised his "bold positions on foreign policy and national security" and wondered, "What\'s not to like?" In America: Our Next Chapter, Nebraska-born Hagel offers a hard-hitting examination of the current state of our nation and provides substantial, meaningful proposals that can guide America back onto the right path.<br/>In America: Our Next Chapter, Hagel speaks the truth as he sees it—in a direct and refreshingly unvarnished manner. Basing his suggestions on thorough research and careful thought, as well as on personal insight from his years as a political insider, successful businessman, and decorated war hero, he discusses domestic issues—including the health care crisis, immigration, and Social Security and Medicare reform—and global climate change. He confronts foreign policy problems that the current administration has bungled or ignored, including China\'s growing economy; control of U.S. debt; India\'s and Pakistan\'s nuclear capabilities; and Iran\'s aggressive political, ideological, and nuclear stances. He decries the pervasive disease of third world poverty, arguing convincingly that this is where the real fight against terrorism must begin. Always true to the beliefs instilled in his childhood on the prairie, he speaks passionately about service—to one\'s country and to one\'s fellow citizens—as the path toward a renewed America. And, of course, he gives a candid examination of the debacle that is the Iraq War.<br/>A staunch Republican yet a "hero to liberals" (Time), Hagel asks the tough questions and delivers straight answers to America\'s most pressing problems. America: Our Next Chapter is a serious, honest, and, ultimately, optimistic look at our nation\'s future, from an American original.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/69/63/9780061436963.jpg', 'title_long': 'America: Our Next Chapter: Tough Questions, Straight Answers', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.28 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.28}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 320, 'date_published': '2008-03-25', 'subjects': ['Politics & Social Sciences', 'Politics & Government', 'Ideologies & Doctrines', 'Specific Topics', 'Self Service', 'Custom Stores'], 'authors': ['Chuck Hagel', 'Peter Kaminsky'], 'title': 'America: Our Next Chapter: Tough Questions, Straight Answers', 'isbn13': '9780061436963', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0061436968', 'isbn10': '0061436968', 'other_isbns': [{'isbn': '9780061734151', 'binding': 'print'}]}}