{"book": {"publisher": "HarperTorch", "synopsis": "It"s one of the stealthiest, most dangerous underwater warships ever built.and it"s about to set off World War III.<br/>Silent at less than five knots and capable of a massive nuclear warhead punch, it"s the 240-foot Russian Kilo Class submarine. Strapped for hard cash, the Russians have produced ten new Kilos for Beijing. The Chinese have already received three of the subs and now the last seven are ready to be delivered\x97a code-red situation the Pentagon must avert. Armed with a full strike force of Kilos, China can cripple American interests, shatter the balance of power, and successfully achieve the unthinkable in the Pacific Rim. But not if the newly appointed National Security Adviser, wily Texas admiral Arnold Morgan, can stop them\x97using the navy's deadliest covert forces.<br/>In a breathtaking race against time, a team of Navy SEALs penetrates deep inside the remote waters of northern Russia on a daring mission of destruction. And in the icy darkness of the North Atlantic, a brave U.S. captain takes his 7,000-ton nuclear vessel on a hair-raising trip beneath the polar ice cap to head off a powerful Russian cordon determined to transport the Kilos at any cost. Horns locked in a tense game of geomilitary survival, each of the world' three most powerful nations knows that one mistake will mean all-out war.', 'language": "en", "image": "https: //images.isbndb.com/covers/68/53/9780061096853.jpg", "title_long": "Kilo Class", "dimensions": "Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.58 Pounds, Width: 1.09 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.19}, "width": {"unit": "inches", "value": 1.09}, "weight": {"unit": "pounds", "value": 0.58}, "height": {"unit": "inches", "value": 6.75}}, "pages": 544, "date_published": "1999-03-03", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Contemporary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense'], 'authors": ["Patrick Robinson'], 'title": "Kilo Class", "isbn13": "9780061096853", "msrp": 7.5, "binding": "Mass Market Paperback", "related": {"ePub": "0061835676"}, "isbn": "0061096857", "isbn10": "0061096857", "other_isbns": [{'isbn": "9780061835674", "binding": "print"}]}}