{'book': {'publisher': 'Avon', 'synopsis': "It's tough to play it cool on a sultry summer night . . .<br/>The perfect daughter. The perfect prom queen. The perfect wife. Jenny Tolliver's been the good girl all her life, and it's gotten her nowhere. Now that her marriage has been busted up by her cheating ex, she's decided it's time to regroup and rediscover herself. This summer she's headed back to her hometown of Destiny, Ohio, to the very lakeshore cottage where she grew up, to figure out what life holds in store for her next.<br/>She never dreamed the answer would be Mick Brody, Destiny's #1 hellraiser. He comes from the wrong side of the tracks (or in his case, the lake), and he's landed in hot water more times than he can count. He's exactly the kind of guy Jenny's always kept her distance from . . . but soon the good girl and the bad boy are caught in a raw heat that's out of control. Too bad Mick's got a secret that threatens to tear them apart and ruin Jenny's perfectly, passionately reckless summer . . .", 'language': 'en', 'image': 'https://images.isbndb.com/covers/98/97/9780061429897.jpg', 'title_long': 'One Reckless Summer: A Destiny Novel (Destiny series, 1)', 'edition': 'Original', 'dimensions': 'Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.41 Pounds, Width: 0.96 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 0.96}, 'weight': {'unit': 'pounds', 'value': 0.41}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 384, 'date_published': '2009-05-26', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Feel-Good', 'United States', 'Romance', 'Contemporary', 'Science Fiction', 'Romantic Comedy', 'Science Fiction & Fantasy'], 'authors': ['Toni Blake'], 'title': 'One Reckless Summer: A Destiny Novel (Destiny series, 1)', 'isbn13': '9780061429897', 'msrp': 6.99, 'binding': 'Mass Market Paperback', 'related': {'ePub': '0061880078'}, 'isbn': '0061429899', 'isbn10': '0061429899', 'other_isbns': [{'isbn': '9780061880070', 'binding': 'print'}]}}