{"book": {"publisher": "William Morrow", "synopsis": "The heartwarming and unforgettable story of a family and the wondrously neurotic dog who taught them what really matters in life. Now with photos and new material.<br/>Is it possible for humans to discover the key to happiness through a bigger-than-life, bad-boy dog? Just ask the Grogans.<br/>John and Jenny were just beginning their life together. They were young and in love, with not a care in the world. Then they brought home Marley, a wiggly yellow furball of a puppy. Life would never be the same.<br/>Marley grew into a barreling, ninety-seven-pound streamroller of a Labrador retriever. He crashed through screen doors, gouged through drywall, and stole women"s undergarments. Obedience school did no good -- Marley was expelled.<br/>But just as Marley joyfully refused any limits on his behavior, his love and loyalty were boundless, too. Marley remained a model of devotion, even when his family was at its wit"s end. Unconditional love, they would learn, comes in many forms.<br/>Marley & Me is John Grogan"s funny, unforgettable tribute to this wonderful, wildly neurotic Lab and the meaning he brought to their lives.', 'language": "en", "image": "https: //images.isbndb.com/covers/82/22/9780061238222.jpg", "title_long": "Marley & Me Illustrated Edition: Life and Love with the World"s Worst Dog", 'edition": "Illustrated", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 1.8 Pounds, Width: 1.06 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1.06}, "weight": {"unit": "pounds", "value": 1.8}, "height": {"unit": "inches", "value": 9}}, "pages": 320, "date_published": "2006-10-31", "subjects": ["Biographies & Memoirs', 'Memoirs', 'Crafts, Hobbies & Home', 'Pets & Animal Care', 'Dogs', 'Essays', 'Self Service', 'Custom Stores'], 'authors": ["John Grogan'], 'title": "Marley & Me Illustrated Edition: Life and Love with the World"s Worst Dog", 'isbn13": "9780061238222", "msrp": 22.07, 'binding": "Hardcover", "isbn": "0061238228", "isbn10": "0061238228"}}