{'book': {'publisher': 'William Morrow', 'synopsis': "Be warned. This book has no literary merit whatsoever. Needless to say, I doubt you'll believe a word of it.<br/>Once the toast of good society in Victoria's England, the extraordinary conjurer Edward Moon no longer commands the respect or inspires the awe that he did in earlier times. Despite having previously unraveled more than sixty perplexing criminal puzzles (to the delight of a grateful London constabulary), he is considered something of an embarrassment these days. Still, each night without fail, he returns to the stage of his theatre to amaze his devoted, albeit dwindling audience with the same old astonishments—aided by his partner, the silent, hairless, hulking, surprisingly placid giant who, when stabbed, does not bleed . . . and who goes by but one appellation:<br/>The Somnambulist<br/>On a night of roiling mists and long shadows, in a corner of the city where only the most foolhardy will deign to tread, a rather disreputable actor meets his end in a most bizarre and terrible fashion. Baffled, the police turn once again in the direction of Edward Moon—who will always welcome such assignments as an escape from ennui. And, in fact, he leads the officers to a murderer rather quickly. Perhaps too quickly. For these are strange, strange times in England, with the strangest of sorts prowling London's dank underbelly: sinister circus performers, freakishly deformed prostitutes, sadistic grown killers in schoolboy attire, a human fly, a man who lives backwards. And nothing is precisely as it seems.<br/>Which should be no surprise to Moon, whose life and livelihood consists entirely of the illusionary, the unexpected, the seemingly impossible. Yet what is to follow will shatter his increasingly tenuous grasp on reality—as death follows death follows death in the dastardly pursuit of poetry, freedom, utopia . . . and Love, Love, Love, and Love.<br/>Remember the name Jonathan Barnes, for, with The Somnambulist, he has burst upon the literary scene with a breathtaking and brilliant, frightening and hilarious, dark invention that recalls Neil Gaiman, Susanna Clarke, and Clive Barker at their grimly fantastical best . . . with more than a pinch of Carl Hiaasen–esque outrageousness stirred into the demonically delicious brew.<br/>Read on . . . and be astonished!", 'language': 'en', 'image': 'https://images.isbndb.com/covers/53/85/9780061375385.jpg', 'title_long': 'The Somnambulist', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 5.5 Inches, Weight: 1.125 Pounds, Width: 1.17 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.17}, 'weight': {'unit': 'pounds', 'value': 1.125}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 368, 'date_published': '2008-02-05', 'subjects': ['Science Fiction & Fantasy', 'Fantasy', 'Historical'], 'authors': ['Jonathan Barnes'], 'title': 'The Somnambulist', 'isbn13': '9780061375385', 'msrp': 23.95, 'binding': 'Hardcover', 'isbn': '0061375381', 'isbn10': '0061375381'}}