{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': 'Can lighting really strike twice? Just ask Eve, whose husband walks out on her in the middle of a garage sale.<br/>Eve\'s beloved Ivan died thirteen years ago in an automobile accident. Her charming, boyish Chuck has taken a different exit out of her life: hopping into his car in the middle of a garage sale with no forewarning and departing their formerly happy upstate New York home for points unknown. Now Eve\'s a boat adrift, subsisting on a heartbreak diet of rue, disappointment, and woe-left alone to care for Ivan\'s brilliant teenaged son, Marcus, and Chuck\'s precocious, pragmatic nine-year-old daughter, Noni, while contending with Charlotte, Eve\'s acerbic mother, who\'s come north to "help" but hinders instead.<br/>But life ultimately must go on, with its highs and lows, its traumas and holidays, and well-meaning, if eccentric, friends. A house and a heart in disrepair are painful burdens for a passionate woman who\'s still in her prime. And while learning to cope with the large and small tragedies that each passing day brings, Eve might end up discovering that she\'s gained much more than she\'s lost.<br/>A poignant, lovely, funny, and ultimately uplifting story of love, family, and survival, Liz Rosenberg\'s Home Repair is an unforgettable introduction to a lyrical, wise, and wonderfully vibrant new literary voice.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/45/64/9780061734564.jpg', 'title_long': 'Home Repair', 'edition': 'Original', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 0.58642961692 Pounds, Width: 0.8 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 0.8}, 'weight': {'unit': 'pounds', 'value': 0.58642961692}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 328, 'date_published': '2009-04-28', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Family Life', "Women's Fiction", 'Divorce', 'Domestic Life', 'Mothers & Children', 'Contemporary', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors': ['Liz Rosenberg'], 'title': 'Home Repair', 'isbn13': '9780061734564', 'msrp': 13.5, 'binding': 'Paperback', 'related': {'ePub': '0061868957'}, 'isbn': '006173456X', 'isbn10': '006173456X', 'other_isbns': [{'isbn': '9780061868955', 'binding': 'print'}]}}