{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': "Many rumors abound about a mysterious gentleman said to be the love of Jane's life—finally, the truth may have been found. . . .<br/>What if, hidden in an old attic chest, Jane Austen's memoirs were discovered after hundreds of years? What if those pages revealed the untold story of a life-changing love affair? That's the premise behind this spellbinding novel, which delves into the secrets of Jane Austen's life, giving us untold insights into her mind and heart.<br/>Jane Austen has given up her writing when, on a fateful trip to Lyme, she meets the well-read and charming Mr. Ashford, a man who is her equal in intellect and temperament. Inspired by the people and places around her, and encouraged by his faith in her, Jane begins revising Sense and Sensibility, a book she began years earlier, hoping to be published at last.<br/>Deft and witty, written in a style that echoes Austen's own, this unforgettable novel offers a delightfully possible scenario for the inspiration behind this beloved author's romantic tales. It's a remarkable book, irresistible to anyone who loves Jane Austen—and to anyone who loves a great story.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/14/27/9780061341427.jpg', 'title_long': 'The Lost Memoirs of Jane Austen', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.65918216338 Pounds, Width: 0.79 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.79}, 'weight': {'unit': 'pounds', 'value': 0.65918216338}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 303, 'date_published': '2007-11-06', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'Family Life', "Women's Fiction", 'Domestic Life', 'United States', 'Romance', 'Victorian', '20th Century', 'Regency', 'Self Service', 'Custom Stores'], 'authors': ['Syrie James'], 'title': 'The Lost Memoirs of Jane Austen', 'isbn13': '9780061341427', 'msrp': 11.12, 'binding': 'Paperback', 'related': {'ePub': '0061857432'}, 'isbn': '0061341428', 'isbn10': '0061341428', 'other_isbns': [{'isbn': '9780061857430', 'binding': 'print'}]}}