{'book': {'publisher': 'Ecco', 'synopsis': 'Edgar Allan Poe, Emily Dickinson, Samuel Clemens ("Mark Twain"), Henry James, Ernest Hemingway—Joyce Carol Oates evokes each of these American literary icons in her newest work of prose fiction, poignantly and audaciously reinventing the climactic events of their lives. In subtly nuanced language suggestive of each of these writers, Oates explores the mysterious regions of the unknowable self that is "genius"—for Edgar Allan Poe, a belated encounter with bizarre life‑forms utterly alien to the poet\'s exalted Romantic aesthetics; for Emily Dickinson, resurrected in the twenty-first century in a "distilled" state, a belated encounter with blundering humanity and brute passion of a kind excluded from the poet\'s verse; for the elderly, renowned Samuel Clemens, a belated encounter with impassioned innocence, in the form of "the little girl who loves you"; for Henry James, an aging volunteer in a London hospital during World War I, a belated encounter with the physicality of desire and the raw yearning of love long absent from the master\'s fiction; and, for Ernest Hemingway, the most tragic of these figures, a belated encounter with the "profound mysteries of the world outside him, and the profound mysteries of the world inside him."<br/>Wild Nights! is Joyce Carol Oates\'s most original and haunting work of the imagination, a writer\'s memoirist work in the form of fiction.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/47/92/9780061434792.jpg', 'title_long': 'Wild Nights!: Stories About the Last Days of Poe, Dickinson, Twain, James, and Hemingway', 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 5.5 Inches, Weight: 0.95 Pounds, Width: 0.96 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.94}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 256, 'date_published': '2008-04-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Short Stories & Anthologies', 'Short Stories', 'United States', 'Literary', 'Mythology & Folk Tales', 'Folklore'], 'authors': ['Joyce Carol Oates'], 'title': 'Wild Nights!: Stories About the Last Days of Poe, Dickinson, Twain, James, and Hemingway', 'isbn13': '9780061434792', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0061434795', 'isbn10': '0061434795'}}