{'book': {'publisher': 'Balzer + Bray', 'synopsis': "“A powerful mix of sibling rivalry, revenge, and hard-won redemption. Readers will come for the laughs and stay for the laughs.” —BCCB<br/>Thirteen-year-old Lamar Washington is the maddest, baddest, most spectacular bowler at Striker's Bowling Paradise. But while Lamar's a whiz at rolling strikes, he always strikes out with girls. And Lamar's brother is no help—Xavier earns trophy after trophy on the basketball court and soaks up Dad's attention, leaving no room for Lamar's problems.<br/>Then bad boy Billy Jenks convinces Lamar that hustling at the alley will help him win his dream girl, plus earn him enough money to buy an expensive pro ball and impress celebrity bowler Bubba Sanders.<br/>But when Billy's scheme goes awry, Lamar ends up ruining his brother's shot at college and damaging every relationship in his life. Can Lamar figure out how to mend his broken ties, no matter what the cost?<br/>Crystal Allen's debut novel bowls over critics: “Lamar will have readers hooked.” —Publishers Weekly (starred review) “Allen has written an engaging and humorous story and created a compelling character in Lamar, whose wonderfully inventive, laugh-out-loud idiosyncratic voice will leave readers wanting to hear more.”—ALA Booklist “Crystal Allen has the rare ability to make you laugh out loud one minute and swell with tears the next. The tween book world has a new hero—Lamar Washington—as well as a brilliant new author who’s bound to win a Bubba-sized trophy herself!” —Neal Shusterman, author of The Schwa Was Here and Bruiser", 'language': 'en', 'image': 'https://images.isbndb.com/covers/27/35/9780061992735.jpg', 'title_long': "How Lamar's Bad Prank Won a Bubba-Sized Trophy", 'dimensions': 'Height: 7.62 Inches, Length: 5.12 Inches, Weight: 0.44 Pounds, Width: 0.61 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.12}, 'width': {'unit': 'inches', 'value': 0.61}, 'weight': {'unit': 'pounds', 'value': 0.44}, 'height': {'unit': 'inches', 'value': 7.62}}, 'pages': 304, 'date_published': '2012-08-14', 'subjects': ["Children's Books", 'Growing Up & Facts of Life', 'Family Life', 'Friendship, Social Skills & School Life', 'Humor', 'Sports & Outdoors', 'Self Service', 'Custom Stores'], 'authors': ['Crystal Allen'], 'title': "How Lamar's Bad Prank Won a Bubba-Sized Trophy", 'isbn13': '9780061992735', 'msrp': 6.99, 'binding': 'Paperback', 'related': {'Kindle Edition': '0062069705', 'ePub': '0062069705'}, 'isbn': '0061992739', 'isbn10': '0061992739', 'other_isbns': [{'isbn': '9780062069702', 'binding': 'print'}]}}