{'book': {'publisher': 'Harper Voyager', 'synopsis': "Reality is not what it was. Desperate science run amok has collided with dark sorcery, and together they have ripped open a gaping wound into... something. Now, in an instant, everything is different. The horrific is mundane, the impossible rational. Nothing works and everyone pays. Welcome to ... Magic Time.<br/>For rising young lawyer Cal Griffin, it's just another day in the Big City, full of stress, screw-ups, deadlines, and anxiety. That is, until New York is rocked by a series of bizarre tremors -- and the lights go off...for good. Trapped in a giant metropolis and cut off from the rest of the world, Cal tries desperately to make sense of the surreal chaos that engulfs his crippled city. Worst of all, the people around him are...changing. Once ordinary humans are becoming embodiments of their darkest desires, manifestations of their deepest fears. Packs of pale, crouched figures stalk the subways, glowing child-faces peer out of the shadows...and monsters prowl Times Square.<br/>Similar weirdness is happening everywhere, from the dank, cold heart of a West Virginia coal mine to a remote lab in South Dakota -- where an overworked team of government physicists has unwittingly invited something catastrophic into the world -- to the highest levels of power in Washington, D.C.<br/>And Cal Griffin is not the only one who will be forced into a strange new role in this brave new world of nightmare and wonder. A spinster school-teacher, a lonely miner, a refugee doctor, a visionary street person, a brooding Secret Service agent, all share a staggering responsibility with the young attorney to make sense of the senseless -- and to follow an awesome destiny. For they are to be soldiers in a titanic battle between darkness and light. And its raging hellfires will effect the most astonishing transformation of all -- turning a young man of pure heart into that rarest of creatures: a hero.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/06/88/9780061050688.jpg', 'title_long': 'Magic Time', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.125 Inches, Weight: 1.45 Pounds, Width: 1.21 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.125}, 'width': {'unit': 'inches', 'value': 1.21}, 'weight': {'unit': 'pounds', 'value': 1.45}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 384, 'date_published': '2001-11-27', 'subjects': ['Literature & Fiction', 'Contemporary', 'Science Fiction & Fantasy', 'Fantasy'], 'authors': ['Marc Zicree', 'Barbara Hambly'], 'title': 'Magic Time', 'isbn13': '9780061050688', 'msrp': 26, 'binding': 'Hardcover', 'isbn': '0061050687', 'isbn10': '0061050687'}}