{'book': {'publisher': 'WmMorrowPB', 'synopsis': 'Are you confused by all the advice you hear and see daily on how to "go green"? Do you want to incorporate earth-friendly practices into your life, but you don\'t know where to start? Don\'t stress! Green guru Sophie Uliano has sorted through all the eco-info out there and put everything you need to know about living a green lifestyle right at your fingertips. In Gorgeously Green , Sophie offers a simple eight-step program that is an easy and fun way to begin living an earth-friendly life. Each chapter covers topics from beauty to fitness, shopping to your kitchen—even your transportation. Whether it\'s finding the right lipstick, making dinner, buying gifts, or picking out a hot new outfit, finally, there is a book that tackles your daily eco-challenges with a take-charge plan. Just consider Sophie your go-to girl with all the eco-solutions. Find out how The book\'s dozens and dozens of eco-friendly tips, products, and practices combine to form a treasure trove of practical advice for every possible way to become stylishly green. Your questions about dressing, makeup, eating, shopping, cleaning, travel, and more are all answered right here. Adopting a green lifestyle is among the most positive, forward-thinking, and personally fulfilling choices that anyone can make—and Gorgeously Green shows that it doesn\'t have to be tedious, time-consuming, or glamourless!', 'language': 'en', 'image': 'https://images.isbndb.com/covers/55/63/9780061575563.jpg', 'title_long': 'Gorgeously Green : 8 Simple Steps to an Earth-Friendly Life', 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 7 Inches, Weight: 0.000625 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.000625}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 309, 'date_published': '2008-04-08', 'subjects': ['Crafts, Hobbies & Home', 'Home Improvement & Design', 'How-to & Home Improvements', 'Reference', 'Encyclopedias & Subject Guides', 'Science & Math', 'Earth Sciences', 'Environmental Science', 'Environment', 'Politics & Social Sciences', 'Politics & Government', 'Public Affairs & Policy'], 'authors': ['Sophie Uliano'], 'title': 'Gorgeously Green : 8 Simple Steps to an Earth-Friendly Life', 'isbn13': '9780061575563', 'msrp': 16.95, 'binding': 'Paperback', 'isbn': '0061575569', 'isbn10': '0061575569'}}