{'book': {'publisher': 'Ecco', 'synopsis': 'NEW YORK TIMES BESTSELLER • NAMED ONE OF THE TEN BEST BOOKS OF THE YEAR BY TIME, PEOPLE, SALON, AND ESQUIRE<br/>“The Family Fang is a comedy, a tragedy, and a tour-de-force examination of what it means to make art and survive your family….The best single word description would be brilliant.”<br/>—Ann Patchett, author of Bel Canto<br/>A funny, poignant, laugh-and-cry-out-loud (sometimes at the same time) novel about the art of surviving a masterpiece of dysfunction. Meet The Family Fang, an unforgettable collection of demanding, brilliant, and absolutely endearing oddballs whose lives are risky and mischievous performance art. Basis for the major motion picture starring Nicole Kidman, Jason Bateman and Christopher Walken.<br/>Annie and Buster Fang have spent most of their adult lives trying to distance themselves from their famous artist parents, Caleb and Camille. But when a bad economy and a few bad personal decisions converge, the two siblings have nowhere to turn but their family home. Reunited under one roof for the first time in more than a decade and surrounded by the souvenirs of their unusual upbringing, Buster and Annie are forced to confront not only their creatively ambitious parents, but the chaos and confusion of their childhood.<br/>“It’s The Royal Tenenbaums meets Who’s Afraid of Virginia Woolf? I’d call The Family Fang a guilty pleasure, but it’s too damn smart….A total blast.”<br/>—Hannah Pittard, author of The Fates Will Find Their Way', 'language': 'en', 'image': 'https://images.isbndb.com/covers/90/59/9780061579059.jpg', 'title_long': 'The Family Fang: A Novel', 'edition': 'Reprint', 'dimensions': 'Height: 7.9 Inches, Length: 0.9 Inches, Weight: 0.54 Pounds, Width: 5.2 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 0.9}, 'width': {'unit': 'inches', 'value': 5.2}, 'weight': {'unit': 'pounds', 'value': 0.54}, 'height': {'unit': 'inches', 'value': 7.9}}, 'pages': 336, 'date_published': '2012-04-17', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Family Life', 'United States', 'Humor & Satire', 'Dark Humor', 'Literary', 'Self Service', 'Custom Stores'], 'authors': ['Kevin Wilson'], 'title': 'The Family Fang: A Novel', 'isbn13': '9780061579059', 'msrp': 9.99, 'binding': 'Paperback', 'related': {'Kindle Edition': '0062092510', 'ePub': '0062092510'}, 'isbn': '006157905X', 'isbn10': '006157905X', 'other_isbns': [{'isbn': '9780062092519', 'binding': 'print'}]}}