{'book': {'publisher': 'Harper Voyager', 'synopsis': 'The ultimate destiny of humankind hangs in the balance in the gripping space saga.<br/>A less likely group of saviors has never before jockeyed a great starship across the heavens-but Jim Endicott and the Stone Cowboys are suddenly the last hope of humanity. A street-toughened gang of thugs and hoodlums, they have already proved their mettle, staunching the flow of the killer drug that turned the world-sized intergalactic vessel Outward Bound into a gargantuan battlefield-cum-graveyard. Now, in a ship hijacked from the alien suppliers of the lethal narcotic and renamed Endeavor, the outlaw heroes are rocketing toward a grim confrontation they cannot avoid and, most likely, will not survive: a war to the death that will be waged on the enemy\'s home turf.<br/>But first a motley group of street fighters-the scum of the galaxy, by all standards of decent people everywhere -- must be molded into a trained and disciplined commando unit. And that\'s where Jim Endicott comes in. Once hoping to join the Space Academy, now the untried captain of a stolen starship and its misfit crew, he has already altered one past using the astonishing powers of Omega, but the deadly challenge that lies ahead dwarfs any he has previously encountered. And within the Endeavor\'s close confines tension and unrest are perilously brewing, threatening to erupt in a devastating explosion of blood and mutiny that will have to be dealt with-brutally yet with finesse.<br/>And after that ... the future is a terrifying question mark. For the roots of the fiendish galactic plot to obliterate the human "cancer" and end its expansion to the stars reach deep into dark, unknown, and inescapable places. And the only champions courageous -- and foolhardly -- enough to venture there are Endicott and his small band of cutthroat Cowboys, who have nothing in the universe left to lose.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/11/97/9780061051197.jpg', 'title_long': 'Shadow Planet', 'edition': 'First Edition', 'dimensions': 'Height: 9 inches, Length: 6 inches, Weight: 1.3 Pounds, Width: 1.09 inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.09}, 'weight': {'unit': 'pounds', 'value': 1.3}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 336, 'date_published': '2002-11-05', 'subjects': ['Science Fiction & Fantasy', 'Science Fiction'], 'authors': ['William Shatner'], 'title': 'Shadow Planet', 'isbn13': '9780061051197', 'msrp': 23.95, 'binding': 'Hardcover', 'isbn': '0061051195', 'isbn10': '0061051195'}}