{'book': {'publisher': 'Harper', 'synopsis': "One of the most gifted, celebrated, scrutinized, and criticized musicians in the second half of the twentieth century, Leonard Bernstein made his legendary conducting debut at the New York Philharmonic in 1943, at age 25. A year later, he became a sensation on Broadway with the premiere of On the Town. Throughout the 1950s, his Broadway fame only grew with Wonderful Town, Candide, and West Side Story. And in 1958, the Philharmonic appointed him the first American Music Director of a major symphony orchestra—a signal historical event. He was adored as a quintessential celebrity but one who could do it all—embracing both popular and classical music, a natural with the new medium of television, a born teacher, writer, and speaker, as well as a political and social activist. In 1976, having conducted the Philharmonic for more than one thousand concerts, he took his orchestra on tour to Europe for the last time.<br/>All of this played out against the backdrop of post-Second World War New York City as it rose to become the cultural capital of the world—the center of wealth, entertainment, communications, and art—and continued through the chaotic and galvanizing movements of the 1960s that led to its precipitous decline by the mid 1970s.<br/>The essays within this book do not simply retell the Bernstein story; instead, Leonard Bernstein's brother, Burton Bernstein, and current New York Philharmonic archivist and historian, Barbara B. Haws, have brought together a distinguished group of contributors to examine Leonard Bernstein's historic relationship with New York City and its celebrated orchestra. Composer John Adams, American historians Paul Boyer and Jonathan Rosenberg, music historians James Keller and Joseph Horowitz, conductor and radio commentator Bill McGlaughlin, musicologist Carol Oja, and music critics Tim Page and Alan Rich have written incisive essays, which are enhanced by personal reminiscences from Burton Bernstein. The result is a telling portrait of Leonard Bernstein, the musician and the man.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/78/68/9780061537868.jpg', 'title_long': 'Leonard Bernstein: American Original', 'edition': '1', 'dimensions': 'Height: 9.5 Inches, Length: 8.75 Inches, Weight: 2 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.75}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 2}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 240, 'date_published': '2008-08-19', 'subjects': ['Arts & Photography', 'Performing Arts', 'Dance', 'Music', 'History & Criticism', 'Musical Genres', 'Biographies & Memoirs', 'Arts & Literature', 'Actors & Entertainers', 'Composers & Musicians', 'Dancers', 'Self Service', 'Custom Stores'], 'authors': ['Burton Bernstein', 'Barbara Haws'], 'title': 'Leonard Bernstein: American Original', 'isbn13': '9780061537868', 'msrp': 29.95, 'binding': 'Hardcover', 'related': {'eBook': '0062043145', 'ePub': '0062043145'}, 'isbn': '0061537861', 'isbn10': '0061537861', 'other_isbns': [{'isbn': '9780062043146', 'binding': 'print'}]}}