{'book': {'publisher': 'HarperCollins', 'synopsis': 'Lindsay took to marriage like a starlet to stilettos, but her husband had a deeper love for his business. Left alone after his death, Lindsay must find out who she is when there isn\'t a party to plan or another person\'s life to be organized. Can she find her way Back to Life?<br/>Lindsay realized when she married Ron, a man seventeen years her senior, that the odds were he\'d see heaven before her, but she never expected to be a widow at thirty-five. She knows there\'s too much of life remaining for her to just sit around in mourning, but she can\'t seem to kick-start the rest of her life. Then unexpected help arrives...when Ron\'s first wife, Jane, shows up at Lindsay\'s front door.<br/>The executor of their late husband\'s estate, Jane is everything Lindsay\'s not: strong, stubborn, independent...and a lot older. There are other surprises as well, including Ron Jr. (whom Jane insists is not "really" Ron\'s son). But against all odds, a most unlikely friendship begins to develop—as each woman discovers how to own up to her past mistakes and to reevaluate what is really important. Told in the alternating voices of Jane and Lindsay, and featuring the return of many of the unforgettable characters introduced in The Trophy Wives Club, Back to Life is a lighthearted, relatable read about where to turn when life goes in a direction you never planned.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/87/75/9780061378775.jpg', 'title_long': 'Back to Life (The Trophy Wives Club, Book 2)', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 0.46737999544 Pounds, Width: 0.61 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 0.61}, 'weight': {'unit': 'pounds', 'value': 0.46737999544}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 272, 'date_published': '2008-09-16', 'subjects': ['Christian Books & Bibles', 'Literature & Fiction', 'Romance', 'Contemporary', 'United States', 'Religion & Spirituality'], 'authors': ['Kristin Billerbeck'], 'title': 'Back to Life (The Trophy Wives Club, Book 2)', 'isbn13': '9780061378775', 'msrp': 12.95, 'binding': 'Paperback', 'related': {'ePub': '0061982369'}, 'isbn': '0061378771', 'isbn10': '0061378771', 'other_isbns': [{'isbn': '9780061982361', 'binding': 'print'}]}}