{'book': {'publisher': 'William Morrow Paperbacks', 'synopsis': 'Despite being cursed with a boy\'s name, Kevin "Vi" Connelly is seriously female and a committed romantic. The affliction hit at the tender age of six when she was handed a basket of flower petals and ensnared by the "marry-tale." The thrill, the attention, the big white dress—it\'s the Best Day of Your Life, and it\'s seriously addictive. But at twenty-seven, with a closetful of pricey bridesmaid dresses she\'ll never wear again, a trunkful of embarrassing memories, and an empty bank account from paying for it all, the illusion of matrimony as the Answer to Everything begins to fray. As her friends\' choices don\'t provide answers, and her family confuses her more, Vi faces off against her eminently untrustworthy boyfriend and the veracity of the BDOYL.<br/>Eleven weddings in eighteen months would send any sane woman either over the edge or scurrying for the altar. But as reality separates from illusion, Vi learns that letting go of someone else\'s story to write your own may be harder than buying the myth, but just might help her make the right choices for herself.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/85/78/9780061438578.jpg', 'title_long': "The Best Day of Someone Else's Life", 'edition': '0', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 0.79 Pounds, Width: 1.05 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 1.05}, 'weight': {'unit': 'pounds', 'value': 0.79}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 430, 'date_published': '2008-05-06', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Family Life', "Women's Fiction", 'Domestic Life', 'Single Women', 'Contemporary', 'United States', 'Romance', 'Self Service', 'Custom Stores'], 'authors': ['Kerry Reichs'], 'title': "The Best Day of Someone Else's Life", 'isbn13': '9780061438578', 'msrp': 12.04, 'binding': 'Paperback', 'related': {'ePub': '0061853259'}, 'isbn': '006143857X', 'isbn10': '006143857X', 'other_isbns': [{'isbn': '9780061853258', 'binding': 'print'}]}}