{'book': {'publisher': 'HarperTeen', 'synopsis': "Before he died, Melissa's father told her about stars. He told her that the brightest stars weren't always the most beautiful—that if people took the time to look at the smaller stars, if they looked with a telescope at the true essence of the star, they would find real beauty. But even though Melissa knows that beauty isn't only skin deep, the people around her don't seem to feel that way. There's her gorgeous sister, Ashley, who will barely acknowledge Melissa at school; there's her best friend, Ryan, who may be falling in love with the sophisticated Courtney; and there's Melissa's mother, who's dating someone new, someone Melissa knows will never be able to replace her father.<br/>To make sure she doesn't lose her father completely, Melissa spends her time trying to piece together the last of his secrets and finishing a journal he began—one about love and relationships and the remarkable ways people find one another. But when tragedy strikes, Melissa has to start living and loving in the present as she realizes that being beautiful on the outside doesn't mean you can't be beautiful on the inside.<br/>This is a lyrical tale of love, loss, and self-discovery from the author of The September Sisters.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/65/11/9780061686511.jpg', 'title_long': 'The Life of Glass', 'dimensions': 'Height: 7.12 Inches, Length: 5 Inches, Weight: 0.8 Pounds, Width: 1.13 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5}, 'width': {'unit': 'inches', 'value': 1.13}, 'weight': {'unit': 'pounds', 'value': 0.8}, 'height': {'unit': 'inches', 'value': 7.12}}, 'pages': 352, 'date_published': '2010-02-10', 'subjects': ['Teen & Young Adult', 'Literature & Fiction', 'Social & Family Issues', 'Mysteries & Thrillers', 'Mystery & Detective', 'Social Issues'], 'authors': ['Jillian Cantor'], 'title': 'The Life of Glass', 'isbn13': '9780061686511', 'msrp': 16.99, 'binding': 'Hardcover', 'related': {'ePub': '0061991988'}, 'isbn': '0061686514', 'isbn10': '0061686514', 'other_isbns': [{'isbn': '9780061991981', 'binding': 'print'}]}}