{'book': {'publisher': 'Greenwillow Books', 'synopsis': '“Rae Carson has proved she’s a master and has shaken up the YA genre.”—USAToday.com<br/>The first book in Rae Carson’s award-winning and New York Times–bestselling trilogy! The Girl of Fire and Thorns is a sweeping journey full of adventure, sorcery, heartbreak, and power. Fans of Shadow & Bone and Game of Thrones, will devour this fantasy series.<br/>Once a century, one person is chosen for greatness.<br/>Elisa is the chosen one. But she has always felt powerless, useless. Now, on her sixteenth birthday, she has become the secret wife of a handsome and worldly king—a king whose country is in turmoil. A king who needs her to be the chosen one, not a failure of a princess.<br/>And he’s not the only one who seeks her. Fierce enemies, seething with dark magic, are hunting her. A daring, determined revolutionary thinks she could be his people’s savior. Soon it is not just her life, but her very heart that is at stake.<br/>Elisa could be everything to those who need her most. If the prophecy is fulfilled. If she finds the power deep within herself. If she doesn’t die young. Most of the chosen do.<br/>William C. Morris YA Debut Award Finalist<br/>YALSA Best Fiction for Young Adults Top Ten Pick<br/>Andre Norton Award Finalist<br/>A Texas Tayshas Selection<br/>Ohioana Book Award YA winner<br/>Don’t miss The Empire of Dreams, Rae Carson’s action-packed return to the world of The Girl of Fire and Thorns!', 'language': 'en', 'image': 'https://images.isbndb.com/covers/64/84/9780062026484.jpg', 'title_long': 'The Girl of Fire and Thorns (Girl of Fire and Thorns, 1)', 'edition': 'First Edition', 'dimensions': 'Height: 8.3 Inches, Length: 5.7 Inches, Weight: 1.1 Pounds, Width: 1.6 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.7}, 'width': {'unit': 'inches', 'value': 1.6}, 'weight': {'unit': 'pounds', 'value': 1.1}, 'height': {'unit': 'inches', 'value': 8.3}}, 'pages': 432, 'date_published': '2011-09-20', 'subjects': ['Teen & Young Adult', 'Literature & Fiction', 'Girls & Women', 'Social & Family Issues', 'Science Fiction & Fantasy', 'Fantasy', 'Social Issues'], 'authors': ['Rae Carson'], 'title': 'The Girl of Fire and Thorns (Girl of Fire and Thorns, 1)', 'isbn13': '9780062026484', 'msrp': 17.99, 'binding': 'Hardcover', 'isbn': '0062026488', 'isbn10': '0062026488'}}