{'book': {'publisher': 'Katherine Tegen Books', 'synopsis': "When twins Sheridan and Taylor wake up 400 years in the future, they find a changed world: domed cities, no animals, and a language that's so different, it barely sounds like English. And the worst news: They can't go back home.<br/>The twenty-fifth-century government transported the girls to their city hoping to find a famous scientist to help perfect a devastating new weapon. The same government has implanted tracking devices in the citizens, limiting and examining everything they do. Taylor and Sheridan have to find a way out of the city before the government discovers their secrets. To complicate matters, the moblike Dakine has interest in getting hold of them too. The only way for the girls to elude their pursuers is to put their trust in Echo, a guy with secrets of his own. The trio must put their faith in the unknown to make a harrowing escape into the wilds beyond the city.<br/>Full of adrenaline-injected chases and heartbreaking confessions, Erasing Time explores the strength of the bonds between twins, the risks and rewards of trust, and the hard road to finding the courage to fight for what you believe in.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/39/23/9780062123923.jpg', 'title_long': 'Erasing Time (Erasing Time, 1)', 'edition': '1', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.95 Pounds, Width: 1.17 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.17}, 'weight': {'unit': 'pounds', 'value': 0.95}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 368, 'date_published': '2012-08-28', 'subjects': ['Teen & Young Adult', 'Literature & Fiction', 'Action & Adventure', 'Social & Family Issues', 'Science Fiction & Fantasy', 'Science Fiction', 'Romance', 'Science Fiction & Dystopian'], 'authors': ['C. J. Hill'], 'title': 'Erasing Time (Erasing Time, 1)', 'isbn13': '9780062123923', 'msrp': 17.99, 'binding': 'Hardcover', 'related': {'ePub': '0062123947'}, 'isbn': '0062123920', 'isbn10': '0062123920', 'other_isbns': [{'isbn': '9780062123947', 'binding': 'print'}]}}