{'book': {'publisher': 'Avon', 'synopsis': '“Her characters are intelligent, vibrant, and wonderfully complex. Katharine Ashe writes with eloquence and power.”<br/>—Lisa Kleypas<br/>“You’ll be swept away by Katharine Ashe’s evocative writing.”<br/>—Sabrina Jeffries<br/>The phenomenal Katharine Ashe flings open the portals of the mysterious Falcon Club—the intriguing Regency address that has every gossip in London asking, “What use has society of an exclusive gentleman’s club if no gentlemen are ever seen to pass through its door?”<br/>After years as an agent of the secret Falcon Club, Lord Leam Blackwood knows it’s time to return home to Scotland. One temptation threatens his plans-Kitty Savege. The scandal-plagued lady warms his blood like a dram of fine whiskey. But a dangerous enemy stands in the way of desire, and to beat this foe Leam needs Kitty’s help…<br/>Kitty never wanted to spend her holidays in a wretched country village! With snow up to the windows, escape is nowhere in sight. A rougish Scottish lord, however, is. His rough brogue sends tingles of heat from Kitty’s frigid toes to her chilled nose, but she’s confident she can withstand that. What she cannot control is the reaction of her carefully guarded heart when she discovers this beast is, in fact, no beast at all…', 'language': 'en', 'image': 'https://images.isbndb.com/covers/16/62/9780062031662.jpg', 'title_long': 'When a Scot Loves a Lady: A Falcon Club Novel (The Falcon Club, 1)', 'edition': 'Original', 'dimensions': 'Height: 6.7 Inches, Length: 1.2 Inches, Weight: 0.40565056208 Pounds, Width: 4.1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 1.2}, 'width': {'unit': 'inches', 'value': 4.1}, 'weight': {'unit': 'pounds', 'value': 0.40565056208}, 'height': {'unit': 'inches', 'value': 6.7}}, 'pages': 384, 'date_published': '2012-02-28', 'subjects': ['Literature & Fiction', 'Genre Fiction', "Women's Fiction", 'United States', 'Romance', 'Historical', 'Scottish', 'Regency'], 'authors': ['Katharine Ashe'], 'title': 'When a Scot Loves a Lady: A Falcon Club Novel (The Falcon Club, 1)', 'isbn13': '9780062031662', 'msrp': 2.99, 'binding': 'Mass Market Paperback', 'related': {'ePub': '0062030647'}, 'isbn': '006203166X', 'isbn10': '006203166X', 'other_isbns': [{'isbn': '9780062030641', 'binding': 'print'}]}}