{'book': {'publisher': 'It Books', 'synopsis': 'Nothin\' to Lose: The Making of KISS (1972-1975) chronicles, for the first time, the crucial formative years of the legendary rock band KISS, culminating with the groundbreaking success of their classic 1975 album Alive! and the smash single "Rock and Roll All Nite," a song that nearly four decades later remains one of rock\'s most enduring anthems. Drawing on more than two hundred interviews, the book offers a captivating and intimate fly-on-the-wall account of their launch, charting the struggles and ultimate victories that led them to the threshold of superstardom.<br/>Constructed as an oral history, the book includes original interviews with Paul Stanley, Gene Simmons, Ace Frehley, and Peter Criss, as well as with producers; engineers; management; record company personnel; roadies; club owners; booking agents; concert promoters; costume, stage, and art designers; rock photographers; publicists; and key music journalists.<br/>Many of KISS\'s musical contemporaries from the time, most of whom shared concert bills with the band on their early tours, also lend their perspective via new interviews; these include Bob Seger, Alice Cooper, and Ted Nugent, as well as members of Aerosmith, Black Sabbath, Rush, Slade, Blue Öyster Cult, Mott the Hoople, Journey, REO Speedwagon, Styx, Raspberries, The James Gang, The New York Dolls, Iggy & the Stooges, The Ramones, Suzi Quatro, Argent, and Uriah Heep, among others.<br/>The result is an indelible and irresistible portrait of a band on the rise and of the music scene they changed forever.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/17/20/9780062131720.jpg', 'title_long': "Nothin' to Lose: The Making of KISS (1972-1975)", 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.92 Pounds, Width: 1.37 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.37}, 'weight': {'unit': 'pounds', 'value': 1.92}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 560, 'date_published': '2013-09-10', 'subjects': ['Arts & Photography', 'Music', 'Musical Genres', 'Biographies & Memoirs', 'Arts & Literature', 'Actors & Entertainers', 'Composers & Musicians', 'Humor & Entertainment', 'Self Service', 'Custom Stores'], 'authors': ['Ken Sharp', 'Mr. Gene Simmons', 'Paul Stanley'], 'title': "Nothin' to Lose: The Making of KISS (1972-1975)", 'isbn13': '9780062131720', 'msrp': 29.99, 'binding': 'Hardcover', 'isbn': '0062131729', 'isbn10': '0062131729'}}