{'book': {'publisher': 'Avon', 'synopsis': '“Laurens’s books are always synonymous with sensuality and strong-willed heroes and heroines.”<br/>—Fresh Fiction<br/>The #1 New York Times bestselling author of The Capture of the Earl of Glencrae, romance fiction superstar Stephanie Laurens has done it again with this passionate tale of an oh-so-proper lady and the dangerous man for whom she throws caution to the wind. The Lady Risks All in this delightfully sexy and sensuous historical romance novel from the creator of the recklessly romantic Cynster family—Regency England’s most irrepressible clan of sexy rogues and ladies—as well as the acclaimed Bastion Club books. The notorious Neville Roscoe, who lives boldly outside the bounds of proper society, is one of Laurens’s most unforgettable heroes—and the story of his seduction of prim, straight-laced Miranda Clifford is filled with intrigue, danger, and passion that will thrill not only Stephanie Laurens fans, but devoted readers of Lisa Kleypas, Johanna Lindsey, and Mary Balogh as well.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/86/37/9780062068637.jpg', 'title_long': 'The Lady Risks All', 'edition': 'Original', 'dimensions': 'Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.45 Pounds, Width: 0.99 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 0.99}, 'weight': {'unit': 'pounds', 'value': 0.45}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 496, 'date_published': '2012-09-25', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'United States', 'Romance', 'American', 'Victorian', 'Regency'], 'authors': ['Stephanie Laurens'], 'title': 'The Lady Risks All', 'isbn13': '9780062068637', 'msrp': 2.99, 'binding': 'Mass Market Paperback', 'related': {'Kindle Edition': '0062066269', 'ePub': '0062066269'}, 'isbn': '0062068636', 'isbn10': '0062068636', 'other_isbns': [{'isbn': '9780062066268', 'binding': 'print'}]}}