{'book': {'publisher': 'Rayo', 'synopsis': 'Adele Faber y Elaine Mazlish han ayudado a millones de familias con sus bestsellers. Ahora, y por primera vez en español, estas aclamadas expertas a nivel internacional nos ofrecen una guía que le dará las herramientas necesarias para ayudarles a sus adolescentes -- ¡y a usted mismo! -- a sobrevivir la etapa difícil de la adolescencia. "Mi hijo de trece años pasa su tiempo con los peores chicos de la escuela. Le paso diciendo que se aleje de ellos, pero siempre me ignora. ¿Cómo hago para que me haga caso?" "Mi hija pasa mucho tiempo en el Internet charlando con un muchacho de dieciséis años. Bueno, por lo menos eso dice él. Ahora la quiere conocer. Ella está muy entusiasmada. Yo tengo miedo. ¿Qué hago?" "Acabo de enterarme que mi hija de doce años fuma marihuana. ¿Cómo la confronto?" Vivir con un adolescente puede ser abrumador. A veces es como si nuestros niños cariñosos se convirtieran de la noche a la mañana en adolescentes independientes, con sus propios pensamientos, gustos y valores. Hoy en día, los jóvenes están creciendo en un mundo más cruel, más materialista, más sexual y más violento que antes. ¿Qué se debe hacer? Tras muchos años de investigación, conferencias y comentarios que han recibido, Faber y Mazlish, autoras del clásico bestseller Cómo Hablar para que los Niños Escuchen y Cómo Escuchar para que los Niños Hablen, han desarrollado una innovadora forma de mantener un diálogo abierto y respetuoso entre padres y adolescentes, una estrategia que le pone frenos al conflicto, reduce frustraciones y fomenta conversaciones acerca de las drogas, el sexo y otros temas difíciles y de actualidad. Escrito en el estilo práctico y popular de estas galardonadas autoras, y lleno de sugerencias, historias y dibujos, esta guía le ayudará a construir una relación más comunicativa y menos conflictiva con sus adolescentes.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/91/77/9780062209177.jpg', 'title_long': 'Cómo Hablar para que los Adolescentes Escuchen y Cómo Escuchar (Spanish Edition)', 'edition': 1, 'dimensions': 'ePub', 'pages': 242, 'date_published': '2012', 'subjects': ['General', 'Adolescence', 'Conflict Resolution', 'Teenagers', 'Adolescent', 'Motherhood', 'Clinical Psychology', 'Emotions', 'Social Sciences -> Family & Consumer Sciences -> Parenting', 'Social Sciences -> Family & Consumer Sciences -> Child & Adolescent Development', 'Social Sciences -> Family & Consumer Sciences -> General'], 'authors': ['Adele Faber', 'Elaine Mazlish'], 'title': 'Cómo Hablar para que los Adolescentes Escuchen y Cómo Escuchar (Spanish Edition)', 'isbn13': '9780062209177', 'msrp': 10.39, 'binding': 'Kindle Edition', 'isbn': '0062209175', 'isbn10': '0062209175', 'other_isbns': [{'isbn': '9780060730888', 'binding': 'print'}, {'isbn': '9780060841294', 'binding': 'print'}]}}