{'book': {'publisher': 'Balzer + Bray', 'synopsis': "For fans of the Chronicles of Narnia comes the second book in the Wildwood Chronicles, the New York Times bestselling fantasy adventure series by Colin Meloy, lead singer of the Decemberists, and Carson Ellis, acclaimed illustrator of The Mysterious Benedict Society.<br/>The three books in the Wildwood Chronicles captivate readers with the wonder and thrill of a secret world within the landscape of a modern city. The books feel at once firmly steeped in the classics of children's literature and completely fresh. Each story is told from multiple points of view, and the books feature more than eighty illustrations, including six full-color plates, making them an absolutely gorgeous object.<br/>In Under Wildwood, Colin Meloy and Carson Ellis reveal new dimensions of the epic fantasy-adventure series begun with the critically acclaimed, bestselling Wildwood.<br/>Ever since Prue McKeel returned home from the Impassable Wilderness after rescuing her brother from the malevolent Dowager Governess, life has been pretty dull. School holds no interest for her, and her new science teacher keeps getting on her case about her dismal test scores and daydreaming in class. Her mind is constantly returning to the verdant groves and sky-tall trees of Wildwood, where her friend Curtis still remains as a bandit-in-training.<br/>But all is not well in that world. Dark assassins with mysterious motives conspire to settle the scores of an unknown client. A titan of industry employs inmates from his orphanage to work his machine shop, all the while obsessing over the exploitation of the Impassable Wilderness. And, in what will be their greatest challenge yet, Prue and Curtis are thrown together again to save themselves and the lives of their friends, and to bring unity to a divided country. But in order to do that, they must go under Wildwood.<br/>The bestselling trilogy from Colin Meloy and Carson Ellis consists of Wildwood, Under Wildwood, and Wildwood Imperium.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/47/18/9780062024718.jpg', 'title_long': 'Under Wildwood (Wildwood Chronicles)', 'edition': 'First Edition', 'dimensions': 'Weight: 1.01 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 1.01}}, 'pages': 576, 'date_published': '2012', 'subjects': ["Children's Books", 'Growing Up & Facts of Life', 'Family Life', 'Friendship, Social Skills & School Life', 'Action & Adventure', 'Science Fiction & Fantasy', 'Fantasy & Magic'], 'authors': ['Colin Meloy'], 'title': 'Under Wildwood (Wildwood Chronicles)', 'isbn13': '9780062024718', 'msrp': 11.98, 'binding': 'Paperback', 'isbn': '006202471X', 'isbn10': '006202471X'}}