{'book': {'publisher': 'Greenwillow Books', 'synopsis': '"I would like to declare Diana Wynne Jones an international treasure," proclaimed Neil Gaiman, Newbery Medalist and best-selling author. In this enchanting introduction to Diana Wynne Jones\'s magical and funny work, Earwig is a fearless young orphan. When she finds herself in a house of dark magic, she does whatever she can to adapt—especially if it means that she\'ll learn a little magic herself! A young middle grade novel by World Fantasy Award for Lifetime Achievement‒winner Diana Wynne Jones, beautifully illustrated in black and white by Caldecott Medalist Paul O. Zelinsky.<br/>Not every orphan would love living at St. Morwald\'s Home for Children, but Earwig does. She gets whatever she wants, whenever she wants it, and it\'s been that way since she was dropped on the orphanage doorstep as a baby. But all that changes the day Bella Yaga and the Mandrake come to St. Morwald\'s, disguised as foster parents. Earwig is whisked off to their mysterious house full of invisible rooms, potions, and spell books, with magic around every corner. Most children would run in terror from a house like that . . . but not Earwig. Using her own cleverness—with a lot of help from a talking cat—she decides to show the witch who\'s boss.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/51/16/9780062075116.jpg', 'title_long': 'Earwig and the Witch', 'edition': 'Illustrated', 'dimensions': 'Height: 7.12 inches, Length: 5.5 inches, Weight: 0.49 Pounds, Width: 0.61 inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.61}, 'weight': {'unit': 'pounds', 'value': 0.49}, 'height': {'unit': 'inches', 'value': 7.12}}, 'pages': 128, 'date_published': '2012-01-31', 'subjects': ["Children's Books", 'Growing Up & Facts of Life', 'Family Life', 'Action & Adventure', 'Humor', 'Science Fiction & Fantasy', 'Fantasy & Magic', 'Self Service', 'Custom Stores'], 'authors': ['Diana Wynne Jones'], 'title': 'Earwig and the Witch', 'isbn13': '9780062075116', 'msrp': 15.99, 'binding': 'Hardcover', 'isbn': '006207511X', 'isbn10': '006207511X'}}