{'book': {'publisher': 'Balzer + Bray', 'synopsis': "Reminiscent of Before I Fall, Elizabeth Norris's Unraveling blends realistic coming-of-age issues and heart-stopping romance with something just a little bit more. In this case, a gripping science fiction world.<br/>Unraveling's heroine, seventeen-year-old Janelle Tenner, is used to having a lot of responsibility. She balances working as a lifeguard in San Diego with an intense academic schedule. Janelle's mother is bipolar, and her dad is a workaholic FBI agent, which means Janelle also has to look out for her younger brother.<br/><br/>And that was before she died...and is brought back to life by Ben Michaels, a mysterious, alluring loner from her high school. The more Janelle tries to figure him out, the more she starts to believe he's connected to a case her father is working on. The one where people are dying of radiation poisoning and the body count is rising. The one that involves a strange clock that seems to be counting down to the earth's destruction. If Janelle wants to stop the clock and save the world, she has twenty-four days to uncover Ben's secrets--and keep from falling in love with him.<br/><br/>From debut author Elizabeth Norris, comes this shattering novel of one girl's fight to save herself, her world, and the boy she never saw coming.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/37/41/9780062103741.jpg', 'title_long': 'Unraveling', 'edition': 'Reprint', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 0.76 Pounds, Width: 1.08 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 1.08}, 'weight': {'unit': 'pounds', 'value': 0.76}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 480, 'date_published': '2013-04-15', 'subjects': ['Teen & Young Adult', 'Literature & Fiction', 'Action & Adventure', 'Mysteries & Thrillers', 'Romantic', 'Fantasy & Supernatural', 'Law & Crime', 'Science Fiction & Fantasy', 'Fantasy', 'Science Fiction', 'Romance', 'Paranormal', 'Science Fiction & Dystopian', 'Self Service', 'Custom Stores'], 'authors': ['Elizabeth Norris'], 'title': 'Unraveling', 'isbn13': '9780062103741', 'msrp': 9.99, 'binding': 'Paperback', 'related': {'ePub': '006210375X'}, 'isbn': '0062103741', 'isbn10': '0062103741', 'other_isbns': [{'isbn': '9780062103758', 'binding': 'print'}]}}