{'book': {'publisher': 'Greenwillow Books', 'synopsis': "Meet Penny, the sweet and curious mouse, in Caldecott Medalist and bestselling author Kevin Henkes’s instant classic story for young readers, perfect for fans Lilly’s Purple Plastic Purse, Owen, and Chrysanthemum.<br/>When Penny comes home from school, she is ready to sing her song. But the babies are sleeping, and Mama and Papa are worried that Penny will wake them up. Oh, but it is a good song, a really wonderful song . . . and Penny wants more than anything to sing it. Will it ever be the right time to sing it?<br/>Penny and Her Song is a Level One I Can Read book, which means it's perfect for children learning to sound out words and sentences. Kevin Henkes is a master at creating beautifully illustrated books that resonate with young children. The Penny books are new classics for beginning readers and will appeal to fans of Frog and Toad, Little Bear, and Henry and Mudge.<br/>Don't miss Penny's newest adventures in Penny and Her Sled!", 'language': 'en', 'image': 'https://images.isbndb.com/covers/19/57/9780062081957.jpg', 'title_long': 'Penny and Her Song', 'edition': 'Illustrated', 'dimensions': 'Height: 0.38 Inches, Length: 8.68 Inches, Weight: 0.48 Pounds, Width: 6.41 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.68}, 'width': {'unit': 'inches', 'value': 6.41}, 'weight': {'unit': 'pounds', 'value': 0.48}, 'height': {'unit': 'inches', 'value': 0.38}}, 'pages': 32, 'date_published': '2012-02-28', 'subjects': ["Children's Books", 'Animals', 'Mice, Hamsters, Guinea Pigs & Squirrels', 'Arts, Music & Photography', 'Performing Arts', 'Growing Up & Facts of Life', 'Family Life', 'Friendship, Social Skills & School Life', 'Literature & Fiction', 'Chapter Books & Readers', 'Education & Reference', 'Self Service', 'Custom Stores'], 'authors': ['Kevin Henkes'], 'title': 'Penny and Her Song', 'isbn13': '9780062081957', 'msrp': 12.99, 'binding': 'Hardcover', 'isbn': '0062081950', 'isbn10': '0062081950'}}