{'book': {'publisher': 'William Morrow', 'synopsis': '“The undisputed king of the comic crime novel.”<br/>—Providence Journal<br/>Nobody does Florida weirdness quite like Tim Dorsey! Case in point: When Elves Attack, the New York Times bestselling author’s twisted Christmas present to his legion of adoring fans who can’t get enough of thrill-killer and Sunshine State historian Serge A. Storms, the most endearing psychopath since Dexter. Dorsey offers the perfect antidote for all those sappy feel-good holiday stories with this zany blockbuster extravaganza in which his wonderfully deranged serial killer Floridaphile delivers his special brand of Christmas cheer. More outrageous than Santa Claus in a Speedo, When Elves Attack serves up a Yuletide feast of the “pure gonzo humor” the New York Times Book Review enthusiastically attributes to this fearlessly funny writer. Think Bad Santa and National Lampoon’s Family Vacation, blend in Dorsey’s trademark appetite for destruction, and you’ve got hilarious crime fiction black comedy that anyone would be thrilled to discover stuffed in their Christmas stocking.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/28/47/9780062092847.jpg', 'title_long': 'When Elves Attack: A Joyous Christmas Greeting from the Criminal Nutbars of the Sunshine State (Serge Storms)', 'edition': 'First Edition', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.3 Pounds, Width: 0.77 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.77}, 'weight': {'unit': 'pounds', 'value': 0.3}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 208, 'date_published': '2011-10-25', 'subjects': ['Biographies & Memoirs', 'Leaders & Notable People', 'Rich & Famous', 'Humor & Entertainment', 'Pop Culture', 'Art', 'Literature & Fiction', 'Genre Fiction', 'Action & Adventure', 'Mystery, Thriller & Suspense', 'United States', 'Humor', 'Humor & Satire', 'Humorous', 'Contemporary', 'Mystery', 'Private Investigators', 'Amateur Sleuths'], 'authors': ['Tim Dorsey'], 'title': 'When Elves Attack: A Joyous Christmas Greeting from the Criminal Nutbars of the Sunshine State (Serge Storms)', 'isbn13': '9780062092847', 'msrp': 16.99, 'binding': 'Hardcover', 'isbn': '0062092847', 'isbn10': '0062092847'}}