{'book': {'publisher': 'Greenwillow Books', 'synopsis': 'Review      Praise for Amelia Bedelia’s First Day of School: New York Times Bestseller “Readers will giggle over Amelia Bedelia’s mishaps, and her genuine joie de vivre may assurage first-day fears.” -- Publishers Weekly“Amelia Bedelia wears her new picture-book format well…[it] works beautifully as a new way to encounter the gaffe-prone gal.” -- ALA BooklistPraise for Amelia Bedelia’s First Valentine: New York Times Bestseller “[Amelia Bedelia’s] ingenuous spirit will continue to capture hearts.” -- Publishers Weekly      Product Description      Amelia Bedelia is sure she will love everything about school election day.The fun choicesHaving a voiceRunning for officeWorking togetherVotingAmelia Bedelia can’t wait.What could be better?Hooray for school!Hooray for elections!Hooray for voting!Amelia Bedelia has been making readers laugh since 1963, when the first Amelia Bedelia book was published. Now, for the first time, you can meet the young Amelia Bedelia. Come join the fun!       About the Author      Herman Parish was in the fourth grade when his aunt, Peggy Parish, wrote the first book about Amelia Bedelia. The author lives in Princeton, New Jersey.Lynne Avril has illustrated all the stories about young Amelia Bedelia. The artist lives in Phoenix, Arizona.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/40/63/9780062094063.jpg', 'title_long': "Amelia Bedelia's First Vote", 'edition': 'Illustrated', 'dimensions': 'Height: 11 Inches, Length: 9.5 Inches, Weight: 0.9 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 9.5}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 11}}, 'pages': 32, 'date_published': '2012-04-03', 'subjects': ["Children's Books", 'Growing Up & Facts of Life', 'Friendship, Social Skills & School Life', 'Humor'], 'authors': ['Herman Parish'], 'title': "Amelia Bedelia's First Vote", 'isbn13': '9780062094063', 'msrp': 17.89, 'binding': 'Library Binding', 'isbn': '0062094068', 'isbn10': '0062094068'}}