{'book': {'publisher': 'William Morrow', 'synopsis': "A mesmerizing literary thriller about the bond between two brothers and the evil they face in a small North Carolina town—author Wiley Cash displays a remarkable talent for lyrical, powerfully emotional storytelling. A Land More Kind than Home is a modern masterwork of Southern fiction, reminiscent of the writings of John Hart (Down River), Tom Franklin (Crooked Letter, Crooked Letter), Ron Rash (Serena), and Pete Dexter (Paris Trout)—one that is likely to be held in the same enduring esteem as such American classics as To Kill a Mockingbird, Of Mice and Men, and A Separate Peace. A brilliant evocation of a place, a heart-rending family story, a gripping and suspenseful mystery. For a curious boy like Jess Hall, growing up in Marshall means trouble when your mother catches you spying on grown-ups. Adventurous and precocious, Jess is enormously protective of his older brother, Christopher, a mute whom everyone calls Stump. Though their mother has warned them not to snoop, Stump can't help sneaking a look at something he's not supposed to—an act that will have catastrophic repercussions, shattering both his world and Jess's. It's a wrenching event that thrusts Jess into an adulthood for which he's not prepared. While there is much about the world that still confuses him, he now knows that a new understanding can bring not only a growing danger and evil—but also the possibility of freedom and deliverance as well. Told by three resonant and evocative characters—Jess; Adelaide Lyle, the town midwife and moral conscience; and Clem Barefield, a sheriff with his own painful past—A Land More Kind Than Home\xa0is a haunting tale of courage in the face of cruelty and the power of love to overcome the darkness that lives in us all. These are masterful portrayals, written with assurance and truth, and they show us the extraordinary promise of this remarkable first novel.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/82/46/9780062088246.jpg', 'title_long': 'A Land More Kind Than Home: A Novel', 'edition': 'Reprint', 'dimensions': 'ePub', 'pages': 325, 'date_published': '2012', 'subjects': ['Literary', 'Suspense', 'Historical', 'Religious', 'Gothic', 'Coming of Age', 'English & College Success -> English -> Fiction'], 'authors': ['Wiley Cash'], 'title': 'A Land More Kind Than Home: A Novel', 'isbn13': '9780062088246', 'msrp': 15.99, 'binding': 'Kindle Edition', 'related': {'Paperback': '0062088238'}, 'isbn': '0062088246', 'isbn10': '0062088246', 'other_isbns': [{'isbn': '9780062088239', 'binding': 'print'}]}}