{'book': {'publisher': 'HarperCollins', 'synopsis': "<p><p>&#145;a Clever Reworking Of A Classic Story. The Little Old Lady&#146;s Fearless Attitude And Her Clever Solution As To What To Do With The Lively Shoes, Pants, Shirt And Pumpkin Head That Are Chasing Her Will Enchant Young Audiences. With Brilliantly Colored, Detailed Folk Art Illustrations. A Great Purchase.&#146; &#151;slj. <p> Children's Choices For 1987 (ira/cbc)<br>notable 1986 Children's Trade Books In Social Studies (ncss/cbc)<br>children's Books Of 1986 (library Of Congress)<br>1988 Keystone To Reading Book Award (pennsylvania Reading Association)</p><h3>publishers Weekly</h3><p>there Is Enough Action And Recurring Clomp Clomps, Wiggle Wiggles And Shake Shakes In Williams's First Story To Hold Any Young Reader's Attention. A Brave Old Woman Begins A Walk In The Forest Where She Meets Two Big Shoes. Further Down The Path, A Pair Of Pants, A Shirt, Two Gloves, A Hat And A Pumpkin Head Come Into Sight, Each Trying To Frighten Her. When She's Back Inside Her Cottage, A Knock Knock Challenges Her To Open Her Door. Again, The Shoes, Pants, Shirt, Gloves, Hat And Pumpkin Head Try To Scare Her, But Find It Impossibly Discouraging. These Assorted Items Have A Callingto Frighten Someone Or Somethingand Thanks To The ``little Old Lady'' They Become The Nastiest Scare-crow Ever. The Fearless Woman's Brave Showing, And Her Determination Not To Be Afraid, Should Strike A Note Of Familiarity With Children. Lloyd's Dark Forest Settings, Wriggling Clothing And Homey Interiors Are A Perfect Complement To The Text. (3-7)</p>", 'language': 'en', 'image': 'https://images.isbndb.com/covers/18/35/9780064431835.jpg', 'title_long': 'The Little Old Lady Who Was Not Afraid of Anything', 'edition': 'Illustrated', 'dimensions': '9.60 (w) x 7.80 (h) x 0.10 (d)', 'pages': 32, 'date_published': '2015', 'subjects': ["Children's Books", 'Growing Up & Facts of Life', 'Friendship, Social Skills & School Life', 'Literature & Fiction', 'Short Story Collections', 'Fairy Tales, Folk Tales & Myths', 'Science Fiction & Fantasy', 'Spine-Chilling Horror', 'Holidays & Celebrations', 'Halloween', 'Kindle Store', 'Categories', 'Kindle eBooks'], 'authors': ['Linda Williams'], 'title': 'The Little Old Lady Who Was Not Afraid of Anything', 'isbn13': '9780064431835', 'msrp': 5.37, 'binding': 'Kindle Edition', 'isbn': '0064431835', 'isbn10': '0064431835'}}