{'book': {'publisher': 'Westview Press', 'synopsis': 'This brilliant study of American art is again available with a new preface by the author, a few corrections in the text, and a revised and updated bibliography. Widely acclaimed for its perception and scholarship, the book concentrates on a number of leading artists, including Washington Allston, Thomas Cole, Asher B. Durand, Fitz Hugh Lane, William Sidney Mount, Winslow Homer, Thomas Eakins, and Albert Pinkham Ryder. Examining each artist in an individual essay, Barbara Novak presents key ideas on the nature of American art of the nineteenth century, framing these ideas with reference to the eighteenth and twentieth centuries and relating American art to American and European traditions. She draws provocative and original conclusions about the roles in American art of spiritualism and mathematics, analyzes not only the painting but nineteenth-century aesthetic theory as well, achieving a unique synthesis of art and literature. Brief biographies of forty-eight artists mentioned in the text are appended and furnish a valuable reference source.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/09/95/9780064300995.jpg', 'title_long': 'American Painting Of The 19th Century: Realism, Idealism, And The American Experience, Second Edition', 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 7.5 Inches, Weight: 1.01 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.5}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 1.01}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 352, 'date_published': '1979-11-27', 'subjects': ['Arts & Photography', 'History & Criticism', 'Criticism', 'History', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Barbara Novak'], 'title': 'American Painting Of The 19th Century: Realism, Idealism, And The American Experience, Second Edition', 'isbn13': '9780064300995', 'msrp': 46, 'binding': 'Paperback', 'isbn': '0064300994', 'isbn10': '0064300994'}}