{"book": {"publisher": "Amistad", "synopsis": "Sometimes I feel like I have walked into the middle of a movie. Maybe I can make my own movie. The film will be the story of my life. No, not my life, but of this experience. I\"ll call it what the lady who is the prosecutor called me. MONSTER.<br/>FADE IN: INTERIOR COURT. A guard sits at a desk behind Steve. Kathy O\'Brien, Steve\'s lawyer, is all business as she talks to Steve.<br/>O\'BRIEN<br/>Let me make sure you understand what\'s going on. Both you and this king character are on trial for felony murder. Felony Murder is as serious as it gets. . . . When you\'re in court, you sit there and pay attetion. You let the jury know that you think the case is a serious as they do. . . .<br/>STEVE<br/>You think we\'re going to win ?<br/>O\'BRIEN (seriously)<br/>It probably depends on what you mean by 'win.'<br/>Sixteen-year-old Steve Harmon is on trial for murder. A Harlem drugstore owner was shot and killed in his store, and the word is that Steve served as the lookout.<br/>Guilty or innocent, Steve becomes a pawn in the hands of 'the system,' cluttered with cynical authority figures and unscrupulous inmates, who will turn in anyone to shorten their own sentences. For the first time, Steve is forced to think about who he is as he faces prison, where he may spend all the tomorrows of his life.<br/>As a way of coping with the horrific events that entangle him, Steve, an amateur filmmaker, decides to transcribe his trial into a script, just like in the movies. He writes it all down, scene by scene, the story of how his whole life was turned around in an instant. But despite his efforts, reality is blurred and his vision obscured until he can no longer tell who he is or what is the truth. This compelling novel is Walter Dean Myers\'s writing at its best.<br/>2000 Coretta Scott King Honor Book,
        2000 Michael L. Printz Award,
        1999 National Book Award Finalist,
        01 Heartland Award for Excellence in YA Lit Finalist,
        00-01 Tayshas High School Reading List, and 00-01 Black-Eyed Susan Award Masterlist<br/>2000 Best Books for Young Adults (ALA), Hornbook Fanfare 2000, Michael L. Printz Award 2000,
        2000 Coretta Scott King Award Author Honor Book,
        2000 Quick Picks for Young Adults (Recomm. Books for Reluctant Young Readers), and 2000 Best Books for Young Adults (ALA)", "language": "en", "image": "https: //images.isbndb.com/covers/73/11/9780064407311.jpg", "title_long": "Monster", "edition": "Reprint", "dimensions": "Height: 0.84 inches, Length: 7.19 inches, Weight: 0.51147244784 Pounds, Width: 4.96 inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.19}, "width": {"unit": "inches", "value": 4.96}, "weight": {"unit": "pounds", "value": 0.51147244784}, "height": {"unit": "inches", "value": 0.84}}, "pages": 281, "date_published": "2001-05-01", "subjects": ["Teen & Young Adult', 'Literature & Fiction', 'Social & Family Issues', 'Mysteries & Thrillers', 'Law & Crime', 'Self Service', 'Custom Stores'], 'authors": ["Walter Dean Myers'], 'title": "Monster", "isbn13": "9780064407311", "msrp": 9.99, "binding": "Paperback", "related": {"Kindle Edition": "0061975028", "ePub": "0061975028"}, "isbn": "0064407314", "isbn10": "0064407314", "other_isbns": [{'isbn": "9780061975028", "binding": "print"}]}}