{'book': {'publisher': 'William Morrow', 'synopsis': "A true master of the action-packed geopolitical thriller, Richard Herman puts America in the middle of a two-front war where success is far from certain. The Last Phoenix<br/>It is the beginning of a new century and Maddy Turner, the first woman to occupy the White House, is about to become a wartime president. The war on terrorism has been too successful; the radical Islamic states have devised a brilliant, unthinkable strategy and found a new ally in a surging China. They know the price will be high, but the prize is control of the vast Middle Eastern oil reserves and the strategic Strait of Malacca. By working in concert where timing is critical, they intend to create a new axis of world power by ensnaring the president's armed forces in a devastating double-pronged conflict -- a war the American military can no longer win.<br/>Fueled by the failure of her intelligence agencies to foresee the unexpected, President Turner must react to a global crisis of world-altering proportions, as nightmarish scenes of brutal conflict and terrorism are played out half a world away. It will take courage, remarkable cunning, stealth, luck, and seemingly unbearable sacrifice to avoid Armageddon, as she approaches what will either be her finest hour or her most tragic mistake. But working below the radarscopes of Turner's antagonists is an ancient warrior on a quest of vengeance in the jungles of Malaysia. Victor Kamigami, a legend in the world of special operations, is a wild card no one knows is in play.<br/>Fighting for reelection against a political enemy as unprincipled and determined as her foes on the battlefield, Turner must turn to the man she trusts above all others, perhaps the only one she can trust in the brutal snake pit of Beltway politics: Brigadier General Matt Pontowski -- himself the grandson of a president -- a brilliant flier and military tactician, and an intimate confidant of the most powerful woman on earth. The mission she must entrust him with is bold and extraordinary -- and potentially suicidal -- a daring incursion into the Malaysian jungle, where a small force of determined warriors must hold off a fearsome, overwhelming aggressor long enough for another war to be won. The risks are astronomical, the chance of success slim. But the alternative is unthinkable. And it is the only road America has left.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/97/60/9780066209760.jpg', 'title_long': 'The Last Phoenix', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.3 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 1.3}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 448, 'date_published': '2002-07-23', 'subjects': ['Literature & Fiction', 'Literary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense'], 'authors': ['Richard Herman'], 'title': 'The Last Phoenix', 'isbn13': '9780066209760', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '0066209765', 'isbn10': '0066209765'}}