{'book': {'publisher': 'William Morrow', 'synopsis': "The enchanting, heartwarming story of a young woman's journey toward true love and self-discovery<br/>Girl Anatomy, Rebecca Bloom's debut novel, marked the arrival of a fresh new voice on the contemporary women's fiction scene. Now Bloom is back with her shimmering sophomore effort, Tangled Up in Daydreams. Bloom takes the themes that put her on the map -- navigating L.A.'s social landscape with the help of trusty friends, a family's unconditional devotion, and the heartbreaking roller coaster of true love -- and creates another irresistible novel.<br/>Molly is a sweet, funny, and occasionally klutzy Los Angeles hipster with a blossoming new business and a supportive family. When she and Liam, a talented, up-and-coming musician, meet, their attraction is instant, their connection unparalleled.<br/>But when Liam's recreational dabbling in the darker side of fame turns into a full-blown addiction, Molly must decide if her love is enough to change Liam. . . or if she should let him go to save herself.<br/>Rebecca Bloom's exploration of a woman's emotional crossing -- through the search for the love of a lifetime -- is a stylish and sparkling novel. Tangled Up in Daydreams confirms her place as one of the brightest young creative talents today.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/25/86/9780066212586.jpg', 'title_long': 'Tangled Up in Daydreams: A Novel', 'edition': 'First Edition', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.95 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.95}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 288, 'date_published': '2003-11-25', 'subjects': ['Literature & Fiction'], 'authors': ['Rebecca Bloom'], 'title': 'Tangled Up in Daydreams: A Novel', 'isbn13': '9780066212586', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0066212588', 'isbn10': '0066212588'}}