{'book': {'publisher': 'William Morrow', 'synopsis': 'A broken kitchen appliance leads Bobbie Kaplowitz -- a single mother of a six-year-old son -- to a new understanding of love and life in the title story of In Case We\'re Separated, Alice Mattison\'s family chronicle of interrelated stories.<br/>Spanning the twentieth century, In Case We\'re Separated looks at a family of Jewish immigrants in the 1920s and 1930s, and follows their children, grandchildren, and great-grandchildren as they all lead urban, emotionally turbulent lives against the backdrop of political assassinations, the Vietnam War, and the AIDS epidemic.<br/>The title story, which appeared in Best American Short Stories 2002, begins with Bobbie in 1954 Brooklyn. Subsequent stories deal with Bobbie\'s son, Bradley, a gay man living outside Boston with his partner and playing detective after a cousin\'s girlfriend is assaulted at knifepoint.<br/>Other stories concern two sisters: one is an editor, always trying to figure out just how Jewish she is, always trying to get through to her troubled sister. The sister, a would-be suicide during the 1960s and 1970s, reappears as a shaky Prozac miracle, helping others and scrambling to hold on to happiness in her middle-aged life. The sisters keep looking for the right man, and the next-to-the-last story includes a midlife wedding and the gathering of what remains of this varied clan.<br/>The sisters\' aunt Sylvia appears and reappears throughout the book. She\'s a schoolteacher who always knows what\'s best for everyone; later, she\'s a middle-aged woman still trying to hold on to hope -- and looking for her "next affair" -- despite an aging mother, an unhappy son, and the election of Ronald Reagan. Later still, with failing eyesight, she hangs on to dignity in her own old age, not wanting to ask her busy, professional daughter whether her shoes match.<br/>Alice Mattison\'s recent novel The Wedding of the Two-Headed Woman was called "quietly splendid" by the New York Times. The Los Angeles Times has called her "a writer\'s writer." In In Case We\'re Separated, Mattison\'s gift for storytelling and ability to create rich, multidimentional characters prove, once again, that she is a master of her craft.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/37/74/9780066213774.jpg', 'title_long': "In Case We're Separated: Connected Stories", 'edition': 'First Edition', 'dimensions': 'Height: 7.5 Inches, Length: 6.5 Inches, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1}, 'height': {'unit': 'inches', 'value': 7.5}}, 'pages': 240, 'date_published': '2005-10-11', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Family Life', 'City Life', 'Short Stories & Anthologies', 'Short Stories', "Women's Fiction", 'Domestic Life', 'Mothers & Children', 'World Literature', 'Jewish', 'United States'], 'authors': ['Alice Mattison'], 'title': "In Case We're Separated: Connected Stories", 'isbn13': '9780066213774', 'msrp': 23.95, 'binding': 'Hardcover', 'isbn': '0066213770', 'isbn10': '0066213770'}}