{'book': {'publisher': 'Ecco', 'synopsis': 'Ramona Drottoveo, an albino with unusual looks, is a chambermaid at a lush Italian estate, La Casa. Further distinguished by the intoxicating scent she exudes, Ramona effortlessly bewitches all men, who are driven into an erotic frenzy each time they inhale her aroma. Ramona -- haughty and misguided -- eagerly satisfies their inexhaustible lust, while the women at the estate scold and despise her.<br/>Ramona\'s life changes when she marries a sweet beekeeper, a victim of her enchantment. But the marriage doesn\'t last long: the beekeeper dies after discovering his bride with a new lover on their wedding day. When the beekeeper\'s body disappears, the superstitious villagers blame Ramona and her lover and exile the couple from the estate to the neighboring city of Naples. The story follows Ramona through her tragicomic misadventures in Naples, where her life is transformed once again. by the birth of an unwanted daughter, Blandina, who "steals" Ramona\'s scent, depriving her mother of her only asset in life. No longer able to seduce men into blind submission, Ramona returns humbly to La Casa to an unexpected welcome -- and revenge.<br/>A hilarious and naughty celebration of the senses and the strange places they can lead us, Nectar is a wildly entertaining fable on the mystery and cruelty of sexual attraction and the frivolous nature of divine justice.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/25/93/9780066212593.jpg', 'title_long': 'Nectar: A Novel of Temptation', 'edition': 'First Edition', 'dimensions': 'Height: 8.25 Inches, Length: 5.62 Inches, Weight: 1.03 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.62}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 1.03}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 272, 'date_published': '2002-06-18', 'subjects': ['Literature & Fiction', 'United States', 'Literary'], 'authors': ['Lily Prior'], 'title': 'Nectar: A Novel of Temptation', 'isbn13': '9780066212593', 'msrp': 23.95, 'binding': 'Hardcover', 'isbn': '0066212596', 'isbn10': '0066212596'}}