{'book': {'publisher': 'Ecco', 'synopsis': "<p>With a body twisted by adolescent scoliosis and memories of the brutal death of a woman he loved, Lynn Schooler kept the world at arm's length, drifting through the wilds of Alaska as a commercial fisherman, outdoorsman, and wilderness guide. In 1990 Schooler met Japanese photographer Michio Hoshino and began a profound friendship forged by a love of adventure and cemented by their mutual obsession with finding the elusive glacier bear, an exceedingly rare creature, seldom seen and shrouded in legend. But it was only after Hoshino's tragic death from a bear attack that Schooler succeeded in photographing the animal -- and only then that he Was able to complete his journey and find new meaning in his own life.</p><br/><p>Set amid the wild archipelagoes, glittering fjords, and dense primordial forests of Alaska's Glacier Coast, The Blue Bear is an unforgettable book that shines with purity and passion.</p>", 'language': 'en', 'image': 'https://images.isbndb.com/covers/08/58/9780066210858.jpg', 'title_long': 'The Blue Bear: A True Story of Friendship, Tragedy, and Survival in the Alaskan Wilderness', 'edition': '1st Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.2 Pounds, Width: 0.97 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.97}, 'weight': {'unit': 'pounds', 'value': 1.2}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 288, 'date_published': '2002', 'subjects': ['Science & Math', 'Biological Sciences', 'Animals', 'Nature & Ecology', 'Nature Writing & Essays', 'Sports & Outdoors', 'Winter Sports', 'Travel', 'Polar Regions', 'Arctic', 'Specialty Travel', 'Adventure', 'United States', 'West', 'Alaska', 'Travel Writing'], 'authors': ['Lynn Schooler'], 'title': 'The Blue Bear: A True Story of Friendship, Tragedy, and Survival in the Alaskan Wilderness', 'isbn13': '9780066210858', 'msrp': 1.99, 'binding': 'Hardcover', 'isbn': '0066210852', 'isbn10': '0066210852'}}