{'book': {'publisher': 'McGraw-Hill', 'synopsis': "When you don't have the time. . . but you still need the grade! If your life is too busy to spend hours ploughing through weighty textbooks,and you need every study minute to count,this Schaum's Easy Outline is perfect for you! This super-condensed,high-torque study guide gives you what you need to know in a fraction of the time. Super-Impact Built for quick,effective study,this Easy Outline packs exciting new learning tools that make mastering biology fast,funand almost automatic. Speedy Quick-study experts slashed the time you need to spend with your books by reducing college algebra to the essentials the professor expects you to know. This Easy Outline is perfect for test preparation,pre-exam review,and handling those last-minute cram situations. Hi-Quality Easy Outlines give you 100% of the authority of Schaum's full-sized guides,known around the world for the highest academic standards. Backpack-able Study Power Compact and portable,this Easy Outline lets you study college algebra anywhere. Schaum's Gets The Grade! Let's talk bottom line. Schaum's Easy Outlines give you what you wantbetter grades,with less work,and more free time. Get the essence of algebra the easy way. Schaum's Easy Outline of College Algebra helps you master biology with plenty of illustrations,memory joggers,and the newest,rapid-absorption teaching techniques. Backed by Schaum's reputation for academic authority,this is the study guide students turn to and trust. Students know that Schaum's is going to be there for them when they needit! Quick study tips At-a-glance tables Student-friendly style Perfect for test prep", 'language': 'en', 'image': 'https://images.isbndb.com/covers/22/67/9780070602267.jpg', 'title_long': "Schaum's Outline of Theory and Problems of College Algebra (Schaum's Outlines)", 'edition': 'Reprint', 'dimensions': 'Height: 10.75 Inches, Length: 8 Inches, Weight: 1.25 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 1.25}, 'height': {'unit': 'inches', 'value': 10.75}}, 'pages': 312, 'date_published': '1967', 'subjects': ['Science & Math', 'Mathematics', 'Pure Mathematics', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Murray R. Spiegel'], 'title': "Schaum's Outline of Theory and Problems of College Algebra (Schaum's Outlines)", 'isbn13': '9780070602267', 'msrp': 13.95, 'binding': 'Paperback', 'isbn': '0070602263', 'isbn10': '0070602263'}}