{'book': {'publisher': 'McGraw-Hill', 'synopsis': 'From School Library Journal      Grade 4-7-This useful title will work best in a classroom setting with adult supervision. Cautionary icons appear throughout to call attention to potentially hazardous situations, and Dashefsky provides warnings to prevent harm to any of the creatures observed in the experiments. The introduction explains how to organize projects and gives brief background material about the animal kingdom and the classification system. Grouped into nine broad areas-behavior, the senses, growth, etc. -each project includes an overview, a list of needed materials, clearly written instructions, hints on drawing conclusions, and suggestions for further study. Black-and-white drawings and charts help to clarify procedures. Many of the activities are simple, requiring no special apparatus; some that are more complex call for laboratory equipment or animals that may not be readily accessible. Projects are well organized and give enough information and encouragement to enable students to carry out successful investigations. Mary Dykstra\'s The Amateur Zoologist (Watts, 1994) is more challenging and could be a suitable follow-up.Cynthia M. Sturgis, Ledding Library, Milwaukee, ORCopyright 1995 Reed Business Information, Inc.      Product Description      Suggests science fair project ideas involving smell, digestion, circulation, habitat, growth, vitamins, and genetics      From Booklist      Gr. 8-12. Dashefsky takes no chances: he recommends adult supervision for all 49 projects he includes in this book and also uses an icon code to identify which require "closer supervision for younger students." Even so, he addresses the students themselves, who will find a fascinating array of projects, quite varied in difficulty, to choose from. The experiments, none of which is extremely complicated, run the gamut from investigating antigens in human blood to plotting the respiration rates of goldfish. Dashefsky presents them clearly, with an overview of the experiment preceding a list of materials, step-by-step instructions, and follow-up questions designed to make students think about what they\'ve observed. The author\'s discussion of the scientific method and his ongoing emphasis on accurate recording of data will be a great help to student researchers. Because the projects frequently require special equipment or specimens (for example, a centrifuge or fruit flies), Dashefsky includes a listing of scientific supply houses. Occasional black-and-white sketches help clarify the procedures. Stephanie Zvirin', 'language': 'en', 'image': 'https://images.isbndb.com/covers/68/21/9780070156821.jpg', 'title_long': 'Zoology: 49 Science Fair Projects', 'dimensions': 'Height: 9.75 Inches, Length: 7.75 Inches, Weight: 1.1 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.75}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 1.1}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 169, 'date_published': '1994', 'subjects': ["Children's Books", 'Literature & Fiction', 'Education & Reference', 'Math', 'Science & Math', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['H. Steven Dashefsky'], 'title': 'Zoology: 49 Science Fair Projects', 'isbn13': '9780070156821', 'msrp': 19.95, 'binding': 'Hardcover', 'isbn': '0070156824', 'isbn10': '0070156824'}}