{'book': {'publisher': 'McGraw-Hill College', 'synopsis': 'It\x92s more than a text. It\x92s a program.<br/>Success in the language classroom requires so much more than just a text. In any language-learning setting, students require numerous and various opportunities to read, write, hear, and speak.<br/>Puntos de partida sets the standard for Spanish-language teaching. An innovative program that has been continuously refined for today\x92s classroom, Puntos delivers proven pedagogy with clear and effective presentations, comprehensive teaching resources, and powerfully adaptive digital tools.<br/>Now in its anniversary Tenth Edition, Puntos builds on the holistic, five-skills approach it pioneered. It\x92s the Puntos you know. It\x92s the Puntos of today.<br/>Puntos hallmark features include:<br/>Engaging and Immersive Digital Tools: Connect Spanish is the most powerful and flexible course management system available. Rooted in research on effective student learning practices, the platform integrates adaptive learning tools with dynamic, engaging language practice activities. McGraw-Hill\x92s LearnSmart provides each student with a personalized and adaptive learning experience based on individual needs. Connect Spanish also provides the instructor with both the ability and flexibility to pull from the robust set of content available in the platform and craft a unique learning path based on the goals of the course. With Practice Spanish: Study Abroad, the market\x92s first 3-D immersive language game designed exclusively by McGraw-Hill Education, Puntos brings the language to the students in a fun, engaging, and immersive gaming experience.Students \x93study abroad\x94 virtually in Colombia where they will create their very own avatar, live with a host family, make new friends, and navigate a variety of real-world scenarios using their quickly developing Spanish language skills. The first and only analytics tool of its kind, Connect Insight is a series of visual data displays\x97each framed by an intuitive question\x97to provide instructors at-a-glance information regarding how your class is doing. Connect Insight provides analysis on five key insights, available at a moment\x92s notice from your Connect course.<br/>A Comprehensive scope and sequence: The comprehensive scope and sequence allows instructors to choose what to cover throughout the course without having to supplement their own materials to fill gaps present in other texts.<br/>Carefully arranged organization: the overall organization carefully progresses from formulaic expressions to vocabulary and grammar relevant to daily life and personal interests (studies, family, home,leisure activities), then goes on to prepare students for survival situations(ordering a meal, traveling), and finally branches out to broader themes(current events, social and environment issues). This forward progress is reinforced by a cyclical structure where vocabulary, grammar, and language functions are continuously reviewed and recycled.<br/>Clear and effective vocabulary and grammar presentations: Puntos\x92 approach to vocabulary and grammar focuses on the acquisition of vocabulary during the early stages of language learning and then at the start of each chapter throughout the text.Grammar is introduced in thorough explanations', 'language': 'es', 'image': 'https://images.isbndb.com/covers/22/68/9780070382268.jpg', 'title_long': 'Puntos De Partida (Spanish Edition)', 'edition': '5', 'dimensions': 'Weight: 3 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 3}}, 'pages': 610, 'date_published': '1997', 'subjects': ['Reference', 'Words, Language & Grammar', 'Study & Teaching', 'Education & Teaching', 'Schools & Teaching', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Marty Knorre', 'T. Dorwic', 'Ana Maria Perez-Girones'], 'title': 'Puntos De Partida (Spanish Edition)', 'isbn13': '9780070382268', 'msrp': 133.15, 'binding': 'Hardcover', 'isbn': '0070382263', 'isbn10': '0070382263'}}