{'book': {'publisher': 'Intl Marine Pub Co', 'synopsis': "This quick-reference guide is an on-board data bank, compiling in one place all the facts, figures, tables, and graphs to which a cruising sailor must occasionally refer. In 17 chapters ranging from deck gear and electronics to spars, rigging, and navigation, it groups information logically; an extensively cross-referenced index acts as a search engine when needed. The amount of data a cruising sailor needs at fingertip reach can be staggering: recommended anchor sizes and types, cleat sizes for specified lines, winch sizes and power ratios, fender sizes, electrical wire sizes for specified amperages, solar panel outputs, GPS accuracy, VHF radio ranges, strength of fiberglass panels, fastener types and pilot hole sizes for various applications, electrical power consumption calculations, fuel consumption, propeller pitch and diameter, refueling procedures, sources of non-stock hardware, nautical rules of the road, navigation formulas, pressures of various wind speeds, coverage of paint, recommended adhesive-sealants, drinking water requirements, cooking fuels, safety equipment, safe working loads for shackles and rigging, and a thousand others. Most of this arcana is buried in one book or another, but now it's all in one place and easy", 'language': 'en', 'image': 'https://images.isbndb.com/covers/47/69/9780070674769.jpg', 'title_long': "The Sailor's Assistant: Reference Data for Maintenance, Repair, and Cruising", 'edition': 'First American Edition.', 'dimensions': 'Height: 9.5 Inches, Length: 8.25 Inches, Weight: 1.19931470528 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.25}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 1.19931470528}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 176, 'date_published': '1996-10-01', 'subjects': ['Engineering & Transportation', 'Transportation', 'Ships', 'Sports & Outdoors', 'Water Sports', 'Sailing'], 'authors': ['John Vigor'], 'title': "The Sailor's Assistant: Reference Data for Maintenance, Repair, and Cruising", 'isbn13': '9780070674769', 'msrp': 21.95, 'binding': 'Hardcover', 'isbn': '0070674760', 'isbn10': '0070674760'}}