{'book': {'publisher': 'McGraw-Hill', 'synopsis': "RECONNECT WITH THE PERSON YOU'RE MEANT TO BE<br/>A four-step process that opens the door to a meaningful life...<br/>Life's authentic moments provide the groundwork for connection to ourselves, others, and God, allowing us to assess what is most important in our lives and uncover the True Self. Such moments of clarity often result from crises, such as illness or loss, that awaken us to what is truly valuable. How can this be achieved in everyday living? Dr. John Chirban helps us assess the degree to which we are, or are not, connected to the True Self-- and shows us how we can reconnect. From everyday men and women to notable Americans, including Tom Brokaw, Ron Howard, Maya Angelou, and Sandra Day O'Connor, the stories featured in this book underscore Dr. Chirban's message of the costs of losing the True Self, as well as the rewards of opening the heart to oneself and others. Dr. Chirban also offers an examination of the seven intrinsic qualities of the True Self: Spontaneity Reasoning Creativity Free Will Spirituality Discernment Love<br/>By exploring these qualities and through the exclusive personal stories found in True Coming of Age, readers will begin to explore their authentic nature and to engage their innate gifts, igniting their unique evolution and experiencing a true coming of age.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/68/17/9780071426817.jpg', 'title_long': 'True Coming of Age : A dynamic process that leads to emotional stability, spiritual growth, and meaningful relationships', 'edition': '1', 'dimensions': 'Height: 8.5 Inches, Length: 5.8 Inches, Weight: 1.05380961236 Pounds, Width: 1.05 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.8}, 'width': {'unit': 'inches', 'value': 1.05}, 'weight': {'unit': 'pounds', 'value': 1.05380961236}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 256, 'date_published': '2004-04-02', 'subjects': ['General', 'Motivational & Inspirational', 'Happiness', 'Lifespan Development', 'SEL016000', 'cs.fmly_consm_scs.hmn_grwth_devel', 'cs.sel.help_gen'], 'authors': ['John T. Chirban'], 'title': 'True Coming of Age : A dynamic process that leads to emotional stability, spiritual growth, and meaningful relationships', 'isbn13': '9780071426817', 'msrp': 21.95, 'binding': 'Hardcover', 'related': {'eBook': '0071457119'}, 'isbn': '0071426817', 'isbn10': '0071426817', 'other_isbns': [{'isbn': '9780071457118', 'binding': 'print'}]}}