{"book": {"publisher": "McGraw Hill", "synopsis": "Publisher\"s Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product.<br/><br/>TAKE THE "MEAN" OUT OF ADVANCED STATISTICS<br/>Now anyone who has mastered basic statistics can easily take the next step up. In Advanced Statistics Demystified, experienced statistics instructor Larry J. Stephens provides an effective, anxiety-soothing, and totally painless way to learn advanced statistics -- from inferential statistics, variance analysis, and parametric and nonparametric testing to simple linear regression, correlation, and multiple regression.<br/>With Advanced Statistics Demystified, you master the subject one simple step at a time -- at your own speed. This unique self-teaching guide offers exercises at the end of each chapter to pinpoint weaknesses and two 50-question 'final exams' to reinforce the entire book.<br/>If you want to build or refresh your understanding of advanced statistics, here\'s a fast and entertaining self-teaching course that\'s specially designed to reduce anxiety.<br/>Get ready to: Draw inferences by comparing means, percents, and variances from two different samples Compare more than two means with variance analysis Make accurate interpretations with simple linear regression and correlation Derive inferences, estimations, and predictions with multiple regression models Apply nonparametric tests when the assumptions for the parametric tests are not satisfied Take two 'final exams' and grade them yourself!<br/>Simple enough for beginners but challenging enough for advanced students, Advanced Statistics Demystified is your direct route to confident, sophisticated statistical analysis!', 'language": "en", "image": "https: //images.isbndb.com/covers/24/29/9780071432429.jpg", "title_long": "Advanced Statistics Demystified", "edition": "1", "dimensions": "Height: 9.1 Inches, Length: 7.3 Inches, Weight: 1.06 Pounds, Width: 0.83 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.3}, "width": {"unit": "inches", "value": 0.83}, "weight": {"unit": "pounds", "value": 1.06}, "height": {"unit": "inches", "value": 9.1}}, "pages": 350, "date_published": "2004-06-01", "subjects": ["General', 'MAT029000', 'cs.mathe.intro_stats', 'cs.mathe.probab'], 'authors": ["Larry Stephens'], 'title": "Advanced Statistics Demystified", "isbn13": "9780071432429", "msrp": 20, "binding": "Paperback", "related": {"ePub": "0071471014"}, "isbn": "0071432426", "isbn10": "0071432426", "other_isbns": [{'isbn": "9780071471015", "binding": "print"}]}}