{'book': {'publisher': 'International Marine/Ragged Mountain Press', 'synopsis': "In 1990, teacher Les Horn had a brainstorm: why not navigate Europe's inland waterways, from England to Greece, in a small sailboat? Much to his surprise, he sold his wife and preteen son and daughter on the idea, and the following summer, installed in their 24-foot fixer-upper, Alea, the Horns set sail on the family odyssey chronicled in this amusing, satisfying tale.<br/>Traveling at a snail's pace, foraging for provisions, and propelled more by British pluck than by their temperamental outboard motor, the Horns eventually made it to the Aegean, but not without their share of uproarious misadventures in France, Germany, Austria, Czechoslovakia, Hungary, Yugoslavia, Bulgaria, and Turkey.<br/>Combining a wry sense of humor with a journalist's eye for the telling detail, Les Horn weaves a shrewdly funny family farce within a delightfully engaging travelogue packed with vivid observations of Europe's variegated landscape, history, and people. A rousing good read for both actual and armchair sailors, travelers, and adventurers.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/13/78/9780071361378.jpg', 'title_long': 'Through Europe at Four Knots: A Tale of Boating Mayhem and Family Adventure', 'edition': '1', 'dimensions': 'Height: 8.1 Inches, Length: 5.7 Inches, Weight: 1.1243575362 Pounds, Width: 1.11 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.7}, 'width': {'unit': 'inches', 'value': 1.11}, 'weight': {'unit': 'pounds', 'value': 1.1243575362}, 'height': {'unit': 'inches', 'value': 8.1}}, 'pages': 304, 'date_published': '2000-05-23', 'subjects': ['Science & Math', 'Earth Sciences', 'Geography', 'Sports & Outdoors', 'Water Sports', 'Boating', 'Travel', 'Europe', 'France', 'Greece', 'General', 'Specialty Travel', 'Adventure'], 'authors': ['Les Horn'], 'title': 'Through Europe at Four Knots: A Tale of Boating Mayhem and Family Adventure', 'isbn13': '9780071361378', 'msrp': 19.95, 'binding': 'Hardcover', 'isbn': '0071361375', 'isbn10': '0071361375'}}