{'book': {'publisher': 'McGraw Hill', 'synopsis': 'There are two schools of thought for encouraging babies to sleep through the night: the hotly debated Ferber technique of letting the baby "cry it out," or the grin-and-bear-it solution of getting up from dusk to dawn as often as necessary. If you don\'t believe in letting your baby cry it out, but desperately want to sleep, there is now a third option, presented in Elizabeth Pantley\'s sanity-saving book The No-Cry Sleep Solution.<br/>Pantley\'s successful solution has been tested and proven effective by scores of mothers and their babies from across the United States, Canada, and Europe. Based on her research, Pantley\'s guide provides you with effective strategies to overcoming naptime and nighttime problems. The No-Cry Sleep Solution offers clearly explained, step-by-step ideas that steer your little ones toward a good night\'s sleep--all with no crying.<br/>Tips from The No-Cry Sleep Solution: Uncover the stumbling blocks that prevent baby from sleeping through the night Determine--and work with--baby\'s biological sleep rhythms Create a customized, step-by-step plan to get baby to sleep through the night Use the Persistent Gentle Removal System to teach baby to fall asleep without breast-feeding, bottlefeeding, or using a pacifier', 'language': 'en', 'image': 'https://images.isbndb.com/covers/13/90/9780071381390.jpg', 'title_long': 'The No-Cry Sleep Solution: Gentle Ways to Help Your Baby Sleep Through the Night', 'edition': '1', 'dimensions': 'Height: 8.3 Inches, Length: 5.4 Inches, Weight: 0.6062712205 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.4}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.6062712205}, 'height': {'unit': 'inches', 'value': 8.3}}, 'pages': 254, 'date_published': '2002-03-28', 'subjects': ['General', 'Sleep & Sleep Disorders', 'Children with Special Needs', 'Lifespan Development', 'FAM034000', 'cs.fmly_consm_scs.chld_fmly_schl_commn', 'cs.psych.famstud'], 'authors': ['Elizabeth Pantley'], 'title': 'The No-Cry Sleep Solution: Gentle Ways to Help Your Baby Sleep Through the Night', 'isbn13': '9780071381390', 'msrp': 16.95, 'binding': 'Paperback', 'related': {'eBook': '0071403248'}, 'isbn': '0071381392', 'isbn10': '0071381392', 'other_isbns': [{'isbn': '9780071403245', 'binding': 'print'}]}}