{'book': {'publisher': 'McGraw-Hill', 'synopsis': 'Olympic Gold Medalist Picabo Street is once again on the rise, ready to face the 2002 Olympics and tell her extraordinary story "Picabo Street...is the kind of athlete for which the Olympics were invented."USA Today "Street...has been performing at Porsche speed...dominating women\'s downhill... [a] comeback queen."Glamour "Picabo rules... America\'s irrepressible ski champion."Skiing Olympic Champion Picabo Street is golden once again The moment she burst onto the world stage at the 1994 Winter Olympics in Lillehammer, Norway, 23-year-old speed demon Picabo Street ignited a fire of excitement in the media and in the hearts of fans that continues to burn today. Free-spirited and outspoken, Street was a new kind of female athlete and a new kind of role model. Street followed her silver medal win with two straight World Cup downhill titlesa feat unmatched in American skiingand finally, the ultimate Olympic gold medal win in Nagano in 1998. But success had its price. Just one month after her gold medal win, Street careened off course in a race in Switzerland, snapping her left femur in two, shredding the ligament in her right knee, and leaving her future in peril. Now, after two years of excruciating pain, grueling rehabilitation, and stunning personal growth, Street is making a comeback, ready to face the 2002 Winter Olympics and ready to tell her inspiring story. In this powerful, honest autobiography, Street shares her coming-of-age experience, revealing how adversity shaped a rebellious tomboy into a champion athlete and compassionate woman, in harmony with her family and at peace with her fear of failure. Here, for the first time, Street addresses the pressures exerted on her by her ski sponsors that may have been partly to blame for her terrible crash; the scandals surrounding the Salt Lake City Olympic Committee; and how she overcame a lengthy, debilitating depression. In the tradition of Lance Armstrong\'s It\'s Not About the Bike and Greg Louganis\'s Breaking the Surface, Picabo: Nothing to Hide is a poignant, intimate account of a woman forced to rebuild herselfbody, mind, and soul. "I learned what all girls need to learn: that you can kick ass, and you should never be ashamed of it."Picabo Street', 'language': 'en', 'image': 'https://images.isbndb.com/covers/31/27/9780071383127.jpg', 'title_long': 'Picabo: Nothing to Hide', 'edition': 'First Edition - First Printing', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.43741394824 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.43741394824}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 256, 'date_published': '2001-10-18', 'subjects': ['Biographies & Memoirs', 'Sports & Outdoors', 'Biographies'], 'authors': ['Picabo Street', 'Dana White'], 'title': 'Picabo: Nothing to Hide', 'isbn13': '9780071383127', 'msrp': 24.95, 'binding': 'Hardcover', 'related': {'Page Fidelity': '007140273X', 'eBook': '007140273X'}, 'isbn': '0071383123', 'isbn10': '0071383123', 'other_isbns': [{'isbn': '9780071402736', 'binding': 'print'}]}}