{"book": {"publisher": "McGraw Hill", "synopsis": ""You\'ll not only break the ice, you\'ll melt it away with your new skills.' Larry King<br/>'The lost art of verbal communication may be revitalized by Leil Lowndes.' Harvey McKay, author of “How to Swim with the Sharks Without Being Eaten Alive”<br/>What is that magic quality makes some people instantly loved and respected? Everyone wants to be their friend (or, if single, their lover!) In business, they rise swiftly to the top of the corporate ladder. What is their 'Midas touch?'<br/>What it boils down to is a more skillful way of dealing with people.<br/>The author has spent her career teaching people how to communicate for success. In her book How to Talk to Anyone (Contemporary Books, October 2003) Lowndes offers 92 easy and effective sure fire success techniques she takes the reader from first meeting all the way up to sophisticated techniques used by the big winners in life. In this information packed book you’ll find: 9 ways to make a dynamite first impression 14 ways to master small talk,
        'big talk,' and body language 14 ways to walk and talk like a VIP or celebrity 6 ways to sound like an insider in any crowd 7 ways to establish deep subliminal rapport with anyone 9 ways to feed someone\'s ego (and know when NOT to!) 11 ways to make your phone a powerful communications tool 15 ways to work a party like a politician works a room 7 ways to talk with tigers and not get eaten alive<br/>In her trademark entertaining and straight shooting style, Leil gives the techniques catchy names so you\'ll remember them when you really need them, including: "Rubberneck the Room,"'Be a Copyclass,''Come Hither Hands,' “Bare Their Hot Button,” “The Great Scorecard in the Sky,
        " and "Play the Tombstone Game,” for big success in your social life, romance, and business.<br/>How to Talk to Anyone, which is an update of her popular book, Talking the Winner\'s Way (see the 5 star reviews of the latter) is based on solid research about techniques that work!<br/>By the way, don\'t confuse How to Talk to Anyone with one of Leil\'s previous books, How to Talk to Anybody About Anything. This one is completely different!', 'language": "en", "image": "https: //images.isbndb.com/covers/85/84/9780071418584.jpg", "title_long": "How to Talk to Anyone: 101 Little Communication Tricks for Big Success in Relationships", "edition": "First Edition", "dimensions": "Height: 8.2 Inches, Length: 5.5 Inches, Weight: 0.99428480162 Pounds, Width: 1.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 1.5}, "weight": {"unit": "pounds", "value": 0.99428480162}, "height": {"unit": "inches", "value": 8.2}}, "pages": 367, "date_published": "2003-10-10", "subjects": ["General', 'Social Psychology', 'Interpersonal Relations', 'PSY031000', 'cs.fmly_consm_scs.ipl_cmm', 'cs.psych.socl_psych'], 'authors": ["Leil Lowndes'], 'title": "How to Talk to Anyone: 101 Little Communication Tricks for Big Success in Relationships", "isbn13": "9780071418584", "msrp": 16.95, "binding": "Paperback", "related": {"Kindle Edition": "0071433341", "eBook": "0071433341"}, "isbn": "007141858X", "isbn10": "007141858X", "other_isbns": [{'isbn": "9780071433341", "binding": "print"}]}}