{'book': {'publisher': 'McGraw-Hill', 'synopsis': '". . . the essential first step for all couples planning to sail away; this is a must-read."--Paul and Sheryl Shard, authors of Sail Away! "Life afloat nourishes my heart, my head, body, and soul in ways that have enhanced all aspects of my life personally and professionally. I have discovered ways of sustaining my sense of purpose both on land and while cruising that have enabled me to embrace the cruising lifestyle."--Debra Ann Cantrell The human quest for change is constant. As existing dreams are realized, new dreams take their place. On one level, Changing Course is a straightforward, step-by-step examination of pursuing your partner\'s dreams and joining the seagoing life. On a deeper, more spiritual level, it addresses the levels of change we encounter in everyday life and how--through the experiences of numerous women who have gone before--we can rise through those levels of change to achieve ultimate fulfillment and satisfaction.Changing Course chronicles the odyssey of making a major lifestyle change from land to sea from a woman\'s perspective. The moving and often poignant thoughts, feelings, and experiences of more than 100 women illustrate the decision-making process that enabled most of them to move from resisting the change proposed by their partners to embracing the cruising life. It is an inspiring examination of the highs, lows, and day-to-day drama of changing one\'s life in a fundamental way. From the common fears that prevent individuals from taking risks to the interpersonal dynamics that affect couples and relationships, this one-of-a-kind book explores the phenomenon of change and the growing lifestyle change movement. This thought-provoking and highly personal book explores what women stand to gain when they set forth on such a journey--and what they stand to lose if they do not.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/08/76/9780071360876.jpg', 'title_long': "Changing Course: A Woman's Guide to Choosing the Cruising Life", 'edition': '1', 'dimensions': 'Height: 8.25 Inches, Length: 6 Inches, Weight: 0.81791499202 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.81791499202}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 186, 'date_published': '2000-07-19', 'subjects': ['Sports & Outdoors', 'Water Sports', 'Boating'], 'authors': ['Debra Ann Cantrell'], 'title': "Changing Course: A Woman's Guide to Choosing the Cruising Life", 'isbn13': '9780071360876', 'msrp': 21.95, 'binding': 'Hardcover', 'isbn': '0071360875', 'isbn10': '0071360875'}}