{'book': {'publisher': 'McGraw-Hill', 'synopsis': "The first authoritative guide for keeping female athletes healthy and injury free<br/>Women's and girls' participation in sports grows exponentially every year, and everyone knows that women's bodies are constructed differently from men's, yet there have been no books on sports injury and health specific to a female athlete's needs.<br/>Until now.<br/>In The Female Athlete's Body Book, Dr. Gloria Beim--orthopedic surgeon, physician for the U.S. National Track Cycling Team, and accomplished athlete--presents the first authoritative sourcebook for every female athlete who wants to get in the game and stay there. She provides sound advice on an array of concerns including: How to minimize injury while enhancing sports performance Nutrition and training for top performance and lifelong health The specific needs of younger, pregnant, and mature athletes How to fight menstrual problems, bone loss, and eating disorders What to do when an injury occurs", 'language': 'en', 'image': 'https://images.isbndb.com/covers/17/52/9780071411752.jpg', 'title_long': "The Female Athlete's Body Book : How to Prevent and Treat Sports Injuries in Women and Girls", 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 7.25 Inches, Weight: 1.5 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.5}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 272, 'date_published': '2003-04-02', 'subjects': ["Women's Health", 'Exercise', 'Training', 'Physical Education', 'Reference', 'History', 'EDU033000', 'cs.hlth.physc_ed', 'cs.kins.hst_of_sprt'], 'authors': ['Gloria Beim', 'Ruth Winter'], 'title': "The Female Athlete's Body Book : How to Prevent and Treat Sports Injuries in Women and Girls", 'isbn13': '9780071411752', 'msrp': 16.95, 'binding': 'Paperback', 'related': {'eBook': '0071425403'}, 'isbn': '0071411755', 'isbn10': '0071411755', 'other_isbns': [{'isbn': '9780071425407', 'binding': 'print'}]}}