{'book': {'publisher': 'McGraw Hill', 'synopsis': '"In just six months I have gained tremendous clarity about how to care for my needs, live my values, and create my ideal life." --Pat Thomas, vice president, product delivery, AT&T "This book is your blueprint for the life you\'ve always dreamed about having." --Sandy Vilas, president, Coach University Olympic athletes have a coach. CEOs use the services of an executive coach. Can you imagine how much more productive and successful you would be if you had your own life coach? You don\'t have to anymore! In Coach Yourself to Success, Talane Miedaner, one of the most widely recognized personal coaches in the world, provides you with the latest technology for achieving success and attracting everything you have always wanted. Using her experience as a professional coach for hundreds of Fortune 500 clients and her own corporate background, Talane shares 101 of the most powerful and effective coaching tips and presents them in an easy-to-follow, 10-part program. Coach Yourself to Success will help you gain insight into what is truly important in your life and give you the edge to take yourself from ordinary to extraordinary.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/75/76/9780071837576.jpg', 'title_long': 'Coach Yourself to Success, Revised and Updated Edition: 101 Tips from a Personal Coach for Reaching Your Goals at Work and in Life', 'edition': '1', 'dimensions': 'ePub', 'pages': 338, 'date_published': '2014', 'subjects': ['Success', 'General', 'Memory Improvement', 'SEL027000', 'cs.fmly_consm_scs.hmn_grwth_devel', 'cs.sel.help_gen', 'General Interests & Hobbies -> Self-Help -> Self-Help General'], 'authors': ['Talane Miedaner'], 'title': 'Coach Yourself to Success, Revised and Updated Edition: 101 Tips from a Personal Coach for Reaching Your Goals at Work and in Life', 'isbn13': '9780071837576', 'msrp': 30, 'binding': 'Kindle Edition', 'related': {'Paperback': '0809225379'}, 'isbn': '0071837574', 'isbn10': '0071837574', 'other_isbns': [{'isbn': '9780809225378', 'binding': 'print'}]}}