{'book': {'publisher': 'International Marine/Ragged Mountain Press', 'synopsis': "Why is stitch-and-glue boatbuilding so popular?<br/>Any number of construction methods will produce a beautiful boat. But for the backyard builder with limited experience and a tight budget, the choice is not so complicated. Traditional plank-on-frame and cold-molded construction require complicated lofting and building molds--to say nothing of expensive tooling and lots of time. Stitch-and-glue construction, on the other hand, can produce the same results with a substantial savings in time and money. The process is quicker, easier, uses fewer parts, and produces a boat that is much easier to maintain--without the building molds and with only the simplest lofting. For tools, you need little more than a circular saw, a sander/polisher/grinder, a block plane, a framing square, a level, and a tape measure.<br/>Sam Devlin has elevated stitch-and-glue boatbuilding to an artform, and his graceful designs have attracted the attention of backyard builders across the country. Here is all you need to know to build the boat of your dreams, whether it's a 7-foot dinghy or a 40-foot power cruiser. Devlin's Boatbuilding: How to Build Any Boat the Stitch-and-Glue Way shares the wisdom of his 16 years of experience designing, building, and helping others build his fleet of small sail- and powerboats.<br/>It's all here, from choosing a design and setting up shop to painting the finished hull and launching. There is also a gallery of Devlin's designs and a detailed appendix listing sources for tools and other materials.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/99/02/9780071579902.jpg', 'title_long': "Devlin's Boatbuilding: How to Build Any Boat the Stitch-and-Glue Way", 'edition': '1', 'dimensions': 'Height: 9.2 Inches, Length: 7.5 Inches, Weight: 0.83114272774 Pounds, Width: 0.4 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.5}, 'width': {'unit': 'inches', 'value': 0.4}, 'weight': {'unit': 'pounds', 'value': 0.83114272774}, 'height': {'unit': 'inches', 'value': 9.2}}, 'pages': 198, 'date_published': '1995-10-25', 'subjects': ['Engineering & Transportation', 'Transportation', 'Ships', 'Sports & Outdoors', 'Water Sports', 'Boating', 'Sailing', 'Sea Kayaking'], 'authors': ['Samual Devlin'], 'title': "Devlin's Boatbuilding: How to Build Any Boat the Stitch-and-Glue Way", 'isbn13': '9780071579902', 'msrp': 24, 'binding': 'Paperback', 'isbn': '0071579907', 'isbn10': '0071579907'}}