{'book': {'publisher': 'McGraw-Hill', 'synopsis': "Seven Important Questions to Ask Yourself & Your Doctor When Reconsidering Hormone Replacement Therapy: What's really happening to my body during menopause? What can I do to combat my menopausal symptoms? Can HRT benefit me? Is HRT too risky to consider? If I start on HRT, do I have to keep taking it after menopause? If I'm on HRT, should I stop immediately in light of the new findings? And what is the best way to stop? What else can I do to enhance my overall health, with or without HRT?<br/>To date, nearly 6 million women use some form of Hormone Replacement Therapy (HRT) to combat menopausal symptoms and retain overall good health. However on July 9, 2002 the National Institute of Health (NIH) announced it would be halting its study of HRT due to an increased risk of cancer in study participants. Understandably, this news left women, currently taking hormone replacement and those considering it--panicked, confused, and full of questions. Now, helping women resolve these fears is Linda Laucella's new book, The Hormone Decision. A respected health writer and researcher, the author offers an authoritative guide to navigating the maze of information on hormone replacement therapy.<br/>With the Hormone Decision, women will be able to: Figure out the questions to ask and how to make the best choices for their individual needs Weigh the benefits and risks for overall health both during and after menopause Assess their lifestyle choices optimize overall health with or without HRT", 'language': 'en', 'image': 'https://images.isbndb.com/covers/61/53/9780071416153.jpg', 'title_long': 'The Hormone Decision : 7 Questions To Ask Yourself and Your Doctor About Hormone Replacement Therapy and Other Options', 'edition': '1', 'dimensions': 'Height: 8.2 Inches, Length: 5.4 Inches, Weight: 0.50044933474 Pounds, Width: 0.52 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.4}, 'width': {'unit': 'inches', 'value': 0.52}, 'weight': {'unit': 'pounds', 'value': 0.50044933474}, 'height': {'unit': 'inches', 'value': 8.2}}, 'pages': 160, 'date_published': '2002-09-20', 'subjects': ['Health, Fitness & Dieting', "Women's Health", 'Pregnancy & Childbirth', 'General', 'Medical Books', 'Medicine', 'Internal Medicine'], 'authors': ['Linda Laucella'], 'title': 'The Hormone Decision : 7 Questions To Ask Yourself and Your Doctor About Hormone Replacement Therapy and Other Options', 'isbn13': '9780071416153', 'msrp': 9.95, 'binding': 'Paperback', 'isbn': '0071416153', 'isbn10': '0071416153'}}