{'book': {'publisher': 'McGraw-Hill Education', 'synopsis': 'YOUR FIRST-CLASS TICKET TO THE ENTIRE FRENCH-SPEAKING WORLD<br/><br/>This comprehensive program encourages meaningful, practical communication by immersing your students in the language and culture of the French-speaking world. The rich resources help you meet the needs of every student. All the culture, diversity, and detail you want for your classroom―with none of the extra work.<br/><br/>Bon voyage! Level 3 brings you a powerful set of teaching tools:<br/>. random access format: materials in each chapter can be taught independently of each other.<br/>. student-centered instruction:ideas for setting up a cooperative learning environment for all students, paired and group-work activities, out-of-class projects on topics related to the chapter theme, and many teaching suggestions at the point of use assure that each individual regardless of learning style, previous preparation, background, or age, will have the necessary resources for becoming proficient.<br/>. balance among all four language skills:a balanced focus on listening,speaking, reading, and writing skills and "teacher-friendly" resources throughout all phases of instruction gives you leeway if you wish to adjust the integration of these skills to the needs of a particular individual, group, or class.<br/>. contextualized vocabulary: identifiable contexts remain consistent throughout the practice, testing, and recycling phases of learning. Future chapters build on vocabulary and grammar from previous ones. In Journalisme and Littérature, students are encouraged to stretch their vocabularies in order to get as much meaning as possible from these authentic and unsimplified selections.<br/>. thorough, contextualized presentation of grammar: is found in two of the seven sections in each chapter. Grammar runs concurrent with, and is embedded in, the chapter-long situational themes. Students are presented with French structure both directly, as grammar, and as a set of useful functions that will aid them in communication.<br/>. an integrated approach to culture: for true competence in a foreign language must include the attainment of the culture in which the language is spoken. The chapter themes richly reflect the cultures of French-speaking countries through accompanying illustrations, photographs, charts, diagrams, maps, and other reproductions of authentic documents and realia.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/25/81/9780078212581.jpg', 'title_long': 'Bon voyage! Level 3 Student Edition (GLENCOE FRENCH)', 'edition': '3', 'dimensions': 'Height: 10.1 Inches, Length: 8.2 Inches, Weight: 2.73 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.2}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 2.73}, 'height': {'unit': 'inches', 'value': 10.1}}, 'pages': 429, 'date_published': '2001-05-22', 'subjects': ['Reference', 'Foreign Language Study & Reference', 'Instruction', 'Teen & Young Adult', 'Education & Reference', 'Foreign Language Study', 'Education & Teaching', 'Schools & Teaching', 'Instruction Methods', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Conrad Schmitt', 'Katia Lutz'], 'title': 'Bon voyage! Level 3 Student Edition (GLENCOE FRENCH)', 'isbn13': '9780078212581', 'msrp': 90.32, 'binding': 'Hardcover', 'isbn': '0078212588', 'isbn10': '0078212588'}}