{'book': {'publisher': 'See Description', 'synopsis': 'Product Description<br/><br/><br/>Since the dramatic end of the Pacific War in 1945 the threat of nuclear war has exercised the minds of many. Initial fears concerned the risk that a political crisis between the Superpowers would escalate through miltary confrontation into a \'calculated\' nuclear war. Another scenario pictured a new Hitler commanding a nuclear-capable state prepared to use such weapons \'irrationally\', possibly sparking a \'catalytic\' nuclear war between the major Powers. More recently attention has shifted towards the risk of the \'accidental\' release of nuclear weapons. While the risk of intentional conflict between the major Powers has lessened, the arsenals have only been marginally reduced, leaving the possibility of accidental release as perhaps the most threatening case.<br/>Inadvertent Nuclear War presents the risk in terms of the reliability and instability of the human and technical systems governing release, with contributions ranging from the engineering of computer software to the psychology of the chain of command. As Dr Wiberg states in his introduction, "No known technical construction, human being or social organization is absolutely failsafe."<br/><br/><br/>Review<br/><br/><br/>The volume is a very rich source of developments in, and contemporary views and debates on, nuclear technology...a very important addition to extant scholarship on nuclear technology and the possibilities of a holocaust. Its major strength lies in the fact that contributors come from diverse disciplines of physics, radiology, psychology, mathematical statistics, political science, and sociology, thereby giving the reader the benefit of the multidisciplinary reaches of the nuclear technology discourse.<br/>The International Journal of Conflict Management', 'language': 'en', 'image': 'https://images.isbndb.com/covers/38/08/9780080413808.jpg', 'title_long': 'Inadvertent Nuclear War: The Implications of the Changing Global Order', 'edition': '1', 'dimensions': 'height: 235 mm, length: 152 mm, width: 25 mm, weight: 590 g', 'dimensions_structured': {'length': {'unit': 'mm', 'value': 152}, 'width': {'unit': 'mm', 'value': 25}, 'weight': {'unit': 'g', 'value': 590}, 'height': {'unit': 'mm', 'value': 235}}, 'pages': 338, 'date_published': '1993-01-01', 'subjects': ['History', 'Military', 'Weapons & Warfare'], 'authors': ['Hakan, Ib Damgaard Petersen and Paul SMoker Wiberg (eds)'], 'title': 'Inadvertent Nuclear War: The Implications of the Changing Global Order', 'isbn13': '9780080413808', 'msrp': 69, 'binding': 'Hardcover', 'related': {'eBook': '1483287637'}, 'isbn': '0080413803', 'isbn10': '0080413803', 'other_isbns': [{'isbn': '9781483287638', 'binding': 'print'}]}}