{'book': {'publisher': 'Pergamon', 'synopsis': 'This extensive work is the first dictionary in the field of automatic control to cover the technical terms of the field in these eight languages. It will certainly prove itself a valuable aid to all control engineers and systems scientists and will undoubtedly become the recognized standard for the technical terms in this field.<br/><br/>Engineers and scientists will also find it a great help when writing research papers for publication in English language journals and preparing oral presentations at scientific conferences. This unique dictionary contains over 1600 terms covering the entire field of control and automation, derived from the technical committees of IFAC (the International Federation of Automatic Control) and the conferences that it organizes.<br/><br/>To facilitate its use in all eight languages the dictionary is divided into two main sections. Firstly, the 1600 technical terms are arranged alphabetically in English with their equivalents in the other languages listed along the page. The second section consists of alphabetical listings in the other seven languages with each term numbered to correspond with the English term in the first section. The Chinese, Japanese and Russian entries all appear in their own alphabet and with roman transliterations to permit wider use.<br/><br/>Published by Pergamon in collaboration with IFAC, the International Federation of Automatic Control.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/19/24/9780080371924.jpg', 'title_long': 'Multilingual Glossary of Automatic Control Technology: English-French-German-Russian-Italian-Spanish-Japanese-Chinese', 'edition': '1', 'dimensions': 'Height: 12.25 Inches, Length: 8.75 Inches, Weight: 2.094391489 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.75}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 2.094391489}, 'height': {'unit': 'inches', 'value': 12.25}}, 'pages': 400, 'date_published': '2005-09-13', 'subjects': ['Engineering & Transportation', 'Engineering', 'Reference', 'Dictionaries & Thesauruses', 'Science & Math', 'Technology', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['H.A. Prime', 'A. Work'], 'title': 'Multilingual Glossary of Automatic Control Technology: English-French-German-Russian-Italian-Spanish-Japanese-Chinese', 'isbn13': '9780080371924', 'msrp': 97.93, 'binding': 'Hardcover', 'isbn': '0080371922', 'isbn10': '0080371922'}}