{'book': {'publisher': 'Pergamon', 'synopsis': 'Fault and Joint Development in Brittle and Semi-brittle Rock deals with theories of fault and joint development in rock when they behave as brittle or semi-brittle material. The book contains three chapters, the first of which deals with some of the concepts and criteria of brittle failure along with an attempt to define limits of temperature and pressure below which rocks may behave in a brittle or semi-brittle manner. The second and third chapters discuss the application of these concepts of brittle failure and elastic theory to the problems of faulting and jointing, respectively. It is emphasized that since this book deals with theoretical aspects of structural geology it is concerned with generalizations and approximations. It must be left to the reader to decide how closely these theories approximate to any particular field data. This book is primarily intended for senior undergraduates and postgraduates in geology interested in the interpretation of geological structures. It may also be of interest to some mining and civil engineers.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/27/49/9780080112749.jpg', 'title_long': 'Fault and Joint Development: In Brittle and Semi-Brittle Rock', 'dimensions': 'Height: 7.75 Inches, Length: 5 Inches, Width: 0.44 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5}, 'width': {'unit': 'inches', 'value': 0.44}, 'height': {'unit': 'inches', 'value': 7.75}}, 'pages': 192, 'date_published': '1966-01-01', 'subjects': ['Engineering & Transportation', 'Engineering', 'Civil & Environmental', 'Science & Math', 'Earth Sciences', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Neville J. Price'], 'title': 'Fault and Joint Development: In Brittle and Semi-Brittle Rock', 'isbn13': '9780080112749', 'msrp': 31.95, 'binding': 'Paperback', 'related': {'eBook': '1483139220'}, 'isbn': '0080112749', 'isbn10': '0080112749', 'other_isbns': [{'isbn': '9781483139227', 'binding': 'print'}]}}