{'book': {'publisher': 'Pergamon', 'synopsis': 'Nuclear Waste Disposal: Can We Rely on Bedrock? focuses on a proposed solution to disposing nuclear waste, which is to deposit canisters of nuclear waste in tunnels and rooms in deep rock formations at depths of about 500 - 1100 m (1600 - 3600 ft.). This underground facility in a large body of rock is known as a repository. This book explains that the tunnels and rooms are excavated by mining techniques and the waste canisters placed in vertical drill holes in the floor. This text also discusses the concept known as mined geological disposal of nuclear wastes. Other topics covered include the form and final disposal of nuclear wastes; nature of rock and groundwater; and disturbed rock and groundwater. This book also explains the long-term behavior of the rock and the groundwater; nuclear waste leakage into the groundwater; and possible positive and negative effects of mined geological disposal. This text is essential for students of environmental science, especially those conducting research on nuclear energy.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/59/56/9780080275956.jpg', 'title_long': 'Nuclear Waste Disposal: Can We Rely on Bedrock?', 'edition': 'lst ed', 'dimensions': 'Height: 8 Inches, Length: 7.75 Inches, Width: 0.16 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.75}, 'width': {'unit': 'inches', 'value': 0.16}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 68, 'date_published': '1982-01-01', 'subjects': ['Engineering & Transportation', 'Engineering', 'Science & Math', 'Physics', 'Technology', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Ulf Lindblom'], 'title': 'Nuclear Waste Disposal: Can We Rely on Bedrock?', 'isbn13': '9780080275956', 'msrp': 31.95, 'binding': 'Paperback', 'related': {'Page Fidelity': '1483138313', 'eBook': '1483138313'}, 'isbn': '0080275958', 'isbn10': '0080275958', 'other_isbns': [{'isbn': '9781483138312', 'binding': 'print'}]}}