{'book': {'publisher': 'Pergamon Press', 'synopsis': 'Advances in Solid-Liquid Flow in Pipes and its Application focuses on solid-liquid interactions.The selection first takes a look at hydraulic transport of bulky materials and role of lift in the radial migration of particles in a pipe flow. Topics include the technological and economical considerations of transporting materials; lift model and the equations of motion; coefficients of lift and drag; and calculated behavior of particles in a pipe flow. The book then discusses particle and fluid velocities of turbulent flows of suspensions of neutrally buoyant particles; phase-separation phenomena in iso-density, two-phase flows; and transient flow of solid-liquid mixtures in pipes.The text discusses pipeline transportation of coke in petroleum products, including slurry components, hydraulic tests, and hydraulic characteristics of slurry. The book then evaluates the use of heavy media in the pipeline transport of particulate solids. Comparison of pressure gradients and equipment and experimental procedures are highlighted.The selection is a valuable reference for readers interested in solid-liquid interactions.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/76/72/9780080157672.jpg', 'title_long': 'Advances in solid-liquid flow in pipes and its application', 'edition': 'First Edition', 'dimensions': 'Weight: 0.5070632026 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 0.5070632026}}, 'pages': 298, 'date_published': '1971', 'subjects': ['Engineering & Transportation', 'Engineering', 'Mechanical', 'Kindle Store', 'Categories', 'Kindle eBooks'], 'authors': ['Iraj Zandi'], 'title': 'Advances in solid-liquid flow in pipes and its application', 'isbn13': '9780080157672', 'msrp': 64.69, 'binding': 'Hardcover', 'related': {'Kindle Edition': '1483151298', 'eBook': '1483151298'}, 'isbn': '008015767X', 'isbn10': '008015767X', 'other_isbns': [{'isbn': '9781483151298', 'binding': 'print'}]}}