{'book': {'publisher': 'Pergamon', 'synopsis': 'Towards Global Action for Appropriate Technology evaluates the feasibility of establishing and implementing an international mechanism for the promotion of appropriate technology. A strategy of reorienting research and development towards the rural and small-scale urban sectors is proposed, with emphasis on ultimately building national technological capacity in developing countries. This book is comprised of six chapters and begins with an overview of concepts, definitions, and strategies, followed by a discussion on some relatively unfamiliar criteria that should be taken into account in guiding the selection of appropriate technologies, including cost and risk involved. The following chapters focus on the links between the concepts of appropriate technology and the basic needs approach to development; institutional capacity at the national and international levels; and the activities of the United Nations with regard to appropriate technology. The final chapter presents a blueprint for global action for the promotion of appropriate technology, with particular reference to small-scale capital-saving technologies that are accessible to the poor and are essential for the creation of productive employment on a sufficient scale. This monograph will be of interest to social and economic policymakers.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/27/74/9780080242774.jpg', 'title_long': 'Towards Global Action for Appropriate Technology', 'edition': 'First Edition', 'dimensions': 'Height: 7.75 Inches, Length: 5 Inches, Width: 0.55 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5}, 'width': {'unit': 'inches', 'value': 0.55}, 'height': {'unit': 'inches', 'value': 7.75}}, 'pages': 244, 'date_published': '1979-01-01', 'subjects': ['Engineering & Transportation', 'Engineering'], 'authors': ['A. S. Bhalla'], 'title': 'Towards Global Action for Appropriate Technology', 'isbn13': '9780080242774', 'msrp': 72.95, 'binding': 'Paperback', 'related': {'eBook': '1483139972'}, 'isbn': '0080242774', 'isbn10': '0080242774', 'other_isbns': [{'isbn': '9781483139975', 'binding': 'print'}]}}