{'book': {'publisher': 'Hutchinson', 'synopsis': 'The aim of this series is to bring together important recent writings in major areas of philosophical inquiry, selected from a variety of sources, mostly periodicals, which may not be conveniently available to the university student or the general reader. The editors of each volume contribute an introductory essay on the items chosen and on the questions with which they deal. A selective bibliography is appended as a guide to further reading. The philosophy of biology today is one of the most exciting areas in philosophical inquiry. Drawing on work of the past decade, this volume brings together articles from the philosophy, history, and sociology of science, as well as many branches of the biological sciences, to consider issues including the nature of evolutionary theory, biology and ethics, the challenge from religion, and the social implications of biology today (in particular the Human Genome Project). The 36 articles in this collection are divided into 10 parts, each with an introduction by the editors. Spanning issues from epistemology across to ethics, the volume delves into the latest theoretical controversies as well as burning questions of contemporary social importance. Throughout the volume an attempt is made to offer positions from different perspectives, so that the reader will be challenged as well as informed. The Philosophy of Biology will be essential and fascinating reading for students of philosophy and biology as well as the general reader with an interest in the natural sciences and evolution.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/22/15/9780091152215.jpg', 'title_long': 'The philosophy of biology', 'pages': 231, 'date_published': '1973', 'subjects': ['Science & Math', 'History & Philosophy', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Michael Ruse'], 'title': 'The philosophy of biology', 'isbn13': '9780091152215', 'msrp': 45.53, 'binding': 'Paperback', 'isbn': '0091152216', 'isbn10': '0091152216'}}