{'book': {'publisher': 'Random House UK', 'synopsis': "In this highly-accessible self-help book Big Issue founder John Bird explains his seven simple rules that could help you change your life. Whether you want to get a new job, quit smoking, stop drinking or go back to college, How to Change Your Life in 7 Steps explains how you can take what you've been given and turn it into something you'll be proud of, rather than spend your life wishing for everything you haven't got.<br/><br/>For 99% of us life doesn't come knocking on the door; you have to go out and get it. But the trouble with aiming for the stars is that you're likely to end up in the gutter. John Bird has learnt through his work with the homeless that if you start by putting just 3% of your energy towards your final goal rather than a gutter-hitting 99% you will eventually make the changes you are looking for.<br/><br/>John's six other rules are as straightforward as this first one, 'Start With 3%'. He writes with passion about the dangers of thinking like a victim and of not telling the truth; he shares with us the importance of thinking for yourself and never putting others down, and he encourages us not to define our successes by the failures of others and to recognise our own achievements.<br/><br/>Written in his unique no-nonsense style this is a book about 'cutting through the bullshit and making the most of what you have.'", 'language': 'en', 'image': 'https://images.isbndb.com/covers/70/37/9780091907037.jpg', 'title_long': 'How to Change Your Life in 7 Steps', 'dimensions': 'Height: 7.5 Inches, Length: 7.75 Inches, Weight: 0.15 Pounds, Width: 0.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.75}, 'width': {'unit': 'inches', 'value': 0.25}, 'weight': {'unit': 'pounds', 'value': 0.15}, 'height': {'unit': 'inches', 'value': 7.5}}, 'pages': 96, 'date_published': '2006-03-02', 'subjects': ['Self-Help', 'Motivational', 'Health, Fitness & Dieting', 'Psychology & Counseling'], 'authors': ['John Bird'], 'title': 'How to Change Your Life in 7 Steps', 'isbn13': '9780091907037', 'msrp': 5.95, 'binding': 'Paperback', 'isbn': '0091907039', 'isbn10': '0091907039'}}