{'book': {'publisher': 'Vermilion Press', 'synopsis': "Follow the Dr Atkins' Diet and forget counting calories. Watch the fat melt away as a healthier and firmer body emerges. Enjoy more energy as well as freedom from a range of ailments from diabetes to heart disease. Essentially a low carbohydrate plan, the Atkins' Diet boosts your metabolic rate and once your metabolism is changed, your body adjusts to a new way of burning fat. Dieting can work, and with this medically proven regime you can lose weight without reducing - or counting - calories. On the Atkins' Diet you can: -Eat luxuriously and feel completely satisfied -Experience the metabolic boost the Atkins' Diet provides -Use a maintenance diet that will ensure you never become fat again -Enjoy mouth-watering, gourmet recipes. In this new edition the world's number one diet expert has updated his proven program for a new century to include; new controlled carbohydrate recipes for breakfast, lunch and dinner; brand new case studies and the very latest scientific research.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/94/87/9780091889487.jpg', 'title_long': "Dr. Atkins' New Diet Revolution : The No-Hunger, Luxurious Weight Loss Plan That Really Works!", 'edition': 'New Ed', 'dimensions': 'Height: 7.79526 Inches, Length: 4.96062 Inches, Weight: 0.8267334825 Pounds, Width: 1.29921 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.96062}, 'width': {'unit': 'inches', 'value': 1.29921}, 'weight': {'unit': 'pounds', 'value': 0.8267334825}, 'height': {'unit': 'inches', 'value': 7.79526}}, 'pages': 560, 'date_published': '2003', 'subjects': ['Health, Fitness & Dieting', 'Diets & Weight Loss', 'Atkins Diet', 'Parenting & Relationships'], 'authors': ['Robert C. Atkins'], 'title': "Dr. Atkins' New Diet Revolution : The No-Hunger, Luxurious Weight Loss Plan That Really Works!", 'isbn13': '9780091889487', 'msrp': 16.5, 'binding': 'Paperback', 'isbn': '0091889480', 'isbn10': '0091889480'}}