{'book': {'publisher': 'Vermilion', 'synopsis': "Sleep, or rather the lack of it, is the issue of paramount concern to the overwhelming majority of new parents. Getting enough sleep is vital for the health of a growing baby or toddler, and the sanity of moms and dads. Yet striking the right balance between their differing needs can be hard to achieve. Once sleep problems set in, they can fast demoralize and exhaust parents, undermining confidence in their ability to cope. Gina Ford has come to the rescue with her answer: the key to a good night's sleep for the whole family lies in teaching parents to understand the changing sleep needs of their growing baby. This book informs and reassures parents, dispelling many common myths and anxieties and offering practical solutions that work. By creating a structure of regular feeding, sleeping, and playing times, Gina explains how parents can help their baby to find a rhythm that will be comfortable for all concerned. Whether parents want to establish good sleeping habits from the start, or find they need to cure sleep problems and get their child back on track, Gina has the answers.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/26/73/9780091912673.jpg', 'title_long': 'The Complete Sleep Guide For Contented Babies & Toddlers', 'edition': 'New Ed', 'dimensions': 'Height: 8.5 Inches, Length: 5.25 Inches, Weight: 0.42769678828 Pounds, Width: 0.6 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 0.6}, 'weight': {'unit': 'pounds', 'value': 0.42769678828}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 192, 'date_published': '2006-04-06', 'subjects': ['Health, Fitness & Dieting', 'Diseases & Physical Ailments', 'Sleep Disorders', 'Crafts, Hobbies & Home', 'Home Improvement & Design', 'How-to & Home Improvements', 'Parenting & Relationships', 'Parenting', 'Early Childhood'], 'authors': ['Gina Ford'], 'title': 'The Complete Sleep Guide For Contented Babies & Toddlers', 'isbn13': '9780091912673', 'msrp': 19.78, 'binding': 'Paperback', 'isbn': '0091912679', 'isbn10': '0091912679'}}