{'book': {'publisher': 'Hutchinson', 'synopsis': 'Product Description<br/><br/>Douglas Kennedy’s riveting new novel bears his trademark genius for writing serious popular fiction.<br/><br/>Hannah Buchan leads an orderly life in a small town in Maine — a schoolteacher, married to a doctor, with two grown up children. However, her past conceals a dark secret. Thirty years ago she had a brief, dangerous fling with Tobias Judson, a high profile student activist, which she had reconciled to that internal, off-limits attic room marked “Ancient History.” But when Tobias suddenly pops up out of nowhere with a book about his radical years, her life goes into free-fall. And before she knows it, Hannah discovers that a long-ago transgression is never really forgotten.<br/><br/>Set amid two wildly contrasting periods of recent American life — the militant 60s and 70s, and the new-found conservatism of today — State of the Union is a remarkable portrait of one woman’s attempts to find her own way in the shifting political currents of her time. But it is also an intriguing portrait of the complexities of a long marriage, the ongoing guilt of parenthood, the perpetual tension between familial responsibility and personal freedom, and the divisive debate between liberal and conservative values that so engulfs the United States today.<br/><br/>From the Trade Paperback edition.<br/><br/>Review<br/><br/>Praise for Douglas Kennedy’s A Special Relationship:<br/>“As it gathered pace . . . I found my heart beating faster. I cannot remember a more compulsive book.”<br/>–Daily Telegraph<br/><br/>“Kennedy knows how to keep the pages turning.”<br/>–The Times<br/><br/>From the Trade Paperback edition.<br/><br/>About the Author<br/><br/>Douglas Kennedy was born in New York in 1955 and now lives in London. His novels — The Big Picture, The Job, The Pursuit of Happiness and A Special Relationship have all been critically praised bestsellers.<br/><br/>From the Trade Paperback edition.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/02/84/9780091800284.jpg', 'title_long': 'State of the Union', 'edition': 'First Edition', 'dimensions': 'Height: 9.5 Inches, Length: 6.5 Inches, Weight: 1.66008083286 Pounds, Width: 1.56 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1.56}, 'weight': {'unit': 'pounds', 'value': 1.66008083286}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 432, 'date_published': '2005-11-22', 'subjects': ['Literature & Fiction'], 'authors': ['Douglas Kennedy'], 'title': 'State of the Union', 'isbn13': '9780091800284', 'msrp': 24.52, 'binding': 'Hardcover', 'isbn': '0091800285', 'isbn10': '0091800285'}}