{'book': {'publisher': 'Vermilion', 'synopsis': 'Reiki(pronounced Ray-Key)is a Japanese word meaning Universal Life Force Energy. There is a life force which flows through all living beings whether animal, vegetable or mineral. Reiki refers to a technique which enables you to accept or become a channel for a far greater amount of this life force energy. It is an energising and healing technique which balances the energy in the body, renewing vitality and bringing about a powerful feeling of serenity and relaxation through the laying on of hands. I draws on ancient practices which are said to have dated back to Buddha. The genuine Reiki method is practiced in the Usui tradition, handed down through generations of Reiki Masters from Dr Mikao Usui, the dean of a small Christian university in Kyoto. Reiki requires no belief system however, and is available to everyone. It is being used increasingly by massage therapists, osteopaths and others to complement their standard form of practice and is a wonderful way of relieving the problems associated with stress, tension, chronic illness and post-operative pain. This practical and accessible book explains the fascinating story behind the discovery of Reiki, explains what to expect from a treatment how it works and how it can be of benefit-and how you can train', 'language': 'en', 'image': 'https://images.isbndb.com/covers/64/38/9780091816438.jpg', 'title_long': 'Reiki:Essenst.Guide to Ancient Healing', 'edition': 'First Edition', 'dimensions': 'Height: 8.46455 Inches, Length: 5.31495 Inches, Weight: 0.39021820374 Pounds, Width: 0.47244 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31495}, 'width': {'unit': 'inches', 'value': 0.47244}, 'weight': {'unit': 'pounds', 'value': 0.39021820374}, 'height': {'unit': 'inches', 'value': 8.46455}}, 'pages': 160, 'date_published': '1998', 'subjects': ['Health, Fitness & Dieting', 'Alternative Medicine', 'Parenting & Relationships', 'Family Health', 'Religion & Spirituality', 'New Age & Spirituality', 'Mental & Spiritual Healing', 'Medical Books', 'Politics & Social Sciences'], 'authors': ['Chris and Penny Parkes of The Reiki School'], 'title': 'Reiki:Essenst.Guide to Ancient Healing', 'isbn13': '9780091816438', 'msrp': 13.99, 'binding': 'Paperback', 'isbn': '0091816432', 'isbn10': '0091816432'}}