{'book': {'publisher': 'Random House UK', 'synopsis': "Weaning your baby on to solid foods is one of the most important milestones during the early months of parenthood, and Gina's expert advice on weaning makes a baby's transition from milk to solid foods as straightforward as possible. Successful weaning establishes a pattern of healthy eating in babies, avoiding the pitfalls of fussy eaters restricted to a narrow diet. In this revised edition of The Contented Little Baby Book of Weaning, Gina includes the latest recommendations regarding breastfeeding and the introduction of solid food from the World Health Organization and the UK Department of Health. She aims to take the worry out of weaning, guiding parents step-by-step through the process, and shares the insight and expertise gained from personally helping to care for more than 300 babies, and advising thousands more parents via her consultation service and website. Included in this revised edition is helpful info on the best time of day to introduce the first solid food; which foods to introduce and at what age; getting the balance of milk feeds and solids right; how to eliminate night feeds once solids are introduced; the importance of introducing finger foods at the right age; extended parent-friendly feeding plans to take parents step-by-step through the different stages; newly developed rotating meal planners for older children up to the end of the first year; and brand new questions and answers giving the most up-to-date advice to parents. The Contented Little Baby Book of Weaning is the definitive guide to ensuring babies eat well now and as they grow up and is as relevant and helpful to those parents who have not previously followed Gina's routines.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/26/80/9780091912680.jpg', 'title_long': 'The Contented Little Baby Book Of Weaning', 'edition': '36962nd', 'dimensions': 'Height: 8.5 Inches, Length: 5.25 Inches, Weight: 0.46076612758 Pounds, Width: 0.59 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 0.59}, 'weight': {'unit': 'pounds', 'value': 0.46076612758}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 208, 'date_published': '2006-04-06', 'subjects': ['Crafts, Hobbies & Home', 'Home Improvement & Design', 'How-to & Home Improvements', 'Parenting & Relationships', 'Parenting', 'Early Childhood'], 'authors': ['Gina Ford'], 'title': 'The Contented Little Baby Book Of Weaning', 'isbn13': '9780091912680', 'msrp': 19.95, 'binding': 'Paperback', 'isbn': '0091912687', 'isbn10': '0091912687'}}