{'book': {'publisher': 'Arrow', 'synopsis': "A searing, vivid, non-stop account of one man's heroism and courage under fire, by the only living recipient of the George Cross in Afghanistan Afghanistan, February 2008: in an out-of-control, dangerous country torn apart by war, littered with Taliban guerrilla forces, and thousands of miles from home, Lance Corporal Matt Croucher, a Royal Marine, accidentally activates a grenade while on a covert patrol behind enemy lines. With only a split second to react, Croucher's instincts kick in and he throws himself beside the grenade, reasoning that saving the lives of his three comrades was worth the likelihood of losing his own. Against all odds, Croucher survived, and just hours later was taking part in a gun battle against local insurgent fighters, demonstrating a raw, unique courage and devotion to military duty that would later see him awarded the George Cross—a distinction bestowed only on those who perform acts of the greatest heroism or of the most conspicuous courage in circumstances of extreme danger. The award would make him famous, but his story is much more than just one heroic act in isolation. At the age of 19 he was one of the first 200 Allied soldiers to invade Iraq in 2003 as part of an elite force of British Marines and U.S. Special Forces, while on his second tour of duty, he suffered a fractured skull only to return to action a week later. Croucher has seen vicious fighting, intense gun battles, roadside ambushes, and witnessed the death and injury of close colleagues on an almost daily basis.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/30/84/9780099543084.jpg', 'title_long': 'Bullet Proof', 'edition': 'Reprint', 'dimensions': 'Height: 8 Inches, Length: 5 Inches, Weight: 0.49383546688 Pounds, Width: 0.8 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5}, 'width': {'unit': 'inches', 'value': 0.8}, 'weight': {'unit': 'pounds', 'value': 0.49383546688}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 288, 'date_published': '2011-06-01', 'subjects': ['Biographies & Memoirs', 'Leaders & Notable People', 'Military', 'History', 'Afghan War'], 'authors': ['Matt Croucher GC'], 'title': 'Bullet Proof', 'isbn13': '9780099543084', 'msrp': 12.95, 'binding': 'Paperback', 'isbn': '0099543087', 'isbn10': '0099543087'}}