{'book': {'publisher': 'Arrow', 'synopsis': "The new blockbuster from bestselling author Chris Ryan.<br/><br/>Blackout -- three cities all lose power. No-one claims responsibility. Fears of a terrorist strike are imminent.<br/><br/>Josh Harding is a tough SAS soldier. Yet his disregard for authority has landed him a secondment to MI6's anti-terrorism unit. In the wake of the mysterious 'Three Cities' attacks, Josh finds himself on the way to the USA, on the trail of a pair on intrepid young hackers who are out to try and make themselves a fortune, and who are in grave danger from those who would kill for the secrets they have managed to uncover -- how to control the power of the Western world.<br/><br/>But soon Josh finds himself waking up in a ditch bloody and wounded, and with no memory of who he is, how he got there, or how he got hurt.<br/><br/>Yet one thing is for certain -- Josh is in danger.<br/><br/>Stranded in the Wild West, Josh must rely on his instincts as a soldier and on the kindness of a beautiful stranger in order to escape those who appear intent on tracking him down and killing him -- all for a secret he can't remember. His determination to discover who he is, and what he was doing there leads him into an explosive web of corporate blackmail, deceit and greed -- where the stakes are high and where no-one can be trusted.<br/><br/>From the Hardcover edition.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/57/82/9780099465782.jpg', 'title_long': 'Blackout', 'dimensions': 'Height: 7 Inches, Length: 4.31 Inches, Weight: 0.49383546688 Pounds, Width: 1.06 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.31}, 'width': {'unit': 'inches', 'value': 1.06}, 'weight': {'unit': 'pounds', 'value': 0.49383546688}, 'height': {'unit': 'inches', 'value': 7}}, 'pages': 288, 'date_published': '2006-06-06', 'subjects': ['Literature & Fiction', 'Action & Adventure', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Spies & Politics', 'Suspense'], 'authors': ['Chris Ryan'], 'title': 'Blackout', 'isbn13': '9780099465782', 'msrp': 11.03, 'binding': 'Mass Market Paperback', 'isbn': '0099465787', 'isbn10': '0099465787'}}