{'book': {'publisher': 'Arrow', 'synopsis': "One of the greatest comedy actresses of recent time, Dawn French has a career that has spanned nearly three decades, encompassing a vast and brilliant array of characters. Loved for her irreverant humor, she has achieved massive success while pushing boundaries and challenging stereotypes. In this memoir in the form of letters to people in her life, she describes her journey. Beginning her career as part of the groundbreaking alternative comedy group the Comic Strip, she then helped firmly establish a place for women in British comedy with Girls On Top, which teamed Dawn with Jennifer Saunders, Ruby Wax, and Tracy Ullman. As part of the wildly successful and much-loved duo French and Saunders, Dawn helped create a repetoire of brilliantly observed characters, parodying popular culture and impersonating everything from Harry Potter to The Exorcist. Dawn's recent role in the Vicar of Dibley showcased both her talent and also her ability to take a controversial issue and make it mainstream—and very funny. From her apartment-sharing antics with Jennifer Saunders to the death of her father, from her outspoken views on sizeism to her views on Madonna, Dear Fatty will chronicle the extraordinary, hilarious rise of a complex, dynamic, and unstoppable woman.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/94/78/9780099519478.jpg', 'title_long': 'Dear Fatty', 'edition': 'Illustrated', 'dimensions': 'Height: 8 Inches, Length: 5 Inches, Weight: 0.69004688006 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.69004688006}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 374, 'date_published': '2010-05-01', 'subjects': ['Arts & Photography', 'Performing Arts', 'Music', 'Biographies & Memoirs', 'Arts & Literature', 'Actors & Entertainers', 'Television Performers', 'Community & Culture', 'Women', 'Humor & Entertainment', 'Television'], 'authors': ['Dawn French'], 'title': 'Dear Fatty', 'isbn13': '9780099519478', 'msrp': 14.95, 'binding': 'Paperback', 'isbn': '009951947X', 'isbn10': '009951947X'}}