{'book': {'publisher': 'Academic Press', 'synopsis': "This anthology emphasizes dialects of American English and language variation in America. The editors present original essays by today's leading investigators, including articles by some of Europe's best dialectologists, obtained expressly for this work.<br/><br/>Important topics featured in Dialect and Language Variation include:**Dialect theories: linguistic geography, structural and generative dialectology, and language variation.**The nature of social dialects and language variation, with attention to women's speech.**Overview of regional dialects and area studies.**The nature and study of the relationship between ethnicity and dialects, including Black, Italian, Irish, Chicano, and Jewish ethnic groups.**The application of dialect studies to education.**Of special interest to dialectologists, sociolinguists, and English language educators and specialists, this work provides original insight into**a general background and history of dialect theory**an overview of regional geography and area studies**the principles of social dialects and language variation from several perspectives**an exploration of the relationship between ethnicity and dialects o explanations of the relationship between historical and language change**a section on how dialects and language variation can contribute to effective language instruction.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/13/03/9780120511303.jpg', 'title_long': 'Dialect and Language Variation', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.86070149128 Pounds, Width: 1.43 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.43}, 'weight': {'unit': 'pounds', 'value': 1.86070149128}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 616, 'date_published': '1986-03-14', 'subjects': ['Business & Money', 'Economics', 'Microeconomics', 'Reference', 'Foreign Language Study & Reference', 'Words, Language & Grammar', 'Linguistics', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': [], 'title': 'Dialect and Language Variation', 'isbn13': '9780120511303', 'msrp': 63, 'binding': 'Paperback', 'related': {'eBook': '1483294765'}, 'isbn': '0120511304', 'isbn10': '0120511304', 'other_isbns': [{'isbn': '9781483294766', 'binding': 'print'}]}}