{'book': {'publisher': 'Academic Press', 'synopsis': 'Language, Thought, and Culture: Advances in the Study of Cognition: Representation and Understanding: Studies in Cognitive Science focuses on the principles, processes, and methodologies involved in artificial intelligence. The selection first offers information on the dimensions of representation, foundations for semantic networks, and reflections on the formal description of behavior. Discussions focus on relativity of behavioral description, hierarchical organization of processes, problems in knowledge representation, and inference, access, and self-awareness. The text then takes a look at the synthesis, analysis, and contingent knowledge in specialized understanding systems, some principles of memory schemata, and representing knowledge for recognition. The book examines frame representations and declarative/procedural controversy, schema for stories, and structure of episodes in memory. Topics include long-term memory, conceptual dependency, understanding paragraphs, simple story grammar, and first attempt at synthesis. The publication then ponders on concepts for representing mundane reality in plans and multiple representations of knowledge for tutorial reasoning. The selection is highly recommended for researchers interested in exploring artificial intelligence.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/55/06/9780121085506.jpg', 'title_long': 'Representation and Understanding: Studies in Cognitive Science', 'edition': '1', 'dimensions': 'Height: 9.5 Inches, Length: 6.5 Inches, Weight: 1.7196056436 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.7196056436}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 427, 'date_published': '1975-10-12', 'subjects': ['Computers & Technology', 'Computer Science', 'AI & Machine Learning', 'Health, Fitness & Dieting', 'Psychology & Counseling', 'Science & Math', 'Behavioral Sciences', 'Cognitive Psychology', 'Medical Books', 'Psychology', 'Cognitive', 'General', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': [], 'title': 'Representation and Understanding: Studies in Cognitive Science', 'isbn13': '9780121085506', 'msrp': 83.95, 'binding': 'Hardcover', 'related': {'eBook': '1483299155'}, 'isbn': '0121085503', 'isbn10': '0121085503', 'other_isbns': [{'isbn': '9781483299150', 'binding': 'print'}]}}