{'book': {'publisher': 'Academic Press', 'synopsis': "Edited by James Birren, one of the world's leading researchers in gerontology, this two-volume work is the most comprehensive work on age, aging, and the aged available. This entirely new encyclopedia covers the latest research on the biology, psychology, and sociology of aging in addition to covering how aging is depicted in the humanities. This dynamic field has grown over the years to encompass fascinating studies of development and change with age. This encyclopedia provides a reference source for identifying major areas of investigation and our knowledge to date. Prepared for a college- and professional-level readership, each article provides depth and breadth of coverage, including theory and summaries of empirical findings. Every article contains a definition paragraph, describing the subject at hand, a glossary of unfamiliar terms, and a bibliography of suggested readings. The set is fully cross-referenced and contains a complete subject index. Biology--molecular and cellular aging; physiology and neurobiology of aging Psychology--how aging affects sensation, perception, learning, and memory Social sciences--home care, quality of life, economics of an aging population Health science--epidemiology, mental health, Alzheimers, AIDS Humanities--characterization of aging in research, literature, and film; perceptions of the aged", 'language': 'en', 'image': 'https://images.isbndb.com/covers/86/01/9780122268601.jpg', 'title_long': 'Encyclopedia of Gerontology: Age, Aging, and the Aged', 'edition': '1', 'dimensions': 'Height: 11.5 Inches, Length: 3 Inches, Weight: 9.8326168852 Pounds, Width: 9 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 3}, 'width': {'unit': 'inches', 'value': 9}, 'weight': {'unit': 'pounds', 'value': 9.8326168852}, 'height': {'unit': 'inches', 'value': 11.5}}, 'pages': 1474, 'date_published': '1996-08-23', 'subjects': ['Health, Fitness & Dieting', 'Psychology & Counseling', 'Developmental Psychology', 'Neuropsychology', 'Reference', 'Encyclopedias & Subject Guides', 'Medical', 'Science & Math', 'Behavioral Sciences', 'Cognitive Psychology', 'Medical Books', 'Medicine', 'Internal Medicine', 'Psychology', 'Cognitive', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': [], 'title': 'Encyclopedia of Gerontology: Age, Aging, and the Aged', 'isbn13': '9780122268601', 'msrp': 790, 'binding': 'Hardcover', 'isbn': '0122268601', 'isbn10': '0122268601'}}