{'book': {'publisher': 'Academic Press', 'synopsis': "An exciting addition to the field of ethnography, this revised and expanded textbook addresses ethical and theoretical concerns central to research in psychology, sociology, and anthropology - an interdisciplinary approach rarely utilized in other text. Like the First Edition, this book explains ways to collect data, methods for assuring the quality of that data, and the techniques and tools used to organize results, conclusions, and interpretations. The Second Edition diverges in that it demonstrates the delicate yet profound relationship between researchers and the material and participants under study. The authors investigate, interpret, and synthesize how each faction informs and affects the others' behavior, as well as the subsequent affect of these interactions on the results. The book discusses the historical development of ethnography and the fundamentals of how to do qualitative and ethnographic research. Other chapters address the problem of selection and of selection and research design, the issues involved in choosing relevant populations and in selecting and sampling qualitative data, and describe how populations are conceptualized. Resource and references lists are expanded to include the most recent developments. Accordingly, the use of computers as analytic tools is now addressed. This book will be of great value for both students and researchers concerned about the effects of theory and interpretation in the research process. It explores the investigative traditions and terminologies of the various interdisciplinary fields. It now includes chapters on critical, postmodern, collaborative, and feministic perspectives on the purposes and implementation of research. It contains an expanded use of concrete examples. It traces the role of research in cultural anthropology and field sociology to its current use in ethnography, educational anthropology, sociology, psychology, and other disciplines.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/48/02/9780122874802.jpg', 'title_long': 'Ethnography and Qualitative Design in Educational Research', 'edition': 'First Edition', 'dimensions': 'Weight: 1.38009376012 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 1.38009376012}}, 'pages': 292, 'date_published': '1984-05-12', 'subjects': ['Business & Money', 'Economics', 'Microeconomics', 'Science & Math', 'Mathematics', 'Applied', 'Education & Teaching', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Judith P. Goetz', 'Margaret Diane LeCompte'], 'title': 'Ethnography and Qualitative Design in Educational Research', 'isbn13': '9780122874802', 'msrp': 49, 'binding': 'Hardcover', 'isbn': '0122874803', 'isbn10': '0122874803'}}