{'book': {'publisher': 'Academic Press', 'synopsis': "Characteristics And Causation Of Protein-calorie Malnutrition In The Infant And Preschool Child / Robert M. Suskind -- Effects Of Severe Protein-calorie Malnutrition On Behavior In Human Populations / Carol A. Thomson And Ernesto Pollitt -- The Role Of The Thyroid In The Development Of The Human Nervous System / John B. Stanbury -- Hyperendemic Goiter, Cretinism, And Social Organization In Highland Ecuador / Lawrence S. Greene -- Malnutrition And Human Performance / Merrill S. Read -- Nutritional Stress And Postcontatct Population Decline Among The Maring Of New Guinea / Georgeda Buchbinder -- Social Structuring Of Nutrition In Southern India / Edward Montgomery -- The Malthusian Proposition And Nutritional Stress: Differing Implications For Man And For Society / B. Abbott Segraves -- Nutrition, Behavior, And Culture / Edward Foulks And Solomons H. Katz -- Malnutrition: Its Effect On Psychological Development And Cultural Evolution / Eugene G. D'aquili And Gary J. Mihalik -- Toward A New Concept Of Nutrition / Solomon H. Katz -- Contemporary Implications Of The State Of The Art / Margaret Mead -- Toward An Appreciation Of The Biological Bases Of Behavioral Variation And Its Influence On Social Organization / Lawrence S. Greene. Edited By Lawrence S. Greene. Includes Bibliographies And Index.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/05/03/9780122980503.jpg', 'title_long': 'Malnutrition, Behavior, and Social Organization', 'dimensions': 'Weight: 0.5070632026 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 0.5070632026}}, 'pages': 298, 'date_published': '1977', 'subjects': ['Politics & Social Sciences', 'Social Sciences', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Lawrence S., ed. Greene'], 'title': 'Malnutrition, Behavior, and Social Organization', 'isbn13': '9780122980503', 'msrp': 1.99, 'binding': 'Hardcover', 'isbn': '0122980506', 'isbn10': '0122980506'}}