{'book': {'publisher': 'Academic Press', 'synopsis': 'In this book, we study theoretical and practical aspects of computing methods for mathematical modelling of nonlinear systems. A number of computing techniques are considered, such as methods of operator approximation with any given accuracy; operator interpolation techniques including a non-Lagrange interpolation; methods of system representation subject to constraints associated with concepts of causality, memory and stationarity; methods of system representation with an accuracy that is the best within a given class of models; methods of covariance matrix estimation;methods for low-rank matrix approximations; hybrid methods based on a combination of iterative procedures and best operator approximation; andmethods for information compression and filtering under condition that a filter model should satisfy restrictions associated with causality and different types of memory.As a result, the book represents a blend of new methods in general computational analysis,and specific, but also generic, techniques for study of systems theory ant its particularbranches, such as optimal filtering and information compression.<br/><br/>- Best operator approximation,- Non-Lagrange interpolation,- Generic Karhunen-Loeve transform- Generalised low-rank matrix approximation- Optimal data compression- Optimal nonlinear filtering', 'language': 'en', 'image': 'https://images.isbndb.com/covers/56/05/9780122695605.jpg', 'title_long': 'Syntactic Methods in Pattern Recognition (Mathematics in Science and Engineering, Vol. 112) (Mathematics in Science and Engineering, Volume 112)', 'edition': '1', 'dimensions': 'Weight: 1.7416518698 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 1.7416518698}}, 'pages': 295, 'date_published': '1974-02-11', 'subjects': ['Questions & Answers', 'Mathematical Analysis', 'Mechanical', 'Linear', 'Mathematics & Statistics -> Calculus -> Introductory Linear Algebra', 'Mathematics & Statistics -> Mathematics -> Mathematics General', 'General Interests & Hobbies -> Reference -> Reference', 'Trades & Technology -> Industrial Technology -> Mechanical'], 'authors': ['K. S. Fu'], 'title': 'Syntactic Methods in Pattern Recognition (Mathematics in Science and Engineering, Vol. 112) (Mathematics in Science and Engineering, Volume 112)', 'isbn13': '9780122695605', 'msrp': 179.99, 'binding': 'Hardcover', 'isbn': '0122695607', 'isbn10': '0122695607', 'other_isbns': [{'isbn': '9780080956213', 'binding': 'eisbncanonical'}]}}