{'book': {'publisher': 'Academic Press', 'synopsis': 'Environmental Radioactivity from Natural, Industrial, and Military Sources is the comprehensive source of information on radiation in the environment and human exposure to radioactivity. This Fourth Edition isa complete revision and extension of the classic work, reflecting major new developments and concerns as the Cold War ended, nuclear weapons began to be dismantled, and cleanup of the nuclear weapons facilities assumed center stage. Contamination from accidents involving weapons, reactors, and radionuclide sources are discussed in an updated chapter, including the latest information about the effects of the Chernobyl accident. Important revisions are also made to the chapters on natural radioactivity, nuclear fuels and power reactors, radioactive waste management, and various other sources of exposure. Several chapters provide primers for readers who may not be familiar with the fundamentals of radiation biology, protection standards, and pathways for the environmental transport of radionuclides. An Appendix lists the properties of the more important radionuclides found in the environment. The book concludes with a commentary on contemporary social aspects of radiation exposure and risks that offers analternative view to current, often excessive concerns over radiation, nuclear technology, and waste.Key Features* Describes every important source of environmental radioactivity* Reviews the vexing problems of radioactive waste management and cleanup of contaminated sites* Contains measured or projected radiation dose estimates for the major sources* Features 126 figures, 80 tables, and more than 1200 references* Discusses current problems in historical context* The two authors bring more than 75 years of combined experience with environmental radioactivity* Provides an understanding of the sources of environmental radioactivity and human exposure from the mining of ores to final disposal of wastes* Thoroughly reviews important contamination accidents', 'language': 'en', 'image': 'https://images.isbndb.com/covers/15/32/9780122351532.jpg', 'title_long': 'Environmental Radioactivity: From Natural, Industrial, and Military Sources', 'edition': 'Third Edition', 'dimensions': 'Height: 9.5 Inches, Length: 1 Inches, Weight: 1.88054309486 Pounds, Width: 6.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 1}, 'width': {'unit': 'inches', 'value': 6.5}, 'weight': {'unit': 'pounds', 'value': 1.88054309486}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 475, 'date_published': '1987', 'subjects': ['Business & Money'], 'authors': ['Merril Eisenbud'], 'title': 'Environmental Radioactivity: From Natural, Industrial, and Military Sources', 'isbn13': '9780122351532', 'msrp': 89, 'binding': 'Hardcover', 'isbn': '0122351533', 'isbn10': '0122351533'}}