{'book': {'publisher': 'Academic Press', 'synopsis': 'Cilia and Flagella presents protocols accessible to all individuals working with eukaryotic cilia and flagella. These recipes delineate laboratory methods and reagents, as well as critical steps and pitfalls ofthe procedures. The volume covers the roles of cilia and flagella in cell assembly and motility, the cell cycle, cell\x96cell recognition and other sensory functions, as well as human diseases and disorders. Students, researchers, professors, and clinicians should find the book\'s combination of"classic"and innovative techniques essential to the study of cilia and flagella.<br/><br/>A complete guide containing more than 80 concise technical chapters friendly to both the novice and experienced researcher<br/>Covers protocols for cilia and flagella across systems and species from Chlamydomonas and Euglena to mammals<br/>Both classic and state-of-the-art methods readily adaptable across model systems, and designed to last the test of time, including microscopy, electrophoresis, and PCR<br/>Relevant to clinicians interested in respiratory disease, male infertility, and other syndromes, who need to learn biochemical, molecular, and genetic approaches to studying cilia, flagella, and related structures', 'language': 'en', 'image': 'https://images.isbndb.com/covers/71/02/9780122097102.jpg', 'title_long': 'Cilia and Flagella, Volume 47 (Methods in Cell Biology)', 'dimensions': 'Height: 9.5 Inches, Length: 8.25 Inches, Weight: 3.38189109908 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 3.38189109908}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 603, 'date_published': '1995-08-08', 'subjects': ['Science & Math', 'Biological Sciences', 'Biology', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Author Unknown'], 'title': 'Cilia and Flagella, Volume 47 (Methods in Cell Biology)', 'isbn13': '9780122097102', 'msrp': 67, 'binding': 'Paperback', 'isbn': '0122097106', 'isbn10': '0122097106'}}