{'book': {'publisher': 'Academic Press', 'synopsis': 'The previous edition of this book marked the shift in technology from video to digital camera use with microscope use in biological science. This new edition presents some of the optical fundamentals needed to provide a quality image to the digital camera. Specifically, it covers the fundamental geometric optics of finite- and infinity-corrected microscopes, develops the concepts of physical optics and Abbe’s theory of image formation, presents the principles of Kohler illumination, and finally reviews the fundamentals of fluorescence and fluorescence microscopy. The second group of chapters deals with digital and video fundamentals: how digital and video cameras work, how to coordinate cameras with microscopes, how to deal with digital data, the fundamentals of image processing, and low light level cameras. The third group of chapters address some specialized areas of microscopy that allow sophisticated measurements of events in living cells that are below the optical limits of resolution. Expands coverage to include discussion of confocal microscopy not found in the previous edition Includes "traps and pitfalls" as well as laboratory exercises to help illustrate methods', 'language': 'en', 'image': 'https://images.isbndb.com/covers/02/50/9780123740250.jpg', 'title_long': 'methods-in-cell-biology-mitochondria', 'edition': '3', 'dimensions': 'Height: 9.48 Inches, Length: 7.73 Inches, Width: 1.14 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.73}, 'width': {'unit': 'inches', 'value': 1.14}, 'height': {'unit': 'inches', 'value': 9.48}}, 'pages': 632, 'date_published': '2007', 'subjects': ['Microscopes & Microscopy', 'Cell Biology', 'Molecular Biology', 'Physical & Earth Sciences -> Physics -> Microscopes & Microscopy', 'Biological Sciences & Nutrition -> Biology -> Molecular & Cell Biology'], 'authors': ['not-available'], 'title': 'methods-in-cell-biology-mitochondria', 'isbn13': '9780123740250', 'msrp': 179.99, 'binding': 'Paperback', 'related': {'ePub': '0080544347'}, 'isbn': '0123740258', 'isbn10': '0123740258', 'other_isbns': [{'isbn': '9780080544342', 'binding': 'print'}]}}