{'book': {'publisher': 'Academic Pr', 'synopsis': 'Developmental NeuroPsychobiology reviews a variety of topics related to developmental neuropsychobiology, a discipline that encompasses developmental neuroscience and developmental psychobiology. This book discusses embryonic mechanisms and embryogenesis as well as sexual differentiation of the brain, synaptic plasticity, and parent-offspring relationships. The development of olfactory control over behavior is also discussed.<br/>This book is comprised of 16 chapters and begins with an analysis of intrinsic mechanisms, including those underlying expression of pattern information at the cellular level and pattern formation in the vertebrate visual system. The next chapters also deal with pattern, but at a higher order, focusing upon the implications of the establishment of systems and how the sequences whereby these systems become established are manifested in the development of behavior. The morphogenetic role of neurotransmitters in embryonic development is also considered, along with structural and functional sexual dimorphisms in the brain and how steroid hormones alter brain organization. The final chapter evaluates previous models of the forces driving parent-offspring relations and offers an alternative view in which both infant-infant interactions and offspring-parent interactions result in mutually beneficial outcomes.<br/>This monograph is intended for advanced workers in the biological and/or psychological sciences.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/27/09/9780123002709.jpg', 'title_long': 'Developmental Neuropsychobiology (Behavioral Biology, an International Series)', 'edition': '1', 'dimensions': 'Weight: 2.1825763938 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 2.1825763938}}, 'pages': 485, 'date_published': '1986', 'subjects': ['Mammals', 'Biochemistry', 'Biological Sciences & Nutrition -> Biology -> Biochemistry', 'General Interests & Hobbies -> Nature -> Nature'], 'authors': ['William T. Greenough'], 'title': 'Developmental Neuropsychobiology (Behavioral Biology, an International Series)', 'isbn13': '9780123002709', 'msrp': 72.99, 'binding': 'Hardcover', 'isbn': '0123002702', 'isbn10': '0123002702', 'other_isbns': [{'isbn': '9780323147842', 'binding': 'eisbncanonical'}]}}