{'book': {'publisher': 'Morgan Kaufmann', 'synopsis': 'This sequel to Graphics Gems (Academic Press, 1990), and Graphics Gems II (Academic Press, 1991) is a practical collection of computer graphics programming tools and techniques. Graphics Gems III contains a larger percentage of gems related to modeling and rendering, particularly lighting and shading. This new edition also covers image processing, numerical and programming techniques, modeling and transformations, 2D and 3D geometry and algorithms,ray tracing and radiosity, rendering, and more clever new tools and tricks for graphics programming. Volume III also includes a disk containing source codes for either the IBM or Mac versions featuring all code from Volumes I, II, and III.<br/>Author David Kirk lends his expertise to the Graphics Gems series in Volume III with his far-reaching knowledge of modeling and rendering, specifically focusing on the areas of lighting and shading. Volume III includes a disk containing source codes for both the IBM and Mac versions featuring all code from volumes I, II, and III. Graphics Gems I, II, and III are sourcebooks of ideas for graphics programmers. They also serve as toolboxes full of useful tricks and techniques for novice programmers and graphics experts alike. Each volume reflects the personality and particular interests of its respective editor. Includes a disk containing source codes for both the IBM and Mac versions featuring code from volumes I, II, and III Features all new graphics gems Explains techniques for making computer graphics implementations more efficient Emphasizes physically based modeling, rendering, radiosity, and ray tracing Presents techniques for making computer graphics implementations more efficient', 'language': 'en', 'image': 'https://images.isbndb.com/covers/67/38/9780124096738.jpg', 'title_long': 'Graphics Gems 3 (IBM Version)', 'edition': '1', 'dimensions': 'Height: 9.75 Inches, Length: 8 Inches, Weight: 2.9541943108 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 2.9541943108}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 631, 'date_published': '1994-01-19', 'subjects': ['Computer Science', 'Computer Graphics', 'General', 'Professional, Career & Trade -> Computer Science -> Computer Science', 'Professional, Career & Trade -> Computer Science -> Computer Graphics', 'Professional, Career & Trade -> Computer Science -> General'], 'authors': ['David Kirk'], 'title': 'Graphics Gems 3 (IBM Version)', 'isbn13': '9780124096738', 'msrp': 72.99, 'binding': 'Hardcover', 'related': {'ePub': '0080507557'}, 'isbn': '0124096735', 'isbn10': '0124096735', 'other_isbns': [{'isbn': '9780080507552', 'binding': 'print'}]}}