{'book': {'publisher': 'Academic Press', 'synopsis': 'Binary Digital Image Processing is aimed at faculty, postgraduate students and industry specialists. It is both a text reference and a textbook that reviews and analyses the research output in this field of binary image processing. It is aimed at both advanced researchers as well as educating the novice to this area. The theoretical part of this book includes the basic principles required for binary digital image analysis. The practical part which will take an algorithmic approach addresses problems which find applications beyond binary digital line image processing.<br/>The book first outlines the theoretical framework underpinning the study of digital image processing with particular reference to those needed for line image processing. The theoretical tools in the first part of the book set the stage for the second and third parts, where low-level binary image processing is addressed and then intermediate level processing of binary line images is studied. The book concludes with some practical applications of this work by reviewing some industrial and software applications (engineering drawing storage and primitive extraction, fingerprint compression). Outlines the theoretical framework underpinning the study of digital image processing with particular reference to binary line image processing Addresses low-level binary image processing, reviewing a number of essential characteristics of binary digital images and providing solution procedures and algorithms Includes detailed reviews of topics in binary digital image processing with up-to-date research references in relation to each of the problems under study Includes some practical applications of this work by reviewing some common applications Covers a range of topics, organised by theoretical field rather than being driven by problem definitions', 'language': 'en', 'image': 'https://images.isbndb.com/covers/50/50/9780124705050.jpg', 'title_long': 'Binary Digital Image Processing: A Discrete Approach', 'edition': 4, 'dimensions': 'Height: 9.91 Inches, Length: 6.84 Inches, Weight: 1.543235834 Pounds, Width: 0.83 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.84}, 'width': {'unit': 'inches', 'value': 0.83}, 'weight': {'unit': 'pounds', 'value': 1.543235834}, 'height': {'unit': 'inches', 'value': 9.91}}, 'pages': 368, 'date_published': '1999-12-30', 'subjects': ['Interactive & Multimedia', 'Robotics', 'Professional, Career & Trade -> Computer Science -> Multimedia', 'Trades & Technology -> Technology & Engineering -> Robotics'], 'authors': ['Stéphane Marchand-Maillet', 'Yazid M. Sharaiha'], 'title': 'Binary Digital Image Processing: A Discrete Approach', 'isbn13': '9780124705050', 'msrp': 149.99, 'binding': 'Hardcover', 'related': {}, 'isbn': '0124705057', 'isbn10': '0124705057', 'other_isbns': [{'isbn': '9780080527826', 'binding': 'eisbncanonical'}]}}