{'book': {'publisher': 'Academic Pr', 'synopsis': "Monoclonal Antibodies Against Bacteria, Volume II provides the basis for understanding new developments of practical importance in the health sciences within the area of microbiology and infectious diseases, focusing on advances made possible by monoclonal antibodies. This 12-chapter volume starts with the analysis of streptococcal antigens implicated in the causation of rheumatic fever and heart disease to find ways of inducing protective immunity. The next chapters deal with the detection of staphylococcal enterotoxins in foods and treatment of staphylococcal food poisoning, the classification of meningococcal isolates associated with meningitis and related disorders, and the immunology of brucellosis with emphasis on the problem of distinguishing antibrucella antibodies elicited by vaccination of cattle from antibodies elicited by infection. These topics are followed by discussions of the diagnostic and epidemiologic studies of legionellosis; the identification of antigens in gram-negative bacteria; and the development of means to study and control infections by Pseudomonas in cystic fibrosis and other pathologic conditions. Other chapters explore the analysis of toxigenicity and neutralization of botulinum toxin, the pathogenetic role of Escherichia coli's pili, and study of its antigens to understand regulatory networks of the immune system involving antiidiotypic antibodies. The remaining chapters consider the elucidation of antigenic mosaics of archaebacteria and identification of their molecular signatures in their ecological niches and other life forms. These chapters also look into the combination of bacterial genetics with hybridoma technology for elucidating structure-function relationships in membrane molecules, as well as the strategies, methods, quality control, and other practical aspects connected with industrial production of monoclonal antibodies against bacteria. This book will prove useful to internists, pediatricians, surgeons, dentists, veterinarians, clinical pathologists, and laboratory technologists.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/00/31/9780124630031.jpg', 'title_long': 'Monoclonal Antibodies Against Bacteria, Vol. 3', 'dimensions': 'Weight: 2.00179733896 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 2.00179733896}}, 'pages': 346, 'date_published': '1986', 'subjects': ['Science & Math', 'Biological Sciences', 'Biology', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': [], 'title': 'Monoclonal Antibodies Against Bacteria, Vol. 3', 'isbn13': '9780124630031', 'msrp': 10.49, 'binding': 'Hardcover', 'related': {'Page Fidelity': '1483257398', 'eBook': '1483257398'}, 'isbn': '0124630030', 'isbn10': '0124630030', 'other_isbns': [{'isbn': '9781483257396', 'binding': 'print'}]}}