{'book': {'publisher': 'Academic Press', 'synopsis': 'This book covers 30% of statistical methods used for 90% of medical studies. It opens with databases from clinical medicine and uses such data throughout to give multiple worked-out illustrations for every method. In contrast to a traditional text, it provides two parts: (I) an introductory text for students in medicine, dentistry, nursing, pharmacy, and other health care fields, and (II) a reference manual to support practicing clinicians in reading medical literature or conducting research study. The textbook part starts at ground zero in mathematics and covers only the basic concepts and the most frequently seen methods in biostatistics, following the philosophy that what the student remembers five years after the course is the important issue, not what is forgotten. The reference part is written to allow topic hop-about rather than a required sequence of reading. It is well indexed to find topics and terms. A great effort has been made to make it user friendly and the foreword has been written by VADM Richard Nelson M.D., Surgeon General of the Navy and Chief, Bureau of Medicine and Surgery.<br/><br/>Key Features<br/>* Easy-to-follow format includes medical examples, step-by-step methods, and check-yourself exercises<br/>* Includes a summary of formulas, method algorithms, and check lists in a back section<br/>* Thorough discussion on required sample size<br/>* Covers germane topics honed through multiple lecture series to hospital staff and residents<br/>* Facilitates scanning and review by leading off each paragraph with its topic or gist in italics<br/>* Covers important topics omitted in most biostatistics texts:<br/>* Multiple, curvlinear, and logarithmic regression<br/>* Survival methods<br/>* Sequential analysis<br/>* Time series<br/>* Number Needed to Treat<br/>* Meta-analysis', 'language': 'en', 'image': 'https://images.isbndb.com/covers/56/07/9780125885607.jpg', 'title_long': 'Statistics in Medicine', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 1.25 Inches, Weight: 2.1605301676 Pounds, Width: 6.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 1.25}, 'width': {'unit': 'inches', 'value': 6.25}, 'weight': {'unit': 'pounds', 'value': 2.1605301676}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 581, 'date_published': '1999-08-16', 'subjects': ['Engineering & Transportation', 'Engineering', 'Industrial, Manufacturing & Operational Systems', 'Medical Books', 'Medicine', 'Internal Medicine', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Robert H. Riffenburgh'], 'title': 'Statistics in Medicine', 'isbn13': '9780125885607', 'msrp': 74.95, 'binding': 'Hardcover', 'isbn': '0125885601', 'isbn10': '0125885601'}}