{'book': {'publisher': 'Academic Press', 'synopsis': 'Intermediate filaments are a large family of proteins that are the cytoskeletal elements involved in a number of skin, liver, neuromuscular, cardiac, eye and hair diseases. Intermediate filament genes are regulated in a tissue-and cell type-specific manner and their polymerized protein products protects the cells and tissue they are part of against a variety of mechanical and nonmechanical stresses. This book provides a comprehensive resource of methodology essentials, describing a variety of essential tools and assays for studying intermediate filaments. The book provides user-friendly advice and protocols covering all aspects of intermediate filaments including protein isolation and structure, protein and gene regulation, relationship to disease and apoptosis, and associated proteins. Both mammalian and non-mammalian systems and animal models are covered, making this book a must-have for any investigator wishing to study IF genes or their protein products.<br/><br/>* Covers intermediate filaments from crystallography, protein chemistry, cell and molecular biology, microrheology, gene regulation, to animal models and human disease<br/>* Practical and user-friendly with detailed "how-to-protocols and "tricks of the trade"<br/>* Includes detailed tables of useful reagents, vendors and web links', 'language': 'en', 'image': 'https://images.isbndb.com/covers/17/39/9780125641739.jpg', 'title_long': 'Intermediate Filament Cytoskeleton (Volume 78) (Methods in Cell Biology, Volume 78)', 'edition': '1', 'dimensions': 'Height: 9.56 Inches, Length: 7.74 Inches, Weight: 3.8360433588 Pounds, Width: 1.51 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.74}, 'width': {'unit': 'inches', 'value': 1.51}, 'weight': {'unit': 'pounds', 'value': 3.8360433588}, 'height': {'unit': 'inches', 'value': 9.56}}, 'pages': 855, 'date_published': '2004-12-16', 'subjects': ['Science & Math', 'Biological Sciences', 'Biochemistry', 'Biology', 'Medical Books', 'Medicine', 'Test Preparation & Review', 'Pharmacology', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': [], 'title': 'Intermediate Filament Cytoskeleton (Volume 78) (Methods in Cell Biology, Volume 78)', 'isbn13': '9780125641739', 'msrp': 156, 'binding': 'Hardcover', 'isbn': '0125641737', 'isbn10': '0125641737'}}