{'book': {'publisher': 'Academic Press', 'synopsis': 'Cell Death provides a current and comprehensive collection of methods for the study of cell death. Using a diverse range of technical approaches and model systems, the chapters in this volume cover topics from the cellular and organismal to the molecular and anatomical. In the tradition of this long-standing series, this volume\'s user-friendly recipes and more than 100 tables and figures make the study of cell death accessible across life science disciplines.<br/>Because of breakthroughs such as the "switching" mechanism of the p53 tumor suppressor gene, as well as many technical innovations, the number of investigators of cell death has rapidly expanded over the last few years. Students of apoptosis and other types of cell death hypothesize that virtually all cells are genetically programmed to self-destruct. In turn, they also have learned that massive cell death does not always represent pathology, but rather a normal and necessary "weeding out" in the development and life of an organism. The clinical implications are immense, as the understanding and ability to regulate this process may offer the potential to treat cancer and a wide variety of other disorders.<br/><br/>Key Features<br/>* A cross-disciplinary look at cell death using a broad range of technical approaches and model systems<br/>* The protocols and insights presented are the products of years of study by experts in their fields<br/>* The chapters cover a topical spectrum from the cellular to the organismal and the molecular to the anatomical<br/>* The methods are illustrated with user-friendly recipes and more than 100 tables, halftones, and diagrams<br/>* The techniques described facilitate both understanding and regulation of cell death, promising to have immense value in the clinical treatment of cancer<br/>* Illustrated with color plates', 'language': 'en', 'image': 'https://images.isbndb.com/covers/14/70/9780125641470.jpg', 'title_long': 'Apoptosis (Volume 66) (Methods in Cell Biology, Volume 66)', 'edition': '1', 'dimensions': 'Height: 9.75 Inches, Length: 8 Inches, Weight: 2.5573622392 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 2.5573622392}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 553, 'date_published': '2001-06-04', 'subjects': ['Science & Math', 'Biological Sciences', 'Biology', 'Medical Books', 'Medicine', 'Internal Medicine', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': [], 'title': 'Apoptosis (Volume 66) (Methods in Cell Biology, Volume 66)', 'isbn13': '9780125641470', 'msrp': 72.95, 'binding': 'Hardcover', 'isbn': '0125641478', 'isbn10': '0125641478'}}