{'book': {'publisher': 'Academic Pr', 'synopsis': 'Multivariate Statistics and Essays in Memory of Paruchuri R. Krishnaiah is a collection of essays on multivariate statistics and probability in memory of Paruchuri R. Krishnaiah (1932-1987), who made significant contributions to the fields of multivariate statistical analysis and stochastic theory. The papers cover the main areas of multivariate statistical theory and its applications, as well as aspects of probability and stochastic analysis. Topics range from finite sampling and asymptotic results, including aspects of decision theory, Bayesian analysis, classical estimation, regression, and time-series problems.Comprised of 35 chapters, this book begins with a discussion on the joint asymptotic distribution of marginal quantiles and quantile functions in samples from a multivariate population. The reader is then introduced to kernel estimators of density function of directional data; moment conditions for valid formal edgeworth expansions; and ergodicity and central limit theorems for a class of Markov processes. Subsequent chapters focus on minimal complete classes of invariant tests for equality of normal covariance matrices and sphericity; normed likelihood as saddlepoint approximation; generalized Gaussian random fields; and smoothness properties of the conditional expectation in finitely additive white noise filtering.This monograph should be of considerable interest to researchers as well as to graduate students working in theoretical and applied statistics, multivariate analysis, and random processes.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/20/55/9780125802055.jpg', 'title_long': 'Multivariate Statistics and Probability: Essays in Memory of Paruchuri R. Krishnaiah', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 2.08777762114 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 2.08777762114}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 567, 'date_published': '2014', 'subjects': ['Science & Math', 'Mathematics', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['C. R. Rao'], 'title': 'Multivariate Statistics and Probability: Essays in Memory of Paruchuri R. Krishnaiah', 'isbn13': '9780125802055', 'msrp': 69.95, 'binding': 'Hardcover', 'related': {'eBook': '1483263835'}, 'isbn': '0125802056', 'isbn10': '0125802056', 'other_isbns': [{'isbn': '9781483263830', 'binding': 'print'}]}}