{'book': {'publisher': 'Academic Press', 'synopsis': 'Each chapter presents a detailed background of the described method, its theoretical foundations, and its applicability to different biomedical material. Updated chapters describe either the most popular methods or those processes that have evolved the most since the past edition. Additionally, a large portion of the volume is devoted to clinical cytometry. Particular attention is paid to applications of cytometry in oncology, the most rapidly growing area.<br/><br/>Key Features<br/>* Contains 56 extensive chapters authored by world authorities on cytometry<br/>* Covers a wide range of topics, including principles of cytometry and general methods, cell preparation, tandardization and quality assurance, cell proliferation, apoptosis, cell-cell/cell-environmental interactions, cytogenetics and molecular genetics, cell function and differentiation, experimental and clinical oncology, microorganisms, and infectious diseases<br/>* Describes in-depth the essential methods and scientific principles of flow and laser scanning cytometry and illustrates how they can be applied to the fields of biology and medicine<br/>* Complements the first and second editions on flow cytometry in the Methods in Cell Biology series and includes new sections on technology principles', 'language': 'en', 'image': 'https://images.isbndb.com/covers/16/74/9780125441674.jpg', 'title_long': 'Cytometry, Part B (Volume 64) (Methods in Cell Biology, Volume 64)', 'edition': '3', 'dimensions': 'Height: 9.5 Inches, Length: 7.75 Inches, Weight: 2.7998707274 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.75}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 2.7998707274}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 614, 'date_published': '2000-10-30', 'subjects': ['Science & Math', 'Biological Sciences', 'Biology', 'Evolution', 'Genetics', 'Research', 'Medical Books', 'Medicine', 'Test Preparation & Review', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': [], 'title': 'Cytometry, Part B (Volume 64) (Methods in Cell Biology, Volume 64)', 'isbn13': '9780125441674', 'msrp': 190, 'binding': 'Hardcover', 'isbn': '0125441673', 'isbn10': '0125441673'}}