{'book': {'publisher': 'Academic Press', 'synopsis': 'Neuroanatomical Research Techniques discusses developments in major neuroanatomical research techniques. The book is organized into four parts. Part I deals generally with the preparation and study of brain tissue. It includes a chapter on the microscope, discussing optical magnification, limitations of microscopy, and optical contrasting methods. Other chapters summarize basic techniques for tissue preparation and sectioning; present guidelines for a number of standard, but essential, staining procedures; and present sophisticated and contemporary computer techniques that are proving to be invaluable as neuroanatomy evolves from a qualitative to a quantitative discipline. Part II deals with techniques often used for the study of normal tissue. These include the Golgi method, fluorescence histochemistry, techniques for staining single neurons, and the use of the electron microscope. Part III presents techniques for studying intrinsic connections of the nervous system. These include techniques for silver impregnation of degenerating fibers; autoradiographic technique for studying axonal projections; and somatopetal movement of horseradish peroxidase as a tool for studying connections and neuron morphology. Part IV discusses the interpretation of results from neuroanatomical research techniques and presents examples of the applications of neuroanatomical methods to major problems in physiological psychology.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/35/09/9780125903509.jpg', 'title_long': 'Neuroanatomical research techniques (Methods in physiological psychology ; v. 2)', 'dimensions': 'Weight: 2 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 2}}, 'pages': 443, 'date_published': '1978', 'subjects': ['Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Richard T. Robertson'], 'title': 'Neuroanatomical research techniques (Methods in physiological psychology ; v. 2)', 'isbn13': '9780125903509', 'msrp': 3.39, 'binding': 'Hardcover', 'related': {'Page Fidelity': '1483266400', 'eBook': '1483266400'}, 'isbn': '0125903502', 'isbn10': '0125903502', 'other_isbns': [{'isbn': '9781483266404', 'binding': 'print'}]}}