{'book': {'publisher': 'Academic Press', 'synopsis': 'The Ecology of Natural Disturbance and Patch Dynamics brings together the findings and ideas of researchers studying such varied systems as marine invertebrate communities; grasslands; and boreal, temperate, and tropical forests. The primary goal is to present a synthesis of diverse individual contributions. The book is divided into three main sections: (1) examples of patch dynamics in diverse systems; (2) adaptations of organisms and evolution of populations in patch dynamic environments; and (3) implications of patch dynamics for the organization of communities and the functioning of ecosystems. This approach demonstrates the commonality of disturbance-generated phenomena over a wide range of scales and levels of organization, and thus validates the broad applicability of the patch dynamic viewpoint. The book presents a framework that can stimulate the generation of explicit hypotheses and theory and forms an alternative to equilibrium concepts of the evolution of populations, composition of communities, and functioning of ecosystems.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/52/04/9780125545204.jpg', 'title_long': 'The Ecology of Natural Disturbance and Patch Dynamics', 'edition': '1', 'dimensions': 'Height: 9.5 Inches, Length: 6.5 Inches, Weight: 1.7416518698 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.7416518698}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 472, 'date_published': '1985-07-12', 'subjects': ['Ecology', 'Microeconomics', 'Business & Economics -> Economics -> Principles of Microeconomics', 'Biological Sciences & Nutrition -> Environmental Science & Ecology -> Ecology'], 'authors': ['Bozzano G Luisa'], 'title': 'The Ecology of Natural Disturbance and Patch Dynamics', 'isbn13': '9780125545204', 'msrp': 72.99, 'binding': 'Hardcover', 'isbn': '0125545207', 'isbn10': '0125545207', 'other_isbns': [{'isbn': '9780323138932', 'binding': 'eisbncanonical'}]}}