{'book': {'publisher': 'Academic Press', 'synopsis': 'Biology of Memory investigates the biological basis of memory and covers topics ranging from short- and long-term post-perceptual memory to memory storage processes, memory microstructures, chemical transfer, and neuronal plasticity. The activity of neuronal networks in the thalamus of the monkey is also examined, along with integrative functions of the thalamocortical visual system of the cat. Comprised of 20 chapters, this book begins with an overview of the mechanisms that inhibit or interfere with short- and long-term memory, followed by a discussion on different retrieval mechanisms for short- and long-term memory. The reader is then introduced to the role of short- and long-term memory in the formation, retention, and utilization of associations, together with the link between memory and the medial temporal regions of the brain. Subsequent chapters focus on anatomical and chemical changes in the brain during primary learning; cellular models of learning and cellular mechanisms of plasticity in Aplysia; trace phenomena in single neurons of hippocampus and mammiliary bodies; and plasticity in single units in the mammalian brain. The book concludes with a description of Occam (Omnium-Gatherum Core Content Addressable Memory), a computer program for a content addressable memory in the central nervous system. This monograph will be useful to biologists, behavioral psychologists, neuropsychologists, neurophysiologists, biophysicists, and biochemists as well as computer scientists and mathematicians.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/35/04/9780125643504.jpg', 'title_long': 'Biology of memory', 'edition': 1, 'dimensions': 'Page Fidelity', 'dimensions_structured': {'weight': {'unit': 'g', 'value': 699}}, 'pages': 323, 'date_published': '1970', 'subjects': ['Mammals', 'Biochemistry', 'Biological Sciences & Nutrition -> Biology -> Biochemistry', 'General Interests & Hobbies -> Nature -> Nature'], 'authors': ['Karl H. Pribram', 'Donald E. Broadbent'], 'title': 'Biology of memory', 'isbn13': '9780125643504', 'msrp': 72.99, 'binding': 'Hardcover', 'isbn': '0125643500', 'isbn10': '0125643500', 'other_isbns': [{'isbn': '9780323141505', 'binding': 'eisbncanonical'}]}}