{'book': {'publisher': 'Academic Press', 'synopsis': "This book teaches readers how to create complete AppleScript applications using AppleScript and the FaceSpan interface builder. It includes detailed examples that are developed over the course of the book. Readers are led through the use of the FaceSpan interface designer, introduced to the Applescript language, and shown how to design and script complex Macintosh applications.<br/><br/>*<br/>* Shows how to build complete AppleScript applications using FaceSpan, a user interface development tool that makes AppleScript applications truly 'Mac-like'<br/>* Uses a step-by-step approach to demonstrate techniques for building applications through illustrations and samples<br/>* Provides Graphical User Interface (GUI) design tips and practical approaches for implementation<br/>* Includes FaceSpan and AppleScript references<br/>* Contains a section on debugging AppleScript applications using FaceSpan<br/>* Includes one CD-ROM with AppleScript 1.1, a demonstration version of FaceSpan 2.1, source code for all example applications, and numerous AppleScript shareware and demonstration programs", 'language': 'en', 'image': 'https://images.isbndb.com/covers/95/77/9780126239577.jpg', 'title_long': 'AppleScript Applications: Building Applications with FaceSpan and AppleScript', 'dimensions': 'Height: 9.5 Inches, Length: 7.5 Inches, Weight: 2.13187007354 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.5}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 2.13187007354}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 539, 'date_published': '1996-10-15', 'subjects': ['Computers & Technology', 'Computer Science', 'Software', 'Programming Languages', 'Science & Math', 'Mathematics', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['John Schettino', "Liz O'Hara"], 'title': 'AppleScript Applications: Building Applications with FaceSpan and AppleScript', 'isbn13': '9780126239577', 'msrp': 34.95, 'binding': 'Paperback', 'isbn': '0126239576', 'isbn10': '0126239576'}}