{'book': {'publisher': 'Morgan Kaufmann Pub', 'synopsis': "If you are a first time user of Windows 95 or are responsible for training large numbers of personnel on Microsoft's new operating system, you've found just what you need!<br/>The Compact Guide to Windows 95 offers unparalleled flexibility. If you want to learn Windows 95 fast and with minimal effort, simply use the CD training. If you want to look something up, learn more detail, or are away from your computer, use the book. It will refer you to appropriate CD segments. Best of all, you can keep it on your shelf or create a lending library. Unlike an expensive training course, it can be used over and over. Both parts of the package offer absolutely first rate quality of presentation and instruction.<br/>The CD is interactive and simple to use. Your instructor, Daniel Will Harris, teaches the basics of Windows 95 that a typical user needs to know. You can sit and watch the CD or you can use the menu system to go to specific topics. You can also fast forward and reverse. For more on the CD, see the Appendix.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/86/50/9780127038650.jpg', 'title_long': 'Compact Guide to Windows 95 (Compact Guide Training Series)', 'edition': 'Pap/Cdr', 'dimensions': 'Height: 9.5 Inches, Length: 7.5 Inches, Weight: 1.78133507696 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.5}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.78133507696}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 370, 'date_published': '1600', 'subjects': ['Computers & Technology', 'Operating Systems', 'Windows', 'Software', 'Science & Math', 'Mathematics', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['James L. Turley'], 'title': 'Compact Guide to Windows 95 (Compact Guide Training Series)', 'isbn13': '9780127038650', 'msrp': 49.95, 'binding': 'Paperback', 'isbn': '0127038655', 'isbn10': '0127038655'}}