{'book': {'publisher': 'Addison-Wesley', 'synopsis': "More and more companies are either requiring HP-UX certification or offering financial incentives to those who achieve it. This is the only all-in-one, authorized reference for HP-UX certification. It covers every exam objective in HP's four-part HP-UX System and Network Administration exam (3HO-001). It's designed not only to help sys admins prepare for the exam, but to remain an invaluable resource once they're certified. The book's coverage maps precisely to HP's exam objectives. It starts with the fundamentals of UNIX logins, general shell concepts, file management, environment variables, I/O, vi editing, regular expressions, filesystems, and the POSIX shell. Next, it reviews the fundamentals of HP-UX system administration, from installation and system startup to building kernels, patch management, peripherals, the HP-UX file system, user/group management, processes, printing, memory management, backup, job automation, security, auditing, performance monitoring, and more. In Section 3, the book covers every key skill related to HP-UX networking, from configuring LAN devices and IP connectivity, to NFS, DNS, NIS, diskless workstations, and more. The book contains hundreds of review questions -- plus a complete sample exam.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/37/43/9780130183743.jpg', 'title_long': 'HP Certified: HP-UX System Administration', 'dimensions': 'Height: 9.25 Inches, Length: 7 Inches, Weight: 2.91451110364 Pounds, Width: 1.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 1.75}, 'weight': {'unit': 'pounds', 'value': 2.91451110364}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 789, 'date_published': '2000-05-31', 'subjects': ['Computers & Technology', 'Hardware & DIY', 'Personal Computers', 'Operating Systems', 'Unix', 'Software', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Rafeeq Rehman'], 'title': 'HP Certified: HP-UX System Administration', 'isbn13': '9780130183743', 'msrp': 1.99, 'binding': 'Hardcover', 'isbn': '0130183741', 'isbn10': '0130183741'}}