{'book': {'publisher': 'Prentice Hall', 'synopsis': "The goal of this book is to prepare prospective teachers to meet the challenges of today's changing classrooms by providing effective, practical, research-based practices in an accessible, conversational style. The author shows future teachers not only \x93what\x94 to do to meet today's teaching challenges, but \x93how\x94 to do it, through the experiences of real teachers in real classrooms. Material is based on a quarter-century of actual, in-classroom research that makes it possible to replace anecdotal suggestions for good teaching with solidly research-grounded strategies empirically related to positive outcomes. Extensive coverage on instructional goals and objectives\x97with expanded treatment of traditional taxonomies for cognitive and affective behaviors illustrates ways to determine the extent to which higher-order thinking and problem-solving is being achieved in the classroom. Discussion and illustrations focused on testing focuses readers' attention on the pros and cons of standardized testing\x97helps them identify when, and when not, to rely on such tests and how to help learners perform better on them. Material on diversity and inclusion, multicultural education and ESL teaching, and at-risk learners prepares prospective teachers for the diversity of today's classrooms\x97helps them understand the impact on learning needs and classroom management of such things as learning style, culture, prior knowledge/achievement, language, home/family life, and more. Includes coverage of NBPTS and INTASC standards, acquainting readers with these professional guidelines to help them prepare for the requirements of certification and licensure. For prospective teachers.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/97/53/9780130489753.jpg', 'title_long': 'Effective Teaching Methods, Fifth Edition', 'edition': 'Subsequent', 'dimensions': 'Height: 8.75 Inches, Length: 7.25 Inches, Weight: 1.92022630202 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.25}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 1.92022630202}, 'height': {'unit': 'inches', 'value': 8.75}}, 'pages': 571, 'date_published': '2003', 'subjects': ['Education & Teaching', 'Schools & Teaching', 'Instruction Methods', 'Curriculum & Lesson Plans', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Gary D. Borich', 'Debra A. Stollenwerk'], 'title': 'Effective Teaching Methods, Fifth Edition', 'isbn13': '9780130489753', 'msrp': 80, 'binding': 'Paperback', 'isbn': '0130489751', 'isbn10': '0130489751'}}