{'book': {'publisher': 'Prentice Hall', 'synopsis': 'Focused solidly on “doing” rather than on “explaining,” this practical volume gets right to the heart of career decision making. It walks readers through the process of self-knowledge and self-discovery; encourages them to believe in themselves and in their own ability to influence outcomes and achieve their career goals; and guides them in working with various job/career-search and development tools in progressively demanding tasks to make their goals become a reality. Includes case studies of individual actively involved in the process. Creating Your Dream. Discovering Yourself: Motivations, Life Stages, and Values. Continuing Your Self-Discovery: Skills, Personality, and Interests. Exploring the World of Work. Networking: Establishing Contacts and Support. Decision Making and Goal Setting. Designing Your Resume and Cover Letters. Interviewing with Confidence. Developing Job Leads. Trying Out a Career. For anyone wanting guidance in Career Planning, Career Development, and Job Seeking Skills.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/83/36/9780130938336.jpg', 'title_long': 'The Career Adventure: Your Guide to Personal Assessment, Career Exploration, and Decision Making (3rd Edition)', 'edition': '3rd Edition', 'dimensions': 'Height: 10.72 Inches, Length: 8.24 Inches, Weight: 1.00971715996 Pounds, Width: 0.425 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.24}, 'width': {'unit': 'inches', 'value': 0.425}, 'weight': {'unit': 'pounds', 'value': 1.00971715996}, 'height': {'unit': 'inches', 'value': 10.72}}, 'pages': 224, 'date_published': '2001', 'subjects': ['Business & Money', 'Job Hunting & Careers', 'Guides', 'Job Hunting', 'Management & Leadership', 'Decision-Making & Problem Solving', 'Education & Reference', 'Skills', 'Decision Making', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Susan M. Johnston'], 'title': 'The Career Adventure: Your Guide to Personal Assessment, Career Exploration, and Decision Making (3rd Edition)', 'isbn13': '9780130938336', 'msrp': 32, 'binding': 'Paperback', 'isbn': '0130938335', 'isbn10': '0130938335'}}