{'book': {'publisher': 'Prentice-Hall', 'synopsis': "Compiled by the editors of the award-winning Clackamas Literary Review, this anthology of twenty short stories and fifty poems gives readers the opportunity to read from a broad range of styles, perspectives, and generations spanning the last century. The anthology is not separated by genre, as are most literature anthologies available today (but rather loosely co-mingles poems and stories according to gradually developing themes); and places canonized writing, and some lesser known yet accomplished writing, together under the same cover. Includes Writer biographies. Features works by James Joyce, Alice Munro, Alice Walker, Gracey Paley, Tim O'Brien, Jamaica Kincaid, Bobbie Ann Mason, William Faulkner, Gabriel Garcia Márquez, John Cheever, Raymond Carver, Melissa Pritchard, Jorge Luis Borges, John Wolff, Ernest Hemingway, Anton Chekhov, Carolyn Forche, Flannery O'Connor, Mary Robinson, Gary Soto, Sharon Olds, Joy Hado, Rohert Hayden, Gary Thompson, Wiliam Stafford, Walt McDonald, Alberto Rios, Theodore Roethke, Marilynne Chin, Gary Snyder, Linda Hogan, Beckian Fritz Goldberg, Anne Sexton, Daisy Zamora, Lucille Clifton, Emily Dickinson, Stephen Dobyns, Octavio Paz, James Haggard, Lanston Hughes, Rita Dove, Carolyn Kizer, Naomi Shihab Nye, Donald Hall, Jimmy Santiago Boca, Maya Angelou, Claribe Alegria, Elizabeth Bishop, James Dickey, Richard Hugo, Denise Levertov, Mary Oliver, James Wright, Jim Harrison, Robert Frost. For anyone interested in Twentieth-Century short stories or poems or Creative Writing (fiction and poetry).", 'language': 'en', 'image': 'https://images.isbndb.com/covers/44/10/9780130274410.jpg', 'title_long': "A Writer's Country: A Collection of Fiction and Poetry", 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 5.75 Inches, Weight: 0.9 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 336, 'date_published': '2001', 'subjects': ['Arts & Photography', 'Literature & Fiction', 'Short Stories & Anthologies', 'Anthologies', 'Literary'], 'authors': ['Jeff Knorr', 'Tim Schell'], 'title': "A Writer's Country: A Collection of Fiction and Poetry", 'isbn13': '9780130274410', 'msrp': 86.65, 'binding': 'Paperback', 'isbn': '0130274410', 'isbn10': '0130274410'}}