{'book': {'publisher': 'Pearson College Div', 'synopsis': "Computer Confluence, Business Edition is the confluence of three information sources: an illustrated book, a multimedia CD-ROM, and an up-to-the-minute website. It goes beyond computer concepts and explores the promises and problems of information technology, how it affects businesses, how it affects people and society, and the future. Once again, George Beekman thoroughly integrates his book with an unparalleled media package. Includes updated and expanded coverage of hot topics and updated screens; the very latest Internet developments, including coverage of Cable Modems, satellite dishes, downloadable video and audio, an expanded Web authoring section emphasizing the evolving Web with defined roles of HTML, and JavaScript; increased Web publishing tools and in-depth hardware chapters; addresses the emergence of non-linear video editing, digital video interfaces via FireWire, MP3 music files, and multimedia Web publishing; total text, Web and CD integration; expanded coverage on ethics with a revised section, On-Line Issues: Reliability, Security, Privacy, and Humanity. Discusses new technologies like GPS, and includes new material on connectivity options and bandwidth. Newer examples and images reflect the rapidly-changing face of the Internet; and lively, often controversial, thought-provoking articles by many of today's writers and visionaries in technology, covering everything from privacy in financial records to software bugs and bombs. Ideal for readers interested in an introduction to computers and information technology.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/12/08/9780130921208.jpg', 'title_long': "Computer Confluence: Exploring Tomorrow's Technology : Business Edition", 'edition': 'Subsequent', 'dimensions': 'Height: 10.5 Inches, Length: 8.25 Inches, Weight: 2.85 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 2.85}, 'height': {'unit': 'inches', 'value': 10.5}}, 'pages': 578, 'date_published': '2001', 'subjects': ['Computers & Technology', 'Computer Science', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['George Beekman', 'Eugene J. Rathswohl'], 'title': "Computer Confluence: Exploring Tomorrow's Technology : Business Edition", 'isbn13': '9780130921208', 'msrp': 64, 'binding': 'Paperback', 'isbn': '0130921203', 'isbn10': '0130921203'}}