{'book': {'publisher': 'Pearson College Div', 'synopsis': 'From a diverse team of writers whose expertise spans law enforcement and cross-cultural relations, comes a book with comprehensive coverage of sensitive topics and issues related to diversity and multiculturalism facing police today and in the 21st century. It contains insightful as well as practical information and guidelines on how law enforcement professionals can work effectively with diverse cultural groups, both inside their organizations as well as in the community. Focusing on the cross-cultural and racial contact that police officers and civilian employees have with citizens, victims, suspects, and co-workers from diverse backgrounds, this book contains information on racial profiling, hate crimes, community-based policing, undocumented immigrants and immigrant women, urban dynamics, and gays and lesbians in law enforcement. For law enforcement managers, supervisors, officers, and instructors.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/40/91/9780130334091.jpg', 'title_long': 'Multicultural Law Enforcement: Strategies for Peacekeeping in a Diverse Society (2nd Edition)', 'edition': '2', 'dimensions': 'Height: 9.25 Inches, Length: 7 Inches, Weight: 2.20462262 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 2.20462262}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 455, 'date_published': '2001', 'subjects': ['Law', 'Criminal Law', 'Criminal Procedure', 'Politics & Social Sciences', 'Politics & Government', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Robert M. Shusta', 'Deena Levine', 'Philip Harris', 'Herb Wong'], 'title': 'Multicultural Law Enforcement: Strategies for Peacekeeping in a Diverse Society (2nd Edition)', 'isbn13': '9780130334091', 'msrp': 56, 'binding': 'Paperback', 'isbn': '013033409X', 'isbn10': '013033409X'}}