{'book': {'publisher': 'Prentice Hall', 'synopsis': "Most Solaris system administrators and power users rely on electronically published man pages as their command reference -- but these pages are written by a diverse, eclectic set of engineers, and rarely edited sufficiently to serve the needs a broad range of readers. The Solaris 8 System Administrator's Reference Guide gives every Solaris user fast access to all the information they need to get results quickly. The Solaris 8 System Administrator's Reference Guide starts with a convenient cross-reference and list of tasks that points users to all the related commands they may need to perform tasks such as printing, file system management, system status, editing, or shell programming. Next, it provides comprehensive descriptions, examples, and reference tables for nearly 400 Solaris commands. The Solaris 8 Reference Guide contains more than 1,300 pages of rock-solid information that's never been delivered with more clarity, or organized for greater accessibility. For every Solaris user, system administrator or programmer who needs a convenient, practical, well-organized reference to Solaris commands.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/70/15/9780130277015.jpg', 'title_long': "Solaris 8 : System Administrator's Reference", 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 7 Inches, Weight: 4.05 Pounds, Width: 2 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 2}, 'weight': {'unit': 'pounds', 'value': 4.05}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 1279, 'date_published': '2000', 'subjects': ['Computers & Technology', 'Operating Systems', 'Unix', 'Solaris', 'Windows', 'Software', 'Science & Math', 'Mathematics', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Janice Winsor'], 'title': "Solaris 8 : System Administrator's Reference", 'isbn13': '9780130277015', 'msrp': 74, 'binding': 'Paperback', 'isbn': '0130277010', 'isbn10': '0130277010'}}