{'book': {'publisher': 'Prentice Hall', 'synopsis': "This introduction to accounting and its significant role in making sound business decisions trains readers in becoming wise users, not necessarily preparers of accounting information—a strong user-based approach that's endorsed and supported by the AECC. The authors present accounting information in a broader business context—emphasizing what accounting information is, why it is important, and how it is used to make strategic economic decisions—but still include traditional debit/credit information as optional coverage. Discussions include Introduction To Business In The United States; Economic Decision Making; The Balance Initial Financing—Investment by Owners; The Balance Sheet (Continued): Additional Financing—Borrowing from Others; Income Statement and Statement of Owners' Equity; Keeping Bases of Economic Measurement; Accumulating Accounting Data; Challenging Issues Under Accrual Long-Lived Depreciable Assets; Challenging Issues Under Accrual Merchandise Inventory and Cost of Goods Sold; The Balance Sheet and Income A Closer Look; The Statement of Cash Bringing the Focus Back to Cash; Financial Statement Analysis; Management It's Environment and Future; Classifying Costs; Determining Costs of Products; Cost Behavior; Business Decisions Using Cost Behavior; Making Decisions Using Relevant Information; The Capital Evaluating Capital Expenditures; The Operating Budget; Standard Costing; and Evaluating Performance. For practicing office professionals, accounting clerks and paraprofessionals, and staff accountants.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/47/55/9780130654755.jpg', 'title_long': 'Introduction to Accounting: A User Perspective', 'edition': 'First Edition', 'dimensions': 'Height: 11.5 Inches, Length: 8.5 Inches, Weight: 5.01772108312 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.5}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 5.01772108312}, 'height': {'unit': 'inches', 'value': 11.5}}, 'pages': 1120, 'date_published': '2000-01-15', 'subjects': ['Business & Money', 'Accounting', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Kumen H. Jones', 'Michael L. Werner', 'Katherene P. Terrell', 'Robert L. Terrell'], 'title': 'Introduction to Accounting: A User Perspective', 'isbn13': '9780130654755', 'msrp': 93, 'binding': 'Hardcover', 'isbn': '0130654752', 'isbn10': '0130654752'}}