{'book': {'publisher': 'Prentice Hall', 'synopsis': 'Blending up-to-date theory with state-of-the-art applications, this book offers a comprehensive treatment of operating systems, with an emphasis on internals and design issues. It helps readers develop a solid understanding of the key structures and mechanisms of operating systems, the types of trade-offs and decisions involved in OS design, and the context within which the operating system functions (hardware, other system programs, application programs, interactive users). Process Description And Control. Threads, SMP, And Microkernels. Concurrency: Mutual Exclusion And Synchronization. Concurrency: Deadlock And Starvation. Memory Management. Virtual Memory. Uniprocessor Scheduling. Multiprocessor And Real-Time Scheduling. I/O Management And Disk Scheduling. File Management. Distributed Processing, Client/Server, And Clusters. Distributed Process Management. Security. For product development personnel (Programmers, Systems Engineers, Network Designers, and others involved in the design of data communications and networking products), Product marketing personnel, and Information system and computer system personnel.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/99/99/9780130319999.jpg', 'title_long': 'Operating Systems: Internals and Design Principles (4th Edition)', 'edition': '4', 'dimensions': 'Height: 9.75 Inches, Length: 7.5 Inches, Weight: 2.82853082146 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.5}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 2.82853082146}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 800, 'date_published': '2000-12-15', 'subjects': ['Computers & Technology', 'Operating Systems', 'Programming', 'APIs & Operating Environments', 'Software', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['William Stallings'], 'title': 'Operating Systems: Internals and Design Principles (4th Edition)', 'isbn13': '9780130319999', 'msrp': 100, 'binding': 'Hardcover', 'isbn': '0130319996', 'isbn10': '0130319996'}}