{'book': {'publisher': 'Prentice Hall', 'synopsis': "Product Description      Brief yet detailed, this book provides a thoughtful history of human civilizations while maintaining a balance between the Western world and the rest of global civilization. It covers the general intellectual and material history of human societies and cultures that have left some kind of written and/or archeological record behind. A four-part organization covers the coming of civilization, empires and cultures of the ancient world, consolidation and interaction of world civilizations, and the world in transition. For anyone trying to understand the historical experiences that have informed and shaped the world's cultures.      About the Author       Albert M. Craig is the Harvard-Yenching Professor of History at Harvard University, where he has taught since 1959. A graduate of Northwestern University, he took his Ph.D. at Harvard University. He has studied at Strasbourg University and at Kyoto, Keio, and Tokyo universities in Japan. He is the author of Choshu in the Meiji Restoration (1961), and, with others, of East Asia, Tradition and Transformation (1978). He is the editor of Japan, A Comparative View (1973) and co-editor of Personality in Japanese History (1970). At present he is engaged in research on the thought of Fukuzawa Yukichi. For eleven years (1976-1987) he was the director of the Harvard-Yenching Institute. He has also been a visiting professor at Kyoto and Tokyo Universities. He has received Guggenheim, Fulbright, and Japan Foundation Fellowships. In 1988 he was awarded the Order of the Rising Sun by the Japanese government.  William A. Graham is a Professor of the History of Religion and Islamic Studies, Chairman of the Near Eastern Languages and Civilizations, and Master of Currier House at Harvard University. From 1990-1996 he directed Harvard's Center for Middle Eastern Studies. He has taught for twenty-six years at Harvard, where he received the A.M. and Ph.D. degrees after graduating with an A.B. in comparative literature from the University of North Carolina at Chapel Hill. He also studied in Gottingen, Tubingen, and Lebanon. He is the author of Divine Word and Prophetic Word in Early Islam (1977); awarded the American Council of Learned Societies History of Religions book prize in 1978, and of Beyond the Written Word: Oral Aspects of Scripture in the History of Religion (1987). He has published a variety of articles in both Islamic studies and the general history of religion and is one of the editors of the forthcoming Encyclopedia of the Qur'an. He serves currently on the editorial board of several journals and has held John Simon Guggenheim and Alexander von Humboldt research fellowships.  Donald Kagan is Hillhouse Professor of History and Classics at Yale University, where he has taught since 1969. He received the A.B. degree in history from Brooklyn College, the M.A. in classics from Brown University, and the Ph.D. in history from Ohio State University. During 19581959 he studied at the American School of Classical Studies as a Fulbright Scholar. He has received four awards for undergraduate teaching at Cornell and Yale. He is the author of a history of Greek political thought, The Great Dialogue (1965); a four-volume history of the Peloponnesian War, The Origins of the Peloponnesian War (1969), The Archidamian War (1974), The Peace of Nicias and the Sicilian Expedition (1981), and The Fall of the Athenian Empire (1987); a biography of Pericles, Pericles of Athens and the Birth of Democracy (1991); and On the Origins of War (1995). With Brian Tierney and L. Pearce Williams, he is the editor of Great Issues in Western Civilization, a collection of readings.  Steven Ozment is McLean Professor of Ancient and Modern History at Harvard University. He has taught Western Civilization at Yale, Stanford, and Harvard. He is the author of nine books. The Age of Reform, 1250-1550 (1980) won the Schaff Prize and was nominated for the 1981 National Book Award. Four of his books: Magdalena", 'language': 'en', 'image': 'https://images.isbndb.com/covers/06/27/9780130340627.jpg', 'title_long': 'The Heritage of World Civilizations: Volume I, To 1650, Brief Edition', 'edition': 'Brief', 'dimensions': 'Height: 10.5 Inches, Length: 8.5 Inches, Width: 0.625 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.5}, 'width': {'unit': 'inches', 'value': 0.625}, 'height': {'unit': 'inches', 'value': 10.5}}, 'pages': 302, 'date_published': '2001', 'subjects': ['History', 'World', 'Civilization & Culture', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Albert M. Craig', 'William A. Graham', 'Donald M. Kagan', 'Steven Ozment', 'Frank M. Turner', 'Donald Kagan'], 'title': 'The Heritage of World Civilizations: Volume I, To 1650, Brief Edition', 'isbn13': '9780130340627', 'msrp': 61, 'binding': 'Paperback', 'isbn': '0130340626', 'isbn10': '0130340626'}}