{'book': {'publisher': 'Pearson College Div', 'synopsis': 'Written in an upbeat style by an author with substantial industry experience, this full-color book offers an enlightening overview of the many fascinating and challenging fields in the hospitality industry. Opens with a welcoming tour of the hospitality industry, and continues with full chapters on tourism, lodging, restaurants (with a new section on culinary arts), managed services, beverages, conventions and meeting, leisure/recreation, gaming entertainment, marketing and human resources, leadership and management. Offers a wealth of industry examples, real-world scenarios, and pertinent career information. Quotes experts in the hospitality field on which attributes and characteristics contributed most to their success—with thoughts from Wayne Calloway, former CEO of PepsiCo; Ray Kroc, founder of McDonalds; Isadore Sharp, president and CEO of Four Seasons Hotels and Resorts; John Martin, former president and CEO of Taco Bell Corporations, and others. Presents a real-world perspective throughout, with "Personal Profiles" that focus on the achievements and industry contributions of industry leaders, plus "A Day in the Life" vignettes that highlight selected key hospitality individuals, with real-life accounts of their activities. For professionals in hospitality, travel and tourism, and hotel and restaurant management.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/66/06/9780130336606.jpg', 'title_long': 'Introduction to Hospitality', 'edition': '3', 'dimensions': 'Height: 10 Inches, Length: 8 Inches, Weight: 2.91671572626 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 2.91671572626}, 'height': {'unit': 'inches', 'value': 10}}, 'pages': 600, 'date_published': '2001', 'subjects': ['Self-Help', 'Success', 'Business & Money', 'Job Hunting & Careers', 'Guides', 'Industries', 'Hospitality, Travel & Tourism', 'Travel', 'Food, Lodging & Transportation', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['John R. Walker'], 'title': 'Introduction to Hospitality', 'isbn13': '9780130336606', 'msrp': 101, 'binding': 'Hardcover', 'isbn': '0130336602', 'isbn10': '0130336602'}}