{'book': {'publisher': 'Prentice Hall', 'synopsis': 'Written by leading scholars in the field, this survey of Western Civilization presents a strong, clear narrative account of the central developments in Western history with a focus on several key themes--the development of political freedom and constitutional government; the shifting relations among religion, society, and the state; the development of science and technology and their impact on thought and social institutions; and the major religious and intellectual currents that have shaped Western culture. Covers Western civilization from the birth of civilization in the Paleolithic Age, to the Renaissance and voyages of discovery in the New Empire in the West. Highlight features include: Art and the West sections that highlight pieces of art and artists who were prominent during specific time periods; The West and World (series of illustrated essays that compares Western social or political institutions with those of non-Western cultures at particular times in history); primary source documents that offer a glimpse of the thoughts of historical figures as well as the words of ordinary people at a particular time in history; and Timelines of the political and social developments in specific historical periods. For anyone interested in Western Civilization and European History and Civilization.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/28/29/9780130272829.jpg', 'title_long': 'The Western Heritage, Volume A: To 1527 (7th Edition)', 'edition': '7th', 'dimensions': 'Height: 11 Inches, Length: 8.5 Inches, Weight: 1.9400679056 Pounds, Width: 0.625 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.5}, 'width': {'unit': 'inches', 'value': 0.625}, 'weight': {'unit': 'pounds', 'value': 1.9400679056}, 'height': {'unit': 'inches', 'value': 11}}, 'pages': 429, 'date_published': '2000-07-10', 'subjects': ['History', 'Americas', 'United States', 'World', 'Civilization & Culture', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Donald Kagan', 'Steven Ozment', 'Frank Turner'], 'title': 'The Western Heritage, Volume A: To 1527 (7th Edition)', 'isbn13': '9780130272829', 'msrp': 63, 'binding': 'Paperback', 'isbn': '0130272825', 'isbn10': '0130272825'}}