{'book': {'publisher': 'Pearson Technology Group', 'synopsis': "This start-to-finish guide to the new Solaris 8 certification exam is the only prep guide endorsed by Sun Educational Services! Focused entirely on Solaris 8, it's both an exceptionally authoritative study guide and an outstanding day-to-day reference for every sysadmin using (or planning an upgrade to) Solaris 8. The book begins by reviewing key Solaris system concepts, introducing processes, file systems, the kernel, Solaris user interfaces, and more. It contains detailed chapters on installation, the boot PROM, and initialization and shutdown; followed by comprehensive coverage of user administration. Coverage includes command syntax, shell commands and scripting, editing with vi, disks, files, backup/recovery, security, printing, and remote communications. Every chapter contains self-assessment questions that have been approved by the creators of the exam. For all Solaris system administrators seeking information and guidance on preparing for Sun's Solaris 8 certification exam. An especially valuable resource for administrators skipping Solaris 7 and migrating directly from Solaris 2.6 to Solaris 8.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/93/31/9780130409331.jpg', 'title_long': 'Sun Certified System Administrator for Solaris 8 Study Guide', 'edition': 'Study Guide', 'dimensions': 'Height: 9.25 Inches, Length: 7 Inches, Weight: 1.54984970186 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 1.54984970186}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 448, 'date_published': '2008-02-02', 'subjects': ['Computers & Technology', 'Certification', 'Operating Systems', 'Unix', 'Solaris', 'Software', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Peter H. Gregory'], 'title': 'Sun Certified System Administrator for Solaris 8 Study Guide', 'isbn13': '9780130409331', 'msrp': 39.99, 'binding': 'Paperback', 'isbn': '0130409332', 'isbn10': '0130409332'}}