{'book': {'publisher': 'Pearson P T R', 'synopsis': "Indonesia's remarkable economic and social achievements, amidst incredible cultural diversity and complexity, have motivated the World Bank to herald this sprawling archipelago of 200 million people as a model developing economy. Driven by an agenda of massive market reforms and deregulations, the government is undeniably committed to the country's sustainable global competitiveness in the 21st century. In Business Opportunities in Indonesia, the ninth volume in the Nanyang Business Report Series, the editors profile the vast business environment emerging within this newly awakened giant.<br/>This book is comprehensive, but practical, in focusing on new reforms spanning manufacturing and trade, foreign investment trends and bold initiatives in the financial, petroleum and banking sectors. Distribution, advertising and marketing issues are uniquely integrated across Indonesia's socio-cultural sensitivities together with the important area of dispute resolution.<br/>As an indispensable member of ASEAN, APEC and other regional economic partnerships, Indonesia is becoming a pillar of economic strength and competitive advantage. Business Opportunities in Indonesia is an essential reference for potential international investors and global entrepreneurs, professional and government agencies, researchers and students.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/08/31/9780130800831.jpg', 'title_long': 'Business Opportunities in Indonesia', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.10010668738 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 1.10010668738}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 408, 'date_published': '1998', 'subjects': ['Business & Money', 'International', 'Accounting'], 'authors': ['Meng', 'Tan Teck'], 'title': 'Business Opportunities in Indonesia', 'isbn13': '9780130800831', 'msrp': 29.95, 'binding': 'Paperback', 'isbn': '013080083X', 'isbn10': '013080083X'}}