{'book': {'publisher': 'Pearson College Div', 'synopsis': "9E-8, 0-13-080795-8, Kotler, Phil, Marketing for Hospitality and Tourism, Covers important principles and concepts that are supported by research and evidence from economics, the behavioral sciences, and modern management theory, and applies them through countless examples of situations in which real-life well-known and little-known companies assess and solve their marketing problems. The book covers: Service Characteristics of Hospitality And Tourism Marketing; The Role of Marketing in Strategic Planning; The Marketing Environment; Marketing Information Systems And Marketing Research; Consumer Markets and Consumer Buying Behavior; Organizational Buyer Behavior of Group Market; Market Segmentation, Targeting, and Positioning; Designing and Managing Products; Internal Marketing; Building Customer Satisfaction through Quality; Pricing Products: Pricing Considerations, Approaches, and Strategy; Distribution Channels; Promoting Products: Communication and Promotion Policy; Promoting Products: Advertising, Direct Marketing, and Sales Promotion; Promoting Products: Public Relations; Professional Sales; Destination Marketing; and Next Year's Marketing Plan. For anyone involved in Hospitality and Tourism", 'language': 'en', 'image': 'https://images.isbndb.com/covers/79/53/9780130807953.jpg', 'title_long': 'Marketing for Hospitality and Tourism (2nd Edition)', 'edition': 'Subsequent', 'dimensions': 'Height: 10.5 Inches, Length: 8.25 Inches, Weight: 3.56487477654 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.25}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 3.56487477654}, 'height': {'unit': 'inches', 'value': 10.5}}, 'pages': 816, 'date_published': '1998-07-27', 'subjects': ['Business & Money', 'Industries', 'Hospitality, Travel & Tourism', 'Marketing & Sales', 'Marketing', 'Travel', 'Food, Lodging & Transportation', 'Medical Books', 'Allied Health Professions', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Philip Kotler', 'John Bowen', 'James C. Makens'], 'title': 'Marketing for Hospitality and Tourism (2nd Edition)', 'isbn13': '9780130807953', 'msrp': 97, 'binding': 'Hardcover', 'isbn': '0130807958', 'isbn10': '0130807958'}}