{'book': {'publisher': 'Prentice Hall', 'synopsis': "Puts a human face on the study of Abnormal Psychology,    now with DSM-5 coverage throughout.       \xa0   Abnormal Psychology in a Changing World, 9/e uses first-person narratives from people struggling with psychological disorders as a pedagogical framework. Updated to reflect the revision of the Diagnostic and Statistical Manual (DSM-5), the authors endeavor to bring research developments and advancements in abnormal psychology to students. Through illustrative case examples drawn from the authors' own experiences, they recognize there is a human dimension to the study of abnormal psychology.      \xa0  The 9th edition includes coverage of the Diagnostic and Statistical Manual (DSM-5), with updated text references and examples throughout.      \xa0  MyPsychLab is an integral part of the Nevid / Rathus / Greene program. Key learning applications include MyPsychLab video series with new virtual case studies.  \xa0      Teaching & Learning Experience      This program will provide a better teaching and learning experience - for you and your students. Here's how:        Personalize Learning  - MyPsychLab is an online homework, tutorial, and assessment program. It helps students prepare for class and instructor gauge individual and class performance.      Explore Theory  — Integrating Theoretical Perspectives — The authors examine the many different theoretical perspectives that inform contemporary understanding of abnormal psychology and help students integrate these diverse viewpoints in the Tying it Togetherfeature.       Improve Critical Thinking  — Controversies in Abnormal Psychology— Spotlighting controversies encourages students to think critically about these important issues and examine different points of view. The Controversies in Abnormal Psychology feature includes several critical thinking questions that challenge students to think further about the issues discussed in the text.       Understand Diversity  — Integrating Diversity — The authors examine abnormal behavior patterns in relation to factors of diversity such as ethnicity, culture, gender, sexual orientation, and socioeconomic status. Students need to understand how issues of diversity affect the conceptualization of abnormal behavior as well as the diagnosis and treatment of psychological disorders.       Engage Students  — A Closer Look— Provides opportunities for further exploration of selected topics that reflect contemporary issues and concerns. Many of these enable students to apply information in the text to their own lives.       Support Instructors  — A full set of supplements, including MyPsychLab, provides instructors with all the resources and support they need.    This Book a la Carte Edition is an unbound, three-hole punched, loose-leaf version of the textbook and provides students the opportunity to personalized their book by incorporating their own notes and taking the portion of the book they need to class – all at a fraction of the bound book price.\xa0   \xa0", 'language': 'en', 'image': 'https://images.isbndb.com/covers/21/62/9780130052162.jpg', 'title_long': 'Abnormal Psychology', 'dimensions': 'Weight: 3.747858454 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 3.747858454}}, 'pages': 674, 'date_published': '1991', 'subjects': ['Health, Fitness & Dieting', 'Psychology & Counseling', 'Medical Books', 'Psychology', 'Mental Illness', 'Pathologies', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Spencer A. Rathus', 'Jeffrey S. Nevid'], 'title': 'Abnormal Psychology', 'isbn13': '9780130052162', 'msrp': 75.65, 'binding': 'Hardcover', 'isbn': '0130052167', 'isbn10': '0130052167'}}