{'book': {'publisher': 'Prentice Hall', 'synopsis': 'This informative, highly readable and comprehensive book offers a balanced, current and comprehensive overview of the legal system and administrative, criminal and civil law in cross-cultural context. The book considers the most recent theories and research findings, and emphasizes developing trends. It focuses on the evolution of modern legal systems, current intellectual movements in law, interplay between law and social change and the main concerns and issues in the profession and practice of law. This is the only book that considers multicultural and cross-cultural issues in a contemporary context with an interdisciplinary emphasis. Extensive new material includes detailed and up-to-date discussions on the transformation of legal systems in Central and Eastern Europe and the former Soviet Union and some of the unintended consequences which promoted organized crime; critical race theory; community policing in Japan; trends in sentencing guidelines; and a variety of new developments in alternative dispute resolution and in the death penalty controversy. For anyone with an interest in law and society.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/95/82/9780130979582.jpg', 'title_long': 'Law and Society (7th Edition)', 'edition': '7', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.5542589471 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.5542589471}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 452, 'date_published': '2002', 'subjects': ['Law', 'Legal Theory & Systems', 'Jurisprudence', 'Politics & Social Sciences', 'Sociology', 'Politics & Government', 'Political Science', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Steven Vago'], 'title': 'Law and Society (7th Edition)', 'isbn13': '9780130979582', 'msrp': 73.33, 'binding': 'Hardcover', 'isbn': '0130979589', 'isbn10': '0130979589'}}