{'book': {'publisher': 'Prentice Hall', 'synopsis': "With Visual Basic.NET, Microsoft transforms Visual Basic into a supercharged tool for developing next-generation Web services and Windows applications. Now, learn Visual Basic.NET hands-on, through thousands of lines of live code -- explained with exceptional clarity by the renowned programming trainers of Deitel & Associates! Visual Basic.NET How to Program starts by introducing the Visual Studio.NET development environment; then covers all key VB.NET programming fundamentals, from control structures to methods, arrays, and object-oriented programming. It delivers in-depth coverage of VB.NET GUI development; multithreading; graphics and multimedia; XML programming; database development with SQL and ADO.NET; building Web Forms and Web Services with ASP.NET; network programming; security; data structures; accessibility; and more. The book contains hundreds of real-world tips and techniques for writing high-quality code, improving performance and reliability, and efficient debugging. An accompanying CD-ROM contains all of the book's source code, up-to-date Visual Basic.NET development tools, plus links to the Web's best Visual Basic.NET demos and resources.For all beginning programmers -- and developers experienced with traditional languages -- who want to master Visual Basic.NET quickly.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/36/33/9780130293633.jpg', 'title_long': 'Visual Basic.NET How to Program, Second Edition', 'edition': 'Subsequent', 'dimensions': 'Height: 9.25 Inches, Length: 7 Inches, Weight: 4.3 Pounds, Width: 1.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 1.75}, 'weight': {'unit': 'pounds', 'value': 4.3}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 1517, 'date_published': '2001-12-11', 'subjects': ['Computers & Technology', 'Hardware & DIY', 'Personal Computers', 'Programming Languages', 'Visual Basic', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Harvey M. Deitel', 'Paul J. Deitel', 'Tem R. Nieto'], 'title': 'Visual Basic.NET How to Program, Second Edition', 'isbn13': '9780130293633', 'msrp': 106.47, 'binding': 'Paperback', 'isbn': '0130293636', 'isbn10': '0130293636'}}