{'book': {'publisher': 'Prentice Hall', 'synopsis': 'This introduction to the theories of personality introduces readers not only to the rich history of psychology but to practical information that helps them understand their own lives and their relationships with other people. Using a theorist-by-theorist approach, the book summarizes the major theories of personality and emphasizes that the best understanding of personality derives from a variety of viewpoints. Thus, theories representing the psychoanalytic, sociocultural, trait, learning, sociological, and existential-humanistic paradigms are offered as different\x97yet equally valid\x97ways of approaching the study of personality. Includes a series of experiential exercises. What Is Personality? Sigmund Freud. Carl Jung. Alfred Adler. Karen Horney. Erik H. Erikson. Gordon Allport. Raymond B. Cattell and Hans J. Eysenck. B. F. Skinner. John Dollard and Neal Miller. Albert Bandura and Walter Mischel. Edward O. Wilson. George Kelly. Carl Rogers. Abraham Maslow. Rollo Reese May. For anyone wanting a comprehensive understanding of personality and individual differences.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/22/60/9780130992260.jpg', 'title_long': 'An Introduction to Theories of Personality', 'edition': '6th', 'dimensions': 'Height: 9.52754 Inches, Length: 7.20471 Inches, Weight: 2.31926299624 Pounds, Width: 1.10236 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.20471}, 'width': {'unit': 'inches', 'value': 1.10236}, 'weight': {'unit': 'pounds', 'value': 2.31926299624}, 'height': {'unit': 'inches', 'value': 9.52754}}, 'pages': 614, 'date_published': '2003', 'subjects': ['Health, Fitness & Dieting', 'Mental Health', 'Science & Math', 'Technology', 'History of Technology'], 'authors': ['B. R. Hergenhahn'], 'title': 'An Introduction to Theories of Personality', 'isbn13': '9780130992260', 'msrp': 114.4, 'binding': 'Hardcover', 'isbn': '0130992267', 'isbn10': '0130992267'}}