{'book': {'publisher': 'Prentice Hall College Div', 'synopsis': "From the Back Cover      The Interim Edition  This interim edition of Places and Regions in Global Context was prompted by the consequences of the terrorist attacks on the World Trade Center in New York and the Pentagon in Washington, D.C. on September 11, 2001. These attacks not only changed the everyday worlds of many ordinary Americans, but also changed their views of the wider world. In addition, the attacks set into motion many other important changes, both in the United States and elsewhere. Studying human geography can help students understand many of the issues and changes surrounding these events. In this interim edition, Paul L. Knox and Sallie A. Marston have added material not only on the direct antecedents and consequences of the terrorist attacks, but also on the broader, related issues of globalization, Western materialism, religious fundamentalism, cultural identity, and geopolitics.Most often, students receive immediate feedback which they can e-mail directly to their instructors.       Product Description      The Updated Second Edition contains materials about recent world events triggered by the September 11th attacks on New York City and Washington D.C. Provides numerous topics, including Mapping Cultural Identities, Nature, Society, and Technology, The Politics of Territory and Space. The Updated Second Edition contains new materials that address the actual world events triggered by the attacks on the United States. For professionals in the field of geography.      Excerpt. © Reprinted by permission. All rights reserved.      A highly embroiled quarter, a network o f streets that 1 had avoided for years, was disentangled at a single stroke when one day a person dear to me moved there. It was as if a searchlight set up at this person's window dissected the area with pencils o f light  — Walter Benjamin, One-Way Street and Other Writings.  London: New Left Books, p. 85.  Most people have an understanding of what their own lives are like and some knowledge of their own areas—their neighborhood, their city, their country. Yet, even as the countries and regions of the world become more interconnected, most of us still know very little about the lives of people in other societies or about the ways in which the lives of those people connect to our own.  The quotation from Walter Benjamin's book reminds us that in order to understand places, they must first be made meaningful to us. This book provides an introduction to human geography that will make places and regions meaningful. To study human geography, to put it simply, is to study the dynamic and complex relationships between peoples and the worlds they inhabit. Our book gives students the basic geographical tools and concepts needed to understand the complexity of places and regions and to appreciate the interconnections between their own lives and those of people in different parts of the world. Objective and Approach The objective of the book is to introduce the study of human geography by providing not only a body of knowledge about the creation of places and regions but also an understanding of the interdependence of places and regions in a globalizing world. The approach is aimed at establishing an intellectual foundation that will enable a life-long and life-sustaining geographical imagination.  The book takes a fresh approach to human geography, reflecting the major changes that have recently been impressed on global, regional, and local landscapes. These changes include the globalization of industry, the breakup of the Soviet empire, the upwelling of ethnic regionalisms on the heels of decolonization and the formation of new states, the physical restructuring of cities, the transformation of traditional agricultural practices throughout much of the world, and the emerging trend toward transnational political and economic organizations. The approach used in Places and Regions in Global Context provides access not only to the new ideas, concepts, and ", 'language': 'en', 'image': 'https://images.isbndb.com/covers/03/18/9780130460318.jpg', 'title_long': 'Places and Regions in Global Context: Human Geography (2nd Edition)', 'edition': '2nd Updtd', 'dimensions': 'Height: 11.14171 Inches, Length: 8.54329 Inches, Weight: 3.13938261088 Pounds, Width: 0.90551 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.54329}, 'width': {'unit': 'inches', 'value': 0.90551}, 'weight': {'unit': 'pounds', 'value': 3.13938261088}, 'height': {'unit': 'inches', 'value': 11.14171}}, 'pages': 592, 'date_published': '2002-06-17', 'subjects': ['Politics & Social Sciences', 'Social Sciences', 'Human Geography', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Paul L. Knox'], 'title': 'Places and Regions in Global Context: Human Geography (2nd Edition)', 'isbn13': '9780130460318', 'msrp': 93, 'binding': 'Hardcover', 'isbn': '0130460311', 'isbn10': '0130460311'}}