{'book': {'publisher': 'Prentice Hall', 'synopsis': 'With 20 cases, this is a thorough revision of the only ID casebook available. The thirty-six richly-detailed, authentic cases are all written by practicing instructional designers?and have been carefully chosen to provide enough depth to develop competence. Alphabetical arrangement by instructional designer hides case ?problem? behind the anonymity of the designer, keeps the case titles from alerting learners to the issues involved, and challenges them to identify and define the challenge on their own. A thoughtful introduction to the book written by the editors speaks to the readers directly and takes them, step-by-step, through the case study method?explaining the study of cases in supportive, accessible language that will allay any fears of users unfamiliar with this type of learning. By giving readers opportunities to encounter many different challenges in a variety of settings (corporate, K-12, higher education) involving a range of issues and subjects, these cases effectively bridge the gulf between the complexities of the design world and the principles taught in ID courses. For future instructional designers.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/32/17/9780130943217.jpg', 'title_long': 'The ID Casebook: Case Studies in Instructional Design (2nd Edition)', 'edition': '2', 'dimensions': 'Height: 8.75 Inches, Length: 7.25 Inches, Weight: 0.9 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.25}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 8.75}}, 'pages': 256, 'date_published': '2002-08-17', 'subjects': ['Education & Teaching', 'Schools & Teaching', 'Instruction Methods', 'Curriculum & Lesson Plans', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Peggy A. Ertmer', 'James Quinn'], 'title': 'The ID Casebook: Case Studies in Instructional Design (2nd Edition)', 'isbn13': '9780130943217', 'msrp': 42.67, 'binding': 'Paperback', 'isbn': '0130943215', 'isbn10': '0130943215'}}