{'book': {'publisher': 'Pearson College Div', 'synopsis': 'This concise edition provides a sympathetic approach to what is living and significant in the religions of the modern world. Highly readable and stimulating, this brief survey explores the historical development and teachings of traditional faiths, indigenous religions and new religious movements, and considers how each of these has evolved into contemporary beliefs and practices. Unlike other world religion texts, Living Religions: A Brief Introduction attempts to see each religion from the inside as its own practitioners experience and live by their faith. Each chapter focuses on a different religion, looking first at its historical development and teachings, and then exploring how these traditions have evolved into contemporary beliefs and practices. Also included are first-person interviews with followers of each faith; Religion in Public Life boxes, including boxes on Winona LaDuke, Dr. Karan Singh, Dalai Lama, Janice Perlman, Desmond Tutu, Farid Esack and Baba Virsa Singh; enhanced coverage of women, with new sections on women in the chapters on Buddhism, Judaism and Christianity; and coverage of the religions of Eastern Europe plus the contemporary condition of religions in the former Soviet Union.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/80/92/9780130618092.jpg', 'title_long': 'Living Religions: A Brief Introduction', 'dimensions': 'Height: 9.25 Inches, Length: 6 Inches, Weight: 1.30954583628 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 1.30954583628}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 319, 'date_published': '2001', 'subjects': ['Religion & Spirituality', 'Religious Studies', 'Education', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Mary Pat Fisher'], 'title': 'Living Religions: A Brief Introduction', 'isbn13': '9780130618092', 'msrp': 45.6, 'binding': 'Paperback', 'isbn': '0130618098', 'isbn10': '0130618098'}}