{'book': {'publisher': 'Prentice Hall', 'synopsis': 'Written in a compelling manner and loaded with real-world applications, this condensed version of Wade and Tavris\' bestseller Psychology maintains its focus on critical thinking, attention to gender and multicultural issues, and commitment to the debates of psychology, and offers the support of companion websites that include test questions, web connections, message board, seven chapter corresponding premium site modules, web news, web survey, interactive lectures, guided reviews, and much more. Covers five major areas\x97yourself, your body, your mind, your environment, your mental health, and your life. Includes full chapters on the science of psychology; the theories of personality; development over the life span; neurons, hormones and the brain; sensation and perception; thinking and intelligence; memory; learning; behavior in social and cultural context; psychological disorders; approaches to treatment and therapy; emotion, stress, and health; and the major motives of life: love, sex, food, and work. For psychologists, psychotherapists, and readers interested in exploring the inner workings of the human mind. @BULLET = Features chapter-opening vignettes based on real newspaper stories, "Get Involved" hands-on application exercises and demonstrations; end-of-chapter "Taking Psychology With You" sections that draw on research in the chapter end-of-chapter sections\x97Draws on research in the chapter. @SUBBULLET = Helps students tackle topics of practical concern. Ex.___ @BULLET = "Quick Quizzes"\x97After each major section of the text. @SUBBULLET = Actively tests students\' comprehension. Ex.___ @CONTENTSBEG =', 'language': 'en', 'image': 'https://images.isbndb.com/covers/81/74/9780130338174.jpg', 'title_long': 'Invitation to Psychology, Second Edition (Book & Video Classics CD)', 'edition': '2nd', 'dimensions': 'Height: 10.25 Inches, Length: 8.75 Inches, Weight: 2.69845808688 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.75}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 2.69845808688}, 'height': {'unit': 'inches', 'value': 10.25}}, 'pages': 551, 'date_published': '2001-05', 'subjects': ['Health, Fitness & Dieting', 'Psychology & Counseling', 'Medical Books', 'Psychology', 'General', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Carole Wade', 'Carol Tavris'], 'title': 'Invitation to Psychology, Second Edition (Book & Video Classics CD)', 'isbn13': '9780130338174', 'msrp': 79.8, 'binding': 'Paperback', 'isbn': '0130338176', 'isbn10': '0130338176'}}