{'book': {'publisher': 'Prentice Hall', 'synopsis': "The 2014 GAAP Handbook of Policies and Procedures is the most complete and user-friendly source of on-the-job help for applying generally accepted accounting principles in practice. It provides guidance in resolving any issues and problems that the accountant may face day-to-day in applying GAAP. The GAAP Handbook provides many rules of thumb. Its content includes informative rules, policies, and procedures applicable to CPAs and may be used as a training medium. This practical reference contains all of the important authoritative pronouncements on GAAP with references to ASC codification, and the corresponding references to the original literature, including APB Opinions, Accounting Research Bulletins, FASB Statements, Staff Positions, Interpretations, Technical Bulletins, and Concepts, as well as AICPA Statements of Position as an aid. Securities and Exchange Financial Reporting Releases and EITF Issues are also covered when appropriate. This volume contains accounting principles, financial reporting presentation requirements, required and recommended disclosures, and specialized accounting topics. The book includes examples, tables, exhibits, and practice aids that demonstrate how to apply GAAP in practice. In some cases, flowcharts are presented to explain, in clearer terms, the practitioner's decision process in applying a pronouncement. Current footnotes from annual reports provide clear examples of reporting. The book also comes with a free companion CD-ROM that contains an electronic version of the book. Subscribers can also earn online CPE credits through the CCH Learning Center (see the book's Highlights pages for more information).", 'language': 'en', 'image': 'https://images.isbndb.com/covers/48/99/9780130444899.jpg', 'title_long': 'GAAP handbook of policies and procedures, 2002', 'edition': '1', 'pages': 1160, 'date_published': '2002', 'authors': ['Joel G. Siegel'], 'title': 'GAAP handbook of policies and procedures, 2002', 'isbn13': '9780130444899', 'msrp': 25, 'binding': 'Paperback', 'isbn': '0130444898', 'isbn10': '0130444898'}}