{'book': {'publisher': 'Pearson Education Canada', 'synopsis': 'Geared for an Introduction to Business course. This best-selling text continues to present a briefer, no-nonsense approach to the fundamentals of business which spans the range of all functional areas - management, marketing, operations, accounting, information systems, finance, and legal studies. *New organization: Streamlines content into 16 chapters divided into 6 parts with 2 appendices. *Crafting Your Business Plan Exercises: Chapter-ending exercises apply chapter material to the task of developing a business plan. Students are encouraged first to examine sample plans and then to personalize their own plans using the Windows-based Business Plan Pro software. *PHLIP/CW companion website: Includes an Interactive Study Guide, Current Events Articles with discussion questions, Student Study Hall, Career Center, Writing Center, Research Center, and Ask the Tutor. *Two Part-Opening Chapter Case Vignettes: Open and close each chapter. The chapter-opening vignette introduces a current real-world business situation involving the content and issues that follow in the chapter. The chapter-closing vignette tells the rest of the story, poses questions for discussion, and leads into the cha', 'language': 'en', 'image': 'https://images.isbndb.com/covers/26/43/9780130432643.jpg', 'title_long': 'Business Essentials, Third Canadian Edition', 'edition': '3', 'dimensions': 'Weight: 2.20462262 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 2.20462262}}, 'pages': 512, 'date_published': '2002', 'subjects': ['Business & Money', 'Management & Leadership', 'Management', 'Management Science', 'Education & Reference', 'Business Development & Entrepreneurship', 'Entrepreneurship'], 'authors': ['Ronald J. Ebert', 'Ricky W. Griffin', 'Frederick A. Starke'], 'title': 'Business Essentials, Third Canadian Edition', 'isbn13': '9780130432643', 'msrp': 1.99, 'binding': 'Paperback', 'isbn': '0130432644', 'isbn10': '0130432644'}}