{'book': {'publisher': 'Pearson College Div', 'synopsis': 'Written by leading scholars in the field, this survey of Western Civilization presents a strong, clear narrative account of the central developments in Western history with a focus on several key themes--the development of political freedom and constitutional government; the shifting relations among religion, society, and the state; the development of science and technology and their impact on thought and social institutions; and the major religious and intellectual currents that have shaped Western culture. Covers Western civilization from the French Revolution to the collapse of European Communism and beyond. Highlight features include: Art and the West sections that highlight pieces of art and artists who were prominent during specific time periods; The West and World (series of illustrated essays that compares Western social or political institutions with those of non- Western cultures at particular times in history); primary source documents that offer a glimpse of the thoughts of historical figures as well as the words of ordinary people at a particular time in history; and Timelines of the political and social developments in specific historical periods. For anyone interested in Western Civilization and European History and Civilization.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/28/50/9780130272850.jpg', 'title_long': 'The Western Heritage, Volume C: Since 1789 (7th Edition)', 'edition': '7', 'dimensions': 'Height: 11.25 Inches, Length: 8.75 Inches, Weight: 2.20462262 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.75}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 2.20462262}, 'height': {'unit': 'inches', 'value': 11.25}}, 'pages': 578, 'date_published': '2000-07-10', 'subjects': ['History', 'World', 'Civilization & Culture', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Donald Kagan', 'Steven E. Ozment', 'Frank Turner'], 'title': 'The Western Heritage, Volume C: Since 1789 (7th Edition)', 'isbn13': '9780130272850', 'msrp': 67, 'binding': 'Paperback', 'isbn': '013027285X', 'isbn10': '013027285X'}}