{'book': {'publisher': 'Prentice Hall', 'synopsis': "Rich with special feature sections and boxes, this broad, theoretically balanced introduction to contemporary social problems provides readers with a thorough understanding of major social problems facing the United States\x97their causes, consequences, likely future course, and what can be done about them. It provides the basic data and the sociological frameworks for interpreting those data. Features Social Maps and a variety of boxes: Technology and Social Problems; A Global Glimpse; Divided Society; Thinking Critically About Social Problems; and Issues in Social Problems. Covers a full range of social problems and how sociologists view and interpret them: Aging; Prostitution, Homosexuality, and Pornography; Alcohol and Other Drugs; Rape and Murder; Crime and Criminal Justice; Wealth and Poverty; Race and Ethnic Relations; Sex Discrimination; Problems of Physical and Mental Illness; Education; The Changing Family; Urban Problems; Population and Food; The Environmental Crisis; and War, Terrorism, and the Balance of Power. For anyone interested in acquiring a solid foundation in the kinds, causes, consequences, and solutions to a broad range of some of today's most pressing social problems.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/08/49/9780130960849.jpg', 'title_long': 'Social Problems (5th Edition)', 'edition': 'Subsequent', 'dimensions': 'Height: 10.5 Inches, Length: 8.5 Inches, Weight: 2.98285440486 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.5}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 2.98285440486}, 'height': {'unit': 'inches', 'value': 10.5}}, 'pages': 614, 'date_published': '1999', 'subjects': ['Politics & Social Sciences', 'Social Sciences', 'Sociology', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['James M. Henslin'], 'title': 'Social Problems (5th Edition)', 'isbn13': '9780130960849', 'msrp': 88, 'binding': 'Hardcover', 'isbn': '0130960845', 'isbn10': '0130960845'}}