{'book': {'publisher': 'Allyn & Bacon', 'synopsis': 'Substantive\x97yet accessible\x97this overview of police-community relations focuses on the importance of, and strategies for, positive interaction in dealing with the many turbulent issues which affect crime control in America today. The book addresses a challenge that all criminal justice practitioners\x97police, courts, and corrections\x97must confront...the development and maintenance of meaningful relationships with one another and with the citizens they serve. Topics include police-community relations\x97an overview; public relations and community relations\x97a contrast; community policing; the public and the police\x97a consortium of communities; relations within the police organization; police role concept in a changing society; coping with the human experience of being a cop; the communication process; police discretion and community relations; the media link; special populations and the police; community relations in the context of culture; the dilemmas of dissent and political response; conflict management; and community control\x97a continuum of participation. For police, court, corrections, and other criminal justice professionals.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/99/79/9780130209979.jpg', 'title_long': 'Police-Community Relations and the Administration of Justice (5th Edition)', 'edition': '5', 'dimensions': 'Height: 9.75 Inches, Length: 1 Inches, Weight: 1.64905771976 Pounds, Width: 7.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 1}, 'width': {'unit': 'inches', 'value': 7.25}, 'weight': {'unit': 'pounds', 'value': 1.64905771976}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 402, 'date_published': '1999-08-09', 'subjects': ['Politics & Social Sciences', 'Social Sciences'], 'authors': ['Ronald D. Hunter', 'Pamela D. Mayhall', 'Thomas Barker'], 'title': 'Police-Community Relations and the Administration of Justice (5th Edition)', 'isbn13': '9780130209979', 'msrp': 1.99, 'binding': 'Hardcover', 'isbn': '013020997X', 'isbn10': '013020997X'}}