{'book': {'publisher': 'Prentice Hall Direct', 'synopsis': "For all entrepreneurs and nonfinancial professionals with budget and/or P&L responsibilities, Finance and Accounting for Nonfinancial Managers provides the basics necessary to make a solid contribution to the financial goals and success of their companies. This indispensible and easy-to-read primer gives all entrepreneurs and managers in nonfinancial areas--sales, marketing, production, and more--a complete understanding of financial terms, statements, and ratios and how they affect the operations of a business or corporation. With this information, financial managers will be able to understand: owners' equity, ratio analysis; balance sheets; income statements; LIFO liquidations; asset valuation; cash flow statements; capital leasing; liabilities; present value; operating leverage; breakeven analysis; and more. New to the third edition are chapters covering: basic tax concepts; capital structure; business plans; working capital management and banking relationships; personal finances; and accountability and controls. This edition also comes with a CD-ROM with interactive Excel templates that lets managers immediately apply the concepts and techniques covered. Topics covered include: 1. An introduction to financial management 2. A primer on taxes 3. Accounting concepts 4. An introduction to key financial statements 5. The role of the outside auditor 6. Valuation of assets and equity 7. Recording financial information 8. Reporting financial information 9. Business plans 10. Capital structure--long-term debt and equity financing 11. Leverage 12. Strategic planning and budgeting 13. Investment analysis 14. Lease or buy? A taxing question 15. Depreciation: Having your cake and eating it too! 16. Working capital management and banking relationships 17. Inventory costing 18. Cost accounting 19. Accountability and internal control 19. A closer look at financial statements 21. Notes to the financial statements 22. Ratio analysis 23. Personal finance", 'language': 'en', 'image': 'https://images.isbndb.com/covers/71/07/9780131577107.jpg', 'title_long': 'Finance & Accounting for Nonfinancial Managers', 'edition': 'Rev&Expdd', 'dimensions': 'Height: 8.25 Inches, Length: 1 Inches, Weight: 0.89066753848 Pounds, Width: 5.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 1}, 'width': {'unit': 'inches', 'value': 5.75}, 'weight': {'unit': 'pounds', 'value': 0.89066753848}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 274, 'date_published': '1992', 'subjects': ['Business & Money', 'Economics', 'Finance', 'Management & Leadership'], 'authors': ['Steven A. Finkler'], 'title': 'Finance & Accounting for Nonfinancial Managers', 'isbn13': '9780131577107', 'msrp': 16.95, 'binding': 'Paperback', 'isbn': '0131577107', 'isbn10': '0131577107'}}