{'book': {'publisher': 'Prentice Hall Direct', 'synopsis': 'Loaded with the expert insight, wry humor, and candid accounts of what really goes on behind the scenes of the mind-boggling megadeals, acquisitions, and "friendly" mergers, A Not-So-Tender Offer chronicles important megamergers, and assesses the impact they have had on corporate performance, the economy, and the millions of employees and shareholders affected by the upheavals.<br/>Written by Isadore Barmash, an acclaimed writer on the Wall Street scene, this savvy insider\'s guide gives you a seat at the bargaining table for an upclose look at the often dramatic, sometimes humorous, stories behind the blockbuster headlines.<br/>Barmash takes all of the fascinating tales and puts the big picture in sharp relief, revealing the trends behind the events. With savvy analysis and a straightforward style, he illustrates the decline of junk bonds and the leveraged buyout, the move away from massive conglomerates of unrelated businesses and toward "strategic mergers," the relentless "downsizing" of U.S. corporations and its far-reaching effects on the workforce, the growth of "mini-deals," and much more. Most important, this timely book makes a persuasive case for a return to common sense on the merger and acquisitions scene, before another unchecked escalation in the eat-or-be-eaten merger wars wreaks havoc on the business landscape once again.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/31/29/9780131823129.jpg', 'title_long': "A Not-So-Tender Offer: An Insider's Look at Mergers and Their Consequences", 'dimensions': 'Height: 9.25 Inches, Length: 6.5 Inches, Weight: 1.28088574222 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.28088574222}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 238, 'date_published': '1995', 'subjects': ['Business & Money', 'Economics', 'Development & Growth', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Isadore Barmash'], 'title': "A Not-So-Tender Offer: An Insider's Look at Mergers and Their Consequences", 'isbn13': '9780131823129', 'msrp': 19.95, 'binding': 'Hardcover', 'isbn': '0131823124', 'isbn10': '0131823124'}}