{'book': {'publisher': 'Ft Pr', 'synopsis': 'Today\x92s best companies get it. From Costco® to Commerce Bank, Wegmans to Whole Foods®: they\x92re becoming the ultimate value creators. They\x92re generatingevery form of value that matters: emotional, experiential, social, and financial. And they\x92re doing it forall their stakeholders. Not because it\x92s \x93politically correct\x94: because it\x92s the only path to long-term competitive advantage.<br/>These are the Firms of Endearment. Companies people love doing business with. Love partnering with. Love working for.Love investing in. Companies for whom \x93loyalty\x94 isn\x92t just real: it\x92s palpable, and driving unbeatable advantages in everything from marketing to recruitment.<br/>You need to become one of those companies. This book will show you how. You\x92ll find specific, practical guidance on transforming every relationship you have: with customers, associates, partners, investors, and society. If you want to be great\x97truly great\x97this is your blueprint.<br/><br/>We\x92re entering an Age of Transcendence, as people increasingly search for higher meaning in their lives, not just more possessions. This is transforming the marketplace, the workplace, the very soul of capitalism. Increasingly, today\x92s most successful companies are bringing love, joy, authenticity, empathy, and soulfulness into their businesses: they are delivering emotional, experiential, and social value\x96not just profits.<br/>Firms of Endearment illuminates this, the most fundamental transformation in capitalism since Adam Smith. It\x92s not about \x93corporate social responsibility\x94: it\x92s about building companies that can sustain success in a radically new era. It\x92s about great companies like IDEO and IKEA®, Commerce Bank and Costco®, Wegmans and Whole Foods®: how they earn the powerful loyalty and affection that enables truly breathtaking performance.<br/><br/>This book is about gaining \x93share of heart,\x94 not just share of wallet. It\x92s about aligning stakeholders\x92 interests, not just juggling them. It\x92s about building companies that leave the world a better place. Most of all, it\x92s about why you must do all this, or risk being left in the dust... and how to get there from wherever you are now.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/37/28/9780131873728.jpg', 'title_long': 'Firms of Endearment: How World-Class Companies Profit from Passion and Purpose', 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 6.5 Inches, Weight: 1.15 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.15}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 284, 'date_published': '2007', 'subjects': ['Business & Money', 'Economics', 'Sustainable Development', 'Human Resources', 'Human Resources & Personnel Management', 'Self Service', 'Custom Stores'], 'authors': ['Rajendra S. Sisodia', 'David B. Wolfe', 'Jagdish N. Sheth'], 'title': 'Firms of Endearment: How World-Class Companies Profit from Passion and Purpose', 'isbn13': '9780131873728', 'msrp': 43.99, 'binding': 'Hardcover', 'related': {'ePub': '0132716178'}, 'isbn': '0131873725', 'isbn10': '0131873725', 'other_isbns': [{'isbn': '9780132716178', 'binding': 'print'}]}}