{'book': {'publisher': 'Pearson P T R', 'synopsis': 'To succeed, leaders must understand and apply the core principles of leadership--but that\x92s not enough. You need to shape your approach for any unique situation. Too many leaders don\x92t know how to do that--and that\x92s why they fail. Ultimate Leadership shows how to adapt the principles of leadership to different challenges, contexts, and organizations.<br/><br/>Russell E. Palmer--who has had three very different, highly successful careers as head of one of the world\x92s largest accounting firms, Dean of the Wharton School, and an entrepreneur--helps you identify the leadership model most appropriate for your environment, and how to lead accordingly. You\x92ll learn better ways to lead your equals, help an organization weather crises, transform its culture, lead entrepreneurial organizations, lead global organizations...even lead non-profit and academic institutions.<br/><br/>Then, drawing on interviews with an extraordinary spectrum of outstanding leaders, Palmer helps you master the attribute every leader must have: the ability to inspire your unique organization, even in the face of the most daunting challenges.<br/><br/>\x95 Achieving empowerment, even in classic "top-down" organizations<br/>Exercising strong authority without falling victim to ego or closed-mindedness<br/><br/>\x95 Transforming an organization of peers<br/>Driving changes in a strategic direction when key power centers disagree<br/><br/>\x95 Turning danger into opportunity<br/>Mastering the art of rapid, focused, hands-on execution for organizations in crisis<br/><br/>\x95 Leading cultural change that sticks<br/>Reconnecting structures, processes, and strategies with the new realities you face<br/><br/>\x95 Learning from the Wharton experience<br/>Succeeding in an environment with widely diverse, highly influential stakeholders', 'language': 'en', 'image': 'https://images.isbndb.com/covers/38/66/9780131933866.jpg', 'title_long': 'Ultimate Leadership: Winning Execution Strategies for Your Situation', 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 0.98987555638 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.98987555638}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 225, 'date_published': '2008', 'subjects': ['Business & Money', 'Management & Leadership', 'Decision-Making & Problem Solving', 'Leadership & Motivation', 'Systems & Planning', 'Skills', 'Decision Making'], 'authors': ['Russell E. Palmer'], 'title': 'Ultimate Leadership: Winning Execution Strategies for Your Situation', 'isbn13': '9780131933866', 'msrp': 25.99, 'binding': 'Hardcover', 'isbn': '0131933868', 'isbn10': '0131933868', 'other_isbns': [{'isbn': '9780132716437', 'binding': 'print'}]}}