{'book': {'publisher': 'Pi Press', 'synopsis': 'Physics textbooks identify Thomas Young (1773-1829) as the experimenter who first proved that light is a wave--not a stream of corpuscles as Newton proclaimed. In any book on the eye and vision, Young is the London physician who showed how the eye focuses and proposed the three-color theory of vision confirmed only in 1959. In any book on ancient Egypt, Young is credited for his crucial detective work in deciphering the Rosetta Stone. It is hard to grasp how much he knew.<br/>Invited to contribute to a new edition of the Encyclopedia Britannica, Young offered the following subjects: Alphabet, Annuities, Attraction, Capillary Action, Cohesion, Colour, Dew, Egypt, Eye, Focus, Friction, Halo, Hieroglyphic, Hydraulics, Motion, Resistance, Ship, Sound, Strength, Tides, Waves, and anything of a medical nature. He asked that all his contributions be kept anonymous.<br/>While not yet thirty he gave a course of lectures at the Royal Institution covering virtually all of known science. But polymathy made him unpopular in the academy. An early attack on his wave theory of light was so scathing that English physicists buried it for nearly two decades until it was rediscovered in France. But slowly, after his death, great scientists recognized his genius.<br/>Today, in an age of professional specialization unimaginable in 1800, polymathy still disturbs us. Is this kind of curiosity selfish, even irresponsible? Here is the story of a driven yet modest hero, the last man who knew everything.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/30/47/9780131343047.jpg', 'title_long': 'The Last Man Who Knew Everything: Thomas Young, The Anonymous Polymath Who Proved Newton Wrong, Explained How We See, Cured the Sick, and Deciphered the Rosetta Stone, Among Other Feats of Genius', 'edition': 'First Edition', 'dimensions': 'Height: 9.5 Inches, Length: 6.25 Inches, Weight: 1.4 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.4}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 304, 'date_published': '2005-12-07', 'subjects': ['Biographies & Memoirs', 'Professionals & Academics', 'Scientists', 'Science & Math', 'Technology', 'History of Technology'], 'authors': ['Andrew Robinson'], 'title': 'The Last Man Who Knew Everything: Thomas Young, The Anonymous Polymath Who Proved Newton Wrong, Explained How We See, Cured the Sick, and Deciphered the Rosetta Stone, Among Other Feats of Genius', 'isbn13': '9780131343047', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0131343041', 'isbn10': '0131343041'}}