{'book': {'publisher': 'Ft Pr', 'synopsis': 'Everywhere, products are being commoditized, services are being imitated, and traditional barriers to market entry are collapsing. To sustain competitive advantage in today\'s Copycat Economy, companies must break from the pack. This book will show how. Oren Harari starts by touring "Commodity Hell," and identifying 10 common mistakes that keep companies trapped in the pack. Next, Harari introduces six strategies for propelling your organization where competitors can\'t follow. Learn how to dominate markets (and when to leave them); how to create a "higher cause" that will mobilize stakeholders; and how to build a pipeline of cool, compelling products, in any industry. Harari reveals new ways to take customers far beyond mere "satisfaction," and shows how to innovate in even the most prosaic areas of a business. Learn how to avoid destructive mergers, and buy what really matters: talent, imagination, foresight, speed, rebelliousness, and inspiration. Finally, Harari offers a candid "12 Step" program for transforming leadership behavior to lead the charge -- and leave competitors in the dust.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/86/30/9780131888630.jpg', 'title_long': 'Break from the Pack: How to Compete in a Copycat Economy', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.2 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.2}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 299, 'date_published': '2006', 'subjects': ['Business & Money', 'Management & Leadership', 'Leadership & Motivation', 'Systems & Planning', 'Processes & Infrastructure', 'Strategic Planning'], 'authors': ['Oren Harari'], 'title': 'Break from the Pack: How to Compete in a Copycat Economy', 'isbn13': '9780131888630', 'msrp': 32.99, 'binding': 'Hardcover', 'related': {'ePub': '0132703823'}, 'isbn': '0131888633', 'isbn10': '0131888633', 'other_isbns': [{'isbn': '9780132703826', 'binding': 'print'}]}}