{'book': {'publisher': 'Prentice Hall Direct', 'synopsis': 'Caught in the Middle provides a wealth of practical guidance and 12 key strategies to help middle managers take charge of their careers, maximize their contributions to their organizations, and gain satisfaction from their work.<br/>In recent years, the role of middle managers in our organizations has been dramatically and permanently altered. You\'ll learn why the middle management success formulas of the past won\'t work in today\'s "leaner and meaner" organizational structures. You\'ll also learn how to develop the concrete skills needed to meet the changing demands, expectations and pressures that middle managers now face.<br/>Here\'s just a sample of what this comprehensive guide contains: Key strategies you can use to market yourself as "Me, Inc!" to enhance your visibility and credibility among those who can influence your success; proven tactics to help you create a long-term vision for the company area you control, increase productivity and morale, and achieve impressive results; 8 important ways to make office politics work for you - not against you; 11 simple techniques that will help you expand your own power base and make yourself indispensable to the company; time-proven ideas for forging strategic alliances with upper management and becoming a master teacher and role model for your staff and much more!<br/>Also included are actual case histories of middle managers who have experienced both the struggles and opportunities of playing in the middle...a look at why senior executives become frustrated with middle managers (and vice versa)... PLUS guidelines and quizzes that help you decide whether you have what it takes to "go it alone."', 'language': 'en', 'image': 'https://images.isbndb.com/covers/22/99/9780131212299.jpg', 'title_long': 'Caught in the Middle', 'dimensions': 'Height: 8.75 Inches, Length: 6 Inches, Weight: 1.23017942196 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 1.23017942196}, 'height': {'unit': 'inches', 'value': 8.75}}, 'pages': 299, 'date_published': '1992', 'subjects': ['Business & Money', 'Economics', 'Economic History', 'Management & Leadership', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Lynda C. McDermott'], 'title': 'Caught in the Middle', 'isbn13': '9780131212299', 'msrp': 21.95, 'binding': 'Hardcover', 'isbn': '013121229X', 'isbn10': '013121229X'}}