{'book': {'publisher': 'Prentice Hall', 'synopsis': 'JOHN C. CALHOUN American Portrait BY MARGARET L. COFT THE UNION, NEXT TO OUR LIBERTY, MOST DEAR. Illujtratttt ftfeettfibe Cambrtoge HOIKJI1TON MIFFLIN COMPANY BOSTON COPYRXCHT, 19 SO, BY MARGARET L, CO IT ALL RIGHTS RESERVED INCLUDING TIIK RIGHT TO REPRODUCE THIS BOOK OR PARTS THEREOF IN ANY FORM CAM0RCDOX IN TH Aifnii-K AS StmiTAMY r Frtim llu jHirtraif hv Jtrfm VV Ji. y Jarvis in ihr of the Army, lnnnm f U. t. MITT IN OTHER AlSri Acknowledgments FIRST, I want to express my gratitude to my editors at Houghton Mifflin Company, Paul Brooks, Dorothy de Santillana, Craig Wylie, and Esther Forbes, who with infinite patience and understanding have worked with me on this book through the years. Special thanks are also due Arthur M. Schlesinger, Junior, of Harvard, who read American Portrait while it was still in manuscript, and to whom I am indebted for enlightenment on ob scure aspects of the slavery question, and on the modern significance of Calhoun 7 s philosophy. I have accepted without material alteration his in terpretation of Calhoun s state of mind in the Years of Decision 1837-38, as depicted in The Age of Jackson. Bernard DeVoto of Cambridge also read this book in its original eleven hundred pages of manuscript, and is responsible for pruning of much surplus material, and for directing my attention to the significance of the soil depletion in the Southern states and the interrelationship of the consequent Western expansionist and abolitionist movements. I wish to thank Little, Brown and Company for permission to quote from Claude M. Fuess Daniel Webster, two volumes, Boston, 1930 Charles Scribners Sons for quotations from Margaret Bayard Smiths The First Forty Years of Washington Society, Gaillard Hunt, editor, New York, 1906 E. C. McClurg and Company, publishers of Eva E. Dyes Me-Lougkttn and Old Oregon, Chicago, 1900 John Perry Pritchett, for mate rial quoted from his Calhoun and His Defense of the South, Pougbkeepsie, 1935 the Chapel Hill Press for quotations from the Reminiscences of William C. Preston, Minnie Clare Yarborough, editor, copyright, 1933, by the University of North Carolina Press, and especially G. P. Putnams Sons, for quotations from The American Heresy by Christopher Hollis, copyright, 1930, by Christopher Hollis. The search for the essence of Calhoun must, of course, begin in his own South Carolina. At Clemson Agricultural College his great mass of per sonal papers and other contemporary material were made available to me and I wish to express my thanks to tt e librarian, Miss Cornelia Graham, to Professor and Mrs. A. G. Holmes and Professor Mark Bradley for their VU1 ACKNOWLEDGMENTS assistance. I am deeply grateful to Mrs. Francis Calhoun, who nearly fifty years ago wrote down her personal interviews with the last of the Calhoun slaves at Fort Hill, which are here used for the first time. Help has also come from other members of the Calhoun family, includ ing anecdotes and reminiscences from the last grandson, the late Patrick Calhoun of Pasadena, California from Miss Lilian Gold, Flint, Michigan Mr. John C. Calhoun, Columbia, South Carolina and Mr. Louis Symonds, Mr. and Mrs. John C, Calhoun Symonds, and Miss Eugenia Frost, all of Charleston. Mr. Alexander S. Salley, Junior, head of the South Carolina Historical Commission, gave me invaluable help in unraveling the early legislative proceedings of South Carolina, still in manuscript. Others assisting me in Columbia were Professor Robert L. Meriwether of the University of South Carolina Faculty, Miss Elizabeth Porcher of the University Library, Colonel Fiu Hugh McMaster, Mr. J. Gordon McCabe, and Mr. James T. Gittman. I also wish to thank Miss Virginia Rugheimer of the Library of the College of the City of Charleston, Miss Ellen FitzSimons, librarian of the Charleston Library Society, and Miss Kitty Ravenel and Dr. W. W. Ball, also of Charleston. In Washington, I. C M I am under obligation to Mr. St. George L...', 'language': 'en', 'image': 'https://images.isbndb.com/covers/40/97/9780131124097.jpg', 'title_long': 'John C. Calhoun, (Great lives observed)', 'edition': 'First Edition', 'dimensions': 'Weight: 0.75 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 0.75}}, 'pages': 174, 'date_published': '1970', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Regional & Cultural'], 'authors': ['Margaret L. Coit'], 'title': 'John C. Calhoun, (Great lives observed)', 'isbn13': '9780131124097', 'msrp': 1.99, 'binding': 'Hardcover', 'isbn': '0131124099', 'isbn10': '0131124099'}}