{'book': {'publisher': 'Pearson P T R', 'synopsis': '“As Emerson said that an institution is the ‘extended shadow’ of a person, Bouchikhi and Kimberly fluidly blend the personal and enterprise-wide perspectives of professional identity to yield both powerful insights and priceless practical tools. Most management books look at the decision maker or at the decision making context. This important book embraces both while eschewing the clichés of corporate culture guidebooks. Anchored in decades of research, compelling current business sagas, and familiar everyday challenges, The Soul of the Corporation uniquely conveys the inextricably intertwined nature of the symbolic and substantive roles of leadership.”<br/>Jeffrey Sonnenfeld, Senior Associate Dean, Lester Crown Professor of Management, Yale School of Management, and coauthor of Firing Back: How Great Leaders Rebound from Career Disasters<br/><br/>“In a world of continuous flux and accelerating change, one’s sense of identity becomes more crucial than ever for companies, no less than individuals. In The Soul of the Corporation, Bouchikhi and Kimberly take us on a journey into the psychological world of corporate identity and explore the importance of companies knowing who they are, both in relation to their inner-workings and the outside world. This trailblazing book will prove invaluable to management in their quest to define the essence of their corporate identity.”<br/>Jeremy Rifkin, President of the Foundation on Economic Trends in Washington, author of The End of Work, The Age of Access, and The Hydrogen Economy<br/><br/>“Identity is one of the most fundamental yet least understood determinants of organizational outcomes. Bouchikhi and Kimberly’s book provides a fresh and provocative point of view of the determinants of organizational identity as well as research-based insights on how to shift identity over time. This book will be important to both scholars of organizational evolution as well as managers involved in leading change.”<br/>Michael Tushman, Paul R. Lawrence Class of 1942 Professor of Business at the Harvard Business School<br/><br/>“A strong Identity is a major asset for a firm, as this book so convincingly illustrates. To manage the Identity (the I*Dimension) is perhaps the most critical top leadership function today. The authors show us how to do this–a must read!”<br/>Dr. Peter Lorange, IMD President, The Nestlé Professor<br/><br/>Understand, Control, and Leverage Your Company’s #1 Asset: Its Unique Identity<br/><br/>We live in a new Age of Identity, in which your employees, customers, investors, and<br/>other stakeholders care about who you really are. More than ever, your company’s identity will shape the results it can achieve. The Soul of the Corporation will help you clearly understand your company’s identity, and then take control of it and leverage<br/>it for long-term adaptation and success.<br/><br/>Drawing on real-life stories from the world’s most prominent companies, the authors show how identity can be an extraordinarily valuable asset–and how, if not properly managed, it can become a huge liability. Discover how your firm’s identity is related to–and different from–its organizational culture, brand positioning, and reputation. Learn how to diagnose and manage the often unconscious shared beliefs that constitute your company’s soul…how to face the enormous identity challenges that arise in mergers, alliances, spin-offs, and the creation of new brands…and above all, how to lead and inspire in this new Age of Identity.<br/><br/>• Master your company’s “I*Dimension”<br/>New tools for leveraging identity for competitive advantage<br/><br/>• Manage the tensions that shape your company’s identity<br/>Convergent vs. divergent, internal vs. external, designed vs. emergent, sameness vs. uniqueness<br/><br/>• Overcome the dark, dysfunctional side of identity<br/>Minimize narcissism, conflict, drift, and fragmentation<br/><br/>• Protect what’s precious, change what needs to change<br/>Managing identity through M&As, spin-offs, alliances, and unrelenting change', 'language': 'en', 'image': 'https://images.isbndb.com/covers/72/61/9780131857261.jpg', 'title_long': 'The Soul of the Corporation: How to manage the identity of your company', 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 6 Inches, Weight: 0.97885244328 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.97885244328}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 208, 'date_published': '2007', 'subjects': ['Business & Money', 'Business Culture', 'Workplace Culture', 'Management & Leadership', 'Systems & Planning', 'Marketing & Sales', 'Public Relations'], 'authors': ['Hamid Bouchikhi', 'John R. Kimberly'], 'title': 'The Soul of the Corporation: How to manage the identity of your company', 'isbn13': '9780131857261', 'msrp': 1.99, 'binding': 'Hardcover', 'isbn': '0131857266', 'isbn10': '0131857266'}}