{'book': {'publisher': 'Pi Press', 'synopsis': 'J. Robert Oppenheimer, the man who led the Manhattan Project that built the atomic bomb and ended World War II, forged the alliance between science and government that made the American Century possible. David C. Cassidy\'s biography is not merely the life story of a brilliant physicist, it tells the hidden story of the political and social forces shaping the world in our time: the rise of American science.<br/>Oppenheimer, the eldest son of an aristocratic Jewish family living on the Upper West Side of New York City, attended the secular, progressive, and elite Ethical Culture School. Cassidy, building his narrative on previously untapped primary documents, shows the importance and character of Oppenheimer\'s early education. The liberal values he absorbed there ran counter to the culture he found at Harvard, whose president sought to foster a future managerial elite, the rulers of the new American society. These formative contrasts in values explain Oppenheimer\'s many seeming contradictions. Why did the scientist who correctly theorized black holes turn his back on cutting edge research? How did a gentle liberal humanist become responsible for the creation of the first real weapon of mass destruction? How could a brilliant mind like his virtually found "scientific militarism" and then let it destroy him?<br/>Cassidy opens up a life story that is emblematic of the transformation of America over the last three generations. It offers, as the best history can, an insight into the future technological and moral progress of a nation.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/99/68/9780131479968.jpg', 'title_long': 'J. Robert Oppenheimer: And the American Century', 'edition': '1', 'dimensions': 'Height: 9.32 Inches, Length: 6.18 Inches, Weight: 1.763698096 Pounds, Width: 1.505 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.18}, 'width': {'unit': 'inches', 'value': 1.505}, 'weight': {'unit': 'pounds', 'value': 1.763698096}, 'height': {'unit': 'inches', 'value': 9.32}}, 'pages': 480, 'date_published': '2004-08-20', 'subjects': ['Biographies & Memoirs', 'Professionals & Academics', 'Scientists', 'Science & Math', 'History & Philosophy', 'Technology', 'History of Technology'], 'authors': ['David Cassidy'], 'title': 'J. Robert Oppenheimer: And the American Century', 'isbn13': '9780131479968', 'msrp': 1.99, 'binding': 'Hardcover', 'isbn': '0131479962', 'isbn10': '0131479962'}}