{'book': {'publisher': 'Specialized Systems Consultants', 'synopsis': 'This major revision of the best-selling and single most comprehensive guide to UNIX system administration is ideal as both an introductory tutorial for those new to system administration AND a day-to-day reference for ?power administrators.? Practical and hands-on in approach, it covers every aspect of system administration ? from basic topics to UNIX esoterica ? and provides explicit instructions for dealing with the six most popular versions of UNIX. Covers topics such as The Filesystem; Controlling Processes; Serial Devices; Periodic Processes; Backups; Syslog and Log Files; Configuring the Kernel; TCP/IP and Routing; The Domain Name System; The Network File System; Sharing System Files; SLIP and PPP; The Internet; Security; Printing and Imaging; Disk Space Management; Accounting; and UUCP. Includes CD ROM with source code, sample programs, and other tools and utilities helpful to UNIX SYSTEM ADMINISTRATION For system administrators and users of the UNIX operating system. ISBN of first edition: 0-13-933441-6.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/05/17/9780131510517.jpg', 'title_long': 'UNIX System Administration Handbook (BkCD ROM) (2nd Edition)', 'edition': '2nd', 'dimensions': 'Height: 9.5 Inches, Length: 7 Inches, Weight: 2.5 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 2.5}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 779, 'date_published': '1995-01-15', 'subjects': ['Computers & Technology', 'Operating Systems', 'Unix', 'Science & Math', 'Mathematics', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Trent R. Hein', 'Garth Snyder'], 'title': 'UNIX System Administration Handbook (BkCD ROM) (2nd Edition)', 'isbn13': '9780131510517', 'msrp': 119.99, 'binding': 'Paperback', 'isbn': '0131510517', 'isbn10': '0131510517'}}