{'book': {'publisher': 'Wharton School Pub', 'synopsis': 'Marketing in the Public Sectoris a groundbreaking book written exclusively for governmental agencies. It offers dozens of marketing success stories from agencies of all types\x96from around the world\x96so that you can make a difference in your organization. World-renowned marketing expert Dr. Philip Kotler and social marketing consultant Nancy Lee show that marketing is far more than communications and has at its core a citizen-oriented mindset. You\x92ll become familiar with the marketing toolbox and come to understand how these tools can be used to engender citizen support for your agency, increase utilization of your products and services, influence positive public behaviors\x96even increase revenues and decrease operating costs. This book offers no-nonsense roadmaps on how to create a strong brand identity, gather citizen input, and evaluate your efforts. It presents a step-by-step model for developing a marketing plan, pulling the lessons of the entire book together into one, high-impact action plan. Simply put, this book empowers you to build the \x93high-tech, high-touch\x94 agency of the future\x96and deliver more value for every penny you spend.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/51/59/9780131875159.jpg', 'title_long': 'Marketing in the Public Sector: A Roadmap for Improved Performance', 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.25 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.25}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 332, 'date_published': '2006', 'subjects': ['Business & Money', 'Management & Leadership', 'Systems & Planning', 'Processes & Infrastructure', 'Strategic Planning'], 'authors': ['Philip Kotler', 'Nancy Lee'], 'title': 'Marketing in the Public Sector: A Roadmap for Improved Performance', 'isbn13': '9780131875159', 'msrp': 34.99, 'binding': 'Hardcover', 'isbn': '0131875159', 'isbn10': '0131875159'}}