{'book': {'publisher': 'Pearson P T R', 'synopsis': "Next time someone tells you business can't be done ethically -- corners must be cut, negotiations can't be honest -- hand them Jon Huntsman's new book. He started with practically nothing, and made it to Forbes'list of America's Top 100 richest people. Huntsman's generous about sharing the credit, but in the 21st century, he's the nearest thing to a self-made multi-billionaire. Now, he presents the lessons of a lifetime: a passionate, inspirational manifesto for returning to the days when your word was your bond, a handshake was sacred, and swarms of lawyers weren't needed to back it up. This is no mere exhortation: it's a practical business book about how to listen to your moral compass, even as others ignore theirs. It's about how you build teams with the highest values, share success, take responsibility, and earn the rewards that only come with giving back. Huntsman's built his career and fortune on these principles. You don't live these principles just to 'succeed': you live them because they're right. But in an age of non-stop business scandal, Huntsman's life proves honesty is more than right: it's the biggest competitive differentiator.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/36/68/9780131863668.jpg', 'title_long': 'Winners Never Cheat: Everyday Values We Learned As Children but May Have Forgotten', 'edition': 'First Edition', 'dimensions': 'Height: 7.75 Inches, Length: 5.75 Inches, Weight: 0.60406659788 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.60406659788}, 'height': {'unit': 'inches', 'value': 7.75}}, 'pages': 185, 'date_published': '2005', 'subjects': ['Business & Money', 'Business Culture', 'Ethics', 'Management & Leadership', 'Decision-Making & Problem Solving', 'Skills', 'Decision Making'], 'authors': ['Jon M. Huntsman'], 'title': 'Winners Never Cheat: Everyday Values We Learned As Children but May Have Forgotten', 'isbn13': '9780131863668', 'msrp': 19.95, 'binding': 'Hardcover', 'isbn': '0131863665', 'isbn10': '0131863665'}}