{'book': {'publisher': 'FT Press', 'synopsis': '"Champy\'s engaging prose, fascinating success stories, penetrating reflections, and provocative challenges to the status quo capture your full attention from the first page to the last and leave your mind swirling with new thoughts about how to exploit opportunities in a very different world."<br/>- Ray Stata, "Founder and Chairman of the Board, Analog Devices, Inc." "To outsmart or be outsmarted, that is the question in modern business. Jim Champy has found the answer, in fact many answers, by looking inside amazingly successful companies. And he tells their simple stories in this book that is so delightfully short it can be read on one flight."- Dr. Robert "Bob" Metcalfe, "General Partner, Polaris Venture Partners" "In this remarkably readable and incisive book, Jim Champy provides case studies of fast growing, innovative companies that have created and implemented successful strategies that are practical, market tested, and reproducible in today\'s global marketplace."- Denis A. Bovin, Vice Chairman, "Investment Banking, Bear Stearns & Co., Inc"."" "This book shows how to spot opportunities in a world that looks, at times,<br/>like everything is done. Jim has strung together nine pearls that reveal the essence of entrepreneurship."<br/>- Gururaj "Desh" Deshpande, "Founder and Chairman, Sycamore Networks, Inc." Author of" ReEngineering the Corporation"<br/>A New York Times Best Seller & More than 3 Million Copies Sold Jim Champy revolutionized business with "Reengineering the Corporation." Now, in "Outsmart! "he\'s doing it again. This concise, fast-paced book shows how you can achieve breakthrough growth by" consistently outsmarting" your competition. Champy reveals the surprising, counterintuitive lessons learned by companies that have achieved super-high growth for at least three straight years. Drawing on the strategies of some of today\'s best "high velocity" companies, he identifies eight powerful ways to compete in even the roughest marketplace. You\'ll discover how to find distinctive market positions and sustainable advantages in products, services, delivery methods, and unexpected customers with unexpected needs. How to reignite growth by...- Seeing what others don\'t- Breaking free of mental legacies- Using all you know- Changing your frame of reference- Tapping others\' successes- Creating order out of chaos- Simplifying complexity- Doing everything yourself there is not much new in management. but there is a lot new in business. Want more? Check out the e-book collection, Jim Champy on What\'s Really Working in Business. This brand new collection contains state-of-the-art business insights from world-renowned expert Jim Champy...now in a convenient e-format, at a great price!', 'language': 'en', 'image': 'https://images.isbndb.com/covers/77/77/9780132357777.jpg', 'title_long': "Outsmart!: How to Do What Your Competitors Can't", 'edition': '1', 'dimensions': 'Height: 9.11 Inches, Length: 6.26 Inches, Weight: 0.9 Pounds, Width: 0.85 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.26}, 'width': {'unit': 'inches', 'value': 0.85}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 9.11}}, 'pages': 188, 'date_published': '2008-02-01', 'subjects': ['Business & Money', 'Business Culture', 'Motivation & Self-Improvement', 'Management & Leadership', 'Leadership & Motivation', 'Motivational', 'Systems & Planning', 'Processes & Infrastructure', 'Strategic Planning', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Jim Champy'], 'title': "Outsmart!: How to Do What Your Competitors Can't", 'isbn13': '9780132357777', 'msrp': 22.99, 'binding': 'Hardcover', 'related': {'ePub': '0132699001'}, 'isbn': '0132357771', 'isbn10': '0132357771', 'other_isbns': [{'isbn': '9780132699006', 'binding': 'saleableprint'}]}}