{'book': {'publisher': 'Pearson P T R', 'synopsis': 'In the age of the Internet, we educate people much as we did during the Industrial Revolution. We educate them for a world that no longer exists, instilling values antithetical to those of a free, 21st century democracy. Worst of all, too many schools extinguish the very creativity and joy they ought to nourish.<br/><br/>In Turning Learning Right Side Up, legendary systems scientist Dr. Russell Ackoff and \x93in-the-trenches\x94 education innovator Daniel Greenberg offer a radically new path forward. In the year\x92s most provocative conversation, they take on the very deepest questions about education: What should be its true purpose? Do classrooms make sense anymore? What should individuals contribute to their own education? Are yesterday\x92s distinctions between subjects--and between the arts and sciences--still meaningful? What would the ideal lifelong education look like--at K-12, in universities, in the workplace, and beyond?<br/><br/>Ackoff and Greenberg each have experience making radical change work--successfully. Here, they combine deep idealism with a relentless focus on the real world--and arrive at solutions that are profoundly sensible and powerfully compelling.<br/><br/>Why today\x92s educational system fails--and why superficial reforms won\x92t help<br/>The questions politicians won\x92t ask--and the answers they don\x92t want to hear<br/><br/>How do people learn--and why do they choose to learn?<br/>Creating schools that reflect what we know about learning<br/><br/>In a 21st century democracy, what values must we nurture?<br/>...and why aren\x92t we nurturing them?<br/><br/>How can tomorrow\x92s \x93ideal schools\x94 be operated and funded?<br/>A plan that cuts through political gridlock and can actually work<br/><br/>Beyond schools: building a society of passionate lifelong learners<br/>Learning from childhood to college to workplace through retirement<br/><br/>Reinventing Learning for the Next Century: How We Can, and Why We Must<br/><br/>An extraordinary conversation about the very deepest questions...<br/><br/>Today, what is education for?<br/>Where should it take place? How? When?<br/>What is the ideal school?<br/>The ideal lifelong learning experience?<br/>Who should be in charge of education?<br/>And who pays for it all?<br/><br/>Over the past 150 years, virtually everything has changed...except education. Schools were designed as factories, to train factory workers. The factories are gone, but the schools haven\x92t changed. It\x92s time for us to return to first principles...or formulate new first principles...and reimagine education from the ground up.<br/><br/>In Turning Learning Right Side Up, two of this generation\x92s most provocative thinkers--and practical doers--have done just that. They draw on the latest scientific research, th', 'language': 'en', 'image': 'https://images.isbndb.com/covers/64/98/9780132346498.jpg', 'title_long': 'Turning Learning Right Side Up: Putting Education Back on Track', 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 0.89948602896 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.89948602896}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 196, 'date_published': '2008', 'subjects': ['Education & Teaching', 'Schools & Teaching', 'Education Theory', 'Self Service', 'Custom Stores'], 'authors': ['Russell L. Ackoff', 'Daniel Greenberg'], 'title': 'Turning Learning Right Side Up: Putting Education Back on Track', 'isbn13': '9780132346498', 'msrp': 29.99, 'binding': 'Hardcover', 'isbn': '0132346494', 'isbn10': '0132346494'}}