{'book': {'publisher': 'FT Press (Prentice Hall)', 'synopsis': '"The book’s gem is a personal financial action plan that allows easy assessment of current assets and retirement goals…This book demystifies the many obstacles--from the logistical to the conceptual--to smart financial planning.”<br/>--Publishers Weekly<br/><br/>"Eric Tyson is the best personal finance writer at work today. In a field cluttered with hucksters, false gurus, and just plain bad advice, this book delivers powerful common sense. I trust Eric Tyson, and you should, too.”<br/>--Tom Ehrenfeld, former writer and Editor at Harvard Business Review and Inc. Magazine, author of The Startup Garden: How Growing a Business Grows You<br/><br/>"Many people have developed attitudes, beliefs, and fears about money that prevent them from acquiring, investing, and spending it in healthy ways...Eric Tyson helps readers get past all that...and start building happy and healthy financial futures. Everyone can profit from this new book--I did."<br/>--Dr. Brian Russell, Psychologist as seen on CNN, Court TV, and Fox News; Professor, University of Kansas<br/><br/>Transform Your Personal Financial Habits and Attitudes...And Your Life!<br/>Real money solutions from the best-selling author of Personal Finance For Dummies, Eric Tyson!<br/>Save smarter, invest smarter, and spend smarter, starting today Reduce your financial risks--and eliminate your money anxieties For everyone interested in improving their personal finances…whether you’re saving for college, retirement, or anything else<br/><br/>Worried about money? Join the club. Now, do something about it! One of America’s best-selling personal finance authors offers real, practical solutions that work: steps you can take right now to start replacing money anxiety with financial fulfillment and happiness. Eric Tyson gets straight to the point, identifying the habits that put you at risk--and helping you replace them with the habits of financial success. Tyson offers plain-English, no-gimmick techniques you can really use: knowledge you’d have to pay a fortune for, if you could get it at all!<br/><br/>Financial success doesn’t just “happen”: it’s determined by your financial habits. Fortunately, you can develop good financial habits--and systematically eliminate the bad ones that stand in your way. Eric Tyson will show you how--step-by-step and hands-on.<br/><br/>Millions of people have benefited from Tyson’s best-selling books and award-winning columns. Now he brings together all he’s learned over two decades--including financial management secrets most professionals never tell you about.<br/><br/>Tyson will help you organize your finances…take control of your future…make plans you’ll actually implement…save, spend, and invest more effectively…choose the right advisors…reduce your risks…and put money where it belongs in your life (instead of making it your whole life!).<br/><br/>This meaty, action-oriented guide is packed with checklists and worksheets that’ll help you start today, get results fast, and make positive changes that will last a lifetime!<br/>Develop the best habits, and use the best strategies<br/>What you can learn from the nation’s best personal financial managers Take control of your finances, one step at a time<br/>Make plans that work--and make your plans work Transform your hopes and ideas into action<br/>Everything you need is here, including hands-on worksheets and practical exercises Get real, not real obsessed!<br/>Learn how to give money the right role in your life...not your whole life!', 'language': 'en', 'image': 'https://images.isbndb.com/covers/16/15/9780132341615.jpg', 'title_long': "Let's Get Real About Money!", 'edition': '1', 'dimensions': 'Height: 8.6 Inches, Length: 5.9 Inches, Weight: 0.9479866 Pounds, Width: 0.8 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.9}, 'width': {'unit': 'inches', 'value': 0.8}, 'weight': {'unit': 'pounds', 'value': 0.9479866}, 'height': {'unit': 'inches', 'value': 8.6}}, 'pages': 352, 'date_published': '2007-11-13', 'subjects': ['Business & Money', 'Economics', 'Personal Finance'], 'authors': ['Eric Tyson'], 'title': "Let's Get Real About Money!", 'isbn13': '9780132341615', 'msrp': 21.99, 'binding': 'Paperback', 'related': {'ePub': '0132703521'}, 'isbn': '0132341611', 'isbn10': '0132341611', 'other_isbns': [{'isbn': '9780132703529', 'binding': 'print'}]}}