{'book': {'publisher': 'Pearson P T R', 'synopsis': 'Never has it been more important to read Wealth: Grow It, Protect It, Spend It, and Share It. More of us have created more wealth today than ever before; managing our retirement assets is increasingly our own responsibility; and America is bracing for the largest intergenerational transfer of wealth in history. Added to this are the recent financial scandals which have left us confused about who to trust for good investment and wealth management advice. And because most advisors are specialists, the critical task of integrating the varied aspects of wealth management falls on our shoulders. Written by Stuart Lucas, an experienced investment professional, Carnation Company heir, and now manager of his family’s fortune, Wealth:<br/>• Helps you to ntegrate the financial and family aspects of wealth management into an actionable, coherent whole;<br/>• Provides the tools and information you need to take charge of your wealth, so that your advisors and your money are working toward achieving your goals;<br/>• Addresses family relationships and values, preparing your children for affluence, the motives of advisors, spending, philanthropy, taxes, estate planning, investment strategies, and more.<br/>In short, Wealth is the definitive guide to optimizing your financial future. The lessons of Wealth apply whether you have $100,000 or $100,000,000, whether your goal is to safeguard assets to last your lifetime or to create a financial legacy that will continue for generations.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/67/93/9780132366793.jpg', 'title_long': 'Wealth: Grow It, Protect It, Spend It, And Share It', 'edition': '1', 'dimensions': 'Height: 9.5 Inches, Length: 6.5 Inches, Weight: 1.69976404002 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.69976404002}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 356, 'date_published': '2006', 'subjects': ['Business & Money', 'Economics', 'Personal Finance'], 'authors': ['Stuart E. Lucas'], 'title': 'Wealth: Grow It, Protect It, Spend It, And Share It', 'isbn13': '9780132366793', 'msrp': 28.99, 'binding': 'Hardcover', 'isbn': '0132366797', 'isbn10': '0132366797'}}