{'book': {'publisher': 'Wharton School Publishing', 'synopsis': 'Praise for Bernard Lewis "For newcomers to the subject[el]Bernard Lewis is the man.""TIME Magazine " "The doyen of Middle Eastern studies." "The New York Times" "No one writes about Muslim history with greater authority, or intelligence, or literary charm."British historian Hugh Trevor-Roper "Bernard Lewis has no living rival in his field.""Al Ahram," Cairo (the most influential Arab world newspaper) "When it comes to Islamic studies, Bernard Lewis is the father of us all. With brilliance, integrity, and extraordinary mastery of languages and sources, he has led the way for[el]investigators seeking to understand the Muslim world.""National Review" "Bernard Lewis combines profound depth of scholarship with encyclopedic knowledge of the Middle East and, above all, readability.""Daily Telegraph" (London) "Lewis speaks with authority in prose marked by lucidity, elegance, wit and force.""Newsday" (New York) "Lewis\' style is lucid, his approach, objective.""Philadelphia Inquirer" "Lewis writes with unsurpassed erudition and grace.""Washington"" Times"" "An objective, easy-to-read introduction to Islam by Bernard Lewis, one of the West\'s leading experts on Islam" "For many people, Islam remains a mystery. Here Bernard Lewis and Buntzie Ellis Churchill examine Islam: what its adherents believe and how their religion has shaped them, their rich and diverse cultures, and their politics over more than 14 centuries. Considered one of the West\'s leading experts on Islam, Lewis, with Churchill, has written an illuminating introduction for those who want to understand the faith and the global challenges it confronts and presents. Whatever your political, personal, or religious views, this book will help you understand Islam\'s reality. Lewis and Churchill answer questions such as... - How does Islam differ from Judaism and Christianity?- What are the pillars of the Islamic faith?- What does Islam really say about peace and jihad?- How does the faith regard non-Muslims?- What are the differences between Sunni and Shi\'a?- What does Islam teach about the position of women in society?- What does Islam say about free enterprise and profit?- What caused the rise of radical Islam?- What are the problems facing Muslims in the U.S. and Europe and what are the challenges posed by those minorities?', 'language': 'en', 'image': 'https://images.isbndb.com/covers/08/58/9780132230858.jpg', 'title_long': 'Islam: The Religion and the People', 'edition': '1', 'dimensions': 'Height: 9.22 Inches, Length: 6.58 Inches, Weight: 1.0141264052 Pounds, Width: 0.81 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.58}, 'width': {'unit': 'inches', 'value': 0.81}, 'weight': {'unit': 'pounds', 'value': 1.0141264052}, 'height': {'unit': 'inches', 'value': 9.22}}, 'pages': 237, 'date_published': '2008-08-01', 'subjects': ['History', 'Religion & Spirituality', 'Islam', 'Theology', 'Politics & Social Sciences', 'Politics & Government', 'Political Science'], 'authors': ['Bernard Lewis', 'Buntzie Ellis Churchill'], 'title': 'Islam: The Religion and the People', 'isbn13': '9780132230858', 'msrp': 21.99, 'binding': 'Hardcover', 'related': {'ePub': '0132716062'}, 'isbn': '0132230852', 'isbn10': '0132230852', 'other_isbns': [{'isbn': '9780132716062', 'binding': 'print'}]}}