{'book': {'publisher': 'FT Press', 'synopsis': 'Every day, we evaluate the people around us: It\'s one of the most important things we ever do. "Making Sense of People" provides the scientific frameworks and tools we need to improve our intuition, and assess people more consciously, systematically, and effectively.Leading neuroscientist Samuel H. Barondes explains the research behind each standard personality category: extraversion, agreeableness, conscientiousness, neuroticism, and openness. He shows readers how to use these traits and assessments to do a better job of deciding who they\'ll enjoy spending time with, whom to trust, and whom to keep at a distance. Barondes explains: What neuroscience and psychological research can tell us about how personality types develop and cohere. The intertwined roles of genes, nurture, and education in personality development. How to recognize troublesome personality patterns such as narcissism, sociopathy, and paranoia. How much a child\'s behavior predicts their adult personality, and how personality stabilizes in young adulthood. How to assess integrity, fairness, wisdom, and other traits related to morality. What genetic testing may (or may not) teach us about personality in the future. General strategies for getting along with people, with specific tactics for special circumstances. Kirkus ReviewsA succinct look at personality psychology. As a psychiatrist and neuroscientist at the University of California, Barondes ("Molecules and Mental Illness," 2007, etc.) has spent years studying human behavior, and this book reflects his systematic, scientific approach for personality assessment. The average person isn\'t likely to have time to research a difficult boss or potential love interest, but the author supplements intuition with a useful cornerstone for gauging human behavior: a table of the "Big Five" personality traits, among them Extraversion vs. Introversion and Agreeableness vs. Antagonism. To learn how to apply the Big Five, Barondes supplies a link for a professional online personality test, in addition to a basic introduction of troubling personality patterns-e.g., narcissism and compulsiveness. While genetics may play a heavy hand in influencing personality, Barondes writes, it\'s awareness of a person\'s background, character and life story that is paramount in unearthing reasons for adult behavior. Readers might like to see the author weave more everyday examples into the text-his exercise in fostering compassion by imagining an adult as a 10-year-old child is a gem-but there is plenty here to ponder. Those looking for traditional "self-help" advice won\'t find it here, but this book clearly lays the groundwork for deeper human interaction and better life relationships.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/26/08/9780132172608.jpg', 'title_long': 'Making Sense of People: Decoding the Mysteries of Personality', 'edition': '1', 'dimensions': 'Height: 8.55 Inches, Length: 5.75 Inches, Weight: 0.8377565956 Pounds, Width: 0.84 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 0.84}, 'weight': {'unit': 'pounds', 'value': 0.8377565956}, 'height': {'unit': 'inches', 'value': 8.55}}, 'pages': 230, 'date_published': '2011-07-02', 'subjects': ['Health, Fitness & Dieting', 'Mental Health', 'Emotions', 'Personality Disorders', 'Psychology & Counseling', 'Personality', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Samuel Barondes'], 'title': 'Making Sense of People: Decoding the Mysteries of Personality', 'isbn13': '9780132172608', 'msrp': 34.99, 'binding': 'Hardcover', 'related': {'ePub': '0132172879'}, 'isbn': '0132172607', 'isbn10': '0132172607', 'other_isbns': [{'isbn': '9780132172875', 'binding': 'print'}]}}