{'book': {'publisher': 'FT Press', 'synopsis': '“This well-organized book shows what a typical life in real estate is like so that newcomers can decide whether the field is right for them. It also offers advice on how to grow real estate investments for people who are already in the industry. Poorvu includes a variety of real world stories about people and their career experiences to make for an interesting read with a practical edge.”<br/>–Publishers Weekly<br/><br/>“This new book by Bill Poorvu trumps any real estate book you’ve ever read.”<br/>–James Grant, editor of Grant’s Interest Rate Observer<br/><br/>There are plenty of “get rich quick in real estate” books. This is not one of them.<br/><br/>Your guide, William Poorvu, is a lifelong real estate investor and consultant, and former head of the real estate program at Harvard Business School. Drawing on his personal experience–and hundreds of interviews with many of the most successful real estate investors and entrepreneurs–Poorvu illuminates every stage of your “life” in real estate: creating wealth, growing it, and<br/>managing it successfully. He reveals the milestones, pitfalls, and rewards associated with real estate investing, offering powerful insight into the challenges and opportunities you’ll face as you start out...scale up...ride the industry’s cyclical waves and then leverage, share, or pass along the wealth you’ve created.<br/><br/>This book contains dozens of real life personal stories, hands-on checklists, and questions to guide your decisions...and it delivers unparalleled insight into how the real estate industry<br/>really works:<br/><br/>• Be strategic: choose your best route into the business<br/>Define your successful real estate career, and learn how to make it a reality<br/><br/>•Build your foundation: your first job, your first deal<br/>Spot a great opportunity to add value, and jump on it<br/><br/>• Scale up: build and sustain your success<br/>Hire a great team, manage them successfully, and find the capital you need to grow<br/><br/>• Survive the downturns: be flexible and nimble<br/>Recognize new realities, adapt to them, and uncover the opportunities they create<br/><br/>• Take stock: make the most of your success<br/>Balance your business, wealth, and family', 'language': 'en', 'image': 'https://images.isbndb.com/covers/45/39/9780132434539.jpg', 'title_long': 'Creating and Growing Real Estate Wealth: The 4 Stages to a Lifetime of Success', 'edition': '1', 'dimensions': 'Height: 8.9 Inches, Length: 5.9 Inches, Weight: 0.7495716908 pounds, Width: 0.7 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.9}, 'width': {'unit': 'inches', 'value': 0.7}, 'weight': {'unit': 'pounds', 'value': 0.7495716908}, 'height': {'unit': 'inches', 'value': 8.9}}, 'pages': 272, 'date_published': '2008-02-17', 'subjects': ['Business & Money', 'Finance', 'Investing', 'Management & Leadership', 'Systems & Planning', 'Real Estate', 'Investments', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['William Poorvu'], 'title': 'Creating and Growing Real Estate Wealth: The 4 Stages to a Lifetime of Success', 'isbn13': '9780132434539', 'msrp': 26.99, 'binding': 'Paperback', 'related': {'ePub': '013270336X'}, 'isbn': '0132434539', 'isbn10': '0132434539', 'other_isbns': [{'isbn': '9780132703369', 'binding': 'print'}]}}