{'book': {'publisher': 'Prentice Hall', 'synopsis': "Need fast, reliable, easy-to-implement solutions for automating SharePoint 2010 administration with PowerShell? This book delivers exactly what you're looking for: step-by-step help and guidance with the tasks you'll perform most often. You'll find tested PowerShell scripts and proven techniques for managing installations, servers, farms, IIS, users, services, sites, data, solutions, enterprise services, and more. You'll even find practical guidance and tested solutions for getting more value from Enterprise Search and PerformancePoint business intelligence. The industry's most focused resource for scripting SharePoint with PowerShell, this book provides all the answers you need-now! Fast, Accurate, and Easy-to-Use!<br/>Run PowerShell scripts from the SharePoint 2010 Management Shell console<br/>Perform unattended SharePoint installations<br/>Configure new farms, add servers, and manage sites<br/>Create new site collections and sub-sites<br/>Review and set Farm Configuration Values and SharePoint Designer Settings<br/>Display, get, create, remove, configure, and extend web applications<br/>Create, manage, remove, back up, and restore SharePoint databases<br/>Work with SharePoint solutions and features<br/>Automatically publish and manage content<br/>Control Office features: Excel Services, Access Services, Visio Graphic Services, Word Services, and PerformancePoint Services<br/>Administer InfoPath Form Services, profiles, metadata, Secure Store, and other service applications<br/>Change the behavior of Enterprise Search and SharePoint Foundation Search<br/>Manage external data connections via Business Data Connectivity Service", 'language': 'en', 'image': 'https://images.isbndb.com/covers/87/80/9780132748780.jpg', 'title_long': 'Empirical Foundations of Educational Research.', 'dimensions': 'weight: 458 g', 'dimensions_structured': {'weight': {'unit': 'g', 'value': 458}}, 'pages': 443, 'date_published': '1968', 'subjects': ['Education & Teaching', 'Schools & Teaching', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Gilbert Sax'], 'title': 'Empirical Foundations of Educational Research.', 'isbn13': '9780132748780', 'msrp': 13.95, 'binding': 'Hardcover', 'isbn': '0132748789', 'isbn10': '0132748789'}}