{'book': {'publisher': 'Prentice Hall', 'synopsis': "Each of the book's authors is both a scholar and a top consultant for Fortune 500 and smaller companies. As a result, they have a unique focus: to help readers better understand management accounting topics, research, and issues from the perspective of a business manager. KEY TOPICS A twelve chapter organization and framework addresses the needs of future business managers specifically, how to interpret and use accounting information to make good decisions. The book answers many pertinent questions: What defines the nature, focus, and scope of management accounting? What determines the cost of products or customers? How do costs change over the product's life cycle? What approaches do managers use to compute the costs of their products and services? How can we use cost for planning and decision-making purposes? How can we use revenue and cost information for capacity planning and profit planning and evaluation purposes? How can we manage and control organizational behavior through organizational design, and how does cost information inform the process of control? For management accountants, cost system designers, incentive compensation system designers, and balanced scorecard implementers.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/76/10/9780132557610.jpg', 'title_long': 'Management Accounting', 'edition': '2nd', 'dimensions': 'Height: 10.35431 Inches, Length: 8.2677 Inches, Weight: 3.637627323 Pounds, Width: 1.33858 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.2677}, 'width': {'unit': 'inches', 'value': 1.33858}, 'weight': {'unit': 'pounds', 'value': 3.637627323}, 'height': {'unit': 'inches', 'value': 10.35431}}, 'pages': 741, 'date_published': '1997', 'subjects': ['Business & Money', 'Management & Leadership', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Robert Kaplan And Rajiv Banker And S. Mark Young And Anthony A. Atkinson'], 'title': 'Management Accounting', 'isbn13': '9780132557610', 'msrp': 110, 'binding': 'Hardcover', 'isbn': '0132557614', 'isbn10': '0132557614'}}