{'book': {'publisher': 'Prentice Hall', 'synopsis': '<p> Going into its eighth edition, this book is a classic in the field of educational measurement. It was written from the point of view of the classroom teacher to answer the question, "What does a teacher need to know about the development and evaluation of educational measures and assessments?"  This book fosters an understanding of how assessment and instruction are interrelated. It also cultivates learning the techniques and skills needed to develop tests and other evaluation procedures (e.g. portfolios), as well as teaches students to understand how to evaluate the validity and reliability of tests. Unlike many books in educational measurement, this book also gives readers what they need to know to properly interpret the results from standardized achievement and scholastic aptitude tests. Topics include: test reliability and validity; meaning and application of the norms; extraneous factors that influence performance of cognitive tests; the development of educational measures; and more. Teachers, principals, and counselors. </p>', 'language': 'en', 'image': 'https://images.isbndb.com/covers/32/42/9780132363242.jpg', 'title_long': 'Educational and Psychological Measurement and Evaluation', 'edition': '7th', 'dimensions': 'Height: 9.25 Inches, Length: 1 Inches, Weight: 2.28398903432 Pounds, Width: 7.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 1}, 'width': {'unit': 'inches', 'value': 7.25}, 'weight': {'unit': 'pounds', 'value': 2.28398903432}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 522, 'date_published': '1990', 'subjects': ['Education & Teaching', 'Schools & Teaching', 'Education Theory', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Kenneth D. Hopkins', 'Julian C. Stanley', 'B.R. Hopkins'], 'title': 'Educational and Psychological Measurement and Evaluation', 'isbn13': '9780132363242', 'msrp': 66, 'binding': 'Hardcover', 'isbn': '0132363240', 'isbn10': '0132363240'}}