{'book': {'publisher': 'Pearson College Div', 'synopsis': "Through many successful editions, the Angel team has developed a text that students can read, understand, and enjoy. They\x92ve done this by pairing clear explanations (in short sentences!) with detailed examples and thorough exercise sets.<br/><br/>ALERT: Before you purchase, check with your instructor or review your course syllabus to ensure that you select the correct ISBN. Several versions of Pearson's MyLab & Mastering products exist for each title, including customized versions for individual schools, and registrations are not transferable. In addition, you may need a CourseID, provided by your instructor, to register for and use Pearson's MyLab & Mastering products.<br/><br/>Packages<br/>Access codes for Pearson's MyLab & Mastering products may not be included when purchasing or renting from companies other than Pearson; check with the seller before completing your purchase.<br/><br/>Used or rental books<br/>If you rent or purchase a used book with an access code, the access code may have been redeemed previously and you may have to purchase a new access code.<br/><br/>Access codes<br/>Access codes that are purchased from sellers other than Pearson carry a higher risk of being either the wrong ISBN or a previously redeemed code. Check with the seller prior to purchase.<br/><br/>--<br/>0321922638 / 9780321922632 Elementary Algebra For College Students Plus NEW MyMathLab with Pearson eText -- Access Card Package<br/>Package consists of<br/>0321431308 / 9780321431301 MyMathLab -- Glue-in Access Card<br/>0321654064 / 9780321654069 MyMathLab Inside Star Sticker<br/>0321868064 / 9780321868060 Elementary Algebra For College Students", 'language': 'en', 'image': 'https://images.isbndb.com/covers/69/90/9780133676990.jpg', 'title_long': 'Elementary Algebra for College Students', 'edition': '4', 'dimensions': 'Height: 10.5 Inches, Length: 8.5 Inches, Weight: 2.866009406 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.5}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 2.866009406}, 'height': {'unit': 'inches', 'value': 10.5}}, 'pages': 619, 'date_published': '1995-08-03', 'subjects': ['Science & Math', 'Mathematics', 'Pure Mathematics', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Allen R. Angel'], 'title': 'Elementary Algebra for College Students', 'isbn13': '9780133676990', 'msrp': 83, 'binding': 'Hardcover', 'isbn': '0133676994', 'isbn10': '0133676994'}}