{'book': {'publisher': 'Prentice Hall', 'synopsis': 'Ironically, many designers of graphical user interfaces are not always aware of the fundamental design rules and techniques that are applied routinely by other practitioners of communication-oriented visual design -- techniques that can be used to enhance the visual quality of GUIs, data displays, and multimedia documents. This volume focuses on design rules and techniques that are drawn from the rational, functionalist design aesthetic seen in modern graphic design, industrial design, interior design, and architecture -- and applies them to various graphical user interface problems experienced in commercial software development. Describes the basic design principles (the what and why), common errors, and practical step-by-step techniques (the how) in each of six major areas: elegance and simplicity; scale, contrast, and proportion; organization and visual structure; module and program; image and representation; and style. Focuses on techniques that will not only improve the aesthetics of the visual display, but, because they promote visual organization, clarity, and conciseness, will also enhance the usability of the product. Includes a catalog of common errors drawn from existing GUI applications and environments to illustrate practices that should be avoided in developing applications. For anyone responsible for designing, specifying, implementing, documenting, or managing the visual appearance of computer-based information displays.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/38/92/9780133033892.jpg', 'title_long': 'Designing Visual Interfaces: Communication Oriented Techniques', 'edition': '1', 'dimensions': 'Height: 9.5 Inches, Length: 7.75 Inches, Weight: 1.1 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.75}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 1.1}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 304, 'date_published': '1994', 'subjects': ['Computers & Technology', 'Software', 'Web Development & Design', 'User Experience & Usability', 'Science & Math', 'Mathematics', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Kevin Mullet', 'Darrell Sano'], 'title': 'Designing Visual Interfaces: Communication Oriented Techniques', 'isbn13': '9780133033892', 'msrp': 84.99, 'binding': 'Paperback', 'isbn': '0133033899', 'isbn10': '0133033899'}}