{'book': {'publisher': 'Prentice Hall', 'synopsis': 'Back in the early 1970s, "Janson"--as History of Art is universally known--was a hefty but manageable 616 pages, illustrated mostly with black-and-white photographs. It also famously contained not a single work by a female artist and devoted a scant eight pages to non-Western art. Five editions and three decades later, the art history student\'s Stone Age-to-20th-century Bible has swelled into a massive, slipcased, 1,000-page tome studded with 865 color reproductions and subheadings that corral individual artists whose achievements used to flow together like some mighty art historical river.<br/>Women artists (from 17th-century painter Artemisia Gentileschi to contemporary photographer Cindy Sherman) now make the cut, and the focus is purely Western, extended to include 20th-century photography and postmodernism (with a scant two pages on postmodern theory). The timeline charting landmarks in art alongside key events in history, science, and the arts has been handsomely redesigned. Each historical period now has its own world map and selection of excerpts from primary sources (including unusual ones, like a fellow monk\'s account of painter Hugo van der Goes\'s mental troubles).<br/>With each edition, portions of the text have been altered to reflect shifting scholarly interpretations. (As the late H.W. Janson wryly noted in the original, 1962 preface, "There are no \'plain facts\' in the history of art.") H.W.\'s son Anthony writes in his preface to the sixth edition that changes have been made to sections on ancient art; French romantic, realist, and impressionist painting; and the history of Western architecture. Happily unchanged--no dumbing-down here--is the clarity and intelligence of the writing. All in all, History of Art remains an invaluable reference for anyone who studies or writes about the subject. But even if no further bloat is contemplated, the time has come to rename the worthy Janson History of Western Art, and to divide it into two volumes, if only to protect the health and backpacks of art historians-to-be. --Cathy Curtis', 'language': 'en', 'image': 'https://images.isbndb.com/covers/44/87/9780133884487.jpg', 'title_long': 'History Of Art: Volume 1', 'edition': '4th', 'dimensions': 'Weight: 3.5 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 3.5}}, 'pages': 438, 'date_published': '1991-01', 'subjects': ['Arts & Photography', 'History & Criticism', 'History', 'Reference', 'Foreign Language Study & Reference', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['H. W. Janson'], 'title': 'History Of Art: Volume 1', 'isbn13': '9780133884487', 'msrp': 41.95, 'binding': 'Paperback', 'isbn': '0133884481', 'isbn10': '0133884481'}}