{'book': {'publisher': 'Pearson', 'synopsis': 'NOTE: This ISBN is a standalone Access Card. Does not include book.<br/><br/>This access code card provides access to the new Enhanced Pearson eText.<br/><br/>Introduction to Middle Level Education, 3/e gives readers an engaging, first person introduction young adolescents and the middle level classroom. It examines the full range of topics relevant to this group of students, from student development and diversity to the structures of middle level education, curriculum instruction, assessment, advisory, service learning, the learning environment, and more. Nine focus teachers and nine focus students bring the concepts to life through photos, vignettes, and professional practice opportunities. In this edition, the new AMLE Teacher Preparation Standards are included in each chapter, along with the 16 characteristics of successful middle level schools featured in the This We Believe section. Likewise, the 13 goals for young adolescent development in This We Believe are referenced repeatedly as concept address ways to meet the goals. The Enhanced Pearson eText features embedded audio.<br/><br/>Improve mastery and retention with the Enhanced Pearson eText*<br/>This access code card provides access to the new Enhanced Pearson eText, a rich, interactive learning environment designed to improve student mastery of content. The Enhanced Pearson eText is: Engaging. The new interactive, multimedia learning features were developed by the authors and other subject-matter experts to deepen and enrich the learning experience. Convenient. Enjoy instant online access from your computer or download the Pearson eText App to read on or offline on your iPad and Android tablet. Affordable. Experience the advantages of the Enhanced Pearson eText for 40% to 65% less than a print bound book.<br/>* The Enhanced eText features are only available in the Pearson eText format. They are not available in third-party eTexts or downloads.<br/>*The Pearson eText App is available on Google Play and in the App Store. It requires Android OS 3.1-4, a 7” or 10” tablet, or iPad iOS 5.0 or later.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/84/07/9780133808407.jpg', 'title_long': 'Introduction to Middle Level Education, Enhanced Pearson Etext -- Access Card', 'edition': '3rd Revised ed.', 'dimensions': 'Height: 21.59 Inches, Length: 21.59 Inches, Weight: 0.14991433816 Pounds, Width: 27.94 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 21.59}, 'width': {'unit': 'inches', 'value': 27.94}, 'weight': {'unit': 'pounds', 'value': 0.14991433816}, 'height': {'unit': 'inches', 'value': 21.59}}, 'pages': 408, 'date_published': '2014-04-26', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Regional & Cultural', 'Education & Teaching', 'Schools & Teaching', 'Certification & Development', 'Self Service', 'Custom Stores', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Henri Saint-Laurent', 'Sara Powell'], 'title': 'Introduction to Middle Level Education, Enhanced Pearson Etext -- Access Card', 'isbn13': '9780133808407', 'msrp': 46.65, 'binding': 'Printed Access Code', 'isbn': '0133808408', 'isbn10': '0133808408'}}