{'book': {'publisher': 'Prentice Hall Press', 'synopsis': 'Taking a brass tacks approach to communication, How to Have Confidence and Power in Dealing With People explains how to interact with others as they really are, not as you would like them to be. The goal is to get what you want from them successfully – be it cooperation, goodwill, love or security.<br/><br/>Les Giblin, a recognized expert in the field of human relations, has devised a method for dealing with people that can be used when relating with anyone – parents, teachers, bosses, employees, friends, acquaintances, even strangers. Giblin shows step by step how to get what you want at any time and in ways that leave you feeling good about yourself. Moreover, the people who have given you want you want wind up feeling good about themselves, too. The result? Nobody gets shortchanged. It’s a win-win situation.<br/><br/>Each chapter includes a handy summary, so there’s absolutely no chance of missing the book’s key points. You can also use these recaps to refresh your memory after you’ve finished the book. Instead of feeling miserable about your interpersonal skills, read this best-selling guide and learn to succeed with people in every area of your life.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/67/17/9780134106717.jpg', 'title_long': 'How to Have Confidence and Power in Dealing with People', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.70106999316 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.70106999316}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 192, 'date_published': '1985-11-15', 'subjects': ['Self-Help', 'Relationships', 'Interpersonal Relations', 'Self-Esteem'], 'authors': ['Leslie T. Giblin'], 'title': 'How to Have Confidence and Power in Dealing with People', 'isbn13': '9780134106717', 'msrp': 15, 'binding': 'Paperback', 'isbn': '0134106717', 'isbn10': '0134106717'}}