{'book': {'publisher': 'Prentice Hall', 'synopsis': "49475-7 UNIX(r) computer systems are increasingly used for mission-critical applications, data processing organizations are required to provide high levels of availability for these systems and to ensure they maintain the required level of availability over time. Among the most reliable, cost-effective ways to deliver high availability is to use clusters-loosely coupled UNIX computers, each with its own processors, memory, operating system and storage, bound together by special system processes. Clusters for High Availability explains the basic concepts, architectures and terminology of high availability using clusters, and gives a broad outline of how Hewlett-Packard's industry-leading cluster solutions work. The book describes how high-availability clusters can be configured to eliminate single points of failure in power systems, disks, processors, network components, and software. The book features coverage of HP high-availability products, including MC/ServiceGuard, MC/LockManager, mirrored disks and disk arrays, journaled file systems, management tools, and consulting services. Finally, Clusters for High Availability presents suggestions for developing high availability solutions in areas as diverse as publishing, mail order catalog sales, brokerage services, and insurance.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/75/87/9780134947587.jpg', 'title_long': 'Clusters for High Availability: A Primer of HP-UX Solutions', 'edition': '1', 'dimensions': 'Height: 8.2677 Inches, Length: 5.43306 Inches, Weight: 0.44312914662 Pounds, Width: 0.31496 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.43306}, 'width': {'unit': 'inches', 'value': 0.31496}, 'weight': {'unit': 'pounds', 'value': 0.44312914662}, 'height': {'unit': 'inches', 'value': 8.2677}}, 'pages': 192, 'date_published': '1996', 'subjects': ['Computers & Technology', 'Software', 'Science & Math', 'Mathematics'], 'authors': ['Peter Weygant'], 'title': 'Clusters for High Availability: A Primer of HP-UX Solutions', 'isbn13': '9780134947587', 'msrp': 36.5, 'binding': 'Paperback', 'isbn': '0134947584', 'isbn10': '0134947584'}}