{'book': {'publisher': 'Prentice Hall', 'synopsis': 'This text provides an overview of industrial marketing. It includes a section on industrial marketing environments, with international considerations, and a discussion of high technology exports, and considers such areas as the resellers market, computerized data analysis techniques, product positioning, perceptual mapping and professional service marketing. This second edition features an updated discussion of the learning curve to reflect new international considerations. There is expanded coverage of marketing services, telemarketing, marketing intelligence, surveying groups and computer uses, including sales force automation, on-line databases and international databases. New ideas in the field are integrated including entrepreneurship, auditioning and small business decision-making. Special emphasis is placed on decision-making regarding distribution channels and conflict resolution strategies. There are also case studies which deal with international problems such as international transportation, communicating with subsidiaries in other nations, the propriety of gifts or bribes and problems of foreign companies in general.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/11/02/9780134571102.jpg', 'title_long': 'Industrial Marketing: Analysis, Planning, and Control', 'edition': 'Subsequent', 'dimensions': 'Height: 9.75 Inches, Length: 7.5 Inches, Weight: 2.47138195702 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.5}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 2.47138195702}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 670, 'date_published': '1991', 'subjects': ['Business & Money', 'Management & Leadership', 'Marketing & Sales', 'Marketing', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Robert R. Reeder', 'Edward G. Brierty', 'Betty H. Reeder'], 'title': 'Industrial Marketing: Analysis, Planning, and Control', 'isbn13': '9780134571102', 'msrp': 70, 'binding': 'Hardcover', 'isbn': '013457110X', 'isbn10': '013457110X'}}