{'book': {'publisher': 'Prentice Hall', 'synopsis': 'This book addresses every aspect of learning disabilities, from assessment, definition, and characteristics through specific strategies for individual disorders. Based on a multi-theoretical foundation, the new edition of Students with Learning Disabilities integrates numerous philosophical and practical perspectives into a supportive framework of best practices for diagnosis and intervention. A clear presentation of non-teaching factors and their affect upon teaching success explores such topics as homework, class size, parental involvement, and curriculum design. There have also been coverage expansions in topics such as cultural diversity, learning strategies, social skills training, affective development, phonological awareness development, successful transition factors, effective assessment, and teaching strategies. The coverage of social-emotional problems of LD students includes discussions of the use of socio-metric measures -- such as peer status -- in assessment and planning. An updated reference section also helps familiarize readers with the latest available resources. By providing practical strategies, Students with Learning Disabilities is a valuable book for any parent, teacher, or school administrator who must learn to cope with LD students.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/17/62/9780134771762.jpg', 'title_long': 'Students with Learning Disabilities (5th Edition)', 'edition': 'Subsequent', 'dimensions': 'Height: 9.75 Inches, Length: 8 Inches, Weight: 2.86160016076 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 2.86160016076}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 710, 'date_published': '1996', 'subjects': ['Education & Teaching', 'Schools & Teaching', 'Special Education', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Cecil D. Mercer', 'Ann R. Mercer'], 'title': 'Students with Learning Disabilities (5th Edition)', 'isbn13': '9780134771762', 'msrp': 88, 'binding': 'Hardcover', 'isbn': '0134771761', 'isbn10': '0134771761'}}