{'book': {'publisher': 'SIGS', 'synopsis': 'Rapid Software Development with Smalltalk is designed to help the professional software developer write Smalltalk code faster without sacrificing software quality. The book covers the spectrum of OO analysis, design, and implementation techniques and provides a proven process for architecting large software systems. By using detailed examples of an extended Responsibility-Driven Design (RDD) methodology and Smalltalk, readers will find techniques derived from real OO projects that are directly applicable to ongoing projects of any size. By providing proven techniques and tips derived from years of hands-on implementation experience on projects large and small from around the world, the author is able to give readers specific guidelines that could dramatically cut costs and keep projects on schedule. Specifically, the author provides readers with project patterns that work, illustrations of design patterns, OO metrics with example code to test design quality, and, of course, numerous Smalltalk code examples.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/73/72/9780134497372.jpg', 'title_long': 'Rapid Software Development with Smalltalk (SIGS: Advances in Object Technology, Series Number 7)', 'dimensions': 'Height: 9.25 Inches, Length: 7.5 Inches, Weight: 1.00530791472 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.5}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 1.00530791472}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 240, 'date_published': '1998-01-13', 'subjects': ['Computers & Technology', 'Business Technology', 'Computer Science', 'Programming', 'Software Design, Testing & Engineering', 'Software', 'Internet & Social Media', 'E-Commerce', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Mark Lorenz'], 'title': 'Rapid Software Development with Smalltalk (SIGS: Advances in Object Technology, Series Number 7)', 'isbn13': '9780134497372', 'msrp': 40, 'binding': 'Paperback', 'isbn': '0134497376', 'isbn10': '0134497376'}}