{'book': {'publisher': 'Pearson College Div', 'synopsis': 'This is the first comprehensive book to approach professional issues in counseling from an ethical perspective and legal viewpoint. It addresses difficult subjects in a direct manner, and offers practical, realistic advice for practicing counselors. A clear explanation of the necessary credentials for counseling is also provided?including licensing, state certification, and national certification. Substantial sections are devoted to crucial areas?such as ensuring client confidentiality, keeping appropriate records, responding to subpoenas, dealing with clients who are a danger to themselves or others, counseling minors, and maintaining proper boundaries with clients and students. Coverage of cutting edge issues includes ensuring a diversity-sensitive practice, dealing with managed care problems, utilizing technology, and supervising properly. Model agreements that counselors can use and adapt for practice are supplied in all of the following areas: private practice, schools, agencies that serve mandated clients, evaluation situations, and community mental health agencies. For counselors in training and for counseling practitioners.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/71/87/9780135737187.jpg', 'title_long': 'Ethical, Legal, and Professional Issues in Counseling', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 7.5 Inches, Weight: 2.20462262 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 2.20462262}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 376, 'date_published': '2000-07-25', 'subjects': ['Health, Fitness & Dieting', 'Psychology & Counseling', 'Law', 'Ethics & Professional Responsibility', 'Medical Books', 'Psychology', 'General', 'Politics & Social Sciences', 'Philosophy', 'Ethics & Morality', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Theodore P., Jr. Remley', 'Barbara Herlihy'], 'title': 'Ethical, Legal, and Professional Issues in Counseling', 'isbn13': '9780135737187', 'msrp': 46, 'binding': 'Paperback', 'isbn': '0135737184', 'isbn10': '0135737184'}}