{'book': {'publisher': 'Prentice Hall', 'synopsis': "Product Description      <br/>A user-friendly, practical guide to starting and running a successful mail order operation. Describes what sells best through mail order, how to target prospective buyers, how to manage the new business and how to market through direct mail, print ads as well as TV and radio advertising. This revised, updated and expanded edition covers using a PC, telemarketing, promotion and publicity and more on direct marketing. The appendix contains examples of filled-out federal income tax forms.<br/>      From the Back Cover      <br/>Serious about getting started in the mail order business?<br/>This bestselling guide shows how to maximize your chances for success!<br/>Mail ORDER selling<br/>How to Market Almost Anything by Mail<br/>There's no doubt about it: mail order is one of today's fastest growing business sectors—a trend that forecasters say will continue well into the next century. But to succeed in it you need all the expert guidance you can get. And that's why thousands of entrepreneurs have turned to Irving Burstiner's Mail Order Selling for practical, nuts-and-bolts advice on how to start and run a thriving mail order business. Mail Order Selling guides you through the ins and outs of mail order, shows you the tricks of the trade, and covers important details you might not be aware of. With this indispensable guide you'll learn:<br/><br/>All the fundamentals of launching a mail order operation, including how to draw up a detailed business plan<br/>What sells best by mail, how to target markets, and how to market through direct mail, print ads, telemarketing, radio, and TV<br/>How to locate the financing you need to get started<br/>How to design and produce print advertising, including techniques for writing eye-catching headlines and ad copy that sells<br/>How to choose the form of ownership most advantageous to you, including model legal forms and tax returns for each—material not found in competing books<br/>How to set up your operations center and use a computer to keep your business organized and efficient<br/>How to stay afloat by keeping your eye on certain financial ratios—and how to perform a simple procedure that will stave off cash flow problems<br/><br/>Comprehensive, easy-to-follow, and packed with valuable information, Mail Order Selling is the one book you need to help you achieve success.<br/>      About the Author      <br/>IRVING BURSTINER, PhD, has more than twenty-five years experience in marketing and sales. He has been a tenured professor of marketing at Baruch College and is the author or coauthor of seven business books, including The Small Business Handbook and Start and Run Your Own Profitable Service Business.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/84/88/9780135458488.jpg', 'title_long': 'Mail Order Selling: How to Market Almost Anything by Mail', 'dimensions': 'Weight: 1.1 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 1.1}}, 'pages': 255, 'date_published': '1982-09', 'subjects': ['Business & Money', 'Industries', 'Retailing', 'Management & Leadership'], 'authors': ['Irving Burstiner'], 'title': 'Mail Order Selling: How to Market Almost Anything by Mail', 'isbn13': '9780135458488', 'msrp': 1.99, 'binding': 'Paperback', 'isbn': '013545848X', 'isbn10': '013545848X'}}