{'book': {'publisher': 'Prentice Hall', 'synopsis': 'The most trusted general chemistry text in Canada is back in a thoroughly revised 11thedition. "General Chemistry: Principles and Modern Applications," is the most trusted book on the market recognized for its superior problems, lucid writing, and precision of argument and precise and detailed and treatment of the subject. The 11th edition offers enhanced hallmark features, new innovations and revised discussions that that respond to key market needs for detailed and modern treatment of organic chemistry, embracing the power of visual learning and conquering the challenges of effective problem solving and assessment.<br/>Note: You are purchasing a standalone product; MasteringChemistry does not come packaged with this content. Students, if interested in purchasing this title withMasteringChemistry, ask your instructor for the correct package ISBN and Course ID. Instructors, contact your Pearson representative for more information. If you would like to purchase both the physical text andMasteringChemistry, search for:<br/>0134097327 / 9780134097329General Chemistry: Principles and Modern Applications Plus MasteringChemistry with Pearson eText -- Access Card Package, 11/e<br/>Package consists of:<br/>0132931281 / 9780132931281General Chemistry: Principles and Modern Applications 0133387917 / 9780133387919 Study Card for General Chemistry: Principles and Modern Applications 0133387801 / 9780133387803MasteringChemistry with Pearson eText -- Valuepack Access Card -- for General Chemistry: Principles and Modern Applications<br/>"', 'language': 'en', 'image': 'https://images.isbndb.com/covers/49/80/9780135334980.jpg', 'title_long': 'General Chemistry: Principles and Modern Applications (7th Edition)', 'edition': '7th Edition', 'dimensions': 'Height: 10.31494 Inches, Length: 8.2677 Inches, Weight: 4.64293523772 Pounds, Width: 1.5748 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.2677}, 'width': {'unit': 'inches', 'value': 1.5748}, 'weight': {'unit': 'pounds', 'value': 4.64293523772}, 'height': {'unit': 'inches', 'value': 10.31494}}, 'pages': 1077, 'date_published': '1996', 'subjects': ['Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Ralph H. Petrucci'], 'title': 'General Chemistry: Principles and Modern Applications (7th Edition)', 'isbn13': '9780135334980', 'msrp': 120, 'binding': 'Hardcover', 'isbn': '0135334985', 'isbn10': '0135334985'}}