{'book': {'publisher': 'Pearson', 'synopsis': "The Courts in Our Criminal Justice System presents a unique historical context on the development, functions, and controversies in the courts system that is lacking in other courts books, while simultaneously presenting the most current theory, research, and examples on the topic. This broad, temporally inclusive approach to the study of the courts will help provide the “big picture” framework necessary for readers to understand the modern American criminal courts process. A Society Designs Laws; A Crime is Committed; After Arrest: Law, the Court, and Post-Arrest Procedures; The Courts Get Involved (The History of Courts and the Arrangement of Modern Courts; A Prosecutor Considers the Charges; A Defense Lawyer is Selected: The Defense Role; A Judge is Assigned to Hear the Case; Jurors and Other Key Participants in the Courtroom Play Their Roles; Some Cases Don't Make It to Court; “You Ring, We Spring” : The Role of Bail in the Court System; Plea Bargaining; Your Day in Court: The Trial Begins; The Punishment Dilemma; $30 or 30 Days: Setting the Penalty; Appeals; Juvenile Courts.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/95/73/9780135259573.jpg', 'title_long': 'The Courts in Our Criminal Justice System', 'edition': '1', 'dimensions': 'Height: 9.2 Inches, Length: 7 Inches, Weight: 0.551155655 Pounds, Width: 1.3 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 1.3}, 'weight': {'unit': 'pounds', 'value': 0.551155655}, 'height': {'unit': 'inches', 'value': 9.2}}, 'pages': 544, 'date_published': '2002-07-29', 'subjects': ['Law', 'Criminal Law', 'Law Enforcement', 'Legal Theory & Systems', 'Jurisprudence', 'Politics & Social Sciences', 'Politics & Government', 'Specific Topics', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ["Jon'a F. Meyer", 'Diana R. Grant'], 'title': 'The Courts in Our Criminal Justice System', 'isbn13': '9780135259573', 'msrp': 173.32, 'binding': 'Paperback', 'isbn': '0135259576', 'isbn10': '0135259576'}}