{'book': {'publisher': 'Pearson', 'synopsis': "NOTE: Before purchasing, check with your instructor to ensure you select the correct ISBN. Several versions of the MyLab™ and Mastering™ platforms exist for each title, and registrations are not transferable. To register for and use MyLab or Mastering, you may also need a Course ID, which your instructor will provide.<br/><br/>Used books, rentals, and purchases made outside of Pearson<br/>If purchasing or renting from companies other than Pearson, the access codes for the MyLab platform may not be included, may be incorrect, or may be previously redeemed. Check with the seller before completing your purchase.<br/><br/>For courses or sequences that cover topics from Prealgebra, Introductory Algebra, and Intermediate Algebra.<br/>This package includes MyLab Math.<br/><br/>The Martin-Gay principle: Every student can succeed<br/>Elayn Martin-Gay’s student-centric approach is woven seamlessly throughout her texts and MyLab™ courses, giving students the optimal amount of support through effective video resources, an accessible writing style, and study skills support built into the program.<br/><br/>This revision of Martin-Gay's worktext series continues her focus on students with new and improved resources to support student success. Algebra Foundations, 2nd Edition is a comprehensive All in One program that offers everything needed to teach Prealgebra, Introductory Algebra, and Intermediate Algebra in one easy-to-use solution. Three courses’ worth of material, in one seamless MyLab Math course and text, allows instructors to pick and choose what content they want to cover and when they want to cover it. This content is designed to work for any course format, and can even be used in a corequisite course―giving instructors a library of review material to support a credit-level corequisite course.<br/><br/>Two choices for a MyLab course provide options when it comes to assignments and interactivity; time-based access options make accessing the content flexible and keeps the course completely customizable. Elayn Martin-Gay’s signature approach is integrated throughout the MyLab to ensure a completely consistent experience from print to MyLab.<br/><br/>Personalize learning with MyLab Math<br/>By combining trusted author content with digital tools and a flexible platform, MyLab personalizes the learning experience and improves results for each student. Bringing Elayn Martin-Gay’s voice and approach into the MyLab course ― though video resources, study skills support, and exercises refined with each edition ― gives students the support to be successful in math.<br/><br/>0135859840 / 9780135859841 Algebra Foundations: Prealgebra, Introductory Algebra & Intermediate Algebra -- Life of Edition Standalone Access Card Plus Video Organizer, 2/e<br/><br/>Package consists of: 0135240085 / 9780135240083 Video Organizer for Algebra Foundations<br/>0135758076 / 9780135758076 MyLab Math with Pearson eText - Life of Edition Standalone Access Card - for Algebra Foundations", 'language': 'en', 'image': 'https://images.isbndb.com/covers/98/41/9780135859841.jpg', 'title_long': 'A Mixed Bag: A contemporary collection for understanding and response', 'edition': '2', 'dimensions': 'Height: 11 Inches, Length: 8.6 Inches, Weight: 10.049 Pounds, Width: 3.3 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.6}, 'width': {'unit': 'inches', 'value': 3.3}, 'weight': {'unit': 'pounds', 'value': 10.049}, 'height': {'unit': 'inches', 'value': 11}}, 'pages': 263, 'date_published': '2019-10-08', 'subjects': ['Reference', 'Words, Language & Grammar', 'Rhetoric', 'Science & Math', 'Mathematics', 'Pure Mathematics', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Elayn Martin-Gay'], 'title': 'A Mixed Bag: A contemporary collection for understanding and response', 'isbn13': '9780135859841', 'msrp': 295.87, 'binding': 'Paperback', 'related': {'Page Fidelity': '0135257506', 'eBook': '0135257506'}, 'isbn': '0135859840', 'isbn10': '0135859840', 'other_isbns': [{'isbn': '9780135257500', 'binding': 'print'}]}}