{'book': {'publisher': 'Prentice Hall Press', 'synopsis': "Here are hundreds of business-tested ideas, strategies, and techniques that demonstrate exactly what to do and what to say to make dealing with your staff, colleagues, and customers easier. You'll discover, for example, how to earn the respect for your ideas and initiatives; get unwilling subordinates to pitch in during crunch times; build goodwill with demanding clients and customers; get more done with your staff - and increase their level of job satisfaction; respond effectively to the problems your subordinates raise; handle disagreements with your boss without damaging your career; and much more.<br/>Plus, you'll find the four distinct initial mindsets from which people tend to operate on the job, as well as some of the major human motivators that will help you get the cooperation you need to meet - and exceed - your goals.<br/>Dealing with people, even difficult people, doesn't have to be a matter of making nerve-shredding concessions or enduring nightmare-inducing meetings. Once you practice the proven techniques outlined in this guide, you'll interact with subordinates and superiors more constructively ... and be seen as a manager on the fast track that consistently achieves good results.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/65/15/9780135206515.jpg', 'title_long': 'The Art and Skill of Dealing with People: Hundreds of Sure Fire Techniques for Getting Your Way with People at Work', 'dimensions': 'Height: 9.25 Inches, Length: 7 Inches, Weight: 1.4 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.4}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 352, 'date_published': '1997-07-25', 'subjects': ['Business & Money', 'Business Culture', 'Image & Etiquette', 'Processes & Infrastructure', 'Customer Relations'], 'authors': ['Brandon Toropov'], 'title': 'The Art and Skill of Dealing with People: Hundreds of Sure Fire Techniques for Getting Your Way with People at Work', 'isbn13': '9780135206515', 'msrp': 16.95, 'binding': 'Paperback', 'isbn': '0135206510', 'isbn10': '0135206510'}}