{'book': {'publisher': 'Jossey-Bass', 'synopsis': 'Written by an experienced school psychologist, this unique resource gives classroom teachers and specialists at all levels the key information and practical stategies they need to recognize and respond effectively to 30 of the most common problems encountered in today\'s classroom, including: ACADEMIC PROBLEMS: Auditory Processing Problem · The ESL Student · The Gifted Student · Handwriting Problem · Math Anxiety · Mild Mental Retardation · Reading Disability · Speech and Language Problems · Spelling Problem · The unmotivated Student BEHAVIORAL PROBLEMS: The Aggressive Student · Attention Deficit Disorder · Autism · The Disorganized Student · The Disruptive Student · Low Seld-Esteem · The Perfectionist Student · The School Phobic Student · The Shy Student · Stuttering PHYSICAL PROBLEMS: AIDS and HIV · Asthma · Cerebral Palsy · Cystic Fibrosis · Diabetes · Epilepsy · Hearing Impairment · Spina Bifida · Tourette Syndrome · Visual Impairment For easy use, each of the 30 problems is covered in a different chapter. Each chapter provides background information for understanding the nature and causes of the problem, a menu of strategies for dealing with the problem that can be practically implemented in the classroom given time constraints and the demandsof other students, specific references for further information, and addresses of relevant organizations. For example, in the chapter on "Speech and Language Problems" you\'ll find: Key information on TYPES OF COMMUNICATION PROBLEMS, CAUSES, SCHOOL IMPACT, and SPEECH AND LANGUAGE THERAPY HOW TEACHERS CAN HELP, including 18 specific stategies for improving the student\'s skills (e.g., "Emphasize Correct Language Expression Without Correcting the Student") as well as supporting the student emotionally (e.g., "Reassure the Student Privately about Her Speech"). Additional sources of help in FOR FURTHER INFORMATION (other publications), ORGANIZATIONS, and SEE ALSO (other related chapters) And the chapter on "The Aggressive Student" explains THE PSYCHOLOGY OF THE BULLY, provides background for UNDERSTANDING THE VICTIM, and offers 24 specific intervention strategies, such as "Coach Students in How to Respond to Teasing or Taunting" and Try to Connect with the Student [Bully] Rather tha Control Him." In short, the SPECIAL KIDS PROBLEM SOLVER gives teachers a store of proven stategies for dealing promptly and effectively with 30 of the most common problems encountered in today\'s regular and special classrooms. It allows teachers to choose the one or more strategies that seem best suit their own and students\' particular needs.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/53/07/9780136325307.jpg', 'title_long': 'Special Kids Problem Solver: Ready-to-Use Interventions for Helping All Students with Academic, Behavioral & Physical Problems', 'edition': '1', 'dimensions': 'Height: 9 inches, Length: 7.75 inches, Weight: 1.65 Pounds, Width: 1 inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.75}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.65}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 366, 'date_published': '1998-09-28', 'subjects': ['Science & Math', 'Behavioral Sciences', 'Education & Teaching', 'Schools & Teaching', 'Education Theory', 'Special Education'], 'authors': ['Kenneth Shore'], 'title': 'Special Kids Problem Solver: Ready-to-Use Interventions for Helping All Students with Academic, Behavioral & Physical Problems', 'isbn13': '9780136325307', 'msrp': 29.95, 'binding': 'Paperback', 'isbn': '0136325300', 'isbn10': '0136325300'}}