{'book': {'publisher': 'Pearson', 'synopsis': 'This book presents a clear and philosophically sound method for identifying, interpreting, and evaluating arguments as they appear in non-technical sources. It focuses on a more functional, real-world goal of argument analysis as a tool for figuring out what is reasonable to believe rather than as an instrument of persuasion. Develops a precise, step-by-step method for analyzing arguments about a variety of topics -- shows how to rewrite arguments in a format that makes them clearer and makes their evaluation easier; and then how to evaluate the rewritten argument. Illustrates methods by applying them to both serious and humorous arguments about different topics as they appear in a variety of contexts — e.g., newspaper and magazine editorials and columns, short essays, informal reports of scientific results, etc. Uses simple, relatively non-controversial examples to illustrate the basic ideas and concepts, and then offers more complicated and controversial examples for challenging applications. For anyone interested in identifying, interpreting, and evaluating arguments as they appear in non- technical sources.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/60/22/9780136246022.jpg', 'title_long': 'Reason & Argument (2nd Edition)', 'edition': '2', 'dimensions': 'Height: 9.15 Inches, Length: 7 Inches, Weight: 1.433004703 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.433004703}, 'height': {'unit': 'inches', 'value': 9.15}}, 'pages': 480, 'date_published': '1998-06-22', 'subjects': ['Politics & Social Sciences', 'Philosophy', 'Logic & Language', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Richard Feldman'], 'title': 'Reason & Argument (2nd Edition)', 'isbn13': '9780136246022', 'msrp': 173.32, 'binding': 'Paperback', 'isbn': '0136246028', 'isbn10': '0136246028'}}