{'book': {'publisher': 'Prentice Hall', 'synopsis': 'B> Most books on operating systems deal with theory while ignoring practice. While the usual principles are covered in detail, the book describes a small, but real UNIX-like operating system: MINIX. The book demonstrates how it works while illustrating the principles behind it. Operating Systems: Design and Implementation Second Edition provides the MINIX source code. The relevant selections of the MINIX code are described in detail. When it first came out, MINIX caused something of a revolution. Within weeks, it had its own newsgroup on USENET, with 40,000 people. Most wanted to make MINIX bigger and fancier. Instead, Linux was created. That has become quite popular, very large, and complicated. MINIX, on the other hand, has remained small and suitable for instruction and example. The book has been revised to include updates in MINIX, which started out as a v 7 unix clone for a floppy-disk only 8088. It is now aimed at 386, 486, and pentium machines and is based on the international posix standard instead of on v7. There are now also versions of MINIX for the Macintosh and SPARC available. Professional programmers will find this book to be a valuable resource and reference', 'language': 'en', 'image': 'https://images.isbndb.com/covers/67/73/9780136386773.jpg', 'title_long': 'Operating Systems: Design and Implementation (Second Edition)', 'edition': '2nd', 'dimensions': 'Height: 9.5 Inches, Length: 7.75 Inches, Weight: 3.48771298484 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.75}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 3.48771298484}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 939, 'date_published': '1997-01-15', 'subjects': ['Computers & Technology', 'Operating Systems', 'Programming', 'APIs & Operating Environments', 'Software', 'Science & Math', 'Mathematics', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Andrew S. Tanenbaum', 'Albert S. Woodhull'], 'title': 'Operating Systems: Design and Implementation (Second Edition)', 'isbn13': '9780136386773', 'msrp': 103, 'binding': 'Hardcover', 'isbn': '0136386776', 'isbn10': '0136386776'}}