{'book': {'publisher': 'Ft Pr', 'synopsis': 'Are you responsible for reinvigorating your brand to achieve enduring profitable growth? Or for keeping your still-strong brand from fading in relevance and value? This extraordinary book teaches the invaluable lessons of one of the most successful brand revitalization projects in business history: the reinvigoration of McDonald’s®. Larry Light, the Global Chief Marketing Officer who spearheaded McDonald’s breakthrough marketing initiatives, presents a systematic blueprint for resurrecting any brand, and driving it to unprecedented levels of success. Light and coauthor Joan Kiddon illuminate their blueprint with specific examples from McDonald’s experience, offering detailed “dos” and “don’ts” for everything from market segmentation to R&D to executive leadership. You’ll discover how to refocus your entire organization around common goals and a common brand promise...restore brand relevance based on a profound knowledge of your customers...and reinvent your total brand experience, leveraging innovation, renovation, marketing, and value. Light and Kiddon reveal how to define and measure progress, rebuild brand trust within and outside the organization, create a “plan to win,” and execute on it!<br/><br/>Revitalize your brand, in six steps! Learn how to... Refocus Your Entire Organization Restore Your Brand’s Relevance Reinvent Your Brand Experience Reinforce an End-to-End “Results Culture” Rebuild Brand Trust Realize Global Alignment', 'language': 'en', 'image': 'https://images.isbndb.com/covers/33/17/9780136043317.jpg', 'title_long': "Six Rules for Brand Revitalization: Learn How Companies Like McDonald's Can Re-Energize Their Brands", 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6.25 Inches, Weight: 1.0141252 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 1.0141252}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 218, 'date_published': '2009', 'subjects': ['Business & Money', 'Marketing & Sales', 'Marketing'], 'authors': ['Larry Light', 'Joan Kiddon'], 'title': "Six Rules for Brand Revitalization: Learn How Companies Like McDonald's Can Re-Energize Their Brands", 'isbn13': '9780136043317', 'msrp': 39.99, 'binding': 'Hardcover', 'related': {'ePub': '0137005857'}, 'isbn': '0136043313', 'isbn10': '0136043313', 'other_isbns': [{'isbn': '9780137005857', 'binding': 'print'}]}}