{'book': {'publisher': 'Pearson College Div', 'synopsis': 'Building on decades of authoritative scholarship, this completely updated text continues to offer accessible, carefully crafted, and straightforward coverage of the foundations of American politics, as well consistent focus on the achievements of a government by the people<br/><br/>In an increasingly cynical world, GBTP emphasizes that politics matters and encourages, motivates, and even inspires students\x96with accounts of individual and collective acts of courageousness, intellect, and integrity in the political arena\x96to be effective and informed citizens.<br/><br/>With each chapter now framed by nationally-selected learning objectives and chapter mastery self-tests, several compelling new features, and an all new contemporary design, this thoroughly updated Twenty-Third Edition continues in the book\x92s long tradition for excellence. The Alternate Edition includes the exact same coverage as the comprehensive version but without the chapters on policy. As we enter this very complex political era, there is no more reliable or more relevant text to help you advance your students from being simple onlookers to knowledgeable participants in the American political experience.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/04/07/9780136050407.jpg', 'title_long': 'Government By the People 2009', 'edition': 'Alternate', 'dimensions': 'Height: 10.5 Inches, Length: 8.5 Inches, Weight: 2.6 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 2.6}, 'height': {'unit': 'inches', 'value': 10.5}}, 'pages': 524, 'date_published': '2008', 'subjects': ['Politics & Social Sciences', 'Politics & Government', 'United States', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['David B. Magleby', 'Paul C. Light'], 'title': 'Government By the People 2009', 'isbn13': '9780136050407', 'msrp': 138.4, 'binding': 'Paperback', 'isbn': '0136050409', 'isbn10': '0136050409'}}