{"book": {"publisher": "Penguin Classics", "synopsis": "John Milton"s celebrated epic poem exploring the cosmological, moral and spiritual origins of man"s existence<br/><br/>A Penguin Classic<br/><br/>In Paradise Lost Milton produced poem of epic scale, conjuring up a vast, awe-inspiring cosmos and ranging across huge tracts of space and time, populated by a memorable gallery of grotesques. And yet, in putting a charismatic Satan and naked, innocent Adam and Eve at the centre of this story, he also created an intensely human tragedy on the Fall of Man. Written when Milton was in his fifties - blind, bitterly disappointed by the Restoration and in danger of execution - Paradise Lost"s apparent ambivalence towards authority has led to intense debate about whether it manages to 'justify the ways of God to men', or exposes the cruelty of Christianity.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.', 'language": "en", "image": "https: //images.isbndb.com/covers/43/93/9780140424393.jpg", "title_long": "Paradise Lost (Penguin Classics)", "edition": "1", "dimensions": "Height: 1 Inches, Length: 7.7 Inches, Weight: 0.77382253962 Pounds, Width: 5.1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.7}, "width": {"unit": "inches", "value": 5.1}, "weight": {"unit": "pounds", "value": 0.77382253962}, "height": {"unit": "inches", "value": 1}}, "pages": 512, "date_published": "2003-04-29", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'History & Criticism', 'Movements & Periods', 'Poetry', 'Regional & Cultural', 'Themes & Styles', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["John Milton'], 'title": "Paradise Lost (Penguin Classics)", "isbn13": "9780140424393", "msrp": 9.33, 'binding": "Paperback", "isbn": "0140424393", "isbn10": "0140424393"}}