{"book": {"publisher": "Penguin Classics", "synopsis": '‘The Master said, “If a man sets his heart on benevolence, he will be free from evil”’<br/><br/>The Analects are a collection of Confucius’s sayings brought together by his pupils shortly after his death in 497 BC. Together they express a philosophy, or a moral code, by which Confucius, one of the most humane thinkers of all time, believed everyone should live. Upholding the ideals of wisdom, self-knowledge, courage and love of one’s fellow man, he argued that the pursuit of virtue should be every individual’s supreme goal. And, while following the Way, or the truth, might not result in immediate or material gain, Confucius showed that it could nevertheless bring its own powerful and lasting spiritual rewards.<br/><br/>This edition contains a detailed introduction exploring the concepts of the original work, a bibliography and glossary and appendices on Confucius himself, The Analects and the disciples who compiled them.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,
        700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https: //images.isbndb.com/covers/34/86/9780140443486.jpg", "title_long": "The Analects (Penguin Classics)", "edition": "First Edition", "dimensions": "Height: 7.76 Inches, Length: 5.09 Inches, Weight: 0.42328754304 Pounds, Width: 0.56 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.09}, "width": {"unit": "inches", "value": 0.56}, "weight": {"unit": "pounds", "value": 0.42328754304}, "height": {"unit": "inches", "value": 7.76}}, "pages": 160, "date_published": "1998-09-03", "subjects": ["Religion & Spirituality', 'Other Eastern Religions & Sacred Texts', 'Confucianism', 'Politics & Social Sciences', 'Philosophy', 'Eastern', 'Movements', 'Individual Philosophers'], 'authors": ["Confucius'], 'title": "The Analects (Penguin Classics)", "isbn13": "9780140443486", "msrp": 12, 'binding": "Paperback", "isbn": "0140443487", "isbn10": "0140443487"}}