{"book": {"publisher": "Penguin Classics", "synopsis": 'The final volume in a brilliant translation destined to take its place among the great English versions of The Divine Comedy<br/><br/>In his translation of Paradise, Mark Musa exhibits the same sensitivity to language and knowledge of translation that enabled his versions of Inferno and Purgatory to capture the vibrant power and full dramatic force of Dante’s poetry. Dante relates his mystical interpretation of the heavens, and his moment of transcendent glory, as he journeys, first with Beatrice, then alone, toward the Trinity. Professor Musa’s extraordinary translation and his interpretive commentary, informative glossary, and bibliography clarify the theological themes and make Dante accessible to the English-speaking public.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,
        700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https: //images.isbndb.com/covers/44/38/9780140444438.jpg", "title_long": "The Divine Comedy, Vol. 3: Paradise", "edition": "Reprint", "dimensions": "Height: 7.72 Inches, Length: 5.1 Inches, Weight: 0.69666074792 Pounds, Width: 0.83 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.1}, "width": {"unit": "inches", "value": 0.83}, "weight": {"unit": "pounds", "value": 0.69666074792}, "height": {"unit": "inches", "value": 7.72}}, "pages": 464, "date_published": "1986-02-04", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Poetry', 'Ancient, Classical & Medieval', 'Regional & Cultural', 'Themes & Styles', 'Ancient & Medieval Literature', 'Self Service', 'Custom Stores'], 'authors": ["Dante Alighieri'], 'title": "The Divine Comedy, Vol. 3: Paradise", "isbn13": "9780140444438", "msrp": 18, "binding": "Paperback", "isbn": "0140444432", "isbn10": "0140444432", "other_isbns": [{'isbn": "9781101117996", "binding": "print"}]}}