{"book": {"publisher": "Penguin", "synopsis": 'Winner of the National Book Critics Circle Award in Criticism<br/><br/>The first comprehensive selection in any language of the non-fiction--much of it appearing here in English for the first time--of “one of literature’s most fertile and original minds” (San Francisco Chronicle)<br/><br/>A Penguin Classics Deluxe Edition with flaps and deckle-edged paper<br/><br/>It will come as a surprise to many readers that the greater part of Jorge Luis Borges’s extraordinary writing was not in the genres of fiction or poetry, but in various forms of non-fiction prose. His thousands of pages of essays, reviews, prologues, lectures, and notes on politics and culture—though revered in Latin America and Europe as among his finest work—have scarcely been translated into English.<br/><br/>Selected Non-Fictions presents a Borges almost entirely unknown to American readers. Here is the dazzling metaphysician speculating on the nature of time and reality and the inventions of heaven and hell, and the almost superhumanly erudite reader of the world’s literatures, from Homer to Ray Bradbury, James Joyce to Lady Murasaki. Here, too, the political Borges, taking courageous stands against fascism, antisemitism, and the Perón dictatorship; Borges the movie critic, on King Kong and Citizen Kane and the Borgesian art of dubbing; and Borges the regular columnist for the Argentine equivalent of the Ladies’ Home Journal, writing hilarious book reviews and capsule biographies of modern writers.<br/><br/>Like the Aleph in his famous story—the magical point in a basement in Buenos Aires from which one can view everything in the world—Borges’s non-fictions are a vortex for seemingly the entire universe: Dante and Ellery Queen, Shakespeare and the Kabbalah, the history of angels and the history of tango, the Buddha, Bette Davis, and the Dionne Quints.<br/><br/>Selected Non-Fictions presents more than 160 of these astonishing writings, from his youthful manifestos to his last meditations on his favorite books. More than a hundred of these pieces have never before appeared in English, and all have been rendered in brilliant new translations by Esther Allen, Suzanne Jill Levine, and Eliot Weinberger. This unique selection presents Borges as at once a deceptively self-effacing guide to the universe and the inventor of a universe that is an indispensable guide to Borges.<br/><br/>For more than seventy-five years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 2,
        000 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https: //images.isbndb.com/covers/01/10/9780140290110.jpg", "title_long": "Borges: Selected Non-Fictions", "dimensions": "Height: 1.6 Inches, Length: 8.3 Inches, Weight: 1.35 pounds, Width: 5.6 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.3}, "width": {"unit": "inches", "value": 5.6}, "weight": {"unit": "pounds", "value": 1.35}, "height": {"unit": "inches", "value": 1.6}}, "pages": 576, "date_published": "2000-11-01", "subjects": ["Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Literature & Fiction', 'Essays & Correspondence', 'Essays', 'History & Criticism', 'Criticism & Theory', 'Regional & Cultural', 'Short Stories & Anthologies', 'Anthologies', 'World Literature', 'Caribbean & Latin American', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Jorge Luis Borges'], 'title": "Borges: Selected Non-Fictions", "isbn13": "9780140290110", "msrp": 26, 'binding": "Paperback", "isbn": "0140290117", "isbn10": "0140290117"}}