{"book": {"publisher": "Penguin Books", "synopsis": "The Soldiers" Tale is the story of modern wars as told by the men who did the actual fighting. Hynes examines the journals, memoirs, and letters of men who fought in the two World Wars and in Vietnam, and also the wars fought against the weak and helpless in concentration camps, prisoner-of-war camps, and bombed cities.<br/><br/>Interweaving his own reflections on war with brilliantly chosen passages from soldiers" accounts, he offers vivid answers to the question we all ask of men who have fought: What was it like? In these powerful pages the experiences of modern war, which seem unimaginable to those who weren"t there, become comprehensible and real.<br/><br/>The wide range of writers examined includes both famous literary memoirists like Robert Graves, Tim O'Brien, and Elie Wiesel, and unknown soldiers who wrote only their war stories. Using these testimonies, Hynes considers each war in terms of its special circumstances and its effects on men who fought. His understanding of the psychology of warfare—and of each war's role in history—gives this study its intellectual authority; the voices of the men who were there, and wrote about what they saw and felt, give it its powerful dramatic impact.', 'language": "en", "image": "https: //images.isbndb.com/covers/15/47/9780140261547.jpg", "title_long": "The Soldiers" Tale: Bearing Witness to a Modern War", 'edition": "Reprint", "dimensions": "Height: 7.71 Inches, Length: 5.1 Inches, Weight: 0.6 Pounds, Width: 0.73 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.1}, "width": {"unit": "inches", "value": 0.73}, "weight": {"unit": "pounds", "value": 0.6}, "height": {"unit": "inches", "value": 7.71}}, "pages": 336, "date_published": "1998-04-01", "subjects": ["Biographies & Memoirs', 'Leaders & Notable People', 'Military', 'History', 'Intelligence & Espionage', 'World War II', 'World', 'Self Service', 'Custom Stores'], 'authors": ["Samuel Hynes'], 'title": "The Soldiers" Tale: Bearing Witness to a Modern War", 'isbn13": "9780140261547", "msrp": 17, "binding": "Paperback", "related": {"ePub": "1101191724"}, "isbn": "0140261540", "isbn10": "0140261540", "other_isbns": [{'isbn": "9781101191729", "binding": "print"}]}}