{"book": {"publisher": "Penguin Books", "synopsis": "* What does the shape of your head and your hands tell about your personality?<br/>* Are you left-brain or right-brain dominant? Yin or yang?<br/>* What is your spiritual tendency?<br/>* Are you sanguine, melancholic, choleric, or phlegmatic?<br/>* Which is your most essential element--wood, fire, earth, metal, or water?<br/>* Are you a sensualist, romantic, or courtesan?<br/><br/>Created by a renowned artist/illustrator, this beautiful and practical book contains one hundred and one intriguing, easy to follow, and often amusing devices that will help readers determine their abilities, personality type, psychological strategies, and deeper potential. As fun to use as it is profound in its revelations, Who Are You? is drawn from ancient teachings and contemporary findings. The "tests" it contains are divided into four sections--the body, the emotions, the intellect, and the spirit. The result is one hundred and one separate identity mirrors that work together to give readers a comprehensive self-portrait that is both revealing and informative.", 'language": "en", "image": "https: //images.isbndb.com/covers/60/92/9780140196092.jpg", "title_long": "Who Are You?: 101 Ways of Seeing Yourself (Compass)", "edition": "First American Edition", "dimensions": "Height: 8.75 Inches, Length: 8.5 Inches, Weight: 1.62 Pounds, Width: 0.75 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.5}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 1.62}, "height": {"unit": "inches", "value": 8.75}}, "pages": 224, "date_published": "2000-01-01", "subjects": ["Self-Help', 'Personal Transformation', 'Health, Fitness & Dieting', 'Psychology & Counseling', 'Personality', 'Religion & Spirituality', 'New Age & Spirituality', 'Spiritualism'], 'authors": ["Malcolm Godwin'], 'title": "Who Are You?: 101 Ways of Seeing Yourself (Compass)", "isbn13": "9780140196092", "msrp": 25, 'binding": "Paperback", "isbn": "0140196099", "isbn10": "0140196099"}}