{"book": {"publisher": "Penguin Classics", "synopsis": 'In his most famous and controversial book, Utopia, Thomas More imagines a perfect island nation where thousands live in peace and harmony, men and women are both educated, and all property is communal. Through dialogue and correspondence between the protagonist Raphael Hythloday and his friends and contemporaries, More explores the theories behind war, political disagreements, social quarrels, and wealth distribution and imagines the day-to-day lives of those citizens enjoying freedom from fear, oppression, violence, and suffering. Originally written in Latin, this vision of an ideal world is also a scathing satire of Europe in the sixteenth century and has been hugely influential since publication, shaping utopian fiction even today.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,
        700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https: //images.isbndb.com/covers/91/05/9780140449105.jpg", "title_long": "Utopia (Penguin Classics)", "edition": "Revised ed.", "dimensions": "Height: 7.75 Inches, Length: 0.4 Inches, Weight: 0.29541943108 Pounds, Width: 5.07 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 0.4}, "width": {"unit": "inches", "value": 5.07}, "weight": {"unit": "pounds", "value": 0.29541943108}, "height": {"unit": "inches", "value": 7.75}}, "pages": 176, "date_published": "2003-05-06", "subjects": ["Literature & Fiction', 'Classics', 'United States', 'Literary', 'Reference', 'Foreign Language Study & Reference', 'Politics & Social Sciences', 'Philosophy', 'Political', 'Politics & Government', 'Ideologies & Doctrines', 'Political Science'], 'authors": ["Thomas More'], 'title": "Utopia (Penguin Classics)", "isbn13": "9780140449105", "msrp": 10, 'binding": "Paperback", "isbn": "0140449108", "isbn10": "0140449108"}}