{"book": {"publisher": "Penguin Classics", "synopsis": "Turgenev"s first major prose work is a series of twenty-five Sketches: the observations and anecdotes of the author during his travels through Russia satisfying his passion for hunting. His album is filled with moving insights into the lives of those he encounters - peasants and landowners, doctors and bailiffs, neglected wives and bereft mothers - each providing a glimpse of love, tragedy, courage and loss, and anticipating Turgenev"s great later works such as First Love and Fathers and Sons. His depiction of the cruelty and arrogance of the ruling classes was considered subversive and led to his arrest and confinement to his estate, but these sketches opened the minds of contemporary readers to the plight of the peasantry and were even said to have led Tsar Alexander II to abolish serfdom.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", 'language": "en", "image": "https: //images.isbndb.com/covers/52/20/9780140445220.jpg", "title_long": "Sketches from a Hunter"s Album: The Complete Edition (Penguin Classics)", 'edition": "Reprint", "dimensions": "Height: 7.8 Inches, Length: 5 Inches, Weight: 0.63272669194 Pounds, Width: 0.7 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 0.7}, "weight": {"unit": "pounds", "value": 0.63272669194}, "height": {"unit": "inches", "value": 7.8}}, "pages": 416, "date_published": "1990-12-10", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Short Stories & Anthologies', 'Anthologies', 'Short Stories', 'World Literature', 'Russian & Soviet', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Ivan Turgenev'], 'title": "Sketches from a Hunter"s Album: The Complete Edition (Penguin Classics)", 'isbn13": "9780140445220", "msrp": 17, 'binding": "Paperback", "isbn": "0140445226", "isbn10": "0140445226"}}