{"book": {"publisher": "Puffin Books", "synopsis": "The author of such reliably offbeat sf thrillers as Strange Attractors (1990) radically changes pace for ten hilarious, semi- autobiographical stories. With affection and a splendid sense of comic timing, Sleator drags forth incidents from his family closet"s darkest recesses--the time young Tycho was hypnotized and then made to drink from the toilet; an indignant skit that laid bare the failings of certain parents, to their vast amusement; rough-and-tumble car games; and deliciously horrifying pranks played on unsuspecting passersby. Vivid characterizations (sister Vicky ``had always enjoyed making dolls fight with each other; when the dolls wore out, she ripped off their arms and legs. Now she is a nurse"") always balance foibles with saving graces; embarrassment is eased by laughter, while painful circumstances always come right in the end. Sleator shows how, in a loosely run household presided over by indulgent working parents, he and his three siblings developed confident, independent spirits. Though he admits to making up a few things, his dedication is telling – ``To my family: Please forgive me!''<br/>– Kirkus Reviews', 'language": "en", "image": "https: //images.isbndb.com/covers/43/84/9780140374384.jpg", "title_long": "Oddballs", "edition": "Reprint", "dimensions": "Height: 0.39 Inches, Length: 7.34 Inches, Weight: 0.21 Pounds, Width: 4.4 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.34}, "width": {"unit": "inches", "value": 4.4}, "weight": {"unit": "pounds", "value": 0.21}, "height": {"unit": "inches", "value": 0.39}}, "pages": 144, "date_published": "1995-06-01", "subjects": ["Children's Books', 'Growing Up & Facts of Life', 'Family Life', 'Activities, Crafts & Games', 'Activity Books', 'Science Fiction & Fantasy', 'Fantasy & Magic', 'Self Service', 'Custom Stores'], 'authors": ["William Sleator'], 'title": "Oddballs", "isbn13": "9780140374384", "msrp": 1.99, 'binding": "Mass Market Paperback", "isbn": "0140374388", "isbn10": "0140374388"}}