{"book": {"publisher": "Penguin Classics", "synopsis": "Friedrich Nietzsche"s Beyond Good and Evil is translated from the German by R.J. Hollingdale with an introduction by Michael Tanner in Penguin Classics. Beyond Good and Evil confirmed Nietzsche"s position as the towering European philosopher of his age. The work dramatically rejects the tradition of Western thought with its notions of truth and God, good and evil. Nietzsche demonstrates that the Christian world is steeped in a false piety and infected with a "slave morality'. With wit and energy, he turns from this critique to a philosophy that celebrates the present and demands that the individual imposes their own 'will to power' upon the world. This edition includes a commentary on the text by the translator and Michael Tanner's introduction, which explains some of the more abstract passages in Beyond Good and Evil. Frederich Nietzsche (1844-1900) became the chair of classical philology at Basel University at the age of 24 until his bad health forced him to retire in 1879. He divorced himself from society until his final collapse in 1899 when he became insane. A powerfully original thinker, Nietzsche's influence on subsequent writers, such as George Bernard Shaw, D.H. Lawrence, Thomas Mann and Jean-Paul Sartre, was considerable. If you enjoyed Beyond Good and Evil you might like Nietzsche's Thus Spoke Zarathustra, also available in Penguin Classics. 'One of the greatest books of a very great thinker' Michael Tanner', 'language": "en", "image": "https: //images.isbndb.com/covers/92/35/9780140449235.jpg", "title_long": "Beyond Good and Evil (Penguin Classics)", "edition": "Reissue", "dimensions": "Height: 0.56 Inches, Length: 7.78 Inches, Weight: 0.3968320716 Pounds, Width: 5.12 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.78}, "width": {"unit": "inches", "value": 5.12}, "weight": {"unit": "pounds", "value": 0.3968320716}, "height": {"unit": "inches", "value": 0.56}}, "pages": 240, "date_published": "2003-04-29", "subjects": ["Politics & Social Sciences', 'Philosophy', 'Ethics & Morality', 'Good & Evil', 'Metaphysics', 'Modern'], 'authors": ["Friedrich Nietzsche'], 'title": "Beyond Good and Evil (Penguin Classics)", "isbn13": "9780140449235", "msrp": 13, 'binding": "Paperback", "isbn": "014044923X", "isbn10": "014044923X"}}