{"book": {"publisher": "Penguin Books", "synopsis": "The magnificent final volume of one of the most widely acclaimed fictional masterpieces of the postwar era.<br/><br/>Few books have been awaited as eagerly as Clea, the sensuous and electrically suspenseful novel that resolves the enigmas of the Alexandria Quartet. Some years and one world war was after his bizarre liaisons with Melissa and Justine, the Irish émigré Darley becomes enmeshed with the bisexual artist Clea. That affair not only changes the lovers, it transforms the dead as well, revealing new layers of duplicity and desire, perversity and pathos in Lawrence Durrell’s masterly construction.<br/><br/>“A massive, marvelously concrete, deeply felt statement of faith. . . . His style glows with the mineral deposits of many cultures. One of the most important works of our time has come to an end.”—The New York Times Book Review<br/><br/>“Clea rounds out the tetralogy with grace, beauty, and stunning impact. . . . This rich, exciting fare is Durrell’s finest writing style, a manner of writing few living authors can equal. . . . A magnificent achievement.”—The Detriot News<br/><br/>“The reader is carried along on a current of superbly accomplished prose, as flexible and colorful as that of any contemporary writer. . . . What Durrell has given us is well worth having.”—San Francisco Chronicle", "language": "en", "image": "https: //images.isbndb.com/covers/32/24/9780140153224.jpg", "title_long": "Clea (Alexandria Quartet)", "edition": "Reissue", "dimensions": "Height: 0.67 Inches, Length: 7.77 inches, Weight: 0.51 Pounds, Width: 5.11 inches", "dimensions_structured": {'length": {"unit": "inches", "value": 7.77}, "width": {"unit": "inches", "value": 5.11}, "weight": {"unit": "pounds", "value": 0.51}, "height": {"unit": "inches", "value": 0.67}}, "pages": 288, "date_published": "1991-07-12", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Historical', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Lawrence Durrell'], 'title": "Clea (Alexandria Quartet)", "isbn13": "9780140153224", "msrp": 11.44, 'binding": "Paperback", "isbn": "0140153225", "isbn10": "0140153225"}}