{"book": {"publisher": "Penguin", "synopsis": "You Shall Know Our Velocity is the story of two young Americans, Will and Hand, who decide to travel around the world in a week and give away a large sum of money. This is a very personal story as well as a sly allegory for American intervention abroad, and Will and Hand are the most unlikely benefactors.<br/><br/>Their friend Jack has died in a shocking and meaningless accident, and this whirlwind and expensive trip will, they hope, be an answer to their overwhelming grief. But, as they soon find out, nothing is quite so simple-they find it as much harder to get round the world than they expect and almost as hard to get rid of the money.<br/><br/>This is a very personal story as well as a sly allegory for American intervention abroad, and Will and Hand are the most unlikely benefactors.<br/><br/>Dave Eggers is the editor of McSweeney’s and the author of a Heartbreaking Work of Staggering Genius. He lives in California.<br/><br/>PRAISE FOR A HEARTBREAKING WORK OF STAGGERING GENIUS<br/><br/>Heartbreaking? Certainly. Staggering? Yes, I’d say so. And if genius is capturing the universal in fresh and memorable way, call it that too.<br/>-Sunday Times<br/><br/>He writes wonderfully…an extremely impressive debut.<br/>-John Banville<br/><br/>PRAISE FOR YOU SHALL KNOW OUR VELOCITY<br/><br/>Velocity achieves a kind of anguished, profane poetry.<br/>-Newsweek<br/><br/>Eggers Frisbee sentences sail, spin, hover, circle and come back to the reader like gifts of gravity and grace.<br/>-New York Times Book Review", "language": "en", "image": "https: //images.isbndb.com/covers/34/59/9780141013459.jpg", "title_long": "You Shall Know Our Velocity", "dimensions": "Height: 7.83463 Inches, Length: 5.35432 Inches, Weight: 0.56438339072 Pounds, Width: 0.94488 inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.35432}, "width": {"unit": "inches", "value": 0.94488}, "weight": {"unit": "pounds", "value": 0.56438339072}, "height": {"unit": "inches", "value": 7.83463}}, "pages": 368, "date_published": "2008", "subjects": ["Literature & Fiction', 'Literary'], 'authors": ["Dave Eggers'], 'title": "You Shall Know Our Velocity", "isbn13": "9780141013459", "msrp": 19.75, 'binding": "Paperback", "isbn": "0141013451", "isbn10": "0141013451"}}