{"book": {"publisher": "Penguin Books", "synopsis": "Continuing the saga begun in Henry IV Part I, William Shakespeare"s history play Henry IV Part II charts the continuing evolution of Prince Hal from roguish troublemaker to noble ruler of men. This Penguin Shakespeare edition is edited by Peter Davison with an introduction by Adrian Poole. Angered by the loss of his son in battle, the Earl of Northumberland supports another rebellion against King Henry IV, bringing the country to the brink of civil war. Sick and weary, the old King sends out his forces, including the unruly Sir John Falstaff, to meet the rebels. But as the conflict grows, he must also confront a more personal problem - how to make his reprobate son Prince Hal aware of the duties he must bear, as heir to the throne. This book contains a general introduction to Shakespeare"s life and Elizabethan theatre, a separate introduction to Henry IV Part II, a chronology, suggestions for further reading, an essay discussing performance options on both stage and screen, and a commentary. William Shakespeare (1564-1616) was born to John Shakespeare and Mary Arden some time in late April 1564 in Stratford-upon-Avon. He wrote about 38 plays (the precise number is uncertain), many of which are regarded as the most exceptional works of drama ever produced, including Romeo and Juliet (1595), Henry V (1599), Hamlet (1601), Othello (1604), King Lear (1606) and Macbeth (1606), as well as a collection of 154 sonnets, which number among the most profound and influential love-poetry in English. If you enjoyed Henry IV Part II, you might like Richard III, also available in Penguin Shakespeare. "The finest, most representative instance of what Shakespeare can do' Harold Bloom', 'language": "en", "image": "https: //images.isbndb.com/covers/67/02/9780141016702.jpg", "title_long": "Henry Iv Part Ii", "dimensions": "Height: 7.16534 Inches, Length: 4.56692 Inches, Weight: 0.46737999544 Pounds, Width: 0.82677 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.56692}, "width": {"unit": "inches", "value": 0.82677}, "weight": {"unit": "pounds", "value": 0.46737999544}, "height": {"unit": "inches", "value": 7.16534}}, "pages": 336, "date_published": "2005-04-26", "subjects": ["Arts & Photography', 'Performing Arts'], 'authors": ['William Shakespeare'], 'title": "Henry Iv Part Ii", "isbn13": "9780141016702", "msrp": "0.00", "binding": "Mass Market Paperback", "isbn": "0141016701", "isbn10": "0141016701"}}