{"book": {"publisher": "Gardners Books", "synopsis": "This special CD pack contains two of Roald Dahl"s most famous stories, fully dramatised with music and sound effects. Charlie and the Chocolate Factory tells the wonderful tale of Charlie Bucket. Charlie can not believe his luck when he finds a Golden Ticket and wins the chance of a lifetime: a magical day witnessing the miraculous creation of the most delectable eatables ever made at the wonderful chocolate factory of Willy Wonka, along with the infamous characters of the Oompa-Loompas, Veronica Salt, Augustus Gloop and many more.  In Charlie and the Great Glass Elevator, Charlie has now won the chocolate factory, and is now on his way to take possession of it. With his parents and grandparents - and Mr Wonka - he"s travelling by a strange new method of transport: a Great Glass Elevator! But suddenly things start to go wrong. The elevator zooms higher and higher into the sky until it goes into orbit around the Earth, an hilarious and exciting adventure ensues, in which Charlie and his companions defend themselves against a mob of vicious space monsters. Listen to other Roald Dahl audiobooks read by some very famous voices, including Kate Winslet, David Walliams and Steven Fry - plus there are added squelchy soundeffects from Pinewood Studios! Look out for new Roald Dahl apps in the App store and Google Play- including the disgusting TWIT OR MISS! inspired by the revolting Twits.", 'language": "en", "image": "https: //images.isbndb.com/covers/56/10/9780141805610.jpg", "title_long": "Adventures of Charlie and Mr Willy Wonka", "edition": "Abridged edition", "dimensions": "Height: 5.66928 Inches, Length: 5.1181 Inches, Weight: 0.41446905256 Pounds, Width: 0.90551 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.1181}, "width": {"unit": "inches", "value": 0.90551}, "weight": {"unit": "pounds", "value": 0.41446905256}, "height": {"unit": "inches", "value": 5.66928}}, "date_published": "2004", "subjects": ["Children's Books'], 'authors": ['Roald Dahl'], 'title": "Adventures of Charlie and Mr Willy Wonka", "isbn13": "9780141805610", "msrp": "0.00", "binding": "Audio CD", "isbn": "0141805617", "isbn10": "0141805617"}}