{"book": {"publisher": "Penguin Classics", "synopsis": 'An exploration of love and its excesses, missteps, and modest triumphs, from the Booker Prize-winning author of The Sea, The Sea<br/><br/>In a dark comedy of errors, Iris Murdoch portrays the mischief wrought by Julius, a cynical intellectual who decides to demonstrate through a Machiavellian experiment how easily loving couples, caring friends, and devoted siblings can betray their loyalties. As puppet master, Julius artfully plays on the human tendency to embrace drama and intrigue and to prefer the distraction of confrontations to the difficult effort of communicating openly and honestly.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,
        700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https: //images.isbndb.com/covers/61/77/9780141186177.jpg", "title_long": "A Fairly Honourable Defeat (Penguin Twentieth-Century Classics)", "dimensions": "Height: 0.99 Inches, Length: 7.68 Inches, Weight: 0.75 Pounds, Width: 5.24 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.68}, "width": {"unit": "inches", "value": 5.24}, "weight": {"unit": "pounds", "value": 0.75}, "height": {"unit": "inches", "value": 0.99}}, "pages": 432, "date_published": "2001-03-01", "subjects": ["Humor & Entertainment', 'Humor', 'Self-Help & Psychology', 'Literature & Fiction', 'Dramas & Plays', 'Comedy', 'History & Criticism', 'Criticism & Theory', 'Literary', 'Reference', 'Self Service', 'Custom Stores'], 'authors": ["Iris Murdoch'], 'title": "A Fairly Honourable Defeat (Penguin Twentieth-Century Classics)", "isbn13": "9780141186177", "msrp": 16.34, "binding": "Paperback", "related": {"ePub": "1101495677"}, "isbn": "0141186178", "isbn10": "0141186178", "other_isbns": [{'isbn": "9781101495674", "binding": "print"}]}}