{"book": {"publisher": "Penguin Classics", "synopsis": "The first historical novel by the Nobel Prize-winning author of Kristin Lavransdatter<br/><br/>A Penguin Classic<br/><br/>More than a decade before writing Kristin Lavransdatter, the trilogy about fourteenth-century Norway that won her the Nobel Prize, Sigrid Undset published Gunnar’s Daughter, a brief, swiftly moving tale about a more violent period of her country’s history, the Saga Age. Set in Norway and Iceland at the beginning of the eleventh century, Gunnar"s Daughter is the story of the beautiful, spoiled Vigdis Gunnarsdatter, who is raped by the man she had wanted to love. A woman of courage and intelligence, Vigdis is toughened by adversity. Alone she raises the child conceived in violence, repeatedly defending her autonomy in a world governed by men. Alone she rebuilds her life and restores her family"s honor—until an unremitting social code propels her to take the action that again destroys her happiness.<br/><br/>First published in 1909, Gunnar"s Daughter was in part a response to the rise of nationalism and Norway's search for a national identity in its Viking past. But unlike most of the Viking-inspired art of its period, Gunnar's Daughter is not a historical romance. It is a skillful conversation between two historical moments about questions as troublesome in Undset's own time—and in ours—as they were in the Saga Age: rape and revenge, civil and domestic violence, troubled marriages, and children made victims of their parents' problems.', 'language": "en", "image": "https: //images.isbndb.com/covers/02/05/9780141180205.jpg", "title_long": "Gunnar"s Daughter (Penguin Twentieth Century Classics)", 'edition": "Illustrated", "dimensions": "Height: 7.7 Inches, Length: 5.1 Inches, Weight: 0.39 Pounds, Width: 0.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.1}, "width": {"unit": "inches", "value": 0.5}, "weight": {"unit": "pounds", "value": 0.39}, "height": {"unit": "inches", "value": 7.7}}, "pages": 161, "date_published": "1998-04-01", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Historical', 'Literary', 'Teen & Young Adult', 'Self Service', 'Custom Stores'], 'authors": ["Sigrid Undset'], 'title": "Gunnar"s Daughter (Penguin Twentieth Century Classics)", 'isbn13": "9780141180205", "msrp": 11.03, 'binding": "Paperback", "isbn": "014118020X", "isbn10": "014118020X"}}