{"book": {"publisher": "Penguin Classic", "synopsis": "Exploring issues of colonialism, faith and the limits of comprehension, E.M. Forster"s A Passage to India is edited by Oliver Stallybrass, with an introduction by Pankaj Mishra. When Adela Quested and her elderly companion Mrs Moore arrive in the Indian town of Chandrapore, they quickly feel trapped by its insular and prejudiced "Anglo-Indian" community. Determined to escape the parochial English enclave and explore the 'real India', they seek the guidance of the charming and mercurial Dr Aziz, a cultivated Indian Muslim. But a mysterious incident occurs while they are exploring the Marabar caves with Aziz, and the well-respected doctor soon finds himself at the centre of a scandal that rouses violent passions among both the British and their Indian subjects. A masterly portrait of a society in the grip of imperialism, A Passage to India compellingly depicts the fate of individuals caught between the great political and cultural conflicts of the modern world. In his introduction, Pankaj Mishra outlines Forster's complex engagement with Indian society and culture. This edition reproduces the Abinger text and notes, and also includes four of Forster's essays on India, a chronology and further reading. E. M. Forster (1879-1970) was a noted English author and critic and a member of the Bloomsbury group. His first novel, Where Angels Fear To Tread appeared in 1905. The Longest Journey appeared in 1907, followed by A Room With A View (1908), based partly on the material from extended holidays in Italy with his mother. Howards End (1910) was a story that centred on an English country house and dealt with the clash between two families, one interested in art and literature, the other only in business. Maurice was revised several times during his life, and finally published posthumously in 1971. If you enjoyed A Passage to India, you might like Rudyard Kipling's Kim, also available in Penguin Classics. 'His great book ... masterly in its presence and its lucidity' Anita Desai', 'language": "en", "image": "https: //images.isbndb.com/covers/11/60/9780141441160.jpg", "title_long": "Penguin Classics Passage To India", "edition": "1", "dimensions": "Height: 0.98031495963 Inches, Length: 7.7559055039 Inches, Weight: 0.6393405598 Pounds, Width: 5.0787401523 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.7559055039}, "width": {"unit": "inches", "value": 5.0787401523}, "weight": {"unit": "pounds", "value": 0.6393405598}, "height": {"unit": "inches", "value": 0.98031495963}}, "pages": 416, "date_published": "2005-08-30", "subjects": ["Literature & Fiction', 'Classics', 'Self Service', 'Custom Stores'], 'authors": ["E M Forster'], 'title": "Penguin Classics Passage To India", "isbn13": "9780141441160", "msrp": 2.18, 'binding": "Paperback", "isbn": "014144116X", "isbn10": "014144116X"}}