{"book": {"publisher": "Penguin Classic", "synopsis": "Once described as the "longest and most charming love-letter in literature", the Virginia Woolf"s Orlando is edited by Brenda Lyons with an introduction and notes by Sandra M. Gilbert in Penguin Classics. Written for Virginia Woolf's intimate friend, the charismatic writer Vita Sackville-West, Orlando is a playful mock 'biography' of a chameleonic historical figure, immortal and ageless, who changes sex and identity on a whim. First masculine, then feminine, Orlando begins life as a young sixteenth-century nobleman, then gallops through three centuries to end up as a woman writer in Virginia Woolf's own time. A wry commentary on gender roles and modes of history, Orlando is also, in Woolf's own words, a light-hearted 'writer's holiday' which delights in ambiguity and capriciousness. Virginia Woolf (1882-1941) is regarded as a major 20th century author and essayist, a key figure in literary history as a feminist and modernist, and the centre of 'The Bloomsbury Group'. This informal collective of artists and writers, which included Lytton Strachey and Roger Fry, exerted a powerful influence over early twentieth-century British culture. Between 1925 and 1931 Virginia Woolf produced what are now regarded as her finest masterpieces, from Mrs Dalloway (1925) to the poetic and highly experimental novel The Waves (1931). She also maintained an astonishing output of literary criticism, short fiction, journalism and biography, including the playfully subversive Orlando (1928) and A Room of One's Own (1929) a passionate feminist essay. If you enjoyed Orlando, you might like Woolf's The Waves, also available in Penguin Modern Classics. 'I read this book and believed it was a hallucinogenic, interactive biography of my own life and future' Tilda Swinton', 'language": "en", "image": "https: //images.isbndb.com/covers/42/72/9780141184272.jpg", "title_long": "Modern Classics Orlando a Biography (Penguin Modern Classics)", "edition": "Abridged", "dimensions": "Height: 7.75 Inches, Length: 5.1 Inches, Weight: 0.551155655 Pounds, Width: 0.8 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.1}, "width": {"unit": "inches", "value": 0.8}, "weight": {"unit": "pounds", "value": 0.551155655}, "height": {"unit": "inches", "value": 7.75}}, "pages": 336, "date_published": "2000-10-03", "subjects": ["Literature & Fiction', 'Classics'], 'authors": ["Virginia Woolf'], 'title": "Modern Classics Orlando a Biography (Penguin Modern Classics)", "isbn13": "9780141184272", "msrp": 14.45, 'binding": "Paperback", "isbn": "0141184272", "isbn10": "0141184272"}}