{"book": {"publisher": "Penguin Classic", "synopsis": "A poignant coming-of-age novel set in a Welsh mining town, Richard Llewellyn"s How Green Was My Valley is a paean to a more innocent age, published in Penguin Modern Classics Growing up in a mining community in rural South Wales, Huw Morgan is taught many harsh lessons - at the kitchen table, at Chapel and around the pit-head. Looking back on the hardships of his early life, where difficult days are faced with courage but the valleys swell with the sound of Welsh voices, it becomes clear that there is nowhere so green as the landscape of his own memory. An immediate bestseller on publication in 1939, How Green Was My Valley quickly became one of the best-loved novels of the twentieth century. Poetic and nostalgic, it is an elegy to a lost world. Richard Dafydd Vivian Llewellyn Lloyd (1906-1983), better known by his pen name Richard Llewellyn, claimed to have been born in St David"s, Pembrokeshire, Wales; after his death he was discovered to have been born of Welsh parents in Hendon, Middlesex. His famous first novel How Green Was My Valley (1939) was begun in St David"s from a draft he had written in India, and was later adapted into an Oscar-winning film by director John Ford. None But the Lonely Heart, his second novel, was published in 1943, and subsequently made into a film starring Cary Grant and Ethel Barrymore. As well as novels including Green, Green My Valley Now (1975) and I Stand on a Quiet Shore (1982), Llewellyn wrote two highly successful plays, Poison Pen and Noose If you enjoyed How Green Was My Valley, you might like Barry Hines' A Kestrel for a Knave, also available in Penguin Modern Classics. 'Vivid, eloquent, poetical, glowing with an inner flame of emotion' The Times Literary Supplement', 'language": "en", "image": "https: //images.isbndb.com/covers/58/59/9780141185859.jpg", "title_long": "Modern Classics How Green Was My Valley (Penguin Modern Classics)", "edition": "47772nd", "dimensions": "Height: 1.05511810916 Inches, Length: 8.5039369992 Inches, Weight: 0.6834330122 pounds, Width: 5.4330708606 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.5039369992}, "width": {"unit": "inches", "value": 5.4330708606}, "weight": {"unit": "pounds", "value": 0.6834330122}, "height": {"unit": "inches", "value": 1.05511810916}}, "pages": 448, "date_published": "2001-07-03", "subjects": ["Literature & Fiction', 'Classics'], 'authors": ["Richard Llewellyn'], 'title": "Modern Classics How Green Was My Valley (Penguin Modern Classics)", "isbn13": "9780141185859", "msrp": 24.25, 'binding": "Paperback", "isbn": "0141185856", "isbn10": "0141185856"}}