{"book": {"publisher": "Penguin UK", "synopsis": "Labelled as a "problem play" for its marriage of comic overtones to serious moral inquiry, William Shakespeare"s Measure for Measure is a peerless black comedy of justice, pride and desire. This Penguin Shakespeare edition is edited by J.M. Nosworthy with an introduction by Julia Briggs. 'Some rise by sin, and some by virtue fall' In the Duke Vincentio's absence from Vienna, his strict deputy Angelo revives an ancient law forbidding sex outside marriage. The young Claudio, whose fiancée Juliet is pregnant, is condemned to death by the law. His sister Isabella, soon to become a nun, pleads with Lord Angelo for her brother's life. But her purity so excites Angelo that he offers her a monstrous bargain - he will save Claudio if Isabella will visit him that night. This book contains a general introduction to Shakespeare's life and Elizabethan theatre, a separate introduction to Measure for Measure, a chronology, suggestions for further reading, an essay discussing performance options on both stage and screen, and a commentary. William Shakespeare (1564-1616) was born to John Shakespeare and Mary Arden some time in late April 1564 in Stratford-upon-Avon. He wrote about 38 plays (the precise number is uncertain), many of which are regarded as the most exceptional works of drama ever produced, including Romeo and Juliet (1595), Henry V (1599), Hamlet (1601), Othello (1604), King Lear (1606) and Macbeth (1606), as well as a collection of 154 sonnets, which number among the most profound and influential love-poetry in English. If you enjoyed Measure for Measure, you might like All's Well that Ends Well, also available in Penguin Shakespeare. 'Language is his power. His characters are precisely the words they speak' A.S.Byatt, author of Possession', 'language": "en", "image": "https: //images.isbndb.com/covers/38/00/9780141013800.jpg", "title_long": "New Penguin Shakespeare Measure for Measure", "edition": "Revised ed.", "dimensions": "Height: 7.15 Inches, Length: 4.5 Inches, Weight: 0.29982867632 Pounds, Width: 0.65 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.5}, "width": {"unit": "inches", "value": 0.65}, "weight": {"unit": "pounds", "value": 0.29982867632}, "height": {"unit": "inches", "value": 7.15}}, "pages": 208, "date_published": "2005", "subjects": ["Arts & Photography', 'Performing Arts', 'Humor & Entertainment', 'Movies', 'Screenplays', 'Literature & Fiction', 'Dramas & Plays', 'Shakespeare', 'History & Criticism', 'Movements & Periods', 'Regional & Cultural', 'British & Irish', 'Humor & Satire', 'Satire'], 'authors": ['William Shakespeare'], 'title": "New Penguin Shakespeare Measure for Measure", "isbn13": "9780141013800", "msrp": "0.00", "binding": "Mass Market Paperback", "isbn": "014101380X", "isbn10": "014101380X"}}