{"book": {"publisher": "Penguin UK", "synopsis": "William Shakespeare"s The Merchant of Venice is both a witty comedy and a moving exploration of bigotry and stigmatisation, and this Penguin Shakespeare edition is edited by W. Moelwyn Merchant with an introduction by Peter Holland. "The quality of mercy is not strain"d, It droppeth as the gentle rain from heaven' Bassanio, a noble but impoverished Venetian, asks his friend the merchant Antonio for a loan to impress an heiress. Antonio agrees, but is forced to borrow the sum from a cynical Jewish moneylender, Shylock, who forces him into a chilling contract, which stipulates he must honour the debt with a pound of his own flesh. But Bassanio's beloved is not as demure as she seems, and disguising herself as a lawyer, Portia proves herself one of Shakespeare's most cunning heroines, in a witty attack on Shylock's claim. A complex and controversial comedy, The Merchant of Venice explores prejudice and the true nature of justice. This book contains a general introduction to Shakespeare's life and Elizabethan theatre, a separate introduction to The Merchant of Venice, a chronology, suggestions for further reading, an essay discussing performance options on both stage and screen, and a commentary. William Shakespeare (1564-1616) was born to John Shakespeare and Mary Arden some time in late April 1564 in Stratford-upon-Avon. He wrote about 38 plays (the precise number is uncertain), many of which are regarded as the most exceptional works of drama ever produced, including Romeo and Juliet (1595), Henry V (1599), Hamlet (1601), Othello (1604), King Lear (1606) and Macbeth (1606), as well as a collection of 154 sonnets, which number among the most profound and influential love-poetry in English. If you enjoyed The Merchant of Venice, you might like The Taming of the Shrew, also available in Penguin Shakespeare. 'The man who of all modern, and perhaps ancient poets, had the largest and most comprehensive soul' John Dryden', 'language": "en", "image": "https: //images.isbndb.com/covers/39/54/9780141013954.jpg", "title_long": "Merchant of Venice", "dimensions": "Height: 7.25 Inches, Length: 4.4 Inches, Weight: 0.31085178942 Pounds, Width: 0.6 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.4}, "width": {"unit": "inches", "value": 0.6}, "weight": {"unit": "pounds", "value": 0.31085178942}, "height": {"unit": "inches", "value": 7.25}}, "pages": 240, "date_published": "2005-04-26", "subjects": ["Arts & Photography', 'Performing Arts'], 'authors": ["William Shakespeare'], 'title": "Merchant of Venice", "isbn13": "9780141013954", "msrp": 17.75, 'binding": "Mass Market Paperback", "isbn": "0141013958", "isbn10": "0141013958"}}