{"book": {"publisher": "Penguin Books", "synopsis": "“Papa explains the war like this: ‘When the elephants dance, the chickens must be careful.’ The great beasts, as they circle one another, shaking the trees and trumpeting loudly, are the Amerikanos and the Japanese as they fight. And our Philippine Islands? We are the small chickens.”<br/><br/>Once in a great while comes a storyteller who can illuminate worlds large and small, magical and true to life. When the Elephants Dance introduces us to the incandescent voice of Tess Uriza Holthe, who sets her remarkable first novel in the waning days of World War II, as the Japanese and the Americans engage in a fierce battle for possession of the Philippine Islands. The Karangalan family and their neighbors huddle for survival in the cellar of a house a few miles from Manila. Outside the safety of their little refuge the war rages on—fiery bombs torch the beautiful Filipino countryside, Japanese soldiers round up and interrogate innocent people, and from the hills guerillas wage a desperate campaign against the enemy. Inside the cellar, these men, women, and children put their hopes and dreams on hold as they wait out the war, only emerging to look for food, water, and medicine.<br/><br/>Through the eyes of three narrators, thirteen-year-old Alejandro Karangalan, his spirited older sister Isabelle, and Domingo, a passionate guerilla commander, we see how ordinary people must learn to live in the midst of extraordinary uncertainty, how they must find hope for survival where none seems to exist. They find this hope in the dramatic history of the Philippine Islands and the passion and bravery of its people. Crowded together in the cellar, the Karangalans and their friends and neighbors tell magical stories to one another based on Filipino myth and legend to fuel their courage, pass the time, and teach important lessons. The group is held spellbound by these stories, which feature a dazzling array of ghosts, witches, supernatural creatures, and courageous Filipinos who changed the course of history with their actions. These profoundly moving stories transport the listeners from the chaos of the war around them and give them new resolve to fight on.<br/><br/>With When the Elephants Dance Holthe has not only written a gripping narrative of how Alejandro, Isabelle, Domingo and their community fight for survival, but a loving tribute to the magical realism that infuses Filipino culture. The stories shared by her characters are based on the same tales handed down to Holthe from her Filipino father and lola, her grandmother. This stunning debut novel is the first to celebrate in such richness and depth the spirit of the Filipino people and their fascinating story and marks the introduction of a talented new author who will join the ranks of writers such as Arundhati Roy, Manil Suri, and Amy Tan.", "language": "en", "image": "https: //images.isbndb.com/covers/28/89/9780142002889.jpg", "title_long": "When the Elephants Dance", "edition": "Reissue", "dimensions": "Height: 8.4 Inches, Length: 0.8 Inches, Weight: 0.76 Pounds, Width: 5.5 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 0.8}, "width": {"unit": "inches", "value": 5.5}, "weight": {"unit": "pounds", "value": 0.76}, "height": {"unit": "inches", "value": 8.4}}, "pages": 384, "date_published": "2003-06-24", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'War', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Tess Uriza Holthe'], 'title": "When the Elephants Dance", "isbn13": "9780142002889", "msrp": 16, "binding": "Paperback", "related": {"Kindle Edition": "0676806732", "ePub": "0676806732"}, "isbn": "0142002887", "isbn10": "0142002887", "other_isbns": [{'isbn": "9780676806731", "binding": "print"}]}}