{"book": {"publisher": "Penguin Books", "synopsis": "An intimate journey across and in search of America, as told by one of its most beloved writers, in a deluxe centennial edition<br/><br/>In September 1960, John Steinbeck embarked on a journey across America. He felt that he might have lost touch with the country, with its speech, the smell of its grass and trees, its color and quality of light, the pulse of its people. To reassure himself, he set out on a voyage of rediscovery of the American identity, accompanied by a distinguished French poodle named Charley; and riding in a three-quarter-ton pickup truck named Rocinante.<br/><br/>His course took him through almost forty states: northward from Long Island to Maine; through the Midwest to Chicago; onward by way of Minnesota, North Dakota, Montana (with which he fell in love), and Idaho to Seattle, south to San Francisco and his birthplace, Salinas; eastward through the Mojave, New Mexico, Arizona, to the vast hospitality of Texas, to New Orleans and a shocking drama of desegregation; finally, on the last leg, through Alabama, Virginia, Pennsylvania, and New Jersey to New York.<br/><br/>Travels with Charley in Search of America is an intimate look at one of America"s most beloved writers in the later years of his life—a self-portrait of a man who never wrote an explicit autobiography. Written during a time of upheaval and racial tension in the South—which Steinbeck witnessed firsthand—Travels with Charley is a stunning evocation of America on the eve of a tumultuous decade. This Penguin Classics Deluxe Edition also features French flaps and deckle-edged paper.<br/><br/>For more than sixty-five years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,500 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https: //images.isbndb.com/covers/07/00/9780142000700.jpg", "title_long": "Travels with Charley in Search of America: (Centennial Edition)", "edition": "10", "dimensions": "Height: 8.4 Inches, Length: 5.7 Inches, Weight: 0.65 Pounds, Width: 0.59 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.7}, "width": {"unit": "inches", "value": 0.59}, "weight": {"unit": "pounds", "value": 0.65}, "height": {"unit": "inches", "value": 8.4}}, "pages": 224, "date_published": "2002-02-05", "subjects": ["Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Historical', 'United States', 'Travelers & Explorers', 'Literature & Fiction', 'Genre Fiction', 'Contemporary', 'Travel', 'Travel Writing', 'Self Service', 'Custom Stores'], 'authors": ["John Steinbeck'], 'title": "Travels with Charley in Search of America: (Centennial Edition)", "isbn13": "9780142000700", "msrp": 17, 'binding": "Paperback", "isbn": "0142000701", "isbn10": "0142000701"}}