{"book": {"publisher": "Penguin Books", "synopsis": "NEW YORK TIMES BESTSELLER • NATIONAL BOOK AWARD FINALIST • From the award–winning author of The Tortilla Curtain comes a “gorgeously crafted epic” (People) about a band of hippies who attempt to establish themselves deep in the wilderness of Alaska.<br/><br/>“Not only an entertaining romp through the madness of the countercultural ’70s, but a stirring parable about the American dream as well.”—The New York Times<br/><br/>It is 1970, and a down-at-the-heels California commune devoted to peace, free love, and the simple life has decided to relocate to the last frontier—the unforgiving landscape of interior Alaska—in the ultimate expression of going back to the land. Armed with the spirit of adventure and naïve optimism, the inhabitants of “Drop City” arrive in the wilderness of Alaska only to find their utopia already populated by other young homesteaders. When the two communities collide, unexpected friendships and dangerous enmities are born as everyone struggles with the bare essentials of life: love, nourishment, and a roof over one’s head.<br/><br/>Drop City is a surprising story that reveals human behavior at its rawest, most tender, and most compelling. It is also a rich, allusive, and unsentimental look at the ideals of a generation and their impact on today’s radically transformed world. Above all, it’s an epic and gripping novel infused with the lyricism and take-no-prisoners storytelling for which T.C. Boyle is justly famous.", "language": "en", "image": "https: //images.isbndb.com/covers/38/00/9780142003800.jpg", "title_long": "Drop City", "edition": "Reprint", "dimensions": "Height: 1.2 Inches, Length: 7.7 Inches, Weight: 0.95 Pounds, Width: 5 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 7.7}, "width": {"unit": "inches", "value": 5}, "weight": {"unit": "pounds", "value": 0.95}, "height": {"unit": "inches", "value": 1.2}}, "pages": 512, "date_published": "2004-01-27", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Small Town & Rural', 'United States', 'Humor & Satire', 'Satire', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["T.C. Boyle'], 'title": "Drop City", "isbn13": "9780142003800", "msrp": 12.99, "binding": "Paperback", "related": {"Kindle Edition": "1101200359", "ePub": "1101200359"}, "isbn": "0142003808", "isbn10": "0142003808", "other_isbns": [{'isbn": "9781101200353", "binding": "print"}]}}