{"book": {"publisher": "Penguin Classics", "synopsis": "“An enduring testament and prophecy.” –Chicago Sun-Times<br/><br/>A Penguin Classic<br/><br/>Mr. Artur Sammler, Holocaust survivor, intellectual, and occasional lecturer at Columbia University in 1960s New York City, is a “registrar of madness,” a refined and civilized being caught among people crazy with the promises of the future (moon landings, endless possibilities). His Cyclopean gaze reflects on the degradations of city life while looking deep into the sufferings of the human soul. “Sorry for all and sore at heart,” he observes how greater luxury and leisure have only led to more human suffering. To Mr. Sammler—who by the end of this ferociously unsentimental novel has found the compassionate consciousness necessary to bridge the gap between himself and his fellow beings—a good life is one in which a person does what is “required of him.” To know and to meet the “terms of the contract” was as true a life as one could live. At its heart, this novel is quintessential Bellow: moral, urbane, sublimely humane.<br/><br/>This Penguin Classics edition features an introduction by Stanley Crouch.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https://images.isbndb.com/covers/78/34/9780142437834.jpg", "title_long": "Mr. Sammler"s Planet (Penguin Classics)", "edition": "Revised ed.", "dimensions": "Height: 7.71 Inches, Length: 5.11 Inches, Weight: 0.440924524 Pounds, Width: 0.66 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.11}, "width": {"unit": "inches", "value": 0.66}, "weight": {"unit": "pounds", "value": 0.440924524}, "height": {"unit": "inches", "value": 7.71}}, "pages": 288, "date_published": "2004-01-06", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Historical', 'United States', 'Literary', 'Teen & Young Adult', 'Self Service', 'Custom Stores'], 'authors": ["Saul Bellow'], 'title": "Mr. Sammler"s Planet (Penguin Classics)", 'isbn13": "9780142437834", "msrp": 11.08, "binding": "Paperback", "isbn": "0142437832", "isbn10": "0142437832", "other_isbns": [{'isbn": "9781623730314", "binding": "print"}]}}