{"book": {"publisher": "Penguin Classics", "synopsis": "The famed Italian poet Dante Alighieri’s two masterworks—The Divine Comedy and La Vita Nuova—in one volume<br/><br/>A Penguin Classic<br/><br/>As a philosopher, he wedded classical methods of inquiry to a Christian faith. As an autobiographer, he looked unsparingly at his own failures to depict universal struggles. As a visionary, he dared draw maps of Hell, with Purgatory and Paradise, and populate all three realms with recognizable human beings. As a passionate lover, he became a poet of bereavement and renunication. As all of these, Dante Alighieri paved the way for modern literature, while creating verse and prose that remain unparalleled for formal elegance, intellectual depth, and emotional grandeur.<br/><br/>The Portable Dante captures the scope and fire of Dante’s genius as thoroughly as any single volume can. It contains complete verse translations of The Divine Comedy and La Vita Nuova, as well as a bibliography, notes, and an introduction by the eminent scholar and translator Mark Musa.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https://images.isbndb.com/covers/75/44/9780142437544.jpg", "title_long": "The Portable Dante (Penguin Classics)", "edition": "Reissue", "dimensions": "Height: 1.33 Inches, Length: 7.72 Inches, Weight: 1.1133344231 Pounds, Width: 5.08 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 7.72}, "width": {"unit": "inches", "value": 5.08}, "weight": {"unit": "pounds", "value": 1.1133344231}, "height": {"unit": "inches", "value": 1.33}}, "pages": 704, "date_published": "2003-07-29", "subjects": ["Literature & Fiction', 'Classics', 'Dramas & Plays', 'British & Irish', 'Genre Fiction', 'History & Criticism', 'Genres & Styles', 'Poetry', 'Ancient, Classical & Medieval', 'Regional & Cultural', 'Short Stories & Anthologies', 'Anthologies', 'World Literature', 'European', 'Literary', 'Ancient & Medieval Literature', 'Reference', 'Self Service', 'Custom Stores'], 'authors": ["Dante Alighieri'], 'title": "The Portable Dante (Penguin Classics)", "isbn13": "9780142437544", "msrp": 19.19, "binding": "Paperback", "isbn": "0142437549", "isbn10": "0142437549", "other_isbns": [{'isbn": "9781101573822", "binding": "print"}]}}