{"book": {"publisher": "Penguin Books", "synopsis": "One of the acknowledged masters of the short story gives readers a gripping ride through narratives that shock, compel, and always entertain.<br/><br/>Few authors in America write with such sheer love of language and imagination as T.C. Boyle, and nowhere is that passion more evident than in his inventive, wickedly funny, and widely praised short stories. In After the Plague, Boyle speaks of contemporary social issues in a range of emotional keys. The 16 tales gathered here address everything from air rage to abortion doctors to first love and its consequences. The collection ends with the brilliant title story, a whimsical and imaginative vision of a disease-ravaged Earth. Presented with characteristic wit and intelligence, this collection will delight readers in search of the latest news of the chaotic, disturbing, and achingly beautiful world in which we live.<br/><br/>“Fine, vigorous short stories . . . this is a writer who can take you anywhere.”—The New York Times<br/><br/>“Uproarious and unforgiving.”—The New Yorker<br/><br/>“In an age of war where the foe is indistinct and difficult to identify, Boyle has become both the poet and the prophet of our time.”—Los Angeles Times<br/><br/>“Reads like a flip through the A-section of the newspaper . . . a vivid collage of millennial American life.”—The Philadelphia Inquirer<br/><br/>"Boyle\"s imagination and zeal for storytelling are in top form here."—Publishers Weekly', 'language": "en", "image": "https: //images.isbndb.com/covers/14/17/9780142001417.jpg", "title_long": "After the Plague: Stories", "dimensions": "Height: 7.7 Inches, Length: 5 Inches, Weight: 0.45 Pounds, Width: 0.69 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 0.69}, "weight": {"unit": "pounds", "value": 0.45}, "height": {"unit": "inches", "value": 7.7}}, "pages": 320, "date_published": "2002-12-31", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Short Stories & Anthologies', 'Anthologies', 'Short Stories', 'Humor & Satire', 'Humorous', 'Literary'], 'authors": ["T.C. Boyle'], 'title": "After the Plague: Stories", "isbn13": "9780142001417", "msrp": 15, "binding": "Paperback", "related": {"ePub": "110157383X"}, "isbn": "0142001414", "isbn10": "0142001414", "other_isbns": [{'isbn": "9781101573839", "binding": "print"}]}}