{"book": {"publisher": "Penguin Classics", "synopsis": "James Joyce"s coming-of-age story, a tour de force of style and technique<br/><br/>The first, shortest, and most approachable of James Joyce’s novels, A Portrait of the Artist as a Young Man portrays the Dublin upbringing of Stephen Dedalus, from his youthful days at Clongowes Wood College to his radical questioning of all convention. In doing so, it provides an oblique self-portrait of the young Joyce himself. At its center lie questions of origin and source, authority and authorship, and the relationship of an artist to his family, culture, and race. Exuberantly inventive in style, the novel subtly and beautifully orchestrates the patterns of quotation and repetition instrumental in its hero’s quest to create his own character, his own language, life, and art: “to forge in the smithy of my soul the uncreated conscience of my race.”<br/><br/>This Penguin Classics edition is the definitive text, authorized by the Joyce estate and collated from all known proofs, manuscripts, and impressions to reflect the author’s original wishes.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https://images.isbndb.com/covers/73/46/9780142437346.jpg", "title_long": "A Portrait of the Artist as a Young Man (Penguin Classics)", "edition": "1", "dimensions": "Height: 7.75 Inches, Length: 5.12 Inches, Weight: 0.58642961692 Pounds, Width: 0.76 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.12}, "width": {"unit": "inches", "value": 0.76}, "weight": {"unit": "pounds", "value": 0.58642961692}, "height": {"unit": "inches", "value": 7.75}}, "pages": 384, "date_published": "2003-03-25", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Biographical', 'Coming of Age', 'United States', 'Literary', 'Reference', 'Science Fiction & Fantasy', 'Fantasy', 'Teen & Young Adult', 'Self Service', 'Custom Stores'], 'authors": ["James Joyce'], 'title": "A Portrait of the Artist as a Young Man (Penguin Classics)", "isbn13": "9780142437346", "msrp": 11, "binding": "Paperback", "isbn": "0142437344", "isbn10": "0142437344", "other_isbns": [{'isbn": "9780679641612", "binding": "print"}]}}