{"book": {"publisher": "Firebird", "synopsis": "The Redwall series is soon to be a Netflix original movie!<br/><br/>In this twelfth book of the masterful Redwall epic, storyteller Brian Jacques goes back in time to the days before Redwall, revealing with dramatic poignancy the legend of the first of the magnificent Redwall warriors--Luke, father of Martin.<br/><br/>Joined by Trimp the Hedgehog, Dinny Foremole, and Gonff--the ever-mischievous Prince of Mousethieves--it is that legend Martin hopes to discover when he embarks on a perilous journey to the northland shore, where his father abandoned him as a child. There, within the carcass of a great red ship--broken in half and wedged high up between pillars of stone--he finally uncovers what he has been searching for: the true story of the evil pirate stoat, Vilu Daskar, and the valiant warrior who pursued him relentlessly over the high seas, seeking to destroy Vilu at all costs, even if it m<br/>meant deserting his only son.<br/>Perfect for fans of T. A. Barron’s Merlin saga, John Flanagan’s Ranger’s Apprentice series, and J. R. R. Tolkien’s Lord of the Rings series.<br/><br/>"Swashbuckling adventures told with great gusto."—Chicago Tribune<br/><br/>"This book is likely to appeal to adolescent readers who have found a friend in the Harry Potter stories.'—The ALAN Review', 'language": "en", "image": "https://images.isbndb.com/covers/10/92/9780142501092.jpg", "title_long": "The Legend of Luke: A Tale from Redwall", "edition": "Reissue", "dimensions": "Height: 7.69 Inches, Length: 5.06 Inches, Weight: 0.63 Pounds, Width: 0.98 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.06}, "width": {"unit": "inches", "value": 0.98}, "weight": {"unit": "pounds", "value": 0.63}, "height": {"unit": "inches", "value": 7.69}}, "pages": 384, "date_published": "2005-06-02", "subjects": ["Teen & Young Adult', 'Literature & Fiction', 'Action & Adventure', 'Boys & Men', 'Science Fiction & Fantasy', 'Fantasy', 'Self Service', 'Custom Stores'], 'authors": ["Brian Jacques'], 'title": "The Legend of Luke: A Tale from Redwall", "isbn13": "9780142501092", "msrp": 8.99, "binding": "Paperback", "related": {"ePub": "1101666099"}, "isbn": "0142501093", "isbn10": "0142501093", "other_isbns": [{'isbn": "9781101666098", "binding": "print"}]}}