{"book": {"publisher": "Penguin Classics", "synopsis": "The classic novel of freedom and the search for authenticity that defined a generation<br/><br/>One of The Atlantic’s Great American Novels of the Past 100 Years<br/><br/>On the Road chronicles Jack Kerouac\"s years traveling the North American continent with his friend Neal Cassady,
        'a sideburned hero of the snowy West.' As 'Sal Paradise' and 'Dean Moriarty,' the two roam the country in a quest for self-knowledge and experience. Kerouac\'s love of America, his compassion for humanity, and his sense of language as jazz combine to make On the Road an inspirational work of lasting importance. Kerouac’s classic novel of freedom and longing defined what it meant to be “Beat” and has inspired every generation since its initial publication more than fifty years ago. This Penguin Classics edition contains an introduction by Ann Charters.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,
        700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https: //images.isbndb.com/covers/72/54/9780142437254.jpg", "title_long": "On the Road (Penguin Classics)", "dimensions": "Height: 7.75 Inches, Length: 5.1 Inches, Weight: 0.5621787681 Pounds, Width: 0.6 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.1}, "width": {"unit": "inches", "value": 0.6}, "weight": {"unit": "pounds", "value": 0.5621787681}, "height": {"unit": "inches", "value": 7.75}}, "pages": 307, "date_published": "2002-12-31", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Coming of Age', 'United States', 'Literary', 'Religion & Spirituality', 'New Age & Spirituality', 'Mysticism', 'Teen & Young Adult', 'Self Service', 'Custom Stores'], 'authors": ["Jack Kerouac'], 'title": "On the Road (Penguin Classics)", "isbn13": "9780142437254", "msrp": 16, "binding": "Paperback", "isbn": "0142437255", "isbn10": "0142437255", "other_isbns": [{'isbn": "9781101127575", "binding": "print"}]}}