{"book": {"publisher": "Viking Books for Young Readers", "synopsis": "The #1 Bestseller!<br/><br/>Michael Arroyo has a pitching arm that throws serious heat along with aspirations of leading his team all the way to the Little League World Series. But his firepower is nothing compared to the heat Michael faces in his day-to-day life. Newly orphaned after his father led the family’s escape from Cuba, Michael’s only family is his seventeen-yearold brother Carlos. If Social Services hears of their situation, they will be separated in the foster-care system—or worse, sent back to Cuba. Together, the boys carry on alone, dodging bills and anyone who asks too many questions. But then someone wonders how a twelve-year-old boy could possibly throw with as much power as Michael Arroyo throws. With no way to prove his age, no birth certificate, and no parent to fight for his cause, Michael’s secret world is blown wide open, and he discovers that family can come from the most unexpected sources.<br/><br/>Perfect for any Little Leaguer with dreams of making it big--as well as for fans of Mike Lupica"s other New York Times bestsellers Travel Team, The Big Field, The Underdogs, Million-Dollar Throw, and The Game Changers series, this cheer-worthy baseball story shows that when the game knocks you down, champions stand tall.", "language": "en", "image": "https: //images.isbndb.com/covers/75/78/9780142407578.jpg", "title_long": "Heat", "edition": "Reprint", "dimensions": "Height: 8.31 Inches, Length: 5.56 Inches, Weight: 0.58 Pounds, Width: 0.65 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.56}, "width": {"unit": "inches", "value": 0.65}, "weight": {"unit": "pounds", "value": 0.58}, "height": {"unit": "inches", "value": 8.31}}, "pages": 256, "date_published": "2007-03-01", "subjects": ["Children's Books', 'Growing Up & Facts of Life', 'Family Life', 'Literature & Fiction', 'Sports & Outdoors', 'Baseball', 'Geography & Cultures', 'Multicultural Stories', 'Self Service', 'Custom Stores'], 'authors": ["Mike Lupica'], 'title": "Heat", "isbn13": "9780142407578", "msrp": 8.99, "binding": "Paperback", "related": {"Kindle Edition": "110122147X", "ePub": "110122147X"}, "isbn": "0142407577", "isbn10": "0142407577", "other_isbns": [{'isbn": "9781101221471", "binding": "print"}]}}