{"book": {"publisher": "Penguin Classics", "synopsis": "A bold translation of Nobel Prize-winner Herman Hesse"s most inspirational and beloved work, which was nominated as one of America’s best-loved novels by PBS’s The Great American Read<br/><br/>A Penguin Classics Deluxe Edition<br/><br/>Hesse"s famous and influential novel, Siddartha, is perhaps the most important and compelling moral allegory our troubled century has produced. Integrating Eastern and Western spiritual traditions with psychoanalysis and philosophy, this strangely simple tale, written with a deep and moving empathy for humanity, has touched the lives of millions since its original publication in 1922. Set in India, Siddhartha is the story of a young Brahmin"s search for ultimate reality after meeting with the Buddha. His quest takes him from a life of decadence to asceticism, through the illusory joys of sensual love with a beautiful courtesan, and of wealth and fame, to the painful struggles with his son and the ultimate wisdom of renunciation. This new translation by award-winning translator Joachim Neugroschel includes an introduction by Hesse biographer Ralph Freedman.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.', 'language": "en", "image": "https: //images.isbndb.com/covers/71/86/9780142437186.jpg", "title_long": "Siddhartha (Penguin Classics Deluxe Edition)", "edition": "Deluxe", "dimensions": "Height: 8.35 Inches, Length: 5.6 Inches, Weight: 0.52470018356 Pounds, Width: 0.6 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.6}, "width": {"unit": "inches", "value": 0.6}, "weight": {"unit": "pounds", "value": 0.52470018356}, "height": {"unit": "inches", "value": 8.35}}, "pages": 176, "date_published": "2002-12-31", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'United States', 'Literary', 'Religion & Spirituality', 'Buddhism', 'Politics & Social Sciences', 'Politics & Government', 'Specific Topics'], 'authors": ["Hermann Hesse'], 'title": "Siddhartha (Penguin Classics Deluxe Edition)", "isbn13": "9780142437186", "msrp": 13, "binding": "Paperback", "isbn": "0142437182", "isbn10": "0142437182", "other_isbns": [{'isbn": "9780834825307", "binding": "print"}, {"isbn": "9781101200025", "binding": "print"}]}}