{"book": {"publisher": "Penguin Classics", "synopsis": "Nobel Prize winner Saul Bellow’s greatest novel<br/><br/>Winner of the 1954 National Book Award<br/><br/>One of The Atlantic’s Great American Novels of the Past 100 Years<br/><br/>“The Adventures of Augie March is the Great American Novel. Search no further.” —Martin Amis<br/><br/>A Penguin Classic<br/><br/>As soon as it first appeared in 1953, this novel by the great Saul Bellow was hailed as an American classic. Augie, the exuberant narrator-hero, is a poor Chicago boy growing up during the Great Deptression. A “born recruit,” Augie makes himself available for a series of occupations, then proudly rejects each one as unworthy. His own oddity is reflected in the companions he encounters—plungers, schemers, risk-takers, and “hole-and corner” operators like the would-be tycoon Einhorn or the would-be siren Thea, who travels with an eagle trained to hunt small creatures. This Penguin Classics edition, with an introduction by celebrated writer and critic Christopher Hitchens, makes a literary masterpiece available to a new generation of readers.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https://images.isbndb.com/covers/95/70/9780143039570.jpg", "title_long": "The Adventures of Augie March (Penguin Classics)", "edition": "Penguin Classics", "dimensions": "Height: 8.39 Inches, Length: 5.48 Inches, Weight: 1.05 Pounds, Width: 1.3 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.48}, "width": {"unit": "inches", "value": 1.3}, "weight": {"unit": "pounds", "value": 1.05}, "height": {"unit": "inches", "value": 8.39}}, "pages": 608, "date_published": "2006-10-03", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Historical', 'Urban Life', 'Psychological', 'Action & Adventure', 'United States', 'Contemporary', 'Literary', 'Teen & Young Adult', 'Self Service', 'Custom Stores'], 'authors": ["Saul Bellow'], 'title": "The Adventures of Augie March (Penguin Classics)", "isbn13": "9780143039570", "msrp": 12.11, "binding": "Paperback", "related": {"ePub": "1623730023"}, "isbn": "0143039571", "isbn10": "0143039571", "other_isbns": [{'isbn": "9781623730024", "binding": "printisbn"}]}}