{"book": {"publisher": "Penguin Books", "synopsis": "“A first-rate journalist, Reid provides impressive evidence to support his hypothesis.” —The Denver Post<br/><br/>“A lively, thought-provoking book.” —The Seattle Times<br/><br/>To Americans accustomed to unilateralism abroad and social belt-tightening at home, few books could be more revelatory—or controversial—than this timely, lucid, and informative portrait of the new European Union.<br/><br/>Now comprising 25 nations and 450 million citizens, the EU has more people, more wealth, and more votes on every international body than the United States. It eschews military force but offers guaranteed health care and free university educations. And the new “United States of Europe” is determined to be a superpower. Tracing the EU’s emergence from the ruins of World War II and its influence everywhere from international courts to supermarket shelves, T. R. Reid explores the challenge it poses to American political and economic supremacy. The United States of Europe is essential reading.<br/><br/>T. R. Reid"s latest book, A Fine Mess, was published by Penguin Press in 2017.", "language": "en", "image": "https://images.isbndb.com/covers/60/81/9780143036081.jpg", "title_long": "The United States of Europe: The New Superpower and the End of American Supremacy", "edition": "Reprint", "dimensions": "Height: 8.36 Inches, Length: 5.55 Inches, Weight: 0.64 Pounds, Width: 0.68 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.55}, "width": {"unit": "inches", "value": 0.68}, "weight": {"unit": "pounds", "value": 0.64}, "height": {"unit": "inches", "value": 8.36}}, "pages": 320, "date_published": "2005-11-01", "subjects": ["History', 'Americas', 'United States', 'Europe', 'Politics & Social Sciences', 'Politics & Government', 'International & World Politics', 'Political Science'], 'authors": ["T. R. Reid'], 'title": "The United States of Europe: The New Superpower and the End of American Supremacy", "isbn13": "9780143036081", "msrp": 10.76, 'binding": "Paperback", "isbn": "0143036084", "isbn10": "0143036084"}}