{"book": {"publisher": "Penguin Classics", "synopsis": "For fans of Shōgun: A stunning Penguin Classics Deluxe Edition, with flaps and deckle-edged paper, of the best stories by the father of the Japanese short story—including the two that inspired Kurosawa\"s classic samurai film about the subjectivity of truth—featuring cover art by famed Japanese manga artist Yoshihiro Tatsumi and an introduction by Haruki Murakami<br/><br/>Ryünosuke Akutagawa is one of Japan\"s foremost stylists—a modernist master whose short stories are marked by highly original imagery, cynicism, beauty and wild humour. "Rashömon'and 'In a Bamboo Grove' inspired Kurosawa\'s magnificent film and depict a past in which morality is turned upside down, while tales such as 'The Nose,' 'O-Gin' and 'Loyalty' paint a rich and imaginative picture of a medieval Japan peopled by Shoguns and priests, vagrants and peasants. And in later works such as 'Death Register,' 'The Life of a Stupid Man,' and 'Spinning Gears,' Akutagawa drew from his own life to devastating effect, revealing his intense melancholy and terror of madness in exquisitely moving impressionistic stories.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.', 'language": "en", "image": "https://images.isbndb.com/covers/98/46/9780143039846.jpg", "title_long": "Rashomon and Seventeen Other Stories (Penguin Classics Deluxe Edition)", "edition": "Penguin Classics Deluxe ed.", "dimensions": "Height: 8.4 Inches, Length: 5.8 Inches, Weight: 0.76720867176 Pounds, Width: 0.8 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.8}, "width": {"unit": "inches", "value": 0.8}, "weight": {"unit": "pounds", "value": 0.76720867176}, "height": {"unit": "inches", "value": 8.4}}, "pages": 320, "date_published": "2006-10-31", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Short Stories & Anthologies', 'Anthologies', 'Short Stories', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Ryunosuke Akutagawa'], 'title": "Rashomon and Seventeen Other Stories (Penguin Classics Deluxe Edition)", "isbn13": "9780143039846", "msrp": 18, "binding": "Paperback", "related": {"ePub": "1101503092"}, "isbn": "0143039849", "isbn10": "0143039849", "other_isbns": [{'isbn": "9781101503096", "binding": "print"}]}}