{"book": {"publisher": "Penguin Classics", "synopsis": "The third book in Robertson Davies\"s acclaimed The Deptford Trilogy, with a new foreword by Kelly Link<br/><br/>Hailed by the Washington Post Book World as "a modern classic," Robertson Davies’s acclaimed Deptford Trilogy is a glittering, fantastical, cunningly contrived series of novels, around which a mysterious death is woven. World of Wonders—the third book in the series after The Manticore—follows the story of Magnus Eisengrim—the most illustrious magician of his age—who is spirited away from his home by a member of a traveling sideshow, the Wanless World of Wonders. After honing his skills and becoming better known, Magnus unfurls his life’s courageous and adventurous tale in this third and final volume of a spectacular, soaring work.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.', 'language": "en", "image": "https://images.isbndb.com/covers/91/43/9780143039143.jpg", "title_long": "World of Wonders (Deptford Trilogy)", "edition": "Reprint", "dimensions": "Height: 7.75 Inches, Length: 5.13 Inches, Weight: 0.64 Pounds, Width: 0.74 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.13}, "width": {"unit": "inches", "value": 0.74}, "weight": {"unit": "pounds", "value": 0.64}, "height": {"unit": "inches", "value": 7.75}}, "pages": 352, "date_published": "2006-02-28", "subjects": ["Humor & Entertainment', 'Humor', 'Self-Help & Psychology', 'Literature & Fiction', 'Classics', 'World Literature', 'Canadian', 'Humor & Satire', 'Satire', 'Literary', 'Politics & Social Sciences', 'Politics & Government', 'Ideologies & Doctrines', 'Self Service', 'Custom Stores'], 'authors": ["Robertson Davies'], 'title": "World of Wonders (Deptford Trilogy)", "isbn13": "9780143039143", "msrp": 17, "binding": "Paperback", "related": {"ePub": "0525505520"}, "isbn": "0143039148", "isbn10": "0143039148", "other_isbns": [{'isbn": "9780525505525", "binding": "print"}]}}