{"book": {"publisher": "Penguin Classics", "synopsis": "While exploring the environs of their summer home, five brothers and sisters find a Psammead, or Sand-fairy, in a nearby gravel pit: “Its eyes were on long horns like a snail’s eyes, and it could move them in and out like telescopes; it had ears like a bat’s ears, and its tubby body was shaped like a spider’s and covered with thick soft fur; its legs and arms were furry too, and it had hands and feet like a monkey’s.” The Psammead is magical and, every day, the ancient and irritable creature grants each of them a wish that lasts until sunset. Soon, though, they find their wishes never seem to turn out right and often have unexpected—and humorous—consequences. But when an accidental wish goes terribly wrong, the children learn that magic, like life, can be as complicated as it is exciting. This edition contains an enchanting introduction by children"s literature scholar Gillian Avery about the complex and unconventional Nesbit, and includes all of the original illustrations, suggestions for further reading, and explanatory notes<br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https://images.isbndb.com/covers/91/50/9780143039150.jpg", "title_long": "Five Children and It", "edition": "Illustrated", "dimensions": "Height: 7.72 Inches, Length: 5.1 Inches, Weight: 0.42549216566 Pounds, Width: 0.54 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.1}, "width": {"unit": "inches", "value": 0.54}, "weight": {"unit": "pounds", "value": 0.42549216566}, "height": {"unit": "inches", "value": 7.72}}, "pages": 240, "date_published": "2004-12-28", "subjects": ["Literature & Fiction', 'Classics', 'United States', 'Literary', 'Teen & Young Adult', 'Social & Family Issues', 'Science Fiction & Fantasy', 'Fantasy'], 'authors": ["E. Nesbit'], 'title": "Five Children and It", "isbn13": "9780143039150", "msrp": "0.00", "binding": "Paperback", "related": {"Kindle Edition": "1101161612", "ePub": "1101161612"}, "isbn": "0143039156", "isbn10": "0143039156", "other_isbns": [{'isbn": "9781101161616", "binding": "print"}]}}