{"book": {"publisher": "Penguin Classics", "synopsis": "While best known for such novels as his monumental Moby-Dick, Herman Melville was also an extraordinarily gifted poet. This is the most complete anthology of Melville’s poetry ever published in a single volume. It features a large selection from Battle-Pieces and Aspects of the War, along with Melville’s own notes and prose supplement; cantos from all four books of Clarel: A Poem and Pilgrimage in the Holy Land; selections from Melville’s later books, Timoleon, John Marr and Other Sailors, and Weeds and Wildings, Chiefly, with a Rose or Two; as well as a number of his powerful and lesserknown uncollected poems. This volume will usher in a new appreciation for Melville’s poetic gifts. Includes a new introduction to Melville"s life and later career as a poet during the Civil War and Gilded Age, as well as notes and suggestions for further reading.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https://images.isbndb.com/covers/90/37/9780143039037.jpg", "title_long": "Selected Poems of Herman Melville (Penguin Classics)", "dimensions": "Height: 0.71 Inches, Length: 7.7 Inches, Weight: 0.6503636729 Pounds, Width: 5.24 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.7}, "width": {"unit": "inches", "value": 5.24}, "weight": {"unit": "pounds", "value": 0.6503636729}, "height": {"unit": "inches", "value": 0.71}}, "pages": 337, "date_published": "2006-06-27", "subjects": ["Literature & Fiction', 'Genre Fiction', 'History & Criticism', 'Movements & Periods', 'Poetry', 'Regional & Cultural', 'Themes & Styles', 'Short Stories & Anthologies', 'Anthologies', 'United States', 'Classics', 'Self Service', 'Custom Stores'], 'authors": ["Herman Melville', 'Robert Faggen'], 'title": "Selected Poems of Herman Melville (Penguin Classics)", "isbn13": "9780143039037", "msrp": 16, "binding": "Paperback", "related": {"Kindle Edition": "1101177357", "ePub": "1101177357"}, "isbn": "0143039032", "isbn10": "0143039032", "other_isbns": [{'isbn": "9781101177358", "binding": "print"}]}}