{"book": {"publisher": "Penguin Books", "synopsis": "A selection of George Orwell"s politically charged essays on language and writing that give context to his dystopian classic, 1984<br/><br/>Throughout history, some books have changed the world. They have transformed the way we see ourselves—and each other. They have inspired debate, dissent, war and revolution. They have enlightened, outraged, provoked and comforted. They have enriched lives—and destroyed them.<br/><br/>Now, Penguin brings you the works of the great thinkers, pioneers, radicals and visionaries whose ideas shook civilization, and helped make us who we are. Penguin"s Great Ideas series features twelve groundbreaking works by some of history"s most prodigious thinkers, and each volume is beautifully packaged with a unique type-drive design that highlights the bookmaker's art. Offering great literature in great packages at great prices, this series is ideal for those readers who want to explore and savor the Great Ideas that have shaped the world.<br/><br/>Whether puncturing the lies of politicians, wittily dissecting the English character or telling unpalatable truths about war, Orwell's timeless, uncompromising essays are more relevant, entertaining and essential than ever in today's era of spin.', 'language": "en", "image": "https://images.isbndb.com/covers/63/57/9780143036357.jpg", "title_long": "Why I Write (Penguin Great Ideas)", "dimensions": "Height: 7.1 Inches, Length: 4.37 Inches, Weight: 0.2 Pounds, Width: 0.35 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.37}, "width": {"unit": "inches", "value": 0.35}, "weight": {"unit": "pounds", "value": 0.2}, "height": {"unit": "inches", "value": 7.1}}, "pages": 128, "date_published": "2005-09-06", "subjects": ["Biographies & Memoirs', 'Memoirs', 'Literature & Fiction', 'History & Criticism', 'Regional & Cultural', 'British & Irish', 'Reference', 'Words, Language & Grammar', 'Communication', 'Writing, Research & Publishing Guides', 'Publishing & Books', 'Writing', 'Politics & Social Sciences', 'Philosophy', 'Social Sciences', 'Communication & Media Studies'], 'authors": ["George Orwell'], 'title": "Why I Write (Penguin Great Ideas)", "isbn13": "9780143036357", "msrp": 13, 'binding": "Paperback", "isbn": "0143036351", "isbn10": "0143036351"}}