{"book": {"publisher": "Penguin Classics", "synopsis": "The fourth volume of one of the greatest novels of the twentieth century<br/><br/>John Sturrock"s acclaimed new translation of Sodom and Gomorrah will introduce a new generation of American readers to the literary riches of Proust. The fourth volume in this superb edition of In Search of Lost Time—the first completely new translation of Proust"s masterpiece since the 1920s—brings us a more comic and lucid prose than English readers have previously been able to enjoy.<br/><br/>Sodom and Gomorrah takes up the theme of homosexual love, male and female, and dwells on how destructive sexual jealousy can be for those who suffer it. Proust’s novel is also an unforgiving analysis of both the decadent high society of Paris and the rise of a philistine bourgeoisie that is on the way to supplanting it. Characters who had lesser roles in earlier volumes now reappear in a different light and take center stage, notably Albertine, with whom the narrator believes he is in love, and the insanely haughty Baron de Charlus.", 'language": "en", "image": "https://images.isbndb.com/covers/93/10/9780143039310.jpg", "title_long": "Sodom and Gomorrah: In Search of Lost Time, Volume 4 (Penguin Classics Deluxe Edition)", "edition": "Deluxe", "dimensions": "Height: 8.42 Inches, Length: 5.64 Inches, Weight: 1.34 Pounds, Width: 1.49 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.64}, "width": {"unit": "inches", "value": 1.49}, "weight": {"unit": "pounds", "value": 1.34}, "height": {"unit": "inches", "value": 8.42}}, "pages": 576, "date_published": "2005-11-01", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Historical', 'World Literature', 'European', 'Literary', 'Teen & Young Adult', 'Self Service', 'Custom Stores'], 'authors": ["Marcel Proust'], 'title": "Sodom and Gomorrah: In Search of Lost Time, Volume 4 (Penguin Classics Deluxe Edition)", "isbn13": "9780143039310", "msrp": 27, "binding": "Paperback", "related": {"ePub": "1101503106"}, "isbn": "0143039318", "isbn10": "0143039318", "other_isbns": [{'isbn": "9781101503102", "binding": "print"}]}}