{"book": {"publisher": "Penguin Classics", "synopsis": "Jack Kerouac’s classic novel about friendship, the search for meaning, and the allure of nature—featuring an Introduction by Anne Douglas<br/><br/>“In [On the Road] Kerouac’s heroes were sensation seekers; now they are seekers after truth . . . the novel often attains a beautiful dignity.”—Chicago Tribune<br/><br/>First published in 1958, a year after On the Road put the Beat Generation on the map, The Dharma Bums stands as one of Jack Kerouac’s most powerful and influential novels. The story focuses on two ebullient young Americans—mountaineer, poet, and Zen Buddhist Japhy Ryder, and Ray Smith, a zestful, innocent writer—whose quest for Truth leads them on a heroic odyssey, from marathon parties and poetry jam sessions in San Francisco’s Bohemia to solitude and mountain climbing in the High Sierras.<br/><br/>Penguin Classics is the leading publisher of classic literature in the English-speaking world, representing a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.", "language": "en", "image": "https://images.isbndb.com/covers/96/00/9780143039600.jpg", "title_long": "The Dharma Bums (Penguin Classics Deluxe Edition)", "edition": "Deluxe", "dimensions": "Height: 0.6 Inches, Length: 8.3 Inches, Weight: 0.5732018812 Pounds, Width: 5.8 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 8.3}, "width": {"unit": "inches", "value": 5.8}, "weight": {"unit": "pounds", "value": 0.5732018812}, "height": {"unit": "inches", "value": 0.6}}, "pages": 187, "date_published": "2006-10-31", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Biographical', 'Action & Adventure', 'United States', 'Literary', 'Religion & Spirituality', 'Self Service', 'Custom Stores'], 'authors": ["Jack Kerouac'], 'title": "The Dharma Bums (Penguin Classics Deluxe Edition)", "isbn13": "9780143039600", "msrp": 17, "binding": "Paperback", "isbn": "0143039601", "isbn10": "0143039601", "other_isbns": [{'isbn": "9781101199305", "binding": "print"}]}}