{"book": {"publisher": "Penguin Books", "synopsis": "“You either love Andrea Camilleri or you haven’t read him yet. Each novel in this wholly addictive, entirely magical series, set in Sicily and starring a detective unlike any other in crime fiction, blasts the brain like a shot of pure oxygen. Aglow with local color, packed with flint-dry wit, as fresh and clean as Mediterranean seafood — altogether transporting. Long live Camilleri, and long live Montalbano.” A.J. Finn, #1 New York Times bestselling author of The Woman in the Window<br/><br/>From the maestro of suspense, comes a spellbinding mystery that will transport you to the sun-soaked streets of Sicily. Rounding the Mark takes you on a gripping journey with Detective Montalbano as he unravels the enigmatic deaths of two individuals. As he delves deeper into the investigation, Montalbano confronts a clandestine underworld of human trafficking. With each twist and turn, the detective"s physical and moral limits are tested. Disillusioned and no longer believing in the institution he serves, will he withdraw or delve deeper into his work?<br/><br/>Andrea Camilleri"s masterful storytelling, infused with dry wit and vivid local color, will keep you on the edge of your seat until the shocking conclusion. Long live Camilleri, and long live Montalbano, the detective unlike any other in crime fiction.", 'language": "en", "image": "https://images.isbndb.com/covers/74/84/9780143037484.jpg", "title_long": "Rounding the Mark (An Inspector Montalbano Mystery)", "edition": "First Edition", "dimensions": "Height: 7.72 Inches, Length: 5.08 Inches, Weight: 0.4629707502 Pounds, Width: 0.57 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.08}, "width": {"unit": "inches", "value": 0.57}, "weight": {"unit": "pounds", "value": 0.4629707502}, "height": {"unit": "inches", "value": 7.72}}, "pages": 272, "date_published": "2006-07-25", "subjects": ["Literature & Fiction', 'Genre Fiction', 'World Literature', 'European', 'Mystery, Thriller & Suspense', 'Mystery', 'Police Procedurals', 'Thrillers & Suspense', 'Crime', 'Romance', 'Romantic Suspense', 'Self Service', 'Custom Stores'], 'authors": ["Andrea Camilleri'], 'title": "Rounding the Mark (An Inspector Montalbano Mystery)", "isbn13": "9780143037484", "msrp": "0.00", "binding": "Paperback", "related": {"ePub": "144062285X"}, "isbn": "014303748X", "isbn10": "014303748X", "other_isbns": [{'isbn": "9781440622854", "binding": "print"}]}}