{"book": {"publisher": "Penguin", "synopsis": "A transcendent tale of a woman"s self-discovery—the New York Times–bestselling second work of fiction by the author of The Secret Life of Bees and The Book of Longings<br/><br/>Inside the church of a Benedictine monastery on Egret Island, just off the coast of South Carolina, resides a beautiful and mysterious chair ornately carved with mermaids and dedicated to a saint who, legend claims, was a mermaid before her conversion.<br/><br/>When Jessie Sullivan is summoned home to the island to cope with her eccentric mother’s seemingly inexplicable behavior, she is living a conventional life with her husband, Hugh, a life “molded to the smallest space possible.” Jessie loves Hugh, but once on the island, she finds herself drawn to Brother Thomas, a monk about to take his final vows. Amid a rich community of unforgettable island women and the exotic beauty of marshlands, tidal creeks, and majestic egrets, Jessie grapples with the tension of desire and the struggle to deny it, with a freedom that feels overwhelmingly right, and with the immutable force of home and marriage.<br/><br/>Is the power of the mermaid chair only a myth? Or will it alter the course of Jessie’s life? What happens will unlock the roots of her mother’s tormented past, but most of all, it will allow Jessie to discover selfhood and a place of belonging as she explores the thin line between the spiritual and the erotic.", "language": "en", "image": "https://images.isbndb.com/covers/66/92/9780143036692.jpg", "title_long": "The Mermaid Chair: A Novel", "edition": "Reprint", "dimensions": "Height: 7.66 Inches, Length: 5 Inches, Weight: 0.52 Pounds, Width: 0.62 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 0.62}, "weight": {"unit": "pounds", "value": 0.52}, "height": {"unit": "inches", "value": 7.66}}, "pages": 368, "date_published": "2006-03-07", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Family Life', 'Women's Fiction', 'Domestic Life', 'Mothers & Children', 'Contemporary', 'United States', 'Literary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Psychological Thrillers', 'Self Service', 'Custom Stores'], 'authors": ["Sue Monk Kidd'], 'title": "The Mermaid Chair: A Novel", "isbn13": "9780143036692", "msrp": 17, "binding": "Paperback", "related": {"Kindle Edition": "1101201037", "ePub": "1101201037"}, "isbn": "0143036696", "isbn10": "0143036696", "other_isbns": [{'isbn": "9781101201039", "binding": "print"}]}}