{"book": {"publisher": "Clarion Books", "synopsis": "In this beautifully crafted novel, the first of the Annals of the Western Shore trilogy, Ursula K. Le Guin writes of the proud cruelty of power, of how hard it is to grow up, and of how much harder still it is to find, in the world\"s darkness, gifts of light.<br/>Scattered among poor, desolate farms, the clans of the Uplands possess gifts. Wondrous gifts: the ability—with a glance, a gesture, a word—to summon animals, bring forth fire, move the land. Fearsome gifts: They can twist a limb, chain a mind, inflict a wasting illness.<br/>The Uplanders live in constant fear that one family might unleash its gift against another. Two young people, friends since childhood, decide not to use their gifts. One, a girl, refuses to bring animals to their death in the hunt. The other, a boy, wears a blindfold lest his eyes and his anger kill.<br/>“A brilliant exploration of the power and responsibility of gifts.” —Publishers Weekly (starred review)<br/>"As always, Le Guin has delivered a story that captivates and draws the reader in. Anyone who enjoyed her Earthsea trilogy will relish this new work and fans of dark fantasy, such as Philip Pullman\"s The Golden Compass, will want to check out this title as well.' —BookPage<br/>'In this moment in history, as well as in the current political climate, perhaps it\'s impossible not to see commentary behind every character in a young adult fantasy novel. But Le Guin\'s detailing of the consequences of greed, bullying and misused power is timeless as well as timely, and has the deep, lasting ring of truth that makes for well-loved, enduring young adult literature.' —Erin Ergenbright, The Oregonian<br/>“Gifts is an excellent read for teens of all interests. Fans of fantasy will be particularly drawn to it, but the world is grounded enough in earthly reality that it should appeal even to those who usually avoid the fantastical. Thought-provoking and suspenseful, with a dollop of action and romance, a novel like this is a gift to its readers.' —Lynn Crow, TeensReadToo<br/>The Annals of the Western Shore Trilogy includes: Gifts Voices Powers', 'language": "en", "image": "https://images.isbndb.com/covers/12/42/9780152051242.jpg", "title_long": "Gifts (Annals of the Western Shore, 1)", "edition": "First Edition", "dimensions": "Height: 0.82 Inches, Length: 7 Inches, Weight: 0.46 Pounds, Width: 5.14 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7}, "width": {"unit": "inches", "value": 5.14}, "weight": {"unit": "pounds", "value": 0.46}, "height": {"unit": "inches", "value": 0.82}}, "pages": 286, "date_published": "2006-04-01", "subjects": ["Children's Books', 'Growing Up & Facts of Life', 'Difficult Discussions', 'Science Fiction & Fantasy', 'Fantasy & Magic', 'Teen & Young Adult', 'Literature & Fiction', 'Girls & Women', 'Social & Family Issues', 'Fantasy', 'Science Fiction'], 'authors": ["Ursula K. Le Guin', 'Ginger Clark'], 'title": "Gifts (Annals of the Western Shore, 1)", "isbn13": "9780152051242", "msrp": 9.99, "binding": "Paperback", "related": {"ePub": "0547539878"}, "isbn": "0152051244", "isbn10": "0152051244", "other_isbns": [{'isbn": "9780547539874", "binding": "saleableprint"}]}}