{"book": {"publisher": "Harcourt", "synopsis": "From Emma Donoghue, the national bestselling author of Room, Slammerkin is "[a] colorful romp of a novel" (The New York Times Book Review) following one woman\"s journey of self-discovery and survival at the dawn of the industrial revolution in eighteenth century England.<br/>Slammerkin: A loose gown; a loose woman.<br/>Born to rough cloth in Hogarth\'s London, but longing for silk, Mary Saunders\'s eye for a shiny red ribbon leads her to prostitution at a young age. A dangerous misstep sends her fleeing to Monmouth, and the position of household seamstress, the ordinary life of an ordinary girl with no expectations.<br/>But Mary has known freedom, and having never known love, it is freedom that motivates her. Mary asks herself if the prostitute who hires out her body is more or less free than the 'honest woman' locked into marriage, or the servant who runs a household not her own? And is either as free as a man? Ultimately, Mary remains true only to the three rules she learned on the streets: Never give up your liberty. Clothes make the woman. Clothes are the greatest lie ever told.', 'language": "en", "image": "https://images.isbndb.com/covers/74/74/9780156007474.jpg", "title_long": "Slammerkin", "edition": "First Edition", "dimensions": "Height: 7.75 Inches, Length: 1 Inches, Weight: 0.75 Pounds, Width: 5.25 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 1}, "width": {"unit": "inches", "value": 5.25}, "weight": {"unit": "pounds", "value": 0.75}, "height": {"unit": "inches", "value": 7.75}}, "pages": 390, "date_published": "2002-05-01", "subjects": ["LGBTQ+ Books', 'Literature & Fiction', 'Genre Fiction', 'Historical', 'British & Irish', 'Contemporary', 'Literary'], 'authors": ["Emma Donoghue'], 'title": "Slammerkin", "isbn13": "9780156007474", "msrp": "0.00", "binding": "Paperback", "related": {"ePub": "0547443293"}, "isbn": "0156007479", "isbn10": "0156007479", "other_isbns": [{'isbn": "9780547443294", "binding": "saleableprint"}]}}