{"book": {"publisher": "Mariner Books", "synopsis": "A compelling tale of edgy, small-town emotions, lingering obsession, and romantic salvation from acclaimed novelist Anita Shreve.<br/><br/>Andrew, after many years, returns to his hometown to attend his mother"s funeral. Planning to remain only a few days, he is drawn into the tragic legacy of his childhood friend and beautiful girl next door, Eden Close. An adopted child, Eden had learned to avoid the mother who did not want her and to please the father who did. She also aimed to please Andrew and his friends, first by being one of the boys and later by seducing them. Then one hot night, Andrew was awakened by gunshots and piercing screams from the next farm: Mr. Close had been killed and Eden blinded.<br/><br/>Now, seventeen years later, Andrew begins to uncover the grisly story––to unravel the layers of thwarted love between the husband, wife, and tormented girl. And as the truth about Eden"s past comes to light, so too does Andrew"s strange and binding attachment to her reveal itself.', 'language": "en", "image": "https://images.isbndb.com/covers/13/32/9780156031332.jpg", "title_long": "Eden Close", "edition": "First Edition", "dimensions": "Height: 8 Inches, Length: 5.3125 Inches, Weight: 0.58 Pounds, Width: 0.624 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.3125}, "width": {"unit": "inches", "value": 0.624}, "weight": {"unit": "pounds", "value": 0.58}, "height": {"unit": "inches", "value": 8}}, "pages": 265, "date_published": "2005-10-04", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Family Saga', 'Family Life', 'Small Town & Rural', 'Contemporary', 'Mystery, Thriller & Suspense', 'Mystery', 'Self Service', 'Custom Stores'], 'authors": ["Anita Shreve'], 'title": "Eden Close", "isbn13": "9780156031332", "msrp": 14.99, "binding": "Paperback", "related": {"ePub": "054753910X"}, "isbn": "0156031337", "isbn10": "0156031337", "other_isbns": [{'isbn": "9780547539102", "binding": "saleableprint"}]}}