{"book": {"publisher": "Mariner Books", "synopsis": "The annotated, authorized edition of one of the great literary masterpieces of the twentieth century with commentary by leading Virginia Woolf scholar Mark Hussey.<br/>From the seemingly trivial postponement of a visit to a nearby lighthouse, Woolf constructs a remarkable, moving examination of the complex tensions and allegiances of family life and conflict between men and women.<br/>To the Lighthouse is made up of three powerfully charged visions into the life of the Ramsay family living in a summer house off the rocky coast of Scotland. There’s the serene and maternal Mrs. Ramsay, the tragic yet absurd Mr. Ramsay, their eight children, and assorted holiday guests. With the lighthouse excursion postponed, Woolf shows the small joys and quiet tragedies of everyday life that seemingly could go on forever.<br/>But as time winds its way through their lives, the Ramsays face, alone and together, the greatest of human challenges and its greatest triumph—the human capacity for change.<br/>A moving portrait in miniature of family life, To the Lighthouse also has profoundly universal implications, giving language to the silent space that separates people and the space that they transgress to reach each other.<br/>This authorized edition from the Virginia Woolf library features: Biographical Preface Chronology Introduction to the text Extensive notes Suggestions for further reading<br/>This annotated edition is the perfect companion to more fully understand To the Lighthouse, its importance in twentieth century literature, and Virginia Woolf"s world.", "language": "en", "image": "https://images.isbndb.com/covers/04/72/9780156030472.jpg", "title_long": "To The Lighthouse (annotated)", "edition": "First Edition", "dimensions": "Height: 8 Inches, Length: 0.83 Inches, Weight: 0.64 Pounds, Width: 5.31 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 0.83}, "width": {"unit": "inches", "value": 5.31}, "weight": {"unit": "pounds", "value": 0.64}, "height": {"unit": "inches", "value": 8}}, "pages": 320, "date_published": "2005-08-01", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Historical', 'Family Life', 'British & Irish', 'United States', 'Literary', 'Teen & Young Adult', 'Self Service', 'Custom Stores'], 'authors": ["Virginia Woolf'], 'title": "To The Lighthouse (annotated)", "isbn13": "9780156030472", "msrp": 15.99, "binding": "Paperback", "isbn": "0156030470", "isbn10": "0156030470", "other_isbns": [{'isbn": "9780547707532", "binding": "print"}]}}