{"book": {"publisher": "Harcourt", "synopsis": "International bestselling and award-winning author Umberto Eco\"s illustrated novel The Mysterious Flame of Queen Loana is "an insidiously witty and provocative story" (Los Angeles Times).<br/><br/>Yambo, a sixtyish rare-book dealer who lives in Milan, has suffered a loss of memory — he can remember the plot of every book he has ever read, every line of poetry, but he no longer knows his own name, doesn\'t recognize his wife or his daughters, and remembers nothing about his parents or his childhood. In an effort to retrieve his past, he withdraws to the family home somewhere in the hills between Milan and Turin.<br/><br/>There, in the sprawling attic, he searches through boxes of old newspapers, comics, records, photo albums, and adolescent diaries. And so Yambo relives the story of his generation: Mussolini, Catholic education and guilt, Josephine Baker, Flash Gordon, Fred Astaire. His memories run wild, and the life racing before his eyes takes the form of a graphic novel. Yambo struggles through the frames to capture one simple, innocent image: that of his first love.<br/><br/>A fascinating, abundant novel — wide-ranging, nostalgic, funny, full of heart — from the incomparable Eco.', 'language": "en", "image": "https://images.isbndb.com/covers/04/34/9780156030434.jpg", "title_long": "The Mysterious Flame Of Queen Loana", "edition": "First Edition", "dimensions": "Height: 1.21 Inches, Length: 7.58 Inches, Weight: 1.12 Pounds, Width: 5.36 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.58}, "width": {"unit": "inches", "value": 5.36}, "weight": {"unit": "pounds", "value": 1.12}, "height": {"unit": "inches", "value": 1.21}}, "pages": 469, "date_published": "2006-06-05", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Metaphysical & Visionary', 'Psychological', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Umberto Eco'], 'title": "The Mysterious Flame Of Queen Loana", "isbn13": "9780156030434", "msrp": 18, 'binding": "Paperback", "isbn": "0156030438", "isbn10": "0156030438"}}