{"book": {"publisher": "Harper Perennial", "synopsis": ""Donoghue… has an extraordinary talent for turning exhaustive research into plausible characters and narratives; she presents a vibrant world seething with repressed feeling and class tensions." Publishers Weekly (starred review)<br/>The bestselling author of Slammerkin vividly brings to life the Beau Monde of late eighteenth-century England, turning the private drama of three celebrated Londoners into a robust, full-bodied portrait of a world on the brink of revolution. In a time of looming war, of glittering spectacle and financial disasters, the wealthy liberals of the Whig Party work to topple a tyrannical prime minister and a lunatic king. Marriages and friendships stretch or break; political liaisons prove as dangerous as erotic ones; and everyone wears a mask. Will Eliza Farren, England"s leading comedic actress, gain entry to that elite circle that calls itself the World? Can Lord Derby, the inventor of the horse race that bears his name, endure public mockery of his long, unconsummated courtship of the actress? Will Anne Damer, a sculptor and rumored sapphist, be the cause of Eliza's fall from grace?<br/>This is a remarkable novel in the tradition of the very best historical fiction.', 'language": "en", "image": "https://images.isbndb.com/covers/26/43/9780156032643.jpg", "title_long": "Life Mask", "edition": "First Edition", "dimensions": "Height: 7.96 Inches, Length: 5.4 Inches, Weight: 0.65 Pounds, Width: 1.23 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.4}, "width": {"unit": "inches", "value": 1.23}, "weight": {"unit": "pounds", "value": 0.65}, "height": {"unit": "inches", "value": 7.96}}, "pages": 672, "date_published": "2005-09-05", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'Biographical', 'Women's Fiction', 'United States', 'Literary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Spies & Politics', 'Self Service', 'Custom Stores'], 'authors": ["Emma Donoghue'], 'title": "Life Mask", "isbn13": "9780156032643", "msrp": "0.00", "binding": "Paperback", "isbn": "0156032643", "isbn10": "0156032643", "other_isbns": [{'isbn": "9780547541464", "binding": "printisbncanonical"}]}}