{"book": {"publisher": "Harvest Books", "synopsis": "A fifteenth-century painting by a Flemish master is about to be auctioned when Julia, a young art restorer, discovers a peculiar inscription hidden in a corner: Who killed the knight? In the painting, the Duke of Flanders and his knight are locked in a game of chess, and a dark lady lurks mysteriously in the background. Julia is determined to solve the five-hundred-year-old murder, but as she begins to look for clues, several of her friends in the art world are brutally murdered in quick succession. Messages left with the bodies suggest a crucial connection between the chess game in the painting, the knight"s murder, the sordid underside of the contemporary art world, and the latest deaths. Just when all of the players in the mystery seem to be pawns themselves, events race toward a shocking conclusion. A thriller like no other, The Flanders Panel presents a tantalizing puzzle for any connoisseur of mystery, chess, art, and history.", "language": "en", "image": "https://images.isbndb.com/covers/95/82/9780156029582.jpg", "title_long": "The Flanders Panel", "edition": "Reprint", "dimensions": "Height: 0.7 Inches, Length: 8 Inches, Weight: 0.66 Pounds, Width: 5.38 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8}, "width": {"unit": "inches", "value": 5.38}, "weight": {"unit": "pounds", "value": 0.66}, "height": {"unit": "inches", "value": 0.7}}, "pages": 294, "date_published": "2004-06-07", "subjects": ["Literature & Fiction', 'United States', 'Literary', 'Mystery, Thriller & Suspense', 'Mystery', 'Thrillers & Suspense', 'Suspense', 'Crime', 'Historical', 'Self Service', 'Custom Stores'], 'authors": ["Arturo Perez-Reverte'], 'title": "The Flanders Panel", "isbn13": "9780156029582", "msrp": 15.95, "binding": "Paperback", "related": {"Page Fidelity": "0547539584", "eBook": "0547539584"}, "isbn": "0156029588", "isbn10": "0156029588", "other_isbns": [{'isbn": "9780547539584", "binding": "saleableprint"}]}}