{"book": {"publisher": "Oxford University Press", "synopsis": "The Antiquary, Scott\"s personal favorite among his novels, is characteristically wry and urbane. A mysterious young man calling himself \"Lovel\" travels idly but fatefully toward the Scottish seaside town of Fairport. Here he is befriended by the antiquary Jonathan Oldbuck, who has taken refuge from his own personal disappointments in the obsessive study of miscellaneous history. Their slow unraveling of Lovel\'s true identity will unearth and redeem the secrets and lies which have devastated the guilt-haunted Earl of Glenallan, and will reinstate the tottering fortunes of Sir Arthur Wardour and his daughter Isabella.<br/>First published in 1816 in the aftermath of Waterloo, The Antiquary deals with the problem of how to understand the past so as to enable the future. Set in the tense times of the wars with revolutionary France, it displays Scott\'s matchless skill at painting the social panorama and in creating vivid characters, from the earthy beggar Edie Ochiltree to the loquacious and shrewdly humorous Antiquary himself.<br/>The text is based on Scott\'s own final, authorized version, the 'Magnum Opus' edition of 1829.', 'language": "en", "image": "https://images.isbndb.com/covers/18/73/9780192831873.jpg", "title_long": "The Antiquary (Oxford World"s Classics)", 'dimensions": "Height: 7.75 Inches, Length: 5.25 Inches, Weight: 0.75 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.25}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 0.75}, "height": {"unit": "inches", "value": 7.75}}, "pages": 528, "date_published": "2002-05-23", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Historical', 'British & Irish', 'Contemporary', 'Literary'], 'authors": ["Sir Walter Scott'], 'title": "The Antiquary (Oxford World"s Classics)", 'isbn13": "9780192831873", "msrp": 15.95, 'binding": "Paperback", "isbn": "0192831879", "isbn10": "0192831879"}}