{"book": {"publisher": "Oxford University Press", "synopsis": "Paradise Lost is the great epic poem of the English language, a tale of immense drama and excitement, of rebellion and treachery, of innocence pitted against corruption, in which God and Satan fight a bitter battle for control of mankind"s destiny. The struggle ranges across heaven, hell, and earth, as Satan and his band of rebel angels conspire against God. At the center of the conflict are Adam and Eve, motivated by all too human temptations, but whose ultimate downfall is unyielding love.<br/>This marvelous edition boasts an introduction by one of Milton"s most famous modern admirers, the best-selling novelist Philip Pullman. Indeed, Pullman not only provides a general introduction, but also introduces each of the twelve books of the poem. In these commentaries, Pullman illuminates the power of the poem and its achievement as a story, suggests how we should read it today, and describes its influence on him and his acclaimed trilogy His Dark Materials, which takes its title from a line in the poem. His observations offer a tribute that is both personal and insightful, and his enthusiasm for Milton"s language, skill, and supreme gifts as a storyteller is infectious. He encourages readers above all to experience the poem for themselves, and surrender to its enchantment.<br/>Pullman's tremendous admiration and passion for Paradise Lost will attract a whole new generation of readers to this classic of English literature. An ideal gift, the book is beautifully produced, printed in two colors throughout, illustrated with the twelve engravings from the first illustrated edition published in 1688, with ribbon marker.', 'language": "en", "image": "https://images.isbndb.com/covers/61/92/9780192806192.jpg", "title_long": "Paradise Lost", "dimensions": "Height: 9.5 Inches, Length: 6.5 Inches, Weight: 2.2 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.5}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 2.2}, "height": {"unit": "inches", "value": 9.5}}, "pages": 384, "date_published": "2005-09-15", "subjects": ["Christian Books & Bibles', 'Literature & Fiction', 'Classics', 'History & Criticism', 'Criticism & Theory', 'Genres & Styles', 'Regional & Cultural', 'Poetry', 'World Literature', 'European', 'British & Irish'], 'authors": ['John Milton'], 'title": "Paradise Lost", "isbn13": "9780192806192", "msrp": "0.00", "binding": "Hardcover", "isbn": "019280619X", "isbn10": "019280619X"}}