{"book": {"publisher": "Oxford University Press", "synopsis": "In Gulliver"s Travels, the narrator represents himself as a reliable reporter of the fantastic adventures he has just experienced. But how far can we rely on a narrator who has been impersonated by someone else? The work purports to be a travel book, and describes the shipwrecked Gulliver"s encounters with the inhabitants of four extraordinary places: Lilliput, Brobdingnag, Laputa, and the country of the Houyhnhnms. An extraordinarily skillful blend of fantasy and realism makes Gulliver"s Travels by turns hilarious, frightening, and profound. Swift's alter ego plays tricks on us, and our gullibility uncovers one of the world's most disturbing satires of the human condition.<br/><br/>The fullest, most up-to-date paperback of Gulliver's Travels currently available, this new edition contains an astute analysis of the nature of Swift's satire. It includes the changing frontispiece portraits of Gulliver that appeared in successive early editions and whose subtle changes contribute to the reader's uncertainty about the veracity of the author. A new introduction by Claude Rawson draws on the latest scholarship and considers Swift's role-playing and the relationship of the author to Gulliver.', 'language": "en", "image": "https://images.isbndb.com/covers/53/48/9780192805348.jpg", "title_long": "Gulliver"s Travels (Oxford World"s Classics)', 'dimensions": "Height: 7.75 Inches, Length: 5 Inches, Weight: 0.65 Pounds, Width: 0.8 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 0.8}, "weight": {"unit": "pounds", "value": 0.65}, "height": {"unit": "inches", "value": 7.75}}, "pages": 422, "date_published": "2005-04-21", "subjects": ["Literature & Fiction', 'Classics', 'Contemporary', 'Literary'], 'authors": ["Jonathan Swift'], 'title": "Gulliver"s Travels (Oxford World"s Classics)', 'isbn13": "9780192805348", "msrp": 7.95, 'binding": "Paperback", "isbn": "0192805347", "isbn10": "0192805347"}}