{"book": {"publisher": "Oxford University Press", "synopsis": "King Lear, widely considered Shakespeare"s most deeply moving, passionately expressed, and intellectually ambitious play, has almost always been edited from the revised version printed in the First Folio of 1623, with additions from the quarto of 1608. Now for the first time, this new volume presents the full, scholarly edition to be based firmly on the quarto, now recognized as the base text from which all others derive. A thorough, attractively written introduction suggests how the work grew slowly in Shakespeare"s imagination, fed by years of reading, thinking, and experience as a practical dramatist.<br/>This editition consists of a new, modern-spelling text; a full index to the introduction and commentary; production photographs and related art. The on-page commentary and detailed notes to this edition offer critical help in understanding the language and dramaturgy in relation to the theaters in which King Lear was first performed. Additional sections reprint the early ballad, which was among the play"s earliest sources, and provide additional guides to understanding and appreciating one of the greatest masterworks of Western civilization.', 'language": "en", "image": "https://images.isbndb.com/covers/99/23/9780192839923.jpg", "title_long": "The History of King Lear (Oxford World"s Classics)", 'edition": "New edition", "dimensions": "Height: 7.5 Inches, Length: 5.25 Inches, Weight: 0.75 Pounds, Width: 0.75 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.25}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 0.75}, "height": {"unit": "inches", "value": 7.5}}, "pages": 336, "date_published": "2001-04-12", "subjects": ["Literature & Fiction', 'Classics', 'Dramas & Plays', 'Shakespeare', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["William Shakespeare'], 'title": "The History of King Lear (Oxford World"s Classics)", 'isbn13": "9780192839923", "msrp": 10.95, 'binding": "Paperback", "isbn": "0192839926", "isbn10": "0192839926"}}