{"book": {"publisher": "Oxford University Press", "synopsis": "In the early 1300s, Dante Alighieri set out to write the three volumes which make the up The Divine Comedy. Purgatorio is the second volume in this set and opens with Dante the poet picturing Dante the pilgrim coming out of the pit of hell. Similar to the Inferno (34 cantos), this volume is divided into 33 cantos, written in tercets (groups of 3 lines). The English prose is arranged in tercets to facilitate easy correspondence to the verse form of the Italian on the facing page, enabling the reader to follow both languages line by line. In an effort to capture the peculiarities of Dante\"s original language, this translation strives toward the literal and sheds new light on the shape of the poem. Again the text of Purgatorio follows Petrocchi\"s La Commedia secondo l\"antica vulgata, but the editor has departed from Petrocchi\'s readings in a number of cases, somewhat larger than in the previous Inferno, not without consideration of recent critical readings of the Comedy by scholars such as Lanza (1995, 1997) and Sanguineti (2001). As before, Petrocchi\'s punctuation has been lightened and American norms have been followed. However, without any pretensions to being 'critical', the text presented here is electic and being not persuaded of the exclusive authority of any manuscript, the editor has felt free to adopt readings from various branches of the stemma. One major addition to this second volume is in the notes, where is found the Intercantica - a section for each canto that discusses its relation to the Inferno and which will make it easier for the reader to relate the different parts of the Comedy as a whole.', 'language": "en", "image": "https://images.isbndb.com/covers/74/51/9780195087451.jpg", "title_long": "Purgatorio: The Divine Comedy of Dante Alighieri, Vol. 2", "dimensions": "Height: 1.87 Inches, Length: 9.28 Inches, Weight: 2.30823988314 Pounds, Width: 6.12 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 9.28}, "width": {"unit": "inches", "value": 6.12}, "weight": {"unit": "pounds", "value": 2.30823988314}, "height": {"unit": "inches", "value": 1.87}}, "pages": 704, "date_published": "2004-04-08", "subjects": ["Literature & Fiction', 'History & Criticism', 'Movements & Periods', 'Regional & Cultural', 'Poetry', 'Ancient, Classical & Medieval', 'World Literature', 'European', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Robert M. Durling'], 'title": "Purgatorio: The Divine Comedy of Dante Alighieri, Vol. 2", "isbn13": "9780195087451", "msrp": 24.99, "binding": "Paperback", "related": {"ePub": "0199879834"}, "isbn": "0195087453", "isbn10": "0195087453", "other_isbns": [{'isbn": "9780199879830", "binding": "saleableprint"}]}}