{"book": {"publisher": "Oxford University Press", "synopsis": "Norse Mythology explores the magical myths and legends of Norway, Sweden, Denmark, Iceland and Viking-Age Greenland and outlines the way the prehistoric tales and beliefs from these regions that have remained embedded in the imagination of the world.<br/><br/>The book begins with an Introduction that helps put Scandinavian mythology in place in history, followed by a chapter that explains the meaning of mythic time, and a third section that presents in-depth explanations of each mythological term. These fascinating entries identify particular deities and giants, as well as the places where they dwell and the varied and wily means by which they forge their existence and battle one another. We meet Thor, one of the most powerful gods, who specializes in killing giants using a hammer made for him by dwarfs, not to mention myriad trolls, ogres, humans and strange animals. We learn of the ongoing struggle between the gods, who create the cosmos, and the jötnar, or giants, who aim to destroy it. In the enchanted world where this mythology takes place, we encounter turbulent rivers, majestic mountains, dense forests, storms, fierce winters, eagles, ravens, salmon and snakes in a landscape closely resembling Scandinavia. Beings travel on ships and on horseback; they eat slaughtered meat and drink mead.<br/><br/>Spanning from the inception of the universe and the birth of human beings to the universe"s destruction and the mythic future, these sparkling tales of creation and destruction, death and rebirth, gods and heroes will entertain readers and offer insight into the relationship between Scandinavian myth, history, and culture.", "language": "en", "image": "https://images.isbndb.com/covers/38/28/9780195153828.jpg", "title_long": "Norse Mythology: A Guide to Gods, Heroes, Rituals, and Beliefs", "edition": "1", "dimensions": "Height: 6.1 inches, Length: 9.4 inches, Weight: 1.34922904344 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 9.4}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 1.34922904344}, "height": {"unit": "inches", "value": 6.1}}, "pages": 384, "date_published": "2002-10-17", "subjects": ["Literature & Fiction', 'Mythology & Folk Tales', 'Folklore', 'Religion & Spirituality', 'Religious Studies', 'Comparative Religion'], 'authors": ["John Lindow'], 'title": "Norse Mythology: A Guide to Gods, Heroes, Rituals, and Beliefs", "isbn13": "9780195153828", "msrp": 10.44, "binding": "Paperback", "related": {"ePub": "0199839697"}, "isbn": "0195153820", "isbn10": "0195153820", "other_isbns": [{'isbn": "9780199839698", "binding": "printisbncanonical"}]}}