{"book": {"publisher": "Oxford University Press", "synopsis": "Revised and expanded in this third edition, American Legal History now features a new coauthor, James Ely, who is a specialist in the history of property rights. This highly acclaimed text provides a comprehensive selection of the most important documents in the field, which integrates the history of public and private law from America\"s colonial origins to the present. Devoting special attention to the interaction of social and legal change, it shows how legal ideas developed in tandem with specific historical events and reveals a rich legal culture unique to America. The book also deals with state and federal courts and looks at the relationship between the development of American society, politics, and economy, and how it relates to the evolution of American law. Introductions and instructive headnotes accompany each document, tying legal developments to broader historical themes and providing a social and political context essential to an understanding of the history of law in America.<br/>American Legal History, Third Edition, offers fresh material throughout and increased coverage of cases on such topics as slave law, politics, and terrorism. The authors have incorporated more cases dealing with minority rights, including Native American and Asian American rights, women\"s rights, and gender and gay rights. Two new chapters have been added to this edition: one on law and economics in modern America, including a discussion of the new federalism, and the other on law, politics, and terrorism, including a full discussion of the USA PATRIOT Act. The "since 1945' portion includes up-to-date material and current cases. The section on English background and colonial America has been expanded. In addition, there is new material on the most recent developments in American constitutional and legal history. Setting the legal challenges of the twenty-first century in a broad context, American Legal History, Third Edition, is an essential text for students and teachers of constitutional and legal history, the judicial process, and the effects of society on law.', 'language": "en", "image": "https://images.isbndb.com/covers/22/57/9780195162257.jpg", "title_long": "American Legal History: Cases and Materials", "edition": "3", "dimensions": "Height: 6.3 Inches, Length: 9 Inches, Weight: 2.38540167484 Pounds, Width: 1.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 9}, "width": {"unit": "inches", "value": 1.5}, "weight": {"unit": "pounds", "value": 2.38540167484}, "height": {"unit": "inches", "value": 6.3}}, "pages": 736, "date_published": "2004-10-28", "subjects": ["History', 'Americas', 'United States', 'Law', 'Legal History', 'Politics & Social Sciences', 'Politics & Government', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Kermit L. Hall', 'Paul Finkelman', 'James W. Ely Jr.'], 'title": "American Legal History: Cases and Materials", "isbn13": "9780195162257", "msrp": 59.95, 'binding": "Paperback", "isbn": "0195162250", "isbn10": "0195162250"}}