{"book": {"publisher": "Oxford University Press", "synopsis": "In this innovative study of the South Carolina Low Country, author Stephanie McCurry explores the place of the yeomanry in plantation society--the complex web of domestic and public relations within which they were enmeshed, and the contradictory politics of slave society by which that class of small farmers extracted the privileges of masterhood from the region"s powerful planters. Insisting on the centrality of women as historical actors and gender as a category of analysis, this work shows how the fateful political choices made by the low-country yeomanry were rooted in the politics of the household, particularly in the customary relations of power male heads of independent households assumed over their dependents, whether slaves or free women and children. Such masterly prerogatives, practiced in the domestic sphere and redeemed in the public, explain the yeomanry"s deep commitment to slavery and, ultimately, their ardent embrace of secession.<br/><br/>By placing the yeomanry in the center of the drama, McCurry offers a significant reinterpretation of this volatile society on the road to Civil War. Through careful and creative use of a wide variety of archival sources, she brings vividly to life the small worlds of yeoman households, and the larger world of the South Carolina Low Country, the plantation South, and nineteenth-century America.", 'language": "en", "image": "https://images.isbndb.com/covers/79/50/9780195117950.jpg", "title_long": "Masters of Small Worlds: Yeoman Households, Gender Relations, and the Political Culture of the Antebellum South Carolina Low Country", "edition": "unknown", "dimensions": "Height: 0.97 Inches, Length: 9.2 Inches, Weight: 1.08246970642 Pounds, Width: 6.12 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 9.2}, "width": {"unit": "inches", "value": 6.12}, "weight": {"unit": "pounds", "value": 1.08246970642}, "height": {"unit": "inches", "value": 0.97}}, "pages": 344, "date_published": "1997-09-11", "subjects": ["History', 'Americas', 'United States', 'Politics & Social Sciences', 'Social Sciences', 'Gender Studies', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Stephanie McCurry'], 'title": "Masters of Small Worlds: Yeoman Households, Gender Relations, and the Political Culture of the Antebellum South Carolina Low Country", "isbn13": "9780195117950", "msrp": 23.93, "binding": "Paperback", "isbn": "0195117956", "isbn10": "0195117956", "other_isbns": [{'isbn": "9780199879410", "binding": "print"}]}}