{"book": {"publisher": "Oxford University Press", "synopsis": "How do creative people think? Do great works of the imagination originate in words or in images? Is there a rational explanation for the sudden appearance of geniuses like Mozart or Einstein? Such questions have fascinated people for centuries; only in recent years, however, has cognitive psychology been able to provide some clues to the mysterious process of creativity. In this revised edition of Notebooks of the Mind, Vera John-Steiner combines imaginative insight with scientific precision to produce a startling account of the human mind working at its highest potential.<br/>To approach her subject John-Steiner goes directly to the source, assembling the thoughts of "experienced thinkers"--artists, philosophers, writers, and scientists able to reflect on their own imaginative patterns. More than fifty interviews (with figures ranging from Jessica Mitford to Aaron Copland), along with excerpts from the diaries, letters, and autobiographies of such gifted giants as Leo Tolstoy, Marie Curie, and Diego Rivera, among others, provide illuminating insights into creative activity. We read, for example, of Darwin\"s preoccupation with the image of nature as a branched tree while working on his concept of evolution. Mozart testifies to the vital influence on his mature art of the wondrous 'bag of memories' he retained from childhood. Anais Nin describes her sense of words as oppressive, explaining how imagistic free association freed her as a writer.<br/>Adding these personal accounts to laboratory studies of thought process, John-Steiner takes a refreshingly holistic approach to the question of creativity. What emerges is an intriguing demonstration of how specific sociocultural circumstances interact with certain personality traits to encourage the creative mind. Among the topics examined here are the importance of childhood mentor figures; the lengthy apprenticeship of the talented person; and the development of self- expression through highly individualistic languages, whether in images, movement or inner speech.<br/>Now, with a new introduction, this award-winning book provides an uniquely broad-based study of the origins, development and fruits of human inspiration.', 'language": "en", "image": "https://images.isbndb.com/covers/89/65/9780195108965.jpg", "title_long": "Notebooks of the Mind: Explorations of Thinking", "edition": "Revised", "dimensions": "Height: 0.71 Inches, Length: 8.6 Inches, Weight: 0.89728140634 Pounds, Width: 5.54 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.6}, "width": {"unit": "inches", "value": 5.54}, "weight": {"unit": "pounds", "value": 0.89728140634}, "height": {"unit": "inches", "value": 0.71}}, "pages": 288, "date_published": "1997-01-23", "subjects": ["Health, Fitness & Dieting', 'Psychology & Counseling', 'Creativity & Genius', 'Science & Math', 'Behavioral Sciences', 'Behavioral Psychology', 'Cognitive Psychology', 'Medical Books', 'Psychology', 'Cognitive', 'Movements', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Vera John-Steiner'], 'title": "Notebooks of the Mind: Explorations of Thinking", "isbn13": "9780195108965", "msrp": 41.95, "binding": "Paperback", "related": {"ePub": "0190283130"}, "isbn": "0195108965", "isbn10": "0195108965", "other_isbns": [{'isbn": "9780190283131", "binding": "printisbncanonical"}]}}