{"book": {"publisher": "Oxford University Press", "synopsis": "With well over a million copies sold, Sun Tzu"s The Art of War is a true masterpiece, a series of brilliant aphorisms that illuminate the planning and conduct of war. Now this classic work is available in an elegant illustrated edition, featuring seventy-five color and black-and-white images.<br/><br/>From perceptive descriptions of the nine varieties of terrain, to advice on how to gage an enemy"s weaknesses and strengths, to suggestions on the employment of secret agents, here is timeless advice on combat and military strategy. Sun Tzu"s writings are unsurpassed in depth of understanding, shedding light not only on battlefield maneuvers, but also on the relevant economic, political, and psychological factors that can shape the outcome of warfare. Equally important, the precepts outlined by Sun Tzu over two thousand years ago can be applied with great success outside the theater of war. Indeed, it is read avidly by corporate executives worldwide and has been touted in the movie Wall Street and the television series The Sopranos as the ultimate guide to strategy. Finally, this edition offers the definitive translation of Sun Tzu's text, by former U.S. Marine Brigadier General Samuel Griffith, who was also an authority of Mao Tse-Tung.<br/><br/>Remarkable for its clear organization, lucid prose, and the acuity of its intellectual and moral insights, The Art of War is the definitive study of combat. It is an essential book for military history buffs, and an ideal gift for anyone who is interested in tactics and strategy, whether on the battlefield or in the boardroom.', 'language": "en", "image": "https://images.isbndb.com/covers/99/95/9780195189995.jpg", "title_long": "The Illustrated Art of War", "dimensions": "Height: 6.12 Inches, Length: 9.62 Inches, Weight: 2.075 Pounds, Width: 1.24 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 9.62}, "width": {"unit": "inches", "value": 1.24}, "weight": {"unit": "pounds", "value": 2.075}, "height": {"unit": "inches", "value": 6.12}}, "pages": 288, "date_published": "2005-10-15", "subjects": ["Business & Money', 'Management & Leadership', 'Management', 'History', 'Ancient Civilizations', 'Asia', 'China', 'Military', 'Strategy', 'Engineering & Transportation', 'Engineering', 'Science & Math', 'Technology', 'History of Technology', 'Politics & Social Sciences', 'Philosophy', 'Eastern', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Sun Tzu'], 'title": "The Illustrated Art of War", "isbn13": "9780195189995", "msrp": 20.22, 'binding": "Hardcover", "isbn": "019518999X", "isbn10": "019518999X"}}