{"book": {"publisher": "Oxford University Press", "synopsis": "By any measure, Oliver Wendell Holmes, Jr., led a full and remarkable life. He was tall and exceptionally attractive, especially as he aged, with piercing eyes, a shock of white hair, and prominent moustache. He was the son of a famous father (Oliver Wendell Holmes, Sr., renowned for "The Autocrat of the Breakfast Table"), a thrice-wounded veteran of the Civil War, a Harvard-educated member of Brahmin Boston, the acquaintance of Longfellow, Lowell, and Emerson, and for a time a close friend of William James. He wrote one of the classic works of American legal scholarship, The Common Law, and he served with distinction on the Supreme Court of the United States. He was actively involved in the Court\"s work into his nineties.<br/>In Justice Oliver Wendell Holmes, G. Edward White, the acclaimed biographer of Earl Warren and one of America\'s most esteemed legal scholars, provides a rounded portrait of this remarkable jurist. We see Holmes\'s early life in Boston and at Harvard, his ambivalent relationship with his father, and his harrowing service during the Civil War (he was wounded three times, twice nearly fatally, shot in the chest in his first action, and later shot through the neck at Antietam). White examines Holmes\'s curious, childless marriage (his diary for 1872 noted on June 17th that he had married Fanny Bowditch Dixwell, and the next sentence indicated that he had become the sole editor of the American Law Review) and he includes new information on Holmes\'s relationship with Clare Castletown. White not only provides a vivid portrait of Holmes\'s life, but examines in depth the inner life and thought of this preeminent legal figure. There is a full chapter devoted to The Common Law, for instance, and throughout the book, there is astute commentary on Holmes\'s legal writings. Indeed, White reveals that some of the themes that have dominated 20th-century American jurisprudence--including protection for free speech and the belief that 'judges make the law'--originated in Holmes\'s work. Perhaps most important, White suggests that understanding Holmes\'s life is crucial to understanding his work, and he continually stresses the connections between Holmes\'s legal career and his personal life. For instance, his desire to distinguish himself from his father and from the 'soft' literary culture of his father\'s generation drove him to legal scholarship of a particularly demanding kind.<br/>White\'s biography of Earl Warren was hailed by Anthony Lewis on the cover of The New York Times Book Review as 'serious and fascinating,' and The Los Angeles Times noted that 'White has gone beyond the labels and given us the man.' In Justice Oliver Wendell Holmes, White has produced an equally serious and fascinating biography, one that again goes beyond the labels and gives us the man himself.', 'language": "en", "image": "https://images.isbndb.com/covers/12/87/9780195101287.jpg", "title_long": "Justice Oliver Wendell Holmes: Law and the Inner Self", "edition": "1", "dimensions": "Height: 1.55 Inches, Length: 9.05 Inches, Weight: 1.97754649014 Pounds, Width: 6.08 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 9.05}, "width": {"unit": "inches", "value": 6.08}, "weight": {"unit": "pounds", "value": 1.97754649014}, "height": {"unit": "inches", "value": 1.55}}, "pages": 648, "date_published": "1995-11-16", "subjects": ["Biographies & Memoirs', 'Historical', 'United States', 'Professionals & Academics', 'Lawyers & Judges', 'Law', 'Legal History', 'Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Regional & Cultural', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["G. Edward White'], 'title": "Justice Oliver Wendell Holmes: Law and the Inner Self", "isbn13": "9780195101287", "msrp": 49.99, "binding": "Paperback", "related": {"ePub": "0199880212"}, "isbn": "0195101286", "isbn10": "0195101286", "other_isbns": [{'isbn": "9780199880218", "binding": "printisbncanonical"}]}}