{"book": {"publisher": "Oxford University Press", "synopsis": "The Oxford Dictionary of Quotations has long been hailed as the most literary quotation book available. Here readers will find in one volume the wit and wisdom of humanity--the finest lines to be found in Shakespeare, the Bible, Mark Twain, Groucho Marx, and hundreds of other writers, philosophers, political figures, and entertainers.<br/>This major new edition offers the broadest and most up-to-date coverage of quotations available today. Now with 20,000 quotations arranged by author, this is Oxford"s largest quotations dictionary ever. Alongside superb coverage of quotations from traditional sources, the Dictionary now boasts improved coverage of world religions, classical Greek and Latin literature, proverbs, and nursery rhymes. In addition, for the first time there are special sections for Advertising Slogans, Epitaphs, Film Lines, and Misquotations, which bring together topical and related quotes. Moreover, the new Fifth Edition provides enhanced accessibility with a new thematic index to help you find the best quotes on a chosen subject, more in depth details of the earliest traceable source, an extensive keyword index, and biographical cross references, so you will easily be able to find quotations for all occasions, and identify who said what, where, and when.<br/>Ranging from profound, to cogent, to witty, these quotations will add spice to your writing and conversation. An ideal reference for any home or office library, The Oxford Dictionary of Quotations, Fifth Edition is a constant source of entertainment and inspiration for public speakers, writers, or anyone else who enjoys a sparkling line or a spirited reply.", "language": "en", "image": "https://images.isbndb.com/covers/17/39/9780198601739.jpg", "title_long": "The Oxford Dictionary of Quotations", "edition": "5", "dimensions": "Height: 9.75 Inches, Length: 7.25 Inches, Weight: 4.2 Pounds, Width: 2.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.25}, "width": {"unit": "inches", "value": 2.5}, "weight": {"unit": "pounds", "value": 4.2}, "height": {"unit": "inches", "value": 9.75}}, "pages": 1152, "date_published": "1999-11-25", "subjects": ["Reference', 'Dictionaries & Thesauruses', 'Quotations', 'Words, Language & Grammar', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": [], "title": "The Oxford Dictionary of Quotations", "isbn13": "9780198601739", "msrp": 45, 'binding": "Hardcover", "isbn": "0198601735", "isbn10": "0198601735"}}