{"book": {"publisher": "Yellow Jersey", "synopsis": "In 1999, Lance Armstrong made world headlines with the most stunning comeback in the history of sport after battling against life-threatening testicular cancer just eighteen months before returning to professional cycling. His first book, It"s Not About the Bike, charted his journey back to life and went on to become an international bestseller.<br/><br/>Now, in his much-anticipated follow-up, Armstrong shares more details of his extraordinary life story, including the births of his twin daughters Grace and Isabel. Never shy of controversy, Armstrong offers, with typical frankness, his thoughts on training, competing, winning and failure. He also tells of the work he did for the foundation he created following his dramatic recovery, addresses the daunting challenge of living in the aftermath of cancer and treatment, and shares further inspirational tales of survival.<br/><br/>A fresh outlook on the spirit of survivors everywhere, Every Second Counts is an account of a man who strives every day to meet life"s challenges - whether on his bike or off.<br/><br/>Every Second Counts was first published in October 2003. In an interview with Oprah Winfrey in January 2013, Lance Armstrong admitted to having taken performance enhancing drugs in all seven of the Tours de France in which he competed between 1999 and 2005. He was officially stripped of these wins by the UCI, the world governing body for cycling, in 2012.", 'language": "en", "image": "https://images.isbndb.com/covers/47/36/9780224064736.jpg", "title_long": "Every Second Counts", "edition": "New Ed", "dimensions": "Height: 7.79526 Inches, Length: 5.07873 Inches, Weight: 0.4078551847 Pounds, Width: 0.62992 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.07873}, "width": {"unit": "inches", "value": 0.62992}, "weight": {"unit": "pounds", "value": 0.4078551847}, "height": {"unit": "inches", "value": 7.79526}}, "pages": 246, "date_published": "2003", "subjects": ["Self-Help', 'Biographies & Memoirs', 'Health, Fitness & Dieting'], 'authors": ['Lance Armstrong', 'Sally Jenkins'], 'title": "Every Second Counts", "isbn13": "9780224064736", "msrp": "0.00", "binding": "Paperback", "isbn": "0224064738", "isbn10": "0224064738"}}