{"book": {"publisher": "University of Chicago Press", "synopsis": "From 1840 until 1940, freak shows by the hundreds crisscrossed the United States, from the smallest towns to the largest cities, exhibiting their casts of dwarfs, giants, Siamese twins, bearded ladies, savages, snake charmers, fire eaters, and other oddities. By today\"s standards such displays would be considered cruel and exploitative—the pornography of disability. Yet for one hundred years the freak show was widely accepted as one of America\"s most popular forms of entertainment.<br/><br/>Robert Bogdan\"s fascinating social history brings to life the world of the freak show and explores the culture that nurtured and, later, abandoned it. In uncovering this neglected chapter of show business, he describes in detail the flimflam artistry behind the shows, the promoters and the audiences, and the gradual evolution of public opinion from awe to embarrassment. Freaks were not born, Bogdan reveals; they were manufactured by the amusement world, usually with the active participation of the freaks themselves. Many of the 'human curiosities' found fame and fortune, becoming the celebrities of their time, until the ascent of professional medicine transformed them from marvels into pathological specimans.', 'language": "en", "image": "https://images.isbndb.com/covers/31/26/9780226063126.jpg", "title_long": "Freak Show: Presenting Human Oddities for Amusement and Profit", "edition": "Reprint", "dimensions": "Height: 8.9 Inches, Length: 5.9 Inches, Weight: 1.1243575362 Pounds, Width: 0.9 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.9}, "width": {"unit": "inches", "value": 0.9}, "weight": {"unit": "pounds", "value": 1.1243575362}, "height": {"unit": "inches", "value": 8.9}}, "pages": 336, "date_published": "1990-05-15", "subjects": ["Travel', 'Specialty Travel', 'Theme Parks', 'Politics & Social Sciences', 'Social Sciences', 'Sociology', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Robert Bogdan'], 'title": "Freak Show: Presenting Human Oddities for Amusement and Profit", "isbn13": "9780226063126", "msrp": 32, "binding": "Paperback", "related": {"eBook": "022622743X", "ePub": "022622743X"}, "isbn": "0226063127", "isbn10": "0226063127", "other_isbns": [{'isbn": "9780226227436", "binding": "ebook"}]}}