{"book": {"publisher": "University of Chicago Press", "synopsis": "When it was first published a quarter of a century ago, Richard Posner\"s exposition and defense of an economic approach to antitrust law was a jeremiad against the intellectual disarray that then characterized the field. As other perspectives on antitrust law have fallen away, Posner\"s book has played a major role in transforming the field of antitrust law into a body of economically rational principles largely in accord with the ideas set forth in the first edition. Today\"s antitrust professionals may disagree on specific practices and rules, but most litigators, prosecutors, judges, and scholars agree that the primary goal of antitrust laws should be to promote economic welfare, and that economic theory should be used to determine how well business practices conform to that goal.<br/><br/>In this thoroughly revised edition, Posner explains the economic approach to new generations of lawyers and students. He updates and amplifies his approach as it applies to the developments, both legal and economic, in the antitrust field since 1976. The 'new economy,' for example, has presented a host of difficult antitrust questions, and in an entirely new chapter, Posner explains how the economic approach can be applied to new industries such as software manufacturers, Internet service providers, and those that provide communications equipment and services.<br/><br/>'The antitrust laws are here to stay,' Posner writes, 'and the practical question is how to administer them better-more rationally, more accurately, more expeditiously, more efficiently.' This fully revised classic will continue to be the standard work in the field.', 'language": "en", "image": "https://images.isbndb.com/covers/57/63/9780226675763.jpg", "title_long": "Antitrust Law, Second Edition", "edition": "Second", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 1.37568451488 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 1.37568451488}, "height": {"unit": "inches", "value": 9}}, "pages": 304, "date_published": "2001-12-01", "subjects": ["Law', 'Business', 'Antitrust', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Richard A. Posner'], 'title": "Antitrust Law, Second Edition", "isbn13": "9780226675763", "msrp": 49, "binding": "Hardcover", "related": {"eBook": "0226675785", "ePub": "0226675785"}, "isbn": "0226675769", "isbn10": "0226675769", "other_isbns": [{'isbn": "9780226675787", "binding": "print"}]}}