{"book": {"publisher": "University of Chicago Press", "synopsis": "Hannah Arendt began her scholarly career with an exploration of Saint Augustine"s concept of caritas, or neighborly love, written under the direction of Karl Jaspers and the influence of Martin Heidegger. After her German academic life came to a halt in 1933, Arendt carried her dissertation into exile in France, and years later took the same battered and stained copy to New York. During the late 1950s and early 1960s, as she was completing or reworking her most influential studies of political life, Arendt was simultaneously annotating and revising her dissertation on Augustine, amplifying its argument with terms and concepts she was using in her political works of the same period. The disseration became a bridge over which Arendt traveled back and forth between 1929 Heidelberg and 1960s New York, carrying with her Augustine"s question about the possibility of social life in an age of rapid political and moral change.<br/><br/>In Love and Saint Augustine, Joanna Vecchiarelli Scott and Judith Chelius Stark make this important early work accessible for the first time. Here is a completely corrected and revised English translation that incorporates Arendt"s own substantial revisions and provides additional notes based on letters, contracts, and other documents as well as the recollections of Arendt's friends and colleagues during her later years.', 'language": "en", "image": "https://images.isbndb.com/covers/59/71/9780226025971.jpg", "title_long": "Love and Saint Augustine", "edition": "1", "dimensions": "Height: 0.55 Inches, Length: 8.94 Inches, Weight: 0.87523518014 Pounds, Width: 5.82 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.94}, "width": {"unit": "inches", "value": 5.82}, "weight": {"unit": "pounds", "value": 0.87523518014}, "height": {"unit": "inches", "value": 0.55}}, "pages": 254, "date_published": "1998-04-26", "subjects": ["Self-Help', 'Relationships', 'Interpersonal Relations', 'Christian Books & Bibles', 'Catholicism', 'Saints', 'Theology', 'Parenting & Relationships', 'Religion & Spirituality', 'Politics & Social Sciences', 'Philosophy', 'Modern', 'Religious'], 'authors": ["Hannah Arendt'], 'title": "Love and Saint Augustine", "isbn13": "9780226025971", "msrp": 18, "binding": "Paperback", "related": {"eBook": "022622564X", "ePub": "022622564X"}, "isbn": "0226025977", "isbn10": "0226025977", "other_isbns": [{'isbn": "9780226225647", "binding": "print"}]}}