{"book": {"publisher": "University Of Chicago Press", "synopsis": "Roger Ebert has been writing film reviews for the Chicago Sun-Times for nearly forty years. And during those four decades, his wide knowledge, keen judgment, prodigious energy, and sharp sense of humor have made him America’s most celebrated film critic. He was the first such critic to win a Pulitzer Prize—one of just three film critics ever to receive that honor—and the only one to have a star dedicated to him on the Hollywood Walk of Fame. His groundbreaking hit TV show, At the Movies, meanwhile, has made “two thumbs up” one of the most coveted hallmarks in the entire industry.<br/><br/>No critic alive has reviewed more movies than Roger Ebert, and yet his essential writings have never been collected in a single volume—until now. With Awake in the Dark, both fans and film buffs can finally bask in the best of Ebert’s work. The reviews, interviews, and essays collected here present a picture of this indispensable critic’s numerous contributions to the cinema and cinephilia. From The Godfather to GoodFellas, from Cries and Whispers to Crash, the reviews in Awake in the Dark span some of the most exceptional periods in film history, from the dramatic rise of rebel Hollywood and the heyday of the auteur, to the triumph of blockbuster films such as Star Wars and Raiders of the Lost Ark, to the indie revolution that is still with us today.<br/><br/>The extraordinary interviews gathered in Awake in the Dark capture Ebert engaging not only some of the most influential directors of our time—Martin Scorsese, Steven Spielberg, Woody Allen, Robert Altman, Werner Herzog, and Ingmar Bergman—but also some of the silver screen’s most respected and dynamic personalities, including actors as diverse as Robert Mitchum, James Stewart, Warren Beatty, and Meryl Streep. Ebert’s remarkable essays play a significant part in Awake in the Dark as well. The book contains some of Ebert’s most admired pieces, among them a moving appreciation of John Cassavetes and a loving tribute to the virtues of black-and-white films.<br/><br/>If Pauline Kael and Andrew Sarris were godmother and godfather to the movie generation, then Ebert is its voice from within—a writer whose exceptional intelligence and daily bursts of insight and enthusiasm have shaped the way we think about the movies. Awake in the Dark, therefore, will be a treasure trove not just for fans of this seminal critic, but for anyone desiring a fascinating and compulsively readable chronicle of film since the late 1960s.", "language": "en", "image": "https://images.isbndb.com/covers/20/01/9780226182001.jpg", "title_long": "Awake in the Dark: The Best of Roger Ebert", "edition": "First Edition", "dimensions": "Height: 9.5 Inches, Length: 6.75 Inches, Weight: 2 Pounds, Width: 1.75 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.75}, "width": {"unit": "inches", "value": 1.75}, "weight": {"unit": "pounds", "value": 2}, "height": {"unit": "inches", "value": 9.5}}, "pages": 512, "date_published": "2006-09-15", "subjects": ["Arts & Photography', 'Performing Arts', 'Humor & Entertainment', 'Movies', 'Guides & Reviews', 'History & Criticism'], 'authors": ["Roger Ebert'], 'title": "Awake in the Dark: The Best of Roger Ebert", "isbn13": "9780226182001", "msrp": 29, 'binding": "Hardcover", "isbn": "0226182002", "isbn10": "0226182002"}}