{"book": {"publisher": "Univ of Chicago Pr", "synopsis": "Richard Hofstadter, the distinguished historian and twice winner of the Pulitzer Prize, brilliantly assesses the ideas and contributions of the three major American interpretive historians of the twentieth century: Frederick Jackson Turner, Charles A. Beard and V.L. Parrington. These men, whose views of history were shaped in large part by the political battles of the Progressive era, provided the Progressive movement with a usable past and the American liberal mind with a historical tradition. The Progressive Historians is at once a critique of historical thought during this decisive period of American development and an account of how these three writers led American historians into the controversial political world of the twentieth century.<br/>Turner, in developing his idea that American democracy is the outcome of the experience of frontier expansion and the settlement of the West, introduced his fellow historians to a set of new concepts and methods, and in doing so doing re-drew the guidelines of American historiography. Beard insisted upon the elitist origins of the Constitution, crusaded for the economic interpretation of history, and ultimately staked his historical reputation on an isolationist view of recent American foreign policy. Parrington emphasized the moral and social functions of literature, and read the history of literature as a history of the national political mind.<br/>In recent years, the tide has run against the Progressive historians, as one specialist after another has taken issue with their interpretations. The movement of contemporary historical thought has led to a rediscovery of the complexity of the American past. Although he cannot share the faith of the Progressive historians in the sufficiency of American liberalism as a guide to the modern world, Richard Hofstadter believes we have much to learn about ourselves from a reconsideration of their insights.", "language": "en", "image": "https://images.isbndb.com/covers/81/86/9780226348186.jpg", "title_long": "The Progressive Historians--Turner, Beard, Parrington", "dimensions": "Height: 8.4 Inches, Length: 1.2 Inches, Weight: 1.56 Pounds, Width: 5.5 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 1.2}, "width": {"unit": "inches", "value": 5.5}, "weight": {"unit": "pounds", "value": 1.56}, "height": {"unit": "inches", "value": 8.4}}, "pages": 498, "date_published": "1979", "subjects": ["Biographies & Memoirs', 'History', 'Americas', 'United States', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Richard Hofstadter'], 'title": "The Progressive Historians--Turner, Beard, Parrington", "isbn13": "9780226348186", "msrp": 8.48, 'binding": "Paperback", "isbn": "0226348180", "isbn10": "0226348180"}}