{"book": {"publisher": "University of Chicago Press", "synopsis": "Robert Dahl’s Preface helped launch democratic theory fifty years ago as a new area of study in political science, and it remains the standard introduction to the field. Exploring problems that had been left unsolved by traditional thought on democracy, Dahl here examines two influential models—the Madisonian, which represents prevailing American doctrine, and its recurring challenger, populist theory—arguing that they do not accurately portray how modern democracies operate. He then constructs a model more consistent with how contemporary democracies actually function, and, in doing so, develops some original views of popular sovereignty and the American constitutional system.<br/><br/>For this fiftieth-anniversary edition, Dahl has written an extensive new afterword that reevaluates Madisonian theory in light of recent research. And in a new foreword, he reflects back on his influential volume and the ways his views have evolved since he wrote it. For any student or scholar of political science, this new material is an essential update on a gold standard in the evolving field of democratic theory.<br/><br/>“A Preface to Democratic Theory is well worth the devoted attention of anyone who cares about democracy.”—Political Science Quarterly", "language": "en", "image": "https://images.isbndb.com/covers/43/45/9780226134345.jpg", "title_long": "A Preface to Democratic Theory, Expanded Edition", "edition": "Expanded ed.", "dimensions": "Height: 0.56 Inches, Length: 8.02 Inches, Weight: 0.5621787681 Pounds, Width: 5.26 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 8.02}, "width": {"unit": "inches", "value": 5.26}, "weight": {"unit": "pounds", "value": 0.5621787681}, "height": {"unit": "inches", "value": 0.56}}, "pages": 176, "date_published": "2006-09-15", "subjects": ["Politics & Social Sciences', 'Politics & Government', 'Ideologies & Doctrines', 'Political Science', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Robert A. Dahl'], 'title": "A Preface to Democratic Theory, Expanded Edition", "isbn13": "9780226134345", "msrp": 23, "binding": "Paperback", "related": {"eBook": "022611872X", "ePub": "022611872X"}, "isbn": "0226134342", "isbn10": "0226134342", "other_isbns": [{'isbn": "9780226118727", "binding": "print"}]}}