{"book": {"publisher": "University of Chicago Press", "synopsis": "Nikolai Gogol was an artist who, like Rabelais, Cervantes, Swift, and Sterne, "knew how to walk upside down in our valley of sorrows so as to make it to a merry place." This two-volume edition at last brings all of Gogol\"s fiction (except his novel Dead Souls) together in paperback. Volume 1 includes Evenings on a Farm near Dikanka, the early Ukrainian folktales that first brought Gogol fame, as well as 'Nevsky Prospekt' and 'Diary of a Madman.'<br/><br/>'It is good to have a complete collection of Gogol\'s tales in paperback. . . . Professor Kent has thoroughly revised Mrs. Garnett\'s conscientious and skillful translation, eliminating the Victorianisms of her style, correcting mistakes and pruderies of diction, and making the whole translation sound much more contemporary and alive. But he has avoided the whimsicality and \'curliness\' in which some recent translators indulged, and he has not changed or suppressed anything material. He has also supplied helpful notes which are often the first annotation in English, and he has written an introduction which steers the correct middle course between making Gogol an irresponsible artist of the grotesque and proving him a documentary historian of backward Russia.'—René Wellek, Yale University', 'language": "en", "image": "https://images.isbndb.com/covers/06/89/9780226300689.jpg", "title_long": "The Complete Tales of Nikolai Gogol (Volume 1)", "edition": "Revised ed.", "dimensions": "Height: 0.69 Inches, Length: 8.06 Inches, Weight: 0.74736706818 Pounds, Width: 5.34 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.06}, "width": {"unit": "inches", "value": 5.34}, "weight": {"unit": "pounds", "value": 0.74736706818}, "height": {"unit": "inches", "value": 0.69}}, "pages": 302, "date_published": "1985-04-15", "subjects": ["Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Movements & Periods', 'Regional & Cultural', 'Short Stories & Anthologies', 'Anthologies', 'Short Stories'], 'authors": ["Nikolai Vasilevich Gogol', 'Leonard J. Kent', 'Nikolai Vasil'evich Gogol'], 'title": "The Complete Tales of Nikolai Gogol (Volume 1)", "isbn13": "9780226300689", "msrp": 17.5, 'binding": "Paperback", "isbn": "0226300684", "isbn10": "0226300684"}}