{"book": {"publisher": "Columbia University Press", "synopsis": "Aren\"t we actually sick of sex, of difference, of emancipation, of culture? With this provocative taunt, the indomitable sociologist Jean Baudrillard challenges us to face up to our deadly, technologically empowered renunciation of mortality and subjectivity as he grapples with the complex issues that define our postmillennial world. What does the advent and proliferation of cloning mean for our sense of ourselves as human beings? What does the turn of the millennium say about our relation to time and history? What does the instantaneous, virtual realm of cyberspace do to reality? In The Vital Illusion―as always―Baudrillard leads his readers to some surprising conclusions.<br/><br/>Baudrillard considers how human cloning―as well as the "cloning" of ideas and social identities―heralds an end to sex and death and the divagations of living by instituting a realm of the Same, beyond the struggles of individuation. In this day and age when everything can be cloned, simulated, programmed, and genetically and neurologically managed, humanity shows itself unable to brave its own diversity, preferring instead to regress to the pathological eternity of self-replicating cells. By reverting to our viral origins as sexless immortal beings, we are, ironically, fulfilling a death wish, putting an end to our own species as we know it.<br/><br/>Next, Baudrillard explores the 'nonevent' that was and is the turn of the millennium. He provocatively puts forward the thesis that the arrival of the year 2000 could never take place because we could neither resolve nor leave behind our history, nor could we stop counting down toward our future. For Baudrillard, the millennial clock reading to the millionth of a second on its way to zero is the perfect symbol of our time: history decays rather than progresses. In closing, Baudrillard examines what he calls 'the murder of the real' by the virtual. In a world of copies and clones in which everything can be made present in an instant by technology, we can no longer even speak of reality. Beyond Nietzsche\'s symbolic murder of God, our virtual world free of referents is in the process of exterminating reality, leaving no trace: "The corps(e) of the Real―if there is any―has not been recovered, is nowhere to be found."<br/><br/>Peppered with Baudrillard\'s signature counterintuitive moves, prophetic visions, and dark humor, The Vital Illusion exposes the contradictions that guide our contemporary culture and rule our lives.', 'language": "en", "image": "https://images.isbndb.com/covers/10/02/9780231121002.jpg", "title_long": "The Vital Illusion", "dimensions": "Height: 0.6 Inches, Length: 7.31 Inches, Weight: 0.5 Pounds, Width: 5.75 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.31}, "width": {"unit": "inches", "value": 5.75}, "weight": {"unit": "pounds", "value": 0.5}, "height": {"unit": "inches", "value": 0.6}}, "pages": 96, "date_published": "2001-01-15", "subjects": ["Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Regional & Cultural', 'Science & Math', 'History & Philosophy', 'Politics & Social Sciences', 'Philosophy', 'Metaphysics', 'Modern', 'Movements', 'Social Sciences', 'Sociology'], 'authors": ["Jean Baudrillard', 'Julia Witwer'], 'title": "The Vital Illusion", "isbn13": "9780231121002", "msrp": 28, "binding": "Hardcover", "related": {"ePub": "0231506325"}, "isbn": "0231121008", "isbn10": "0231121008", "other_isbns": [{'isbn": "9780231506328", "binding": "print"}]}}