{"book": {"publisher": "Columbia University Press", "synopsis": ""The tragedy of the left is that, having achieved an unprecedented victory in helping stop an appalling war, it then proceeded to commit suicide." So writes Todd Gitlin about the aftermath of the Vietnam War in this collection of writings that calls upon intellectuals on the left to once again engage American public life and resist the trappings of knee-jerk negativism, intellectual fads, and political orthodoxy. Gitlin argues for a renewed sense of patriotism based on the ideals of sacrifice, tough-minded criticism, and a willingness to look anew at the global role of the United States in the aftermath of 9/11. Merely criticizing and resisting the Bush administration will not do―the left must also imagine and propose an America reformed.<br/><br/>Where then can the left turn? Gitlin celebrates the work of three prominent postwar intellectuals: David Riesman, C. Wright Mills, and Irving Howe. Their ambitious, assertive, and clearly written works serve as models for an intellectual engagement that forcefully addresses social issues and remains affirmative and comprehensive. Sharing many of the qualities of these thinkers\" works, Todd Gitlin\'s blunt, frank analysis of the current state of the left and his willingness to challenge orthodoxies pave the way for a revival in leftist thought and a new liberal patriotism.', 'language": "en", "image": "https://images.isbndb.com/covers/49/28/9780231124928.jpg", "title_long": "The Intellectuals and the Flag", "dimensions": "Height: 8.42 Inches, Length: 5.84 Inches, Weight: 0.83 Pounds, Width: 0.8 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.84}, "width": {"unit": "inches", "value": 0.8}, "weight": {"unit": "pounds", "value": 0.83}, "height": {"unit": "inches", "value": 8.42}}, "pages": 192, "date_published": "2005-12-13", "subjects": ["History', 'Americas', 'United States', 'Historical Study & Educational Resources', 'Politics & Social Sciences', 'Philosophy', 'Political', 'Politics & Government', 'Ideologies & Doctrines', 'Political Science', 'Specific Topics'], 'authors": ["Todd Gitlin'], 'title": "The Intellectuals and the Flag", "isbn13": "9780231124928", "msrp": 90, "binding": "Hardcover", "related": {"eBook": "0231510357"}, "isbn": "0231124929", "isbn10": "0231124929", "other_isbns": [{'isbn": "9780231510356", "binding": "print"}]}}