{"book": {"publisher": "Houghton Mifflin", "synopsis": "This 1997 edition, illustrated by Alan Lee commemorates the 60th anniversary of "The Hobbit."<br/><br/>Bilbo Baggins is a reasonably typical hobbit: fond of sleeping, eating, drinking, parties and presents. However, it is his destiny to travel to the dwarflands in the east, to help slay the dragon Smaug. His quest takes him through enchanted forests, spiders\" lairs, and under the Misty Mountains, where he comes across the vile Gollum, and tricks him out of his \'Precious\' - a ring that makes its bearer invisible, and wields a terrible power of its own.<br/><br/>J.R.R. Tolkien\'s own description for the original edition:<br/><br/>'If you care for journeys there and back, out of the comfortable Western world, over the edge of the Wild, and home again, and can take an interest in a humble hero (blessed with a little wisdom and a little courage and considerable good luck), here is a record of such a journey and such a traveler. The period is the ancient time between the age of Faerie and the dominion of men, when the famous forest of Mirkwood was still standing, and the mountains were full of danger. In following the path of this humble adventurer, you will learn by the way (as he did) - if you do not already know all about these things - much about trolls, goblins, dwarves, and elves, and get some glimpses into the history and politics of a neglected but important period.'<br/><br/>'For Mr. Bilbo Baggins visited various notable persons; conversed with the dragon, Smaug the Magnificent; and was present, rather unwillingly, at the Battle of the Five Armies. This is all the more remarkable, since he was a hobbit. Hobbits have hitherto been passed over in history and legend, perhaps because they as a rule preferred comfort to excitement. But this account, based on his personal memoirs, of the one exciting year in the otherwise quiet life of Mr. Baggins will give you a fair idea of the estimable people now (it is said) becoming rather rare. They do not like noise.'', 'language": "en", "image": "https://images.isbndb.com/covers/33/06/9780261103306.jpg", "title_long": "The Hobbit", "edition": "First Edition", "dimensions": "Height: 9.92124 Inches, Length: 7.67715 Inches, Weight: 2.6014546916 Pounds, Width: 1.14173 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.67715}, "width": {"unit": "inches", "value": 1.14173}, "weight": {"unit": "pounds", "value": 2.6014546916}, "height": {"unit": "inches", "value": 9.92124}}, "pages": 304, "date_published": "1997", "subjects": ["Literature & Fiction', 'Classics', 'Contemporary', 'Science Fiction & Fantasy'], 'authors": ["J. R. R. Tolkien'], 'title": "The Hobbit", "isbn13": "9780261103306", "msrp": 100, 'binding": "Hardcover", "isbn": "026110330X", "isbn10": "026110330X"}}