{"book": {"publisher": "The MIT Press", "synopsis": "In recent years, water resource management in the United States has begun a shift away from top-down, government agency-directed decision processes toward a collaborative approach of negotiation and problem solving. Rather than focusing on specific pollution sources or specific areas within a watershed, this new process considers the watershed as a whole, seeking solutions to an interrelated set of social, economic, and environmental problems. Decision making involves face-to-face negotiations among a variety of stakeholders, including federal, state, and local agencies, landowners, environmentalists, industries, and researchers.<br/>Swimming Upstream analyzes the collaborative approach by providing a historical overview of watershed management in the United States and a normative and empirical conceptual framework for understanding and evaluating the process. The bulk of the book looks at a variety of collaborative watershed planning projects across the country. It first examines the applications of relatively short-term collaborative strategies in Oklahoma and Texas, exploring issues of trust and legitimacy. It then analyzes factors affecting the success of relatively long-term collaborative partnerships in the National Estuary Program and in 76 watersheds in Washington and California. Bringing analytical rigor to a field that has been dominated by practitioners" descriptive accounts, Swimming Upstream makes a vital contribution to public policy, public administration, and environmental management.", "language": "en", "image": "https://images.isbndb.com/covers/31/96/9780262693196.jpg", "title_long": "Swimming Upstream: Collaborative Approaches to Watershed Management (American and Comparative Environmental Policy)", "edition": "Illustrated", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 1.00089866948 Pounds, Width: 0.6875 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 0.6875}, "weight": {"unit": "pounds", "value": 1.00089866948}, "height": {"unit": "inches", "value": 9}}, "pages": 344, "date_published": "2005-04-29", "subjects": ["Business & Money', 'Economics', 'Environmental Economics', 'Management & Leadership', 'Management', 'Medical Books', 'Administration & Medicine Economics', 'Public Health', 'Politics & Social Sciences', 'Politics & Government', 'Public Affairs & Policy', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": [], "title": "Swimming Upstream: Collaborative Approaches to Watershed Management (American and Comparative Environmental Policy)", "isbn13": "9780262693196", "msrp": 35, 'binding": "Paperback", "isbn": "0262693194", "isbn10": "0262693194"}}