{"book": {"publisher": "M.I.T. Press", "synopsis": "Beginning in the mid-fifties and emanating largely form MIT, an approach was developed to linguistic theory and to the study of the structure of particular languages that diverges in many respects from modern linguistics. Although this approach is connected to the traditional study of languages, it differs enough in its specific conclusions about the structure and in its specific conclusions about the structure of language to warrant a name, "generative grammar." Various deficiencies have been discovered in the first attempts to formulate a theory of transformational generative grammar and in the descriptive analysis of particular languages that motivated these formulations. At the same time, it has become apparent that these formulations can be extended and deepened.The major purpose of this book is to review these developments and to propose a reformulation of the theory of transformational generative grammar that takes them into account. The emphasis in this study is syntax; semantic and phonological aspects of the language structure are discussed only insofar as they bear on syntactic theory.", 'language": "en", "image": "https://images.isbndb.com/covers/00/71/9780262530071.jpg", "title_long": "Aspects of the Theory of Syntax", "dimensions": "Height: 7.25 Inches, Length: 4.75 Inches, Weight: 0.75 Pounds, Width: 0.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.75}, "width": {"unit": "inches", "value": 0.5}, "weight": {"unit": "pounds", "value": 0.75}, "height": {"unit": "inches", "value": 7.25}}, "pages": 251, "date_published": "1969", "subjects": ["Reference', 'Foreign Language Study & Reference', 'Words, Language & Grammar', 'Grammar', 'Linguistics', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Noam Chomsky'], 'title": "Aspects of the Theory of Syntax", "isbn13": "9780262530071", "msrp": 30, 'binding": "Paperback", "isbn": "0262530074", "isbn10": "0262530074"}}