{"book": {"publisher": "MIT Press", "synopsis": "By closely following Goethe"s explanations of the color phenomena, the reader may become so divorced from the wavelength theory—Goethe never even mentions it—that he may begin to think about color theory relatively unhampered by prejudice, ancient or modern.<br/>By the time Goethe"s Theory of Colours appeared in 1810, the wavelength theory of light and color had been firmly established. To Goethe, the theory was the result of mistaking an incidental result for an elemental principle. Far from pretending to a knowledge of physics, he insisted that such knowledge was an actual hindrance to understanding. He based his conclusions exclusively upon exhaustive personal observation of the phenomena of color.<br/>Of his own theory, Goethe was supremely confident: “From the philosopher, we believe we merit thanks for having traced the phenomena of colours to their first sources, to the circumstances under which they appear and are, and beyond which no further explanation respecting them is possible.”<br/>Goethe"s scientific conclusions have, of course, long since been thoroughly demolished, but the intelligent reader of today may enjoy this work on quite different grounds: for the beauty and sweep of his conjectures regarding the connection between color and philosophical ideas; for an insight into early nineteenth-century beliefs and modes of thought; and for the flavor of life in Europe just after the American and French Revolutions.<br/>The book does not have to be studied to be appreciated. Goethe's subjective theory of colors permits him to speak most persuasively of color harmony and aesthetics. In some readers these notions will evoke a positive response on their merits. Others may regard them as pure fantasy, but savor the grace and style of their exposition.<br/>The work may also be read as an accurate guide to the study of color phenomena. Goethe's conclusions have been repudiated, but no one quarrels with his reporting of the facts to be observed. With simple objects—vessels, prisms, lenses, and the like—the reader will be led through a demonstration course not only in subjectively produced colors, but also in the observable physical phenomena of color. By closely following Goethe's explanations of the color phenomena, the reader may become so divorced from the wavelength theory—Goethe never even mentions it—that he may begin to think about color theory relatively unhampered by prejudice, ancient or modern.', 'language": "en", "image": "https://images.isbndb.com/covers/02/13/9780262570213.jpg", "title_long": "Theory of Colours", "edition": "1st", "dimensions": "Height: 8 Inches, Length: 5.25 Inches, Weight: 1.19931470528 Pounds, Width: 0.98 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.25}, "width": {"unit": "inches", "value": 0.98}, "weight": {"unit": "pounds", "value": 1.19931470528}, "height": {"unit": "inches", "value": 8}}, "pages": 423, "date_published": "1994", "subjects": ["Arts & Photography', 'Graphic Design', 'Commercial', 'Techniques'], 'authors": ["Johann Wolfgang von Goethe'], 'title": "Theory of Colours", "isbn13": "9780262570213", "msrp": 34.95, 'binding": "Paperback", "isbn": "0262570211", "isbn10": "0262570211"}}