{"book": {"publisher": "The MIT Press", "synopsis": "The Parallax View is Slavoj Zizek\"s most substantial theoretical work to appear in many years; Zizek himself describes it as his magnum opus. Parallax can be defined as the apparent displacement of an object, caused by a change in observational position. Zizek is interested in the "parallax gap" separating two points between which no synthesis or mediation is possible, linked by an 'impossible short circuit' of levels that can never meet. From this consideration of parallax, Zizek begins a rehabilitation of dialectical materialism.Modes of parallax can be seen in different domains of today\'s theory, from the wave-particle duality in quantum physics to the parallax of the unconscious in Freudian psychoanalysis between interpretations of the formation of the unconscious and theories of drives. In The Parallax View, Zizek, with his usual astonishing erudition, focuses on three main modes of parallax: the ontological difference, the ultimate parallax that conditions our very access to reality; the scientific parallax, the irreducible gap between the phenomenal experience of reality and its scientific explanation, which reaches its apogee in today\'s brain sciences (according to which 'nobody is home' in the skull, just stacks of brain meat--a condition Zizek calls 'the unbearable lightness of being no one'); and the political parallax, the social antagonism that allows for no common ground. Between his discussions of these three modes, Zizek offers interludes that deal with more specific topics--including an ethical act in a novel by Henry James and anti-anti-Semitism.The Parallax View not only expands Zizek\'s Lacanian-Hegelian approach to new domains (notably cognitive brain sciences) but also provides the systematic exposition of the conceptual framework that underlies his entire work. Philosophical and theological analysis, detailed readings of literature, cinema, and music coexist with lively anecdotes and obscene jokes.', 'language": "en", "image": "https://images.isbndb.com/covers/05/12/9780262240512.jpg", "title_long": "The Parallax View (Short Circuits)", "edition": "First Edition", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 1.75047036028 Pounds, Width: 1.125 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1.125}, "weight": {"unit": "pounds", "value": 1.75047036028}, "height": {"unit": "inches", "value": 9}}, "pages": 448, "date_published": "2006-02-10", "subjects": ["Politics & Social Sciences', 'Philosophy', 'Criticism', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Slavoj Žižek'], 'title": "The Parallax View (Short Circuits)", "isbn13": "9780262240512", "msrp": "0.00", "binding": "Hardcover", "related": {"ePub": "0262265184"}, "isbn": "0262240513", "isbn10": "0262240513", "other_isbns": [{'isbn": "9780262265188", "binding": "print"}]}}