{"book": {"publisher": "Holtzbrinck", "synopsis": "In October 1973, the State of Israel was invaded by Egyptian and Syrian forces. Despite early losses, Israel managed to outfight its opponents. The brief and bloody Yom Kippur War stands as a unique chapter in modern military history. Fought primarily by tank units, the war became a story not only of battle strategy and tactics, but also one of human discipline, endurance and sacrifice.<br/><br/>While many historians have chronicled the events of the Yom Kippur War, few have been seasoned by actual combat. Avigdor Kahalani, commander of a tank battalion on the Golan Heights during the Yom Kippur War, describes this experience in The Heights of Courage. Beginning with a description of the initial Syrian offensive, he recounts the personal endeavors of his men, their fears and their ambitions, as well as their emotional and physical hardships. His stark account traces the efforts of the Israel Armored Corps as they struggle to overcome extreme difficulties and setbacks. The author describes their ultimate penetration into enemy territory and their approach to within forty kilometers of Damascus.", "language": "en", "image": "https://images.isbndb.com/covers/26/94/9780275942694.jpg", "title_long": "The Heights of Courage: A Tank Leader"s War On the Golan", "edition": "1", "dimensions": "Height: 8.5 Inches, Length: 5.5 inches, Weight: 0.68784225744 Pounds, Width: 0.5358257 inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.5358257}, "weight": {"unit": "pounds", "value": 0.68784225744}, "height": {"unit": "inches", "value": 8.5}}, "pages": 198, "date_published": "1992-02-18", "subjects": ["Biographies & Memoirs', 'History', 'Middle East', 'Israel & Palestine', 'Military', 'Strategy', 'Weapons & Warfare', 'Regiments'], 'authors": ["Avigdor Kahalani'], 'title": "The Heights of Courage: A Tank Leader"s War On the Golan", 'isbn13": "9780275942694", "msrp": 26.83, 'binding": "Paperback", "isbn": "0275942694", "isbn10": "0275942694"}}