{"book": {"publisher": "Weidenfeld & Nicolson Ltd", "synopsis": "Following the success of Inside Sahara, photographer Basil Pao documents another of Michael Palin"s unforgettable journeys, this time to the top of the world: the amazing, breathtaking Himalayas. The 300 resulting photographs provide a dramatic visual record of an extraordinary trip, and will be tied to a Travel Channel special program.<br/><br/>Armchair explorers, connoisseurs of fine photography, and fans of Michael Palin will gladly come along on this memorable expedition to some of the world"s most inhospitable, yet exquisite, terrain. The adventure-the longest and most challenging that Palin has taken during his long career-extends from the deserts of Afghanistan to the sheer slopes of Mount Everest, passing through Pakistan, India, Nepal, Tibet, China, and Bangladesh. Along the way Basil Pao expertly captures the magical appeal of the region and its diverse landscapes, peoples, and cultures. Look into the infamous Tora Bora Mountains in Afghanistan; the storied Khyber Pass; the ancient cities of Peshawar, Taxila, and Lahore; the Bay of Bengal; and the mighty peaks of K2. In addition, intimate shots of Michael and his film crew at work and relaxing off-air give fascinating insight into the making of the TV series about the voyage.", 'language": "en", "image": "https://images.isbndb.com/covers/37/02/9780297843702.jpg", "title_long": "Inside Himalaya", "dimensions": "Height: 12.5 Inches, Length: 10 Inches, Weight: 3.5935348706 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 10}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 3.5935348706}, "height": {"unit": "inches", "value": 12.5}}, "pages": 200, "date_published": "2004", "subjects": ["Arts & Photography', 'Photography & Video', 'Travel', 'Asia', 'General'], 'authors": [], "title": "Inside Himalaya", "isbn13": "9780297843702", "msrp": 39.95, 'binding": "Hardcover", "isbn": "0297843702", "isbn10": "0297843702"}}