{"book": {"publisher": "Yale University Press", "synopsis": "When Volume 1 of Donald Meinig\"s sweeping history of America was published, reviewers called it "a masterpiece in the best and old sense of the word" (Alfred W. Crosby, Southwestern Historical Quarterly), 'a standard work in its field' (William Cronon, New York Times Book Review), and 'one of the classic amalgamations of geography and history in the current literature' (Kenneth C. Martis, Journal of American History). In this new volume, the second in a projected four-volume series, D. W. Meinig again provides a fresh interpretation of the American past, bringing his special geographical perspective to the years between 1800 and 1867, the period when the nation experienced a dramatic expansion in territory, population, economy, and political tension that culminated in the Civil War. As in his first volume, Atlantic America, Meinig assesses the characteristics of regions and political territories and the relations among them, examining the dual roles played by geopolitics and ethnoculture in the shaping of the United States.<br/><br/>Meinig emphasizes the flux, uncertainty, and unpredictability of the expansion into continental America, showing how a multitude of individuals confronted complex and problematic issues. He discusses, for example, Jefferson\'s options regarding the Louisiana Purchase and the effects of his decisions on the Louisianians, and later controversies about U.S. pressures on Mexico and Cuba. He carefully traces the expansion of distinct regional societies and the social and geographical repositioning of various peoples (Indians, African-Americans, and subgroups of each). He describes and assesses the emerging patterns of cities, waterways, roads, railways, and attempts at national planning. And he presents the geopolitical alternatives considered in dealing with initial secessions, and the ragged tearing apart of the nation in 1861. Throughout, Meinig places the United States in its broader North American context, focusing on its relations with Canada, Mexico, and the West Indies.<br/><br/>Richly illustrated with maps, plans, and scenes, many of which were specially prepared for the book, Continental America is at once an invaluable complement to and a penetrating critique of more ordinary American histories.', 'language": "en", "image": "https://images.isbndb.com/covers/29/08/9780300062908.jpg", "title_long": "The Shaping of America: A Geographical Perspective on 500 Years of History, Vol. 2: Continental America, 1800-1867 (Paperback)", "edition": "Revised", "dimensions": "Height: 1.6 Inches, Length: 9.9 Inches, Weight: 2.44933573082 Pounds, Width: 6.91 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 9.9}, "width": {"unit": "inches", "value": 6.91}, "weight": {"unit": "pounds", "value": 2.44933573082}, "height": {"unit": "inches", "value": 1.6}}, "pages": 656, "date_published": "1995-02-22", "subjects": ["History', 'Americas', 'United States', 'Science & Math', 'Earth Sciences', 'Geography', 'Politics & Social Sciences', 'Sociology'], 'authors": ["D. W. Meinig'], 'title": "The Shaping of America: A Geographical Perspective on 500 Years of History, Vol. 2: Continental America, 1800-1867 (Paperback)", "isbn13": "9780300062908", "msrp": 45, 'binding": "Paperback", "isbn": "0300062907", "isbn10": "0300062907"}}