{"book": {"publisher": "Yale University Press", "synopsis": "Eva Hesse (1936--1970) was a highly experimental artist who continually challenged the conventions of her time. For Hesse, drawing played a unique role, providing the nexus between her works in all media. Eva Hesse Drawing is the first book to explore her drawing process, following her work from drawing to painting and sculpture, and always back to drawing. The book features important, recently rediscovered \x93working drawings,” providing an intimate look at Hesse’s everyday practice and methodology.<br/>An accomplished draftswoman, Hesse began to develop her wandering, tentative line while studying at Yale University in the late 1950s. Her early 1960s works on paper engaged with visual vocabularies from geometry to biomorphic abstraction. In 1965, Hesse combined her tactile sensibility for materials with her stringlike line to achieve a breakthrough: her astonishing reliefs, which began to bridge the space between two and three dimensions. Balancing the disembodiment of line with its intensified materialization, Hesse went on to develop one of the most innovative oeuvres of the twentieth century, anticipating the hybridization of media and crossing borderlines linking one impossible space to another.", "language": "en", "image": "https://images.isbndb.com/covers/61/82/9780300116182.jpg", "title_long": "Eva Hesse Drawing", "edition": "First Edition", "dimensions": "Height: 10.25 Inches, Length: 8.25 Inches, Weight: 3.22756751568 Pounds, Width: 1 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 8.25}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 3.22756751568}, "height": {"unit": "inches", "value": 10.25}}, "pages": 344, "date_published": "2006-11-28", "subjects": ["Arts & Photography', 'History & Criticism', 'History'], 'authors": [], "title": "Eva Hesse Drawing", "isbn13": "9780300116182", "msrp": 55, 'binding": "Hardcover", "isbn": "0300116187", "isbn10": "0300116187"}}