{"book": {"publisher": "Yale University Press", "synopsis": "In this bitterly funny novel by the renowned Polish author Witold Gombrowicz. a writer finds himself tossed into a chaotic world of schoolboys by a diabolical professor who wishes to reduce him to childishness. Originally published in Poland in 1937. Ferdydurke became an instant literary sensation and catapulted the young author to fame. Deemed scandalous and subversive by Nazis. Stalinists. and the Polish Communist regime in turn. the novel (as well as all of Gombrowicz\"s other works) was officially banned in Poland for decades. It has nonetheless remained one of the most influential works of twentieth-century European literature.<br/><br/>Ferdydurke is translated here directly from the Polish for the first time. Danuta Borchardt deftly captures Gombrowicz\"s playful and idiosyncratic style. and she allows English speakers to experience fully the masterpiece of a writer whom Milan Kundera describes as "one of the great novelists of our century.'<br/><br/>Witold Gombrowicz (1904-1969) wrote three other novels. Trans-Atlantyk. Pornografia. and Cosmos. which together with his plays and his three-volume Diary have been translated into more than thirty languages.', 'language": "en", "image": "https://images.isbndb.com/covers/24/01/9780300082401.jpg", "title_long": "Ferdydurke", "edition": "First Edition", "dimensions": "Height: 7.75 Inches, Length: 5.75 Inches, Weight: 0.55 Pounds, Width: 0.75 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.75}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 0.55}, "height": {"unit": "inches", "value": 7.75}}, "pages": 320, "date_published": "2000-08-11", "subjects": ["Literature & Fiction', 'Literary'], 'authors": ["Danuta Borchardt', 'Susan Sontag'], 'title": "Ferdydurke", "isbn13": "9780300082401", "msrp": 14.95, "binding": "Paperback", "related": {"ePub": "0300164653"}, "isbn": "0300082401", "isbn10": "0300082401", "other_isbns": [{'isbn": "9780300164657", "binding": "print"}]}}