{"book": {"publisher": "Yale University Press", "synopsis": "A New York Times Book Review Best Book Since 2000<br/><br/>A New York Times Bestseller, a 2003 National Book Critics Circle Award finalist, and a Washington Post Book World, Publisher’s Weekly, and Los Angeles Times Book Review Best Book of the Year<br/><br/>“Superb. . . . The best short biography of Franklin ever written.”—Gordon Wood, New York Review of Books<br/><br/>“None rivals Morgan’s study for its grasp of Franklin’s character.”—Joseph J. Ellis, London Review of Books<br/><br/>Benjamin Franklin is perhaps the most remarkable figure in American history: the greatest statesman of his age, he played a pivotal role in the formation of the American republic. He was also a pioneering scientist, a bestselling author, the country’s first postmaster general, a printer, a bon vivant, a diplomat, a ladies’ man, and a moralist—and the most prominent celebrity of the eighteenth century.<br/><br/>Franklin was, however, a man of vast contradictions, as Edmund Morgan demonstrates in this brilliant biography. A reluctant revolutionary, Franklin had desperately wished to preserve the British Empire, and he mourned the break even as he led the fight for American independence. Despite his passion for science, Franklin viewed his groundbreaking experiments as secondary to his civic duties. And although he helped to draft both the Declaration of Independence and the American Constitution, he had personally hoped that the new American government would take a different shape. Unraveling the enigma of Franklin’s character, Morgan shows that he was the rare individual who consistently placed the public interest before his own desires.<br/><br/>Written by one of our greatest historians and a Pulitzer Prize winner, Benjamin Franklin offers a provocative portrait of America’s most extraordinary patriot.", "language": "en", "image": "https://images.isbndb.com/covers/16/21/9780300101621.jpg", "title_long": "Benjamin Franklin (Yale Nota Bene S)", "edition": "Reprint", "dimensions": "Height: 0.88 Inches, Length: 7.82 Inches, Weight: 0.70106999316 Pounds, Width: 5.04 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 7.82}, "width": {"unit": "inches", "value": 5.04}, "weight": {"unit": "pounds", "value": 0.70106999316}, "height": {"unit": "inches", "value": 0.88}}, "pages": 352, "date_published": "2003-09-24", "subjects": ["Biographies & Memoirs', 'Historical', 'United States', 'Leaders & Notable People', 'Political', 'Professionals & Academics', 'Scientists', 'History', 'Americas'], 'authors": ["Edmund S. Morgan'], 'title": "Benjamin Franklin (Yale Nota Bene S)", "isbn13": "9780300101621", "msrp": 16, 'binding": "Paperback", "isbn": "0300101627", "isbn10": "0300101627"}}