{"book": {"publisher": "Yale University Press", "synopsis": "A Washington Post Book World Best Seller<br/><br/>“Robert A. Dahl . . . is about as covered in honors as a scholar can be. . . . He knows what he is talking about. And he thinks that the Constitution has something the matter with it.”—Hendrik Hertzberg, New Yorker<br/><br/>“A devastating attack on the undemocratic character of the American Constitution.”—Gordon S. Wood, New York Review of Books<br/><br/>In this provocative book, one of our most eminent political scientists poses the question, “Why should Americans uphold their constitution?” The vast majority of Americans venerate the Constitution and the democratic principles it embodies, but many also worry that the United States has fallen behind other nations on crucial issues, including economic equality, racial integration, and women’s rights. Robert Dahl explores this vital tension between the Americans’ belief in the legitimacy of their constitution and their belief in the principles of democracy.<br/><br/>Dahl starts with the assumption that the legitimacy of the American Constitution derives solely from its utility as an instrument of democratic governance. Dahl demonstrates that, due to the context in which it was conceived, our constitution came to incorporate significant antidemocratic elements. Because the Framers of the Constitution had no relevant example of a democratic political system on which to model the American government, many defining aspects of our political system were implemented as a result of shortsightedness or last-minute compromise. Dahl highlights those elements of the American system that are most unusual and potentially antidemocratic: the federal system, the bicameral legislature, judicial review, presidentialism, and the electoral college system.<br/><br/>The political system that emerged from the world’s first great democratic experiment is unique—no other well-established democracy has copied it. How does the American constitutional system function in comparison to other democratic systems? How could our political system be altered to achieve more democratic ends? To what extent did the Framers of the Constitution build features into our political system that militate against significant democratic reform?<br/><br/>Refusing to accept the status of the American Constitution as a sacred text, Dahl challenges us all to think critically about the origins of our political system and to consider the opportunities for creating a more democratic society.", "language": "en", "image": "https://images.isbndb.com/covers/52/41/9780300095241.jpg", "title_long": "How Democratic is the American Constitution? Second Edition", "edition": "Second", "dimensions": "Height: 0.59 Inches, Length: 7.64 Inches, Weight: 0.50044933474 Pounds, Width: 5.04 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 7.64}, "width": {"unit": "inches", "value": 5.04}, "weight": {"unit": "pounds", "value": 0.50044933474}, "height": {"unit": "inches", "value": 0.59}}, "pages": 240, "date_published": "2003-12-01", "subjects": ["Business & Money', 'Economics', 'Income Inequality', 'History', 'Americas', 'United States', 'Law', 'Constitutional Law', 'General', 'Politics & Social Sciences', 'Politics & Government', 'Political Science'], 'authors": ["Robert A. Dahl'], 'title": "How Democratic is the American Constitution? Second Edition", "isbn13": "9780300095241", "msrp": 17, "binding": "Paperback", "related": {"Kindle Edition": "0300133723", "ePub": "0300133723"}, "isbn": "0300095244", "isbn10": "0300095244", "other_isbns": [{'isbn": "9780300133721", "binding": "print"}]}}