{"book": {"publisher": "Knopf Doubleday Publishing Group", "synopsis": "From the bestselling author of The Passenger and the Pulitzer Prize–winning novel The Road • A startling encounter on a New York subway platform leads two strangers to a run-down tenement where a life or death decision must be made.<br/><br/>In that small apartment, “Black” and “White,” as the two men are known, begin a conversation that leads each back through his own history, mining the origins of two fundamentally opposing world views. White is a professor whose seemingly enviable existence of relative ease has left him nonetheless in despair. Black, an ex-con and ex-addict, is the more hopeful of the men–though he is just as desperate to convince White of the power of faith as White is desperate to deny it.<br/><br/>Their aim is no less than this: to discover the meaning of life.<br/><br/>Deft, spare, and full of artful tension, The Sunset Limited is a beautifully crafted, consistently thought-provoking, and deceptively intimate work by one of the most insightful writers of our time.<br/><br/>Look for Cormac McCarthy"s latest bestselling novels, The Passenger and Stella Maris.", "language": "en", "image": "https://images.isbndb.com/covers/83/64/9780307278364.jpg", "title_long": "The Sunset Limited: A Novel in Dramatic Form", "edition": "1", "dimensions": "Height: 0.41 Inches, Length: 7.96 Inches, Weight: 0.39 Pounds, Width: 5.3 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.96}, "width": {"unit": "inches", "value": 5.3}, "weight": {"unit": "pounds", "value": 0.39}, "height": {"unit": "inches", "value": 0.41}}, "pages": 143, "date_published": "2006-10-24", "subjects": ["Literature & Fiction', 'Dramas & Plays', 'United States', 'Genre Fiction', 'Psychological', 'Black & African American', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Cormac McCarthy'], 'title": "The Sunset Limited: A Novel in Dramatic Form", "isbn13": "9780307278364", "msrp": 14.95, "binding": "Paperback", "related": {"Kindle Edition": "0307498123", "ePub": "0307498123"}, "isbn": "0307278360", "isbn10": "0307278360", "other_isbns": [{'isbn": "9780307498120", "binding": "printisbn"}]}}