{"book": {"publisher": "Plaza y Janes", "synopsis": "Otra faz en la narrativa de Gabriel Garcia Marquez. Casi todas las obras de este gran autor se caracterizan por la presencia simultanea de ambitos aparentemente alejados entre si. -"Ademas de lo onirico y de la rareza individual- escribe Mario Vargas Llosa a proposito de Garcia Marquez- en este mundo en que lo social, lo politico y otros niveles objetivos (como el sexo) parecen arrolladores, tienen cabida hechos y situaciones que por su caracter insolito y pintoresco contrastan con los hechos opresivos, obvios y monotonos que constituye en la vida cotidiana... y sugieren la existencia de "otra" realidad, menos previsible, en la que reinan la fantasia, la extravagancia, cierto tipo de humor. 'En ojos de perro azul el buceo de Garcia Marquez en esa 'otra' realidad es hondo y vertiginoso. Ya no se trata de revelarnos un aspecto de realidad placentero y risueno. Garcia Marquez nos enfrenta con esa presencia inevitable que es la muerte, descubriendola como una parte gemela de nuestro vivir. la muerte vislumbrada en los suenos y luego conocida como experiencia total del alma y del cuerpo la muerte como una constante inminencia que nos revela hasta que punto nuestro propio ser esta formado por aspectos distintos y nunca imaginados.', 'language": "es", "image": "https://images.isbndb.com/covers/05/10/9780307350510.jpg", "title_long": "Ojos De Perro Azul (Spanish Edition)", "dimensions": "Height: 7.47 Inches, Length: 4.99 Inches, Weight: 0.43 Pounds, Width: 0.64 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.99}, "width": {"unit": "inches", "value": 0.64}, "weight": {"unit": "pounds", "value": 0.43}, "height": {"unit": "inches", "value": 7.47}}, "pages": 192, "date_published": "2006-02-07", "subjects": ["Literature & Fiction', 'World Literature', 'Literary'], 'authors": ["Gabriel García Márquez'], 'title": "Ojos De Perro Azul (Spanish Edition)", "isbn13": "9780307350510", "msrp": 8.95, 'binding": "Paperback", "isbn": "0307350517", "isbn10": "0307350517"}}