{"book": {"publisher": "Crown", "synopsis": "She survived her own innocence, and the treachery of Europe’s royal courts; The Last Boleyn is the story of the rise and fall of the Boleyns, one of England’s most powerful families, through the eyes of the eldest daughter, Mary.<br/><br/>Although her sister, Anne, the queen; her brother, George, executed alongside Anne; and her father, Thomas, are most remembered by history, Mary was the Boleyn who set into motion the chain of events that brought about the family’s meteoric rise to power, as well as the one who managed to escape their equally remarkable fall. Sent away to France at an extraordinarily young age, Mary is quickly plunged into the dangerous world of court politics, where everything is beautiful but deceptive, and everyone she meets is watching and quietly manipulating the events and people around them. As she grows into a woman, Mary must navigate both the dangerous waters ruled by two kings and the powerful will of her own family in order to find a place for herself and the love she so deeply desires.", "language": "en", "image": "https://images.isbndb.com/covers/79/03/9780307237903.jpg", "title_long": "The Last Boleyn: A Novel", "edition": "Later Printing", "dimensions": "Height: 7.9 Inches, Length: 5.22 Inches, Weight: 1.03837725402 Pounds, Width: 1.3 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.22}, "width": {"unit": "inches", "value": 1.3}, "weight": {"unit": "pounds", "value": 1.03837725402}, "height": {"unit": "inches", "value": 7.9}}, "pages": 592, "date_published": "2006-02-28", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'Biographical', 'Contemporary', 'Romance', 'Tudor', 'Self Service', 'Custom Stores'], 'authors": ["Karen Harper'], 'title": "The Last Boleyn: A Novel", "isbn13": "9780307237903", "msrp": 16.99, "binding": "Paperback", "related": {"ePub": "0307345386"}, "isbn": "0307237907", "isbn10": "0307237907", "other_isbns": [{'isbn": "9780307345387", "binding": "printisbn"}]}}