{"book": {"publisher": "Shaye Areheart Books", "synopsis": "Instant New York Times bestselling author Lisa Unger\"s second sensational thriller featuring Ridley Jones "bursts from the starting gate and never lets up." (Booklist, starred review) And it 'will force you to stay up past your bedtime, just as you do with the books of James Patterson and Michael Connelly.' (Richmond Times-Dispatch)<br/><br/>A Best Book of the Month (BookSense)<br/><br/>A Doubleday & Literary Guild Book Club Main Selection<br/><br/>'Unger\'s genius is in plotting the story so that the reader never knows what\'s coming next.' (New York Journal of Books)<br/><br/>In Beautiful Lies, Ridley Jones stepped off a street corner and into an abyss of violence, deception, and fear. Now, she is just trying to get on with her life when another seemingly mundane act--picking up some prints at a photo lab--sends her on a mission to find a ghost from her past. A figure of the same man appears in too many pictures she\'s taken in the last year, lurking just far enough away to make identification impossible. But, she is not the only one who wants to know who the man is, and soon finds herself in the middle of a deeper investigation and unsure who to trust.<br/><br/>The only thing Ridley knows for sure is that she has to get to the truth about herself and her past if she is ever going to find her way home.', 'language": "en", "image": "https://images.isbndb.com/covers/84/64/9780307338464.jpg", "title_long": "Sliver of Truth: A Novel", "dimensions": "Height: 9.54 Inches, Length: 6.53 Inches, Weight: 1 Pounds, Width: 1.29 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.53}, "width": {"unit": "inches", "value": 1.29}, "weight": {"unit": "pounds", "value": 1}, "height": {"unit": "inches", "value": 9.54}}, "pages": 368, "date_published": "2007-01-02", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Psychological', 'United States', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Psychological Thrillers', 'Suspense'], 'authors": ["Lisa Unger'], 'title": "Sliver of Truth: A Novel", "isbn13": "9780307338464", "msrp": 23, "binding": "Hardcover", "related": {"ePub": "0307381536"}, "isbn": "0307338460", "isbn10": "0307338460", "other_isbns": [{'isbn": "9780307381538", "binding": "printisbn"}]}}