{"book": {"publisher": "Knopf", "synopsis": "From the two-time Booker Prize–winning author and recipient of the Commonwealth Prize comes this new novel about obsession, deception, and redemption, at once an engrossing psychological suspense story and a work of highly charged, fiendishly funny literary fiction.<br/><br/>Michael—a.k.a. “Butcher”—Boone is an ex–“really famous” painter: opinionated, furious, brilliant, and now reduced to living in the remote country house of his biggest collector and acting as caretaker for his younger brother, Hugh, a damaged man of imposing physicality and childlike emotional volatility. Alone together they’ve forged a delicate and shifting equilibrium, a balance instantly destroyed when a mysterious young woman named Marlene walks out of a rainstorm and into their lives on three-inch Manolo Blahnik heels. Beautiful, smart, and ambitious, she’s also the daughter-in-law of the late great painter Jacques Liebovitz, one of Butcher’s earliest influences. She’s sweet to Hugh and falls in love with Butcher, and they reciprocate in kind. And she sets in motion a chain of events that could be the making—or the ruin—of them all.<br/><br/>Told through the alternating points of view of the brothers—Butcher’s urbane, intelligent, caustic observations contrasting with Hugh’s bizarre, frequently poetic, utterly unique voice—Theft reminds us once again of Peter Carey’s remarkable gift for creating indelible, fascinating characters and a narrative as gripping as it is deliriously surprising.", "language": "en", "image": "https://images.isbndb.com/covers/37/11/9780307263711.jpg", "title_long": "Theft: A Love Story", "edition": "First Edition", "dimensions": "Height: 9.4 Inches, Length: 5.7 Inches, Weight: 1.15 Pounds, Width: 1.1 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.7}, "width": {"unit": "inches", "value": 1.1}, "weight": {"unit": "pounds", "value": 1.15}, "height": {"unit": "inches", "value": 9.4}}, "pages": 272, "date_published": "2006-05-09", "subjects": ["Romance'], 'authors": ["Peter Carey'], 'title": "Theft: A Love Story", "isbn13": "9780307263711", "msrp": 24, "binding": "Hardcover", "related": {"ePub": "0307265277"}, "isbn": "0307263711", "isbn10": "0307263711", "other_isbns": [{'isbn": "9780307265272", "binding": "printisbn"}]}}