{"book": {"publisher": "Everyman"s Library", "synopsis": "Includes the stories "Poison" and 'The Ratcatcher,' soon to be short films from Wes Anderson on Netflix<br/><br/>The only hardcover edition of Roald Dahl’s stories for adults, the Collected Stories amply showcases his singular gifts as a fabulist and a born storyteller. • “An ingenious imagination, a fascination with odd and ordinary detail . . . are the first strengths of Dahl’s storytelling.”—NEW YORK TIMES BOOK REVIEW<br/><br/>Later known for his immortal children’s books, including Charlie and the Chocolate Factory, James and the Giant Peach, and The BFG, Dahlalso had a genius for adult short fiction, which he wrote throughout his life. Whether fictionalizing his dramatic exploits as a Royal Air Force pilot during World War II or concocting the ingeniously plotted fables that were dramatized on television as Tales of the Unexpected, Dahl was brilliant at provoking in his readers the overwhelming desire to know what happens next—and at satisfying that desire in ways that feel both surprising and inevitable.<br/><br/>Filled with devilish plot twists, his tales display a tantalizing blend of macabre humor and the absurdly grotesque. From “The Landlady,” about an unusual boardinghouse that features a small but very permanent clientele, to “Pig,” a brutally funny look at vegetarianism, to “Man from the South,” in which a fanatical gambler does his betting with hammer, nails, and a butcher’s knife, Dahl’s creations amuse and shock us in equal measure, gleefully reminding us of what might lurk beneath the surface of the ordinary.<br/><br/>Everyman\'s Library pursues the highest production standards, printing on acid-free cream-colored paper, with full-cloth cases with two-color foil stamping, decorative endpapers, silk ribbon markers, European-style half-round spines, and a full-color illustrated jacket. Contemporary Classics include an introduction, a select bibliography, and a chronology of the author\'s life and times.', 'language": "en", "image": "https://images.isbndb.com/covers/49/09/9780307264909.jpg", "title_long": "Collected Stories (Everyman"s Library)", 'edition": "First Edition", "dimensions": "Height: 8.2 Inches, Length: 5.2 Inches, Weight: 1.975 Pounds, Width: 1.9 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 1.9}, "weight": {"unit": "pounds", "value": 1.975}, "height": {"unit": "inches", "value": 8.2}}, "pages": 888, "date_published": "2006-10-17", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Horror', 'Short Stories & Anthologies', 'Anthologies', 'Short Stories', 'British & Irish', 'Humor & Satire', 'Satire', 'Dark Humor', 'Self Service', 'Custom Stores'], 'authors": ["Roald Dahl'], 'title": "Collected Stories (Everyman"s Library)", 'isbn13": "9780307264909", "msrp": 30, 'binding": "Hardcover", "isbn": "0307264904", "isbn10": "0307264904"}}