{"book": {"publisher": "Everyman"s Library", "synopsis": "P.G. Wodehouse (1881-1975) was perhaps the most widely acclaimed British humorist of the twentieth century. Throughout his career, he brilliantly examined the complex and idiosyncratic nature of English upper-crust society with hilarious insight and wit. The works in this volume provide a wonderful introduction to Wodehouse’s work and his unique talent for joining fantastic plots with authentic emotion.<br/><br/>In The Code of the Woosters, Wodehouse’s most famous duo, Bertie Wooster and his unflappable valet Jeeves, risks all to steal a cream jug. Uncle Fred in the Springtime, part of the famous Blandings Castle series, follows Uncle Fred as he attempts to ruin the Duke of Blandings while he is preoccupied with his favorite pig. Fourteen stories feature some of Wodehouse’s most memorable characters, and three autobiographical pieces provide a revealing look into Wodehouse’s life.<br/><br/>With his gift for hilarity and his ever-human tone, Wodehouse and his work have never felt more lively. With a New Introduction by John Mortimer", "language": "en", "image": "https://images.isbndb.com/covers/66/13/9780307266613.jpg", "title_long": "The Best of Wodehouse: An Anthology", "edition": "First Edition Thus", "dimensions": "Height: 8.3 Inches, Length: 5.35 Inches, Weight: 1.91 Pounds, Width: 1.71 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.35}, "width": {"unit": "inches", "value": 1.71}, "weight": {"unit": "pounds", "value": 1.91}, "height": {"unit": "inches", "value": 8.3}}, "pages": 840, "date_published": "2007-06-19", "subjects": ["Literature & Fiction', 'Classics', 'Short Stories & Anthologies', 'Anthologies', 'Short Stories', 'British & Irish', 'Humor & Satire', 'Satire', 'Humorous', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["P.G. Wodehouse'], 'title": "The Best of Wodehouse: An Anthology", "isbn13": "9780307266613", "msrp": 35, 'binding": "Hardcover", "isbn": "0307266613", "isbn10": "0307266613"}}