{"book": {"publisher": "Everyman"s Library", "synopsis": "A dazzling selection of seventeen stories from Nobel Prize–winning author Alice Munro—featuring an Introduction by Margaret Atwood<br/><br/>“Munro stands as one of the living colossi of the modern short story, and her Chekhovian realism, her keen psychological insight, her instinctive feel for the emotional arithmetic of domestic life have indelibly stamped contemporary writing.”—The New York Times<br/><br/>The stories brought together in Carried Away span a quarter century, drawn from Alice Munro’s earlier works. Here are such favorites as “Royal Beatings” in which a young girl, her father, and stepmother release the tension of their circumstances in a ritual of punishment and reconciliation; “Friend of My Youth” in which a woman comes to understand that her difficult mother is not so very different from herself; and “The Albanian Virgin,” a romantic tale of capture and escape in Central Europe that may or may not be true but that nevertheless comforts the hearer, who is on a desperate adventure of her own.<br/><br/>Munro’s incomparable empathy for her characters, the depth of her understanding of human nature, and the grace and surprise of her narrative add up to a richly layered and capacious fiction. Like the World War I soldier in the title story, whose letters from the front to a small-town librarian he doesn’t know change her life forever, Munro’s unassuming characters insinuate themselves in our hearts and take permanent hold.", "language": "en", "image": "https://images.isbndb.com/covers/48/62/9780307264862.jpg", "title_long": "Carried Away: A Selection of Stories (Everyman"s Library)", 'edition": "First Edition", "dimensions": "Height: 8.29 Inches, Length: 5.28 Inches, Weight: 1.37 Pounds, Width: 1.34 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.28}, "width": {"unit": "inches", "value": 1.34}, "weight": {"unit": "pounds", "value": 1.37}, "height": {"unit": "inches", "value": 8.29}}, "pages": 608, "date_published": "2006-09-26", "subjects": ["Literature & Fiction', 'Genre Fiction', 'History & Criticism', 'Criticism & Theory', 'Short Stories & Anthologies', 'Short Stories', 'Women's Fiction', 'Friendship', 'Literary'], 'authors": ["Alice Munro'], 'title": "Carried Away: A Selection of Stories (Everyman"s Library)", 'isbn13": "9780307264862", "msrp": 26, 'binding": "Hardcover", "isbn": "0307264866", "isbn10": "0307264866"}}