{"book": {"publisher": "Listening Library", "synopsis": "To the great joy of her many fans, Tamora Pierce with this book begins a new saga of Tortall to add to The Song of the Lioness Quartet, the Immortals Quartet, and The Protector of the Small tetralogy. At the center of each of these books is always a strong and resourceful young woman who masters the arts of swordplay and knightly warfare in the magical medieval country of Tortall. Alianne, or Aly, daughter of the warrior queen Alanna the Lioness, has all these skills, but also a delicious sense of humor, which serves her well when she is chosen by the trickster god Kyprioth to serve as his secret agent and a slave for a year in the embattled Copper Isles. There the dark-skinned natives, or raka, have been conquered and crushed by the laurin, light-skinned people from the mainland. The burning raka resentment is fueled by prophecies of a twice royal queen who will free them, aided by the "wise one, the cunning one, the strong one, the warrior, and the crows." Just how each of the colorful characters and Aly herself fit into this prophecy and Kyprioth\"s tricky plan keeps readers guessing. Aly plots to show her skill at spying as she flirts with the god and is courted by Nawat, a crow transformed into a handsome young man, who is puzzled when she rejects his attempts to mate-feed her with grubs and ants.<br/>The pages of this long but fast-paced adventure zip by, enlivened by intrigue, skirmishes, comedy, romance, and lots of dramatic clothes. (Ages 10 to 14) --Patty Campbell<br/><br/>Length approximately 11:54:00', 'language": "en", "image": "https://images.isbndb.com/covers/37/95/9780307283795.jpg", "title_long": "Trickster"s Choice (Lib)(CD)", 'edition": "Unabridged", "pages": 12, "date_published": "2005", "subjects": ["Children's Books', 'Science Fiction & Fantasy', 'Fantasy & Magic'], 'authors": ["Tamora Pierce'], 'title": "Trickster"s Choice (Lib)(CD)", 'isbn13": "9780307283795", "msrp": 14.95, 'binding": "Audio CD", "isbn": "0307283798", "isbn10": "0307283798"}}