{"book": {"publisher": "Crown Business", "synopsis": "In this book, self-made millionaire Phil Towns will show you how he turned $1,000 into $1 million in only five years, and then proceeded to make many millions more.<br/><br/>Before I became “Phil Town, teacher of investing principles to more than 500,000 people a year,” I was a lot like you: someone who viewed individual stock investing as way too hard to do successfully. As a guy who barely made a living as a river guide, I considered the whole process pretty impenetrable, and I was convinced that to do it right you had to make it a full-time job. Me, I was more interested in having full-time fun.<br/><br/>So I was tempted to do what you’re probably doing right now: letting some mutual fund manager worry about growing your nest egg. Let me tell you why that decision could one day make you absolutely miserable.<br/><br/>The fact is, because of natural market cycles, the mutual fund industry is likely to soon be facing twenty years of flat returns. That means that if you’ve got your nest egg tucked away in funds—especially the type found in most 401ks—your egg won’t get much bigger than it is now. Translation: Get ready for a retirement filled with lots of cold cuts, plenty of quality TV-watching time, and a place to live that’s too small to accommodate your visiting kids.<br/><br/>I came to investing as a person who wasn’t great at math, possessed zero extra cash, and wanted a life—not an extra three hours of work to do every day. Fortunately, I was introduced to The Rule.<br/><br/>Rule #1, as famed investor Warren Buffett will tell you, is don’t lose money. Through an intriguing process that I’ll clarify in this book, not losing money results in making more money than you ever imagined. What it comes down to is buying shares of companies only when the numbers—and the intangibles—are on your side. If that sounds too good to be true, it’s because the mind-set I’ll be introducing you to leads not to bets but to certainties. Believe me, if there were anything genius-level about this, I’d still be a river guide collecting unemployment much of the year.<br/><br/>Part of the secret is thinking of yourself as a business owner rather than a stock investor. Part is taking advantage of today’s new Internet tools, which drastically reduce the “homework factor.” (We’re talking a few minutes, tops.) Part is knowing the only five numbers that really count in valuing a potential investment. And part—maybe the most important part—is using the risk-free Rule #1 approach to consistently pay a mere 50 cents to buy a dollar’s worth of a business.<br/><br/>What I won’t waste your time with is fluff: a lot of vague parables reminding you of what you already know and leaving you exactly where you started. This is the real deal, folks: a start-to-finish, one-baby-step-at-a-time approach that will allow you to retire ten years sooner than you planned, with more creature comforts than you ever imagined.", "language": "en", "image": "https://images.isbndb.com/covers/61/32/9780307336132.jpg", "title_long": "Rule #1: The Simple Strategy for Successful Investing in Only 15 Minutes a Week!", "dimensions": "Height: 9.45 Inches, Length: 6.42 Inches, Weight: 1.23 Pounds, Width: 1.09 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.42}, "width": {"unit": "inches", "value": 1.09}, "weight": {"unit": "pounds", "value": 1.23}, "height": {"unit": "inches", "value": 9.45}}, "pages": 320, "date_published": "2006", "subjects": ["Business & Money', 'Investing', 'Introduction', 'Personal Finance', 'Budgeting & Money Management'], 'authors": ["Phil Town'], 'title": "Rule #1: The Simple Strategy for Successful Investing in Only 15 Minutes a Week!", "isbn13": "9780307336132", "msrp": 25, "binding": "Hardcover", "related": {"ePub": "0307345750"}, "isbn": "0307336131", "isbn10": "0307336131", "other_isbns": [{'isbn": "9780307345752", "binding": "printisbn"}]}}