{"book": {"publisher": "Debolsillo", "synopsis": "En los últimos años, las novelas de la serie NUMA, escritas por Clive Cussler en colaboración con Paul Krempecos, se han convertido en un éxito de crítica y público, con una legión de fans que reciben cada vez con más entusiasmo las nuevas entregas. Y sus expectativas, como ya pasara con Muerte blanca, nunca se ven defraudadas.<br/>Este es el caso de la nueva novela de la serie, Lost City, en la que una enzima capaz de prolongar la vida ha sido descubierta a setenta metros de profundidad en el Atlántico Norte, en el área conocida como “Lost City”. Pero, ¿por qué todos los que se dedican a recogerla son asesinados? ¿Por qué todos los científicos de un remoto laboratorio griego desaparecen uno a uno? ¿Qué tiene todo esto que ver con un cuerpo que acaba de aparecer congelado en una cima de los Alpes? Para Kurt Austin, jefe del equipo NUMA y su compañero, Joe Zavala, está claro que ahí hay mucho por investigar, pero las respuestas a estas preguntas serán más abrumadoras de lo que piensan y representan el reto más peligroso que han tenido nunca que afrontar.<br/>Enriquecido con una acción que pone los pelos de punta y una imaginación que nunca termina, Lost City es un thriller excepcional, uno de los mejores de sus autores.", "language": "es", "image": "https://images.isbndb.com/covers/66/40/9780307376640.jpg", "title_long": "La ciudad perdida (The Numa Files) (Spanish Edition)", "edition": "1ra edicion", "dimensions": "Height: 6.7 Inches, Length: 4.1 Inches, Weight: 0.575 Pounds, Width: 1.3 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 4.1}, "width": {"unit": "inches", "value": 1.3}, "weight": {"unit": "pounds", "value": 0.575}, "height": {"unit": "inches", "value": 6.7}}, "pages": 432, "date_published": "2006-11-07", "subjects": ["Mystery, Thriller & Suspense', 'Thrillers & Suspense'], 'authors": ["Clive Cussler'], 'title": "La ciudad perdida (The Numa Files) (Spanish Edition)", "isbn13": "9780307376640", "msrp": 36.25, 'binding": "Mass Market Paperback", "isbn": "0307376648", "isbn10": "0307376648"}}