{"book": {"publisher": "Crown", "synopsis": "#1 NEW YORK TIMES BESTSELLER • “Prepare to be entranced by this addictively readable oral history of the great war between humans and zombies.”—Entertainment Weekly<br/><br/>We survived the zombie apocalypse, but how many of us are still haunted by that terrible time? We have (temporarily?) defeated the living dead, but at what cost? Told in the haunting and riveting voices of the men and women who witnessed the horror firsthand, World War Z is the only record of the pandemic.<br/><br/>The Zombie War came unthinkably close to eradicating humanity. Max Brooks, driven by the urgency of preserving the acid-etched first-hand experiences of the survivors, traveled across the United States of America and throughout the world, from decimated cities that once teemed with upwards of thirty million souls to the most remote and inhospitable areas of the planet. He recorded the testimony of men, women, and sometimes children who came face-to-face with the living, or at least the undead, hell of that dreadful time. World War Z is the result. Never before have we had access to a document that so powerfully conveys the depth of fear and horror, and also the ineradicable spirit of resistance, that gripped human society through the plague years.<br/><br/>THE INSPIRATION FOR THE MAJOR MOTION PICTURE<br/><br/>“Will spook you for real.”—The New York Times Book Review<br/><br/>“Possesses more creativity and zip than entire crates of other new fiction titles. Think Mad Max meets The Hot Zone. . . . It’s Apocalypse Now, pandemic-style. Creepy but fascinating.”—USA Today<br/><br/>“Will grab you as tightly as a dead man’s fist. A.”—Entertainment Weekly, EW Pick<br/><br/>“Probably the most topical and literate scare since Orson Welles’s War of the Worlds radio broadcast . . . This is action-packed social-political satire with a global view.”—Dallas Morning News", "language": "en", "image": "https://images.isbndb.com/covers/66/05/9780307346605.jpg", "title_long": "World War Z: An Oral History of the Zombie War", "edition": "First Edition", "dimensions": "Height: 1.17 Inches, Length: 9.58 Inches, Weight: 1.32 Pounds, Width: 6.36 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 9.58}, "width": {"unit": "inches", "value": 6.36}, "weight": {"unit": "pounds", "value": 1.32}, "height": {"unit": "inches", "value": 1.17}}, "pages": 342, "date_published": "2006-09-12", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Horror', 'War', 'United States', 'Humor', 'Humor & Satire', 'Satire', 'Humorous', 'Science Fiction & Fantasy', 'Science Fiction', 'Adventure'], 'authors": ["Max Brooks'], 'title": "World War Z: An Oral History of the Zombie War", "isbn13": "9780307346605", "msrp": 27, "binding": "Hardcover", "isbn": "0307346609", "isbn10": "0307346609", "other_isbns": [{'isbn": "9780307351937", "binding": "e"}]}}