{"book": {"publisher": "Knopf", "synopsis": "With her disarming, intimate, completely accessible voice, and dry sense of humor, Nora Ephron shares with us her ups and downs in I Feel Bad About My Neck, a candid, hilarious look at women who are getting older and dealing with the tribulations of maintenance, menopause, empty nests, and life itself.<br/><br/>The woman who brought us When Harry Met Sally . . . , Sleepless in Seattle, You’ve Got Mail, and Bewitched, and the author of best sellers Heartburn, Scribble Scribble, and Crazy Salad, discusses everything—from how much she hates her purse to how much time she spends attempting to stop the clock: the hair dye, the treadmill, the lotions and creams that promise to slow the aging process but never do. Oh, and she can’t stand the way her neck looks. But her dermatologist tells her there’s no quick fix for that.<br/><br/>Ephron chronicles her life as an obsessed cook, passionate city dweller, and hapless parent. She recounts her anything-but-glamorous days as a White House intern during the JFK years (“I am probably the only young woman who ever worked in the Kennedy White House that the President did not make a pass at”) and shares how she fell in and out of love with Bill Clinton—from a distance, of course. But mostly she speaks frankly and uproariously about life as a woman of a certain age.<br/><br/>Utterly courageous, wickedly funny, and unexpectedly moving in its truth telling, I Feel Bad About My Neck is a book of wisdom, advice, and laugh-out-loud moments, a scrumptious, irresistible treat.", "language": "en", "image": "https://images.isbndb.com/covers/45/58/9780307264558.jpg", "title_long": "I Feel Bad About My Neck: And Other Thoughts on Being a Woman", "edition": "First Edition", "dimensions": "Height: 9 Inches, Length: 6.25 Inches, Weight: 0.7 Pounds, Width: 0.75 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.25}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 0.7}, "height": {"unit": "inches", "value": 9}}, "pages": 137, "date_published": "2006-08-01", "subjects": ["Humor & Entertainment', 'Humor', 'Essays', 'Health, Fitness & Dieting', 'Aging', 'Literature & Fiction', 'Humor & Satire', 'Satire', 'Parenting & Relationships', 'Politics & Social Sciences', 'Women's Studies'], 'authors": ["Nora Ephron'], 'title": "I Feel Bad About My Neck: And Other Thoughts on Being a Woman", "isbn13": "9780307264558", "msrp": 21.95, "binding": "Hardcover", "related": {"ePub": "0307265943"}, "isbn": "0307264556", "isbn10": "0307264556", "other_isbns": [{'isbn": "9780307265944", "binding": "printisbn"}]}}