{"book": {"publisher": "Crown", "synopsis": "The Doctor Is In . . . Again!<br/><br/>Did the mega-bestselling Why Do Men Have Nipples? exhaust your curiosity about stuff odd, icky, kinky, noxious, libidinous, or just plain embarrassing? No, you say? Well, good, because the doctor and his able-bodied buddy are in! Again! Mark Leyner and Billy Goldberg, M.D., now take on the differences between the sexes—those burning questions like Why doesn’t my husband ever listen? or Why does my wife ALWAYS have to pee? And of course, Why do men fall asleep after sex?, plus plenty of others to keep you fully informed.<br/><br/>Full of smart and funny answers to an onslaught of new questions, all in a do-ask-we’ll-tell spirit that entertain and teaches you something at the same time, Why Do Men Fall Asleep After Sex? offers the real lowdown on everything everyone wants to know about all things anatomical, medical, sexual, nutritional, animal, and mineral, but would only ask a physician after a few too many, like:<br/><br/>• Why do you have a “bionic” sense of smell when you’re pregnant?<br/><br/>• Does peeing in the shower cure athlete’s foot?<br/><br/>• Is a dog’s mouth clean?<br/><br/>• Can you breastfeed with fake boobs?<br/><br/>• Does thumb sucking cause buckteeth?<br/><br/>• Do your eyebrows grow back if shaved?<br/><br/>Bigger, funnier, and better than ever, Why Do Men Fall Asleep After Sex? proves that in the battle of the sexes, as in most things, a little Q&A is a safe, effective, minimally invasive remedy.<br/><br/>Also available as an eBook", "language": "en", "image": "https://images.isbndb.com/covers/59/74/9780307345974.jpg", "title_long": "Why Do Men Fall Asleep After Sex?: More Questions You"d Only Ask a Doctor After Your Third Whiskey Sour", "edition": "First Edition", "dimensions": "Height: 7.55 Inches, Length: 4.96 Inches, Weight: 0.43 Pounds, Width: 0.65 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.96}, "width": {"unit": "inches", "value": 0.65}, "weight": {"unit": "pounds", "value": 0.43}, "height": {"unit": "inches", "value": 7.55}}, "pages": 288, "date_published": "2006-08-01", "subjects": ["Humor & Entertainment', 'Trivia & Fun Facts', 'Humor', 'Doctors & Medicine', 'Love, Sex & Marriage', 'Puzzles & Games', 'Trivia', 'Health, Fitness & Dieting', 'Reference', 'Literature & Fiction', 'Humor & Satire', 'Satire', 'Medical Books'], 'authors": ["Mark Leyner', 'Billy Goldberg'], 'title": "Why Do Men Fall Asleep After Sex?: More Questions You"d Only Ask a Doctor After Your Third Whiskey Sour", 'isbn13": "9780307345974", "msrp": 15, "binding": "Paperback", "related": {"ePub": "0307352714"}, "isbn": "0307345971", "isbn10": "0307345971", "other_isbns": [{'isbn": "9780307352712", "binding": "printisbn"}]}}