{"book": {"publisher": "Zondervan", "synopsis": "What should the church look like today? What should be the focus of its message? How should I present that message? We live in as pivotal and defining an age as the Great Depression or the Sixties–a period whose definition, say some cultural observers, includes a warning of the church’s influence. The result? A society measurably less religious but decidedly more spiritual. Less influenced by authority than by experience. More attuned to images than to words. How does the church adapt to such a culture? Or should it, in fact, eschew adapting for maintaining a course it has followed these last two millennia? Or something in between? These are exactly the questions asked in The Church In Emerging Culture by five Christian thinker-speaker-writers, each who advocate unique stances regarding what the church’s message should be (and what methods should be used to present it) as it journeys through this evolving, postmodern era. The authors are: Andy Crouch–Re:Generation Quarterly editor-in-chief Michael Horton–professor and reformed theologian Frederica Mathewes-Green–author, commentator, and Orthodox Christian Brian D. McLaren–postmodernist, author, pastor, and Emergent senior fellow Erwin Raphael McManus–author and pastor of the innovative and interethnic L.A.-based church, Mosaic Most unique about their individual positions is that they’re presented not as singular essays but as lively discussions in which the other four authors freely (and frequently) comment, critique, and concur. That element, coupled with a unique photographic design that reinforces the depth of their at-once congenial and feisty conversation, gives you all-access entrée into this groundbreaking discourse. What’s more, general editor Leonard Sweet (author of SoulTsunami and AquaChurch, among several other acclaimed texts) frames the thought-provoking dialogue with a profoundly insightful, erudite introductory essay–practically a book within a book. The Church In Emerging Culture is foundational reading for leaders and serious students of all denominations and church styles.", "language": "en", "image": "https://images.isbndb.com/covers/48/74/9780310254874.jpg", "title_long": "The Church in Emerging Culture: Five Perspectives", "edition": "Illustrated", "dimensions": "Height: 9.13 Inches, Length: 7.38 Inches, Weight: 1.02735414092 Pounds, Width: 0.75 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 7.38}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 1.02735414092}, "height": {"unit": "inches", "value": 9.13}}, "pages": 272, "date_published": "2003-10-19", "subjects": ["Christian Books & Bibles', 'Christian Living', 'Inspirational', 'Churches & Church Leadership', 'Church History', 'Church Institutions & Organizations', 'Theology', 'Ecclesiology', 'History', 'World', 'Religious', 'Religion & Spirituality', 'Religious Studies', 'Sociology', 'Politics & Social Sciences'], 'authors": ["Leonard Sweet', 'Andy Crouch', 'Brian D. McLaren', 'Erwin Raphael McManus', 'Michael Horton', 'Frederica Matthewes-Green'], 'title": "The Church in Emerging Culture: Five Perspectives", "isbn13": "9780310254874", "msrp": 19.99, "binding": "Paperback", "related": {"eBook": "0310861373"}, "isbn": "0310254876", "isbn10": "0310254876", "other_isbns": [{'isbn": "9780310861379", "binding": "print"}]}}