{"book": {"publisher": "Zondervan", "synopsis": "She is a Supreme Court Justice. She is an atheist. And she is about to encounter the God of the truth and justice she has sworn to uphold. For years, Millicent Hollander has been the consistent swing vote on abortion and other hot-button issues. Now she"s poised to make history as the first female Chief Justice of the United States Supreme Court. But something is about to happen that no one has counted on, least of all Hollander: a near-death experience that will thrust her on a journey toward God. Skeptically, fighting every inch of the way, Hollander finds herself dragged toward belief in something she has never believed in---while others in Washington are watching her every step. Too much is at stake to let a Christian occupy the country"s highest judicial office. Even as Hollander grapples with the interplay between faith and the demands of her position, and as she finds answers through her growing friendship with Pastor Jack Holden, a hidden web of lies, manipulation, and underworld connections is being woven around her. It could control her. It could destroy her reputation. Unless God intervenes, it could take her out of the picture permanently.", 'language": "en", "image": "https://images.isbndb.com/covers/38/85/9780310243885.jpg", "title_long": "Deadlock", "edition": "Reprinted", "dimensions": "Height: 5.39369 Inches, Length: 8.50392 Inches, Weight: 0.6503636729 Pounds, Width: 0.86614 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.50392}, "width": {"unit": "inches", "value": 0.86614}, "weight": {"unit": "pounds", "value": 0.6503636729}, "height": {"unit": "inches", "value": 5.39369}}, "pages": 320, "date_published": "2002-10-01", "subjects": ["Christian Books & Bibles', 'Literature & Fiction', 'Mystery & Suspense', 'Religion & Spirituality'], 'authors": ["James Scott Bell'], 'title": "Deadlock", "isbn13": "9780310243885", "msrp": 14.99, "binding": "Paperback", "related": {"ePub": "031056574X"}, "isbn": "0310243882", "isbn10": "0310243882", "other_isbns": [{'isbn": "9780310565741", "binding": "print"}]}}