{"book": {"publisher": "Zondervan", "synopsis": ""Not I, but Christ." That brief phrase reflects our complete dependency on Jesus for everything that the Christian life is about, from right standing with God, to spiritual growth, to personal well being, to practical service. In four words, it captures the essence and sweep of The Complete Green Letters.<br/>The language of The Complete Green Letters may have a classic flavor, but the remarkable insight and spiritual penetration are thoroughly and refreshingly contemporary. Drawing from the spiritual heritage of the Keswick Convention, these beloved writings by Miles J. Stanford comment powerfully on the true nature of spirituality. Here in one volume, in logical order, are: The Green Letters: Principles of Spiritual Growth The Principle of Position: Foundations of Spiritual Growth The Ground of Growth: The Christian\"s Relationship to the Cross and the Risen Christ The Reckoning That Counts: The Realization of Spiritual Growth Abide Above: A Guide to Spiritual Growth<br/>A sound apprehension of the deeper life can make the difference between progress or frustration, peace or turmoil. If you desire a better understanding of what it means to serve Christ, his church, and the world around you, The Complete Green Letters shines light on the path of spiritual growth.', 'language": "en", "image": "https://images.isbndb.com/covers/05/16/9780310330516.jpg", "title_long": "Complete Green Letters, The", "edition": "Later Printing.", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 0.69886537054 Pounds, Width: 0.88 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 0.88}, "weight": {"unit": "pounds", "value": 0.69886537054}, "height": {"unit": "inches", "value": 8}}, "pages": 336, "date_published": "1984-01-14", "subjects": ["Christian Books & Bibles', 'Christian Living', 'Faith', 'Personal Growth', 'Spiritual Growth', 'Literature & Fiction', 'Contemporary', 'Religion & Spirituality', 'Worship & Devotion', 'Devotionals'], 'authors": ["Miles J. Stanford'], 'title": "Complete Green Letters, The", "isbn13": "9780310330516", "msrp": 16.99, 'binding": "Paperback", "isbn": "0310330513", "isbn10": "0310330513"}}