{"book": {"publisher": "Zondervan", "synopsis": "Does having faith mean abandoning reason? It"s easy to get that impression. Still, it seems reasonable that a supremely intelligent God would want you to use your God-given intellect on your spiritual journey as much as in any other aspect of your life.<br/>Faith may not stand on rational thinking alone, but a solid faith should walk hand in hand with intellectual integrity. Does it really matter what I believe? What is the relationship between faith and knowledge? Why are there so many religions? Do all paths lead to the same God?<br/>This book helps you sort through the questions, objections, and concerns you can"t help but raise. A Search for What Makes Sense will help you think your way clearly and honestly to answers that satisfy because they"re your answers--conclusions you've arrived at personally without manipulation, coercion, or game-playing.<br/>For faith to exist and grow it's got to make sense--good sense, carefully-thought-out sense. And chances are it does.<br/>FINDING FAITH<br/>The Finding Faith books A Search for What Makes Sense and A Search for What Is Real don't try to tell you what to believe; they are guides in learning how to believe. If you think the spiritual journey requires turning your back on honesty and intellectual integrity, these two companion volumes will speak to both your mind and your soul.', 'language": "en", "image": "https://images.isbndb.com/covers/26/63/9780310272663.jpg", "title_long": "Finding Faith: A Search for What Makes Sense", "dimensions": "Height: 7.125 Inches, Length: 5 Inches, Weight: 0.37919509064 Pounds, Width: 0.48 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 0.48}, "weight": {"unit": "pounds", "value": 0.37919509064}, "height": {"unit": "inches", "value": 7.125}}, "pages": 192, "date_published": "2007-01-23", "subjects": ["Christian Books & Bibles', 'Christian Living', 'Faith', 'Personal Growth', 'Spiritual Growth', 'Religion & Spirituality', 'Worship & Devotion'], 'authors": ["Brian Mclaren'], 'title": "Finding Faith: A Search for What Makes Sense", "isbn13": "9780310272663", "msrp": 10.7, "binding": "Paperback", "related": {"Kindle Edition": "0310858747", "ePub": "0310858747"}, "isbn": "0310272661", "isbn10": "0310272661", "other_isbns": [{'isbn": "9780310858744", "binding": "print"}]}}