{"book": {"publisher": "Zondervan", "synopsis": ""...a wonderfully user-friendly book for serious readers who desire to journey into the world of the Bible in order to better understand it and to live faithfully in today"s world."---From the foreword by Kevin J. Vanhoozer'Excellent, practical, and accurate. It leads students from the most fundamental building blocks of interpretation (including skills that most beginning students lack) through all the essential processes.'---Craig S. Keener, Professor of New Testament, Eastern SeminaryJust as a rock climber's handhold enables him to master the mountain, a firm grasp on God's Word empowers us to traverse the challenging, risky slopes of life. Grasping God's Word helps college students, beginning seminary students, and other serious readers get a grip on the solid rock of Scripture---how to read it, how to interpret it, and how to apply it.Filling the gap between approaches that are too simple and others that are too technical, this book starts by equipping readers with general principles of interpretation, then moves on to apply those principles to specific genres and contexts. Features include:* Proven in classrooms across the country* Hands-on exercises to guide students through the interpretation process* Emphasis on real-life application* Supplemented by a website for professors providing extensive teaching materials* Accompanying workbook (sold separately)This second edition includes an appendix on 'Inspiration and Canon,' numerous updates throughout the rest of the book, new exercises, and updated bibliographies.Grasping God's Word progresses through the following five sections:1. How to Read the Book---Basic Tools2. Contexts---Now and Then3. Meaning and Application4. The Interpretive Journey---New Testament5. The Interpretive Journey---Old Testament', 'language": "en", "image": "https://images.isbndb.com/covers/96/64/9780310259664.jpg", "title_long": "Grasping God"s Word: A Hands-On Approach To Reading, Interpreting, And Applying The Bible", 'edition": "2", "dimensions": "Height: 9.25 Inches, Length: 7.5 Inches, Weight: 2.00179733896 Pounds, Width: 1.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.5}, "width": {"unit": "inches", "value": 1.5}, "weight": {"unit": "pounds", "value": 2.00179733896}, "height": {"unit": "inches", "value": 9.25}}, "pages": 462, "date_published": "2005", "subjects": ["Christian Books & Bibles', 'Bible Study & Reference', 'Bible Study', 'Criticism & Interpretation', 'Religion & Spirituality', 'Religious Studies', 'Philosophy'], 'authors": ["J. Scott Duvall', 'J. Daniel Hays'], 'title": "Grasping God"s Word: A Hands-On Approach To Reading, Interpreting, And Applying The Bible", 'isbn13": "9780310259664", "msrp": 39.99, 'binding": "Hardcover", "isbn": "0310259665", "isbn10": "0310259665"}}