{"book": {"publisher": "St. Martin"s Griffin", "synopsis": "Over thirty years ago, a group of five Englishmen and one wayward American, re-wrote the rules of comedy. Monty Python"s Flying Circus, an unheralded, previously unseen and practically unprogrammed half hour of sketches, hilarities, inanities and animations first appeared on the BBC late one night in 1969. Its impact on the world has been felt ever since.<br/>From its humble beginnings as late night entertainment on a British TV channel that went off the air before midnight, it blossomed into arguably the most influential movement in modern comedy. They found the Holy Grail, they detailed the life of the Savior-also-ran Brian, and when we were lost, they explained The Meaning of Life.<br/>Now, those purveyors of dead parrots and silly walks are going to tell us something more: Their story. In their own, intimate, never before heard words.<br/>The Pythons by The Pythons is the definitive word on all things Pythonesque (the only word invented by a modern comedian which is listed in the Oxford English Dictionary.) 30 years of insight, hindsight, and bad sight - now told for the first time. Stuff they"re never remembered before alongside stories they'd forgotten to say, coupled with things they couldn't say then and even more things they can't pronounce now (with a healthy dollop of things they would never have said in the first place if any others had been in the room at the time.)<br/>The Pythons by The Pythons is a unique look at arguably the most important comic team of the modern age, lavishly illustrated with 1000 photographs and illustrations, many culled from the teams' own personal collections, many seen here for the first time. A tome, a tombstone, the definitive word on all things Python, as told by all things Python - do you want Spam with that?', 'language": "en", "image": "https://images.isbndb.com/covers/14/52/9780312311452.jpg", "title_long": "The Pythons", "edition": "First Edition", "dimensions": "Height: 9.4200599 Inches, Length: 7.6 Inches, Weight: 2.45 Pounds, Width: 0.8401558 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.6}, "width": {"unit": "inches", "value": 0.8401558}, "weight": {"unit": "pounds", "value": 2.45}, "height": {"unit": "inches", "value": 9.4200599}}, "pages": 368, "date_published": "2005-11-15", "subjects": ["Arts & Photography', 'Performing Arts', 'Biographies & Memoirs', 'Arts & Literature', 'Actors & Entertainers', 'Television Performers', 'Humor & Entertainment', 'Humor', 'Television'], 'authors": ["Graham Chapman', 'Michael Palin', 'John Cleese', 'Terry Gilliam', 'Eric Idle', 'Terry Jones'], 'title": "The Pythons", "isbn13": "9780312311452", "msrp": 19.95, 'binding": "Paperback", "isbn": "0312311451", "isbn10": "0312311451"}}