{"book": {"publisher": "St. Martin"s Press", "synopsis": "Peter Rabbit, Mr. McGregor, and many other Beatrix Potter characters remain in the hearts of millions. However, though Potter is a household name around the world, few know the woman behind the illustrations. Her personal life, including a romantic relationship with her publisher, Norman Warne, and her significant achievements outside of children"s literature remain largely unknown. In Linda Lear"s enchanting new biography, we get the life story of this incredible, funny, and independent woman. As one of the first female naturalists in the world, Potter brought the beauty and importance of nature back into the imagination at a time when plunder was more popular than preservation. Through her art she sought to encourage conservation and change the world. With never before seen illustrations and intimate detail, Lear goes beyond our perrenial fascination with Potter as a writer and illustrator of children's books, and delves deeply into the life of a most unusual and gifted woman--one whose art was timeless, and whose generosity left an indelible imprint on the countryside.', 'language": "en", "image": "https://images.isbndb.com/covers/93/47/9780312369347.jpg", "title_long": "Beatrix Potter: A Life in Nature", "edition": "First Edition", "dimensions": "Height: 1.71 Inches, Length: 9.5 Inches, Weight: 2.1 Pounds, Width: 6.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 9.5}, "width": {"unit": "inches", "value": 6.5}, "weight": {"unit": "pounds", "value": 2.1}, "height": {"unit": "inches", "value": 1.71}}, "pages": 608, "date_published": "2007-01-09", "subjects": ["Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Self Service', 'Custom Stores'], 'authors": ["Linda Lear'], 'title": "Beatrix Potter: A Life in Nature", "isbn13": "9780312369347", "msrp": 30, "binding": "Hardcover", "isbn": "0312369344", "isbn10": "0312369344", "other_isbns": [{'isbn": "9781429972154", "binding": "print"}]}}