{"book": {"publisher": "St. Martin"s Paperbacks", "synopsis": "Rule #1: Never fall in love.<br/><br/>Celeste Bradley captivated critics and readers alike with her unforgettable novel Fallen, which was nominated for the prestigious RITA Award from Romance Writers of America for Best First Book. Now, she brings us The Lover, the first book in the wildly fun, exciting, and sexy new Liar\"s Club series both featuring irresistible heroes who are out to steal their leading ladies hearts!<br/><br/>She had a secret she\"d do anything to hide.<br/>Agatha Cunnington, a headstrong beauty from the country, has come to London in search of her missing brother James. The only clue she has is a cryptic letter signed The Griffin. Agatha decides to disguise herself as a respectable married woman so that she can go about the city unnoticed. But for her charade to work she needs a suitable 'husband,' preferably someone tall, elegant, and rakish-someone like Simon Montague Rain.<br/><br/>He had a secret he\'d do anything to hide.<br/>Simon Montague Rain, also known as The Magician, is a member of The Liar\'s Club, a renegade group of rogues and thieves in the service of the Crown. When someone begins murdering members of the undercover cabal one by one, Simon is given the mission to bring in The Griffin, one of his comrades who is suspected of betraying his brothers. Simon goes undercover and infiltrates the home of 'Mrs.' Agatha Applequist who he believes is the Griffin\'s mistress. Before Simon knows what\'s happened, he finds himself irresistibly drawn to Agatha\'s soft, feminine charms-and he is tempted beyond reason to break the first rule of The Liar\'s Club: never fall in love.', 'language": "en", "image": "https://images.isbndb.com/covers/48/54/9780312984854.jpg", "title_long": "The Pretender (Liars Club, Book 1)", "edition": "Reprint", "dimensions": "Height: 6.8 Inches, Length: 4.26 Inches, Weight: 0.42108292042 Pounds, Width: 1.06 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.26}, "width": {"unit": "inches", "value": 1.06}, "weight": {"unit": "pounds", "value": 0.42108292042}, "height": {"unit": "inches", "value": 6.8}}, "pages": 384, "date_published": "2003-06-16", "subjects": ["Literature & Fiction', 'United States', 'Romance', 'Historical', 'Regency'], 'authors": ["Celeste Bradley'], 'title": "The Pretender (Liars Club, Book 1)", "isbn13": "9780312984854", "msrp": 7.99, 'binding": "Mass Market Paperback", "isbn": "0312984855", "isbn10": "0312984855"}}