{"book": {"publisher": "St. Martin"s Press", "synopsis": "In the first volume of her autobiography, The Sun in the Morning, M.M. Kaye detailed the first eighteen years of her life in India and England and introduced readers to her love affair with India. She brought to life its people, scents, vibrant colors, and breathtaking landscapes. In the second volume, Golden Afternoon, she happily returned to her beloved India after years in a British boarding school. New to the glories of the Delhi social season, M.M. Kaye recounted her delightful exploits as a vivacious young woman in Raj society.<br/><br/>Now, in Enchanted Evening, M.M. Kaye is a young woman forced to leave her cherished home in India when her father takes a new post in china. Though at first disoriented by the unfamiliar customs and confusing protocol of her new surroundings, it is in China that she discovers the pleasures that come from independence. Coming into her own as a painter, Kaye first meets with artistic success in China and then moves to cramped quarters in London"s South Kensington neighborhood, where she begins to flourish as a writer.<br/><br/>With vivid descriptions and the wisdom that comes with age, M.M. Kaye looks back on the years she spent as a young woman in a world as yet unmarked by World War II"s devastation.', 'language": "en", "image": "https://images.isbndb.com/covers/58/16/9780312265816.jpg", "title_long": "Enchanted Evening: Volume III of the Autobiography of M. M. Kaye", "edition": "First Edition", "dimensions": "Height: 9.62 Inches, Length: 6.5 Inches, Weight: 1.5 Pounds, Width: 1.265 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.5}, "width": {"unit": "inches", "value": 1.265}, "weight": {"unit": "pounds", "value": 1.5}, "height": {"unit": "inches", "value": 9.62}}, "pages": 368, "date_published": "2000-12-05", "subjects": ["Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Community & Culture', 'Women'], 'authors": ["M. M. Kaye'], 'title": "Enchanted Evening: Volume III of the Autobiography of M. M. Kaye", "isbn13": "9780312265816", "msrp": 26.95, "binding": "Hardcover", "isbn": "0312265816", "isbn10": "0312265816", "other_isbns": [{'isbn": "9781466842755", "binding": "printisbncanonical"}]}}