{"book": {"publisher": "Minotaur Books", "synopsis": "There"s hell to pay in Philadelphia when Marty Kelly commits suicide over his wife"s body in the sacristy of St. Anselm"s Church. Everyone assumes that Bernadette Kelly, a diabetic, died of natural causes--until the autopsy reveals death by arsenic. But one of the nuns a St. Anselm's, certain of Marty innocence, recruits retired director of the FBI's Behavioral Science Unit Gregor Demarkian to investigate for the new Cardinal Archbishop. His Eminence, dispatched to Philadelphia to clean up a scandal, expects Demarkian to act with discretion. But when a third death by arsenic is revealed in the neighboring Episcopal Church, not even God's grace can help the priest who becomes a prime suspect--and the murderer's next victim. Moving among three combustible parishes--Catholic, Episcopalian, and rabble-rousing fundmentalist--Demarkian must negotiate his way through holy hell to find the diabolically clever killer. Only then may God's will--and a homicidal reign of terror--be done...', 'language": "en", "image": "https://images.isbndb.com/covers/28/67/9780312982867.jpg", "title_long": "True Believers: A Gregor Demarkian Novel", "edition": "First Edition", "dimensions": "Height: 6.62 Inches, Length: 4.18 Inches, Weight: 0.46 Pounds, Width: 1.25 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.18}, "width": {"unit": "inches", "value": 1.25}, "weight": {"unit": "pounds", "value": 0.46}, "height": {"unit": "inches", "value": 6.62}}, "pages": 432, "date_published": "2002-04-15", "subjects": ["Literature & Fiction', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Police Procedurals', 'Private Investigators', 'Self Service', 'Custom Stores'], 'authors": ["Jane Haddam'], 'title": "True Believers: A Gregor Demarkian Novel", "isbn13": "9780312982867", "msrp": 6.99, "binding": "Mass Market Paperback", "isbn": "0312982860", "isbn10": "0312982860", "other_isbns": [{'isbn": "9781429904926", "binding": "printisbncanonical"}]}}