{"book": {"publisher": "St. Martin"s Griffin", "synopsis": "Unexpectedly suspenseful, but written with all the fluency and dark humor of Tom Perrotta\"s The Wishbones and Joe College, Little Children exposes the adult dramas unfolding amidst the swingsets and slides of an ordinary American playground.<br/><br/>Tom Perrotta\"s thirty-ish parents of young children are a varied and surprising bunch. There\'s Todd, the handsome stay-at-home dad dubbed 'The Prom King' by the moms of the playground; Sarah, a lapsed feminist with a bisexual past, who seems to have stumbled into a traditional marriage; Richard, Sarah\'s husband, who has found himself more and more involved with a fantasy life on the internet than with the flesh and blood in his own house; and Mary Ann, who thinks she has it all figured out, down to scheduling a weekly roll in the hay with her husband, every Tuesday at 9pm.<br/><br/>They all raise their kids in the kind of sleepy American suburb where nothing ever seems to happen--at least until one eventful summer, when a convicted child molester moves back to town, and two restless parents begin an affair that goes further than either of them could have imagined.<br/><br/>Perrotta received Golden Globe and Academy Award nominations for best screenplay for the film adaptation of Little Children, which was directed by Todd Field and starred Kate Winslet and Jennifer Connelly.', 'language": "en", "image": "https://images.isbndb.com/covers/57/33/9780312315733.jpg", "title_long": "Little Children", "edition": "First Edition", "dimensions": "Height: 8.15 Inches, Length: 5.5 Inches, Weight: 0.74 Pounds, Width: 0.95 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.95}, "weight": {"unit": "pounds", "value": 0.74}, "height": {"unit": "inches", "value": 8.15}}, "pages": 368, "date_published": "2005-01-05", "subjects": ["Literature & Fiction', 'United States', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Tom Perrotta'], 'title": "Little Children", "isbn13": "9780312315733", "msrp": 9.95, "binding": "Paperback", "isbn": "0312315732", "isbn10": "0312315732", "other_isbns": [{'isbn": "9781429907828", "binding": "printisbncanonical"}]}}