{"book": {"publisher": "St. Martin"s Press", "synopsis": "#1 New York Times<br/><br/>#1 Wall Street Journal<br/><br/>#1 Los Angeles Times<br/><br/>#1 Entertainment Weekly<br/><br/>#1 Publishers Weekly<br/><br/>Stephanie Plum is thinking her career as a fugitive apprehension agent has run its course. She"s been shot at, spat at, cussed at, fire-bombed, mooned, and attacked by dogs. Time for a change, Stephanie thinks. Time to find the kind of job her mother can tell her friends about without making the sign of the cross.<br/><br/>So Stephanie Plum quits. Resigns. No looking back. No changing her mind. She wants something safe and normal. As it turns out, jobs that are safe and normal for most people aren"t necessarily safe and normal for Stephanie Plum. Trouble follows her, and the kind of trouble she had at the bail bonds office can't compare to the kind of trouble she finds herself facing now. Her past has come back to haunt her. She's stalked by a maniac returned from the grave for the sole purpose of putting her into a burial plot of her own. He's killed before, and he'll kill again if given the chance. Caught between staying far away from the bounty hunter business and staying alive, Stephanie reexamines her life and the possibility that being a bounty hunter is the solution rather than the problem. After disturbingly brief careers at the button factory, Kan Klean Dry Cleaners, and Cluck-in-a-Bucket, Stephanie takes an office position in security, working for Ranger, the sexiest, baddest bounty hunter and businessman on two continents. It might not be the job she'll keep for the rest of her life, but for now it gives her the technical access she needs to find her stalker. Tempers and temperatures rise as competition ratchets up between the two men in her life---her on-again, off-again boyfriend, tough Trenton cop Joe Morelli, and her bad-ass boss, Ranger. Can Stephanie Plum take the heat? Can you?<br/><br/>Between the adventure and the adversity there's attitude, and Stephanie Plum's got plenty in her newest misadventure from Janet Evanovich, Eleven on Top.', 'language": "en", "image": "https://images.isbndb.com/covers/53/49/9780312985349.jpg", "title_long": "Eleven on Top (Stephanie Plum, No. 11) (Stephanie Plum Novels)", "edition": "Reprint", "dimensions": "Height: 6.7901439 Inches, Length: 4.09 Inches, Weight: 0.38 Pounds, Width: 1.01 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.09}, "width": {"unit": "inches", "value": 1.01}, "weight": {"unit": "pounds", "value": 0.38}, "height": {"unit": "inches", "value": 6.7901439}}, "pages": 368, "date_published": "2006-06-20", "subjects": ["Literature & Fiction', 'Humor & Satire', 'Humorous', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Romance', 'Romantic Comedy', 'Self Service', 'Custom Stores'], 'authors": ["Janet Evanovich'], 'title": "Eleven on Top (Stephanie Plum, No. 11) (Stephanie Plum Novels)", "isbn13": "9780312985349", "msrp": 8.99, "binding": "Mass Market Paperback", "isbn": "0312985347", "isbn10": "0312985347", "other_isbns": [{'isbn": "9781429971171", "binding": "printisbncanonical"}]}}