{"book": {"publisher": "St. Martin"s Griffin", "synopsis": "Like so many young men in later generations, Roman playboy/detective Decius Caecilius Metellus the Younger is faced with the necessity of serving in his country"s armed forces. Since a dangerous enemy has become powerful in the politics of Rome, Decius is just as well out of the city for a while. He sets out to join Caesar in Gaul, where the general has come and seen, but has as yet not been able to conquer.<br/><br/>The occupying Roman army is at a standstill when Decius shows up in full parade regalia (much to the amusement of the more informally uniformed veterans) and accompanied only by his young personal slave. Caesar sets him the task of discovering who murdered one of his centurions, a cruel and unfair officer feared and hated by every man of the one hundred soldiers under him. A further prod to Decius is that the main suspect is a youth whose father is a close friend of the Metellus family. With Caesar"s decree that another killer be found in a matter of hours or the young man dies, Decius has his work cut out for him.<br/><br/>John Maddox Roberts's series set in the first century A.D. vividly brings to readers a strong sense of the everyday life of the ancient Romans in the context of our own.', 'language": "en", "image": "https://images.isbndb.com/covers/01/95/9780312320195.jpg", "title_long": "Nobody Loves a Centurion (SPQR VI)", "edition": "First Edition", "dimensions": "Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.64 Pounds, Width: 0.65 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.65}, "weight": {"unit": "pounds", "value": 0.64}, "height": {"unit": "inches", "value": 8.5}}, "pages": 288, "date_published": "2003-10-01", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Self Service', 'Custom Stores'], 'authors": ["John Maddox Roberts'], 'title": "Nobody Loves a Centurion (SPQR VI)", "isbn13": "9780312320195", "msrp": 9.99, "binding": "Paperback", "isbn": "0312320191", "isbn10": "0312320191", "other_isbns": [{'isbn": "9781429908320", "binding": "printisbncanonical"}]}}