{"book": {"publisher": "St. Martin"s Paperbacks", "synopsis": "After phenomenal bestseller upon bestseller, Robert Ludlum\"s books still "dominate the field in adventure-drenched thrillers' (Chicago Tribune). Now Ludlum\'s books are at an all-time high in this new breakneck classic of international intrigue, terrifying deception, and two random strangers who unwittingly hold the fate of the world in their hands...<br/><br/>In Zurich, Switzerland, American investment banker Ben Hartman has arrived on holiday when he chances upon old friend Jimmy Cavanaugh-- a madman who\'s armed and programmed to assassinate. In a matter of minutes, six innocent bystanders-- and Cavanaugh-- are dead. But when his body vanishes, and his weapon mysteriously appears in Hartman\'s luggage, Hartman is plunged into an unfathomable nightmare, and suddenly finds himself on the run. Meanwhile in Washington, D.C., Anna Navarro, field agent for the Department of justice, has been asked to investigate the sudden-- seemingly unrelated-- deaths of eleven men throughout the world. The only thing that connects them is a secret file, over a half-century old, linked to the CIA, and marked with the same puzzling codename: Sigma.<br/><br/>But as Anna follows the connecting thread, she finds herself in the shadows of a relentless killer who is one step ahead of her, victim by victim. Together she and Hartman must uncover the diabolical secrets long held behind the codename, Sigma. It will threaten everything they think they know about themselves and confirm their very worst fears...', 'language": "en", "image": "https://images.isbndb.com/covers/25/15/9780312982515.jpg", "title_long": "The Sigma Protocol", "edition": "First Edition", "dimensions": "Height: 6.82 Inches, Length: 4.26 Inches, Weight: 0.72 Pounds, Width: 1.085 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.26}, "width": {"unit": "inches", "value": 1.085}, "weight": {"unit": "pounds", "value": 0.72}, "height": {"unit": "inches", "value": 6.82}}, "pages": 672, "date_published": "2002-10-13", "subjects": ["Literature & Fiction', 'Contemporary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Spies & Politics'], 'authors": ["Robert Ludlum'], 'title": "The Sigma Protocol", "isbn13": "9780312982515", "msrp": 7.99, 'binding": "Mass Market Paperback", "isbn": "0312982518", "isbn10": "0312982518"}}