{"book": {"publisher": "Picador", "synopsis": "A lonely schoolteacher reveals more than she intends when she records the story of her best friend"s affair with a pupil in this sly, insightful novel<br/><br/>Schoolteacher Barbara Covett has led a solitary existence; aside from her cat, Portia, she has few friends and no intimates. When Sheba Hart joins St. George"s as the new art teacher, Barbara senses the possibility of a new friendship. It begins with lunches and continues with regular invitations to meals with Sheba"s seemingly close-knit family. But as Barbara and Sheba's relationship develops, another does as well: Sheba has begun a passionate affair with an underage male student. When it comes to light and Sheba falls prey to the inevitable media circus, Barbara decides to write an account in her friend's defense―an account that reveals not only Sheba's secrets but her own.<br/><br/>What Was She Thinking? is a story of repression and passion, envy and complacence, friendship and loneliness. A complex psychological portrait framed as a wicked satire, it is by turns funny, poignant, and sinister. With it, Zoë Heller surpasses the promise of her critically acclaimed first novel, Everything You Know.<br/><br/>Shortlisted for the Man Booker Prize<br/><br/>What Was She Thinking? is the basis of the 2006 film, Notes on a Scandal, starring Judi Dench and Kate Blanchett.', 'language": "en", "image": "https://images.isbndb.com/covers/19/91/9780312421991.jpg", "title_long": "What Was She Thinking?: Notes on a Scandal: A Novel", "edition": "First Edition", "dimensions": "Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.55 Pounds, Width: 0.61 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.61}, "weight": {"unit": "pounds", "value": 0.55}, "height": {"unit": "inches", "value": 8.5}}, "pages": 258, "date_published": "2003-06-01", "subjects": ["Humor & Entertainment', 'Humor', 'Self-Help & Psychology', 'Literature & Fiction', 'Women's Fiction', 'Friendship', 'British & Irish', 'Contemporary', 'Humor & Satire', 'Satire', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Zoë Heller'], 'title": "What Was She Thinking?: Notes on a Scandal: A Novel", "isbn13": "9780312421991", "msrp": 18, "binding": "Paperback", "isbn": "0312421990", "isbn10": "0312421990", "other_isbns": [{'isbn": "9781429932875", "binding": "printisbncanonical"}]}}