{"book": {"publisher": "St. Martin"s Press", "synopsis": "Once upon a time, in 1930s England, there were two little princesses named Elizabeth and Margaret Rose. Their father was the Duke of York, the second son of King George V, and their Uncle David was the future King of England.<br/><br/>We all know how the fairy tale ended: When King George died, “Uncle David” became King Edward VIII---who abdicated less than a year later to marry the scandalous Wallis Simpson. Suddenly the little princesses’ father was King. The family moved to Buckingham Palace, and ten-year-old Princess Elizabeth became the heir to the crown she would ultimately wear for over fifty years.<br/><br/>The Little Princesses shows us how it all began. In the early thirties, the Duke and Duchess of York were looking for someone to educate their daughters, Elizabeth and Margaret, then five- and two-years-old. They already had a nanny---a family retainer who had looked after their mother when she was a child---but it was time to add someone younger and livelier to the household.<br/><br/>Enter Marion Crawford, a twenty-four-year-old from Scotland who was promptly dubbed “Crawfie” by the young Elizabeth and who would stay with the family for sixteen years. Beginning at the quiet family home in Piccadilly and ending with the birth of Prince Charles at Buckingham Palace in 1948, Crawfie tells how she brought the princesses up to be “Royal,” while attempting to show them a bit of the ordinary world of underground trains, Girl Guides, and swimming lessons.<br/><br/>The Little Princesses was first published in 1950 to a furor we cannot imagine today. It has been called the original “nanny diaries” because it was the first account of life with the Royals ever published. Although hers was a touching account of the childhood of the Queen and Princess Margaret, Crawfie was demonized by the press. The Queen Mother, who had been a great friend and who had, Crawfie maintained, given her permission to write the account, never spoke to her again.<br/><br/>Reading The Little Princesses now, with a poignant new introduction by BBC royal correspondent Jennie Bond, offers fascinating insights into the changing lives and times of Britains royal family.", "language": "en", "image": "https://images.isbndb.com/covers/21/52/9780312312152.jpg", "title_long": "The Little Princesses: The Story of the Queen"s Childhood by her Nanny, Marion Crawford", 'edition": "First Edition", "dimensions": "Height: 8.62 Inches, Length: 5.78 Inches, Weight: 1.05 Pounds, Width: 0.995 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.78}, "width": {"unit": "inches", "value": 0.995}, "weight": {"unit": "pounds", "value": 1.05}, "height": {"unit": "inches", "value": 8.62}}, "pages": 288, "date_published": "2003-04-10", "subjects": ["Biographies & Memoirs', 'Leaders & Notable People', 'Royalty'], 'authors": ["Marion Crawford'], 'title": "The Little Princesses: The Story of the Queen"s Childhood by her Nanny, Marion Crawford", 'isbn13": "9780312312152", "msrp": 24.95, "binding": "Hardcover", "isbn": "0312312156", "isbn10": "0312312156", "other_isbns": [{'isbn": "9781466831902", "binding": "printisbncanonical"}]}}