{"book": {"publisher": "Wentworth Press", "synopsis": "A Picador Paperback Original<br/><br/>From the #1 New York Times bestselling author of Presumed Innocent comes a compelling new legal mystery featuring George Mason from Personal Injuries. Originally commissioned and published by The New York Times Magazine, this edition contains additional material.<br/><br/>Life would seem to have gone well for George Mason. His days as a criminal defense lawyer are long behind him. At fifty-nine, he has sat as a judge on the Court of Appeals in Kindle County for nearly a decade. Yet, when a disturbing rape case is brought before him, the judge begins to question the very nature of the law and his role within it. What is troubling George Mason so deeply? Is it his wife"s recent diagnosis? Or the strange and threatening e-mails he has started to receive? And what is it about this horrific case of sexual assault, now on trial in his courtroom, that has led him to question his fitness to judge?<br/><br/>In Limitations, Scott Turow, the master of the legal thriller, returns to Kindle County with a page-turning entertainment that asks the biggest questions of all. Ingeniously, and with great economy of style, Turow probes the limitations not only of the law but of human understanding itself.", "language": "es", "image": "https://images.isbndb.com/covers/64/53/9780312426453.jpg", "title_long": "Manual Del Arte De Obstetricia Para Uso De Las Matronas... (Spanish Edition)", "edition": "First", "dimensions": "Height: 9.21 Inches, Length: 6.14 Inches, Weight: 1.02955876354 Pounds, Width: 0.7 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.14}, "width": {"unit": "inches", "value": 0.7}, "weight": {"unit": "pounds", "value": 1.02955876354}, "height": {"unit": "inches", "value": 9.21}}, "pages": 334, "date_published": "2018-08-08", "subjects": ["History'], 'authors": ["Imprenta Nacional'], 'title": "Manual Del Arte De Obstetricia Para Uso De Las Matronas... (Spanish Edition)", "isbn13": "9780312426453", "msrp": 12.08, "binding": "Paperback", "isbn": "0312426453", "isbn10": "0312426453", "other_isbns": [{'isbn": "9781466841017", "binding": "printisbncanonical"}]}}