{"book": {"publisher": "Picador", "synopsis": "In Pardonable Lies, the third novel of this bestselling series from Jacqueline Winspear, London investigator Maisie Dobbs faces grave danger as she returns to the site of her most painful WWI memories to resolve the mystery of a pilot\"s death.<br/><br/>A deathbed plea from his wife leads Sir Cecil Lawton to seek the aid of Maisie Dobbs, psychologist and investigator. As Maisie soon learns, Agnes Lawton never accepted that her aviator son was killed in the Great War, a torment that led her not only to the edge of madness but to the doors of those who practice the dark arts and commune with the spirit world. In accepting the assignment, Maisie finds her spiritual strength tested, as well as her regard for her mentor, Maurice Blanche. The mission also brings her together once again with her college friend Priscilla Evernden, who served in France and who lost three brothers to the war―one of whom, it turns out, had an intriguing connection to the missing Ralph Lawton.<br/><br/>Following on the heels of Winspear\"s triumphant Birds of a Feather, Pardonable Lies is another compelling installment in the chronicles of Maisie Dobbs, "a heroine to cherish' (Marilyn Stasio, New York Times Book Review).', 'language": "en", "image": "https://images.isbndb.com/covers/62/17/9780312426217.jpg", "title_long": "Pardonable Lies: A Maisie Dobbs Novel (Maisie Dobbs Novels, 3)", "edition": "First Edition", "dimensions": "Height: 8.25 Inches, Length: 5.4499891 Inches, Weight: 0.7 Pounds, Width: 0.65 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.4499891}, "width": {"unit": "inches", "value": 0.65}, "weight": {"unit": "pounds", "value": 0.7}, "height": {"unit": "inches", "value": 8.25}}, "pages": 359, "date_published": "2006-06-27", "subjects": ["Literature & Fiction', 'Contemporary', 'Mystery, Thriller & Suspense', 'Mystery', 'Historical', 'Women Sleuths', 'Private Investigators', 'Self Service', 'Custom Stores'], 'authors": ["Jacqueline Winspear'], 'title": "Pardonable Lies: A Maisie Dobbs Novel (Maisie Dobbs Novels, 3)", "isbn13": "9780312426217", "msrp": 17, "binding": "Paperback", "isbn": "0312426216", "isbn10": "0312426216", "other_isbns": [{'isbn": "9781429900997", "binding": "printisbncanonical"}]}}