{"book": {"publisher": "Picador", "synopsis": "The historical record crowns success. Those enshrined in its annals are men and women whose ideas, accomplishments, or personalities have dominated, endured, and most important of all, found champions. John F. Kennedy\"s Profiles in Courage, Giorgio Vasari\"s Lives of the Artists, and Samuel Johnson\"s Lives of the Poets are classic celebrations of the greatest, the brightest, the eternally constellated.<br/><br/>Paul Collins\' Banvard\'s Folly is a different kind of book. Here are thirteen unforgettable portraits of forgotten people: men and women who might have claimed their share of renown but who, whether from ill timing, skullduggery, monomania, the tinge of madness, or plain bad luck-or perhaps some combination of them all-leapt straight from life into thankless obscurity. Among their number are scientists, artists, writers, entrepreneurs, and adventurers, from across the centuries and around the world. They hold in common the silenced aftermath of failure, the name that rings no bells.<br/><br/>Collins brings them back to glorious life. John Banvard was an artist whose colossal panoramic canvasses (one behemoth depiction of the entire eastern shore of the Mississippi River was simply known as 'The Three Mile Painting') made him the richest and most famous artist of his day. . . before he decided to go head to head with P. T. Barnum. René Blondot was a distinguished French physicist whose celebrated discovery of a new form of radiation, called the N-Ray, went terribly awry. At the tender age of seventeen, William Henry Ireland signed 'William Shakespeare' to a book and launched a short but meteoric career as a forger of undiscovered works by the Bard -- until he pushed his luck too far. John Symmes, a hero of the War of 1812, nearly succeeded in convincing Congress to fund an expedition to the North Pole, where he intended to prove his theory that the earth was hollow and ripe for exploitation; his quixotic quest counted Jules Verne and Edgar Allan Poe among its greatest admirers.<br/><br/>Collins\' love for what he calls the 'forgotten ephemera of genius' give his portraits of these figures and the other nine men and women in Banvard\'s Folly sympathetic depth and poignant relevance. Their effect is not to make us sneer or revel in schadenfreude; here are no cautionary tales. Rather, here are brief introductions-acts of excavation and reclamation-to people whom history may have forgotten, but whom now we cannot.', 'language": "en", "image": "https://images.isbndb.com/covers/03/33/9780312300333.jpg", "title_long": "Banvard"s Folly: Thirteen Tales of People Who Didn"t Change the World', 'edition": "First Edition", "dimensions": "Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.9 Pounds, Width: 0.71 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.71}, "weight": {"unit": "pounds", "value": 0.9}, "height": {"unit": "inches", "value": 8.5}}, "pages": 320, "date_published": "2002-05-03", "subjects": ["Biographies & Memoirs', 'Historical', 'United States', 'Travelers & Explorers', 'True Crime', 'Hoaxes & Deceptions', 'History', 'Americas', 'Arctic & Antarctica'], 'authors": ["Paul S. Collins'], 'title": "Banvard"s Folly: Thirteen Tales of People Who Didn"t Change the World', 'isbn13": "9780312300333", "msrp": 24, "binding": "Paperback", "isbn": "0312300336", "isbn10": "0312300336", "other_isbns": [{'isbn": "9781466892057", "binding": "printisbncanonical"}]}}