{"book": {"publisher": "L.A. Weekly Books", "synopsis": "Okay, so at least you"re interested enough to pick up this book and look inside. I think you and I are going to get along just fine.<br/><br/>Life is full of choices. Right now, yours is whether or not to buy the autobiography of a mid-grade, kind of hammy actor.<br/><br/>Am I supposed to know this guy? you think to yourself.<br/><br/>No, and that"s exactly the point. Bookstores are chock full of household name actors and their high stakes shenanigans. I don"t want to be a spoilsport, but we've all been down that road before.<br/><br/>Case in point: look to your left - see that Judy Garland book? You don't need that, you know plenty about her already - great voice, crappy life. Now look to your right at the Charlton Heston book. You don't need to cough up hard-earned dough for that either. You know his story too - great voice, crappy toupee.<br/><br/>The truth is that though you might not have a clue who I am, there are countless working stiffs like me out there, grinding away every day at the wheel of fortune.<br/><br/>If Chins Could Kill: Confessions of a B Movie Actor is my first book, and I invite you to ride with me through the choppy waters of blue collar Hollywood.<br/><br/>Okay, so buy the damned book already and read like the wind!<br/><br/>Best,<br/>Bruce Campbell<br/><br/>P.S. If the book sucks, at least there are gobs of pictures, and they're not crammed in the middle like all those other actor books.', 'language": "en", "image": "https://images.isbndb.com/covers/14/57/9780312291457.jpg", "title_long": "If Chins Could Kill: Confessions of a B Movie Actor", "edition": "First Edition", "dimensions": "Height: 9.2 Inches, Length: 6.0999878 Inches, Weight: 0.9 Pounds, Width: 3.35 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.0999878}, "width": {"unit": "inches", "value": 3.35}, "weight": {"unit": "pounds", "value": 0.9}, "height": {"unit": "inches", "value": 9.2}}, "pages": 368, "date_published": "2002-08-24", "subjects": ["Arts & Photography', 'Performing Arts', 'Biographies & Memoirs', 'Arts & Literature', 'Actors & Entertainers', 'Humor & Entertainment', 'Movies', 'History & Criticism', 'Self Service', 'Custom Stores'], 'authors": ["Bruce Campbell'], 'title": "If Chins Could Kill: Confessions of a B Movie Actor", "isbn13": "9780312291457", "msrp": 19.99, "binding": "Paperback", "isbn": "0312291450", "isbn10": "0312291450", "other_isbns": [{'isbn": "9781250099273", "binding": "printisbncanonical"}]}}