{"book": {"publisher": "St. Martin"s Griffin", "synopsis": ""And God said, Let us make man in our image, after our likeness; and let them have dominion over the fish of the sea, and over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth."--Genesis 1:24-26<br/><br/>In this crucial passage from the Old Testament, God grants mankind power over animals. But with this privilege comes the grave responsibility to respect life, to treat animals with simple dignity and compassion.<br/><br/>Somewhere along the way, something has gone wrong.<br/><br/>In Dominion, we witness the annual convention of Safari Club International, an organization whose wealthier members will pay up to $20,000 to hunt an elephant, a lion or another animal, either abroad or in American 'safari ranches,' where the animals are fenced in pens. We attend the annual International Whaling Commission conference, where the skewed politics of the whaling industry come to light, and the focus is on developing more lethal, but not more merciful, methods of harvesting 'living marine resources.' And we visit a gargantuan American 'factory farm,' where animals are treated as mere product and raised in conditions of mass confinement, bred for passivity and bulk, inseminated and fed with machines, kept in tightly confined stalls for the entirety of their lives, and slaughtered in a way that maximizes profits and minimizes decency.<br/><br/>Throughout Dominion, Scully counters the hypocritical arguments that attempt to excuse animal abuse: from those who argue that the Bible\'s message permits mankind to use animals as it pleases, to the hunter\'s argument that through hunting animal populations are controlled, to the popular and 'scientifically proven' notions that animals cannot feel pain, experience no emotions, and are not conscious of their own lives.<br/><br/>The result is eye opening, painful and infuriating, insightful and rewarding. Dominion is a plea for human benevolence and mercy, a scathing attack on those who would dismiss animal activists as mere sentimentalists, and a demand for reform from the government down to the individual. Matthew Scully has created a groundbreaking work, a book of lasting power and importance for all of us.', 'language": "en", "image": "https://images.isbndb.com/covers/97/31/9780312319731.jpg", "title_long": "Dominion: The Power of Man, the Suffering of Animals, and the Call to Mercy", "edition": "First Edition", "dimensions": "Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.881849048 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 0.881849048}, "height": {"unit": "inches", "value": 8.5}}, "pages": 434, "date_published": "2003-10-01", "subjects": ["Science & Math', 'Nature & Ecology', 'Animal Rights', 'Sports & Outdoors', 'Politics & Social Sciences', 'Social Sciences', 'Politics & Government', 'Self Service', 'Custom Stores'], 'authors": ["Matthew Scully'], 'title": "Dominion: The Power of Man, the Suffering of Animals, and the Call to Mercy", "isbn13": "9780312319731", "msrp": 12.73, "binding": "Paperback", "isbn": "0312319738", "isbn10": "0312319738", "other_isbns": [{'isbn": "9781429980432", "binding": "printisbncanonical"}]}}