{"book": {"publisher": "St. Martin"s Press", "synopsis": "More Plums in One. The adventures continue for Stephanie Plum, Trenton"s best-known bounty hunter, in these three Complete Plum Novels from #1 Bestselling Author Janet Evanovich!<br/>Four to Score: Stephanie Plum is forced to enlist the help of Grandma Mazur, ex-hooker and wannabe bounty hunter Lula, and transvestite rock musician Sally Sweet in an attempt to capture revenge-seeking waitress Maxine Nowicki. Threatening messages, murder, firebombs, and archnemesis Joyce Barnhardt pale in comparison to the greatest danger of all when, homeless and broke, Stephanie and her hamster, Rex, move in with vice cop Joe Morelli.<br/>High Five: Out of bail skippers and rent money, Stephanie throws caution to the wind and follows in the entrepreneurial bootsteps of Super Bounty Hunter Ranger, engaging in morally correct and marginally legal enterprises. Stephanie"s problems escalate when homicidal rapist Benito Ramirez returns, her Uncle Fred disappears, a nasty bookie starts following her around town, and she has nothing to wear to the Mafia wedding.<br/>Hot Six: Stephanie Plum and Trenton vice cop Joe Morelli join forces to find the madman killer who shot and barbecued the youngest son of international black-market arms dealer Alexander Ramos. The man wanted for the crime is Carlos Manoso, street name Ranger. Minutes before the crime occurs, Ranger is caught on video, at the scene, with the victim. Bad enough Stephanie has to bring in the man who taught her everything she knows about fugitive apprehension, now her maternal grandmother has moved in and a dog with an eating disorder has adopted her.<br/>One unbeatable bestselling author. Three classic Stephanie Plum stories. Criminally original and stone brilliant, this Intermediate Bounty Hunting Survival Manual is blockbuster entertainment.', 'language": "en", "image": "https://images.isbndb.com/covers/29/66/9780312362966.jpg", "title_long": "More Plums in One: Four to Score, High Five, and Hot Six (Stephanie Plum Novels)", "edition": "First Edition", "dimensions": "Height: 9.2098241 Inches, Length: 6.14 Inches, Weight: 2.55 Pounds, Width: 1.6870045 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.14}, "width": {"unit": "inches", "value": 1.6870045}, "weight": {"unit": "pounds", "value": 2.55}, "height": {"unit": "inches", "value": 9.2098241}}, "pages": 800, "date_published": "2007-04-03", "subjects": ["Literature & Fiction', 'Women's Fiction', 'Contemporary', 'Action & Adventure', 'United States', 'Humor', 'Humor & Satire', 'Humorous', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Romance', 'Romantic Comedy', 'Self Service', 'Custom Stores'], 'authors": ["Janet Evanovich'], 'title": "More Plums in One: Four to Score, High Five, and Hot Six (Stephanie Plum Novels)", "isbn13": "9780312362966", "msrp": 9.99, "binding": "Hardcover", "isbn": "031236296X", "isbn10": "031236296X", "other_isbns": [{'isbn": "9781429993630", "binding": "printisbncanonical"}]}}