{"book": {"publisher": "St. Martin"s Griffin", "synopsis": "Gene Wilder was one of the great comic actors who defined the 1970"s and 1980"s in movies. From his early work with Woody Allen to the rich group of movies he made with Mel Brooks to his partnership on screen with Richard Pryor, Wilder's performances are still discussed and celebrated today. Kiss Me Like A Stranger is an intimate glimpse of the man behind the image on the screen.<br/><br/>In this book, Wilder talks about everything from his experiences in psychoanalysis to why he got into acting (and later comedy-his first goal was to be a Shakespearean actor) to how a Midwestern childhood with a sick mother changed him. He writes about the creative process on stage and on screen, and divulges moments from life on the sets of the some of the most iconic movies of our time. He also opens up about his love affairs and marriages, including his marriage to comedian Gilda Radner. But the core of Kiss Me Like A Stranger is an actor's search for truth and a thoughtful analysis of why the choices he made-some of them so serendipitous they were practically accidental-changed the course of his life.', 'language": "en", "image": "https://images.isbndb.com/covers/70/70/9780312337070.jpg", "title_long": "Kiss Me Like A Stranger: My Search for Love and Art", "edition": "First Edition", "dimensions": "Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.75 Pounds, Width: 0.62 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.62}, "weight": {"unit": "pounds", "value": 0.75}, "height": {"unit": "inches", "value": 8.5}}, "pages": 272, "date_published": "2006-03-07", "subjects": ["Arts & Photography', 'Performing Arts', 'Biographies & Memoirs', 'Arts & Literature', 'Actors & Entertainers', 'Memoirs', 'Humor & Entertainment', 'Movies', 'History & Criticism', 'Self Service', 'Custom Stores'], 'authors": ["Gene Wilder'], 'title": "Kiss Me Like A Stranger: My Search for Love and Art", "isbn13": "9780312337070", "msrp": 22.99, "binding": "Paperback", "isbn": "0312337078", "isbn10": "0312337078", "other_isbns": [{'isbn": "9781429909952", "binding": "printisbncanonical"}]}}