{"book": {"publisher": "St. Martin"s Griffin", "synopsis": "The third volume in the multimillion copy bestselling series<br/>Readers adored James Herriot"s tales of his life as a Yorkshire animal doctor in All Creatures Great and Small and All Things Bright and Beautiful. Now here"s a third delightful volume of memoirs rich with Herriot's own brand of humor, insight, and wisdom.<br/>In the midst of World War II, James is training for the Royal Air Force, while going home to Yorkshire whenever possible to see his very pregnant wife, Helen. Musing on past adventures through the dales, visiting with old friends, and introducing scores of new and amusing character--animal and human alike--Herriot enthralls with his uncanny ability to spin a most engaging and heartfelt yarn.<br/>Millions of readers have delighted in the wonderful storytelling and everyday miracles of James Herriot in the over thirty years since his delightful animal stories were first introduced to the world.', 'language": "en", "image": "https://images.isbndb.com/covers/52/81/9780312335281.jpg", "title_long": "All Things Wise and Wonderful (All Creatures Great and Small)", "edition": "Reprint", "dimensions": "Height: 8.19 Inches, Length: 6.2901449 Inches, Weight: 0.85 Pounds, Width: 1.2499975 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.2901449}, "width": {"unit": "inches", "value": 1.2499975}, "weight": {"unit": "pounds", "value": 0.85}, "height": {"unit": "inches", "value": 8.19}}, "pages": 448, "date_published": "2004-11-01", "subjects": ["Biographies & Memoirs', 'Memoirs', 'Professionals & Academics', 'Medical', 'Crafts, Hobbies & Home', 'Pets & Animal Care', 'Essays', 'Science & Math', 'Biological Sciences', 'Animals', 'Nature & Ecology', 'Fauna', 'Nature Writing & Essays', 'Medical Books', 'Veterinary Medicine'], 'authors": ["James Herriot'], 'title": "All Things Wise and Wonderful (All Creatures Great and Small)", "isbn13": "9780312335281", "msrp": 16.99, 'binding": "Paperback", "isbn": "0312335288", "isbn10": "0312335288"}}