{"book": {"publisher": "St. Martin"s Paperbacks", "synopsis": "A Featured Alternate Selection of the Literary Guild and Doubleday Book Club and a Main Selection of the Mystery Guild<br/><br/>Janet Evanovich, bestselling author of One for the Money, Two for the Dough, and Three to Get Deadly, scores big with Four to Score, her most thrilling Stephanie Plum adventure yet.<br/><br/>Working for her bail bondsman cousin Vinnie, Stephanie is hot on the trail of revenge-seeking waitress Maxine Nowicki, whose crimes include bail jumping, theft, and extortion. Someone is terrifying Maxine"s friends, and those who have seen her are turning up dead. Also on the hunt for Maxine is Joyce Barnhardt, Stephanie"s archenemy and rival bounty hunter.<br/><br/>Stephanie's attitude never wavers-- even when aided by crazy Grandma Mazur, ex-hooker and wannabe bounty hunter Lula, and transvestite rock musician Sally Sweet-- and even when Stephanie makes an enemy whose deadly tactics escalate from threatening messages to firebombs. All of this pales in comparison, though, with an even greater danger Stephanie faces, when, homeless and broke, she and her hamster Rex move in with a vice cop Joe Morelli.<br/><br/>RATED PG35 for licentious wit and libidinous cohabitation.', 'language": "en", "image": "https://images.isbndb.com/covers/69/73/9780312966973.jpg", "title_long": "Four to Score (Stephanie Plum, No. 4) (Stephanie Plum Novels)", "edition": "1998", "dimensions": "Height: 6.7 Inches, Length: 4.1999916 Inches, Weight: 0.35 Pounds, Width: 0.9 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.1999916}, "width": {"unit": "inches", "value": 0.9}, "weight": {"unit": "pounds", "value": 0.35}, "height": {"unit": "inches", "value": 6.7}}, "pages": 352, "date_published": "1998-07-01", "subjects": ["Literature & Fiction', 'Humor & Satire', 'Humorous', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Romance', 'Romantic Comedy', 'Self Service', 'Custom Stores'], 'authors": ["Janet Evanovich'], 'title": "Four to Score (Stephanie Plum, No. 4) (Stephanie Plum Novels)", "isbn13": "9780312966973", "msrp": "0.00", "binding": "Mass Market Paperback", "isbn": "0312966970", "isbn10": "0312966970", "other_isbns": [{'isbn": "9781429971195", "binding": "printisbncanonical"}]}}