{"book": {"publisher": "Picador", "synopsis": "A gripping examination of the case for and against capital punishment by a respected criminal lawyer and celebrated novelist.<br/><br/>In the words of Harvard Law Professor, Laurence H. Tribe--"Ultimate Punishment is the ultimate statement about the death penalty: to read it is to understand why law alone cannot make us whole."<br/><br/>As a respected criminal lawyer, Scott Turow has been involved with the death penalty for more than a decade, including successfully representing two different men convicted in death-penalty prosecutions. In this vivid account of how his views on the death penalty have evolved, Turow describes his own experiences with capital punishment from his days as an impassioned young prosecutor to his recent service on the Illinois commission which investigated the administration of the death penalty and influenced Governor George Ryan\"s unprecedented commutation of the sentences of 164 death row inmates on his last day in office.<br/><br/>Telling the powerful stories behind the statistics, as he moves from the Governor\'s Mansion to Illinois\'s state-of-the art 'super-max' prison and the execution chamber, Ultimate Punishment has all the drama and intellectual substance of Turow\'s bestselling fiction.', 'language": "en", "image": "https://images.isbndb.com/covers/37/35/9780312423735.jpg", "title_long": "Ultimate Punishment: A Lawyer"s Reflections on Dealing with the Death Penalty", 'edition": "First Edition", "dimensions": "Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.5 Pounds, Width: 0.38 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.38}, "weight": {"unit": "pounds", "value": 0.5}, "height": {"unit": "inches", "value": 8.5}}, "pages": 164, "date_published": "2004-08-01", "subjects": ["Biographies & Memoirs', 'Professionals & Academics', 'Lawyers & Judges', 'Law', 'Criminal Law', 'Legal Education', 'Legal Profession', 'Politics & Social Sciences', 'Social Sciences', 'Criminology'], 'authors": ["Scott Turow'], 'title": "Ultimate Punishment: A Lawyer"s Reflections on Dealing with the Death Penalty", 'isbn13": "9780312423735", "msrp": 12, "binding": "Paperback", "isbn": "031242373X", "isbn10": "031242373X", "other_isbns": [{'isbn": "9780374706470", "binding": "printisbncanonical"}]}}