{"book": {"publisher": "Picador", "synopsis": "We Wish to Inform You That Tomorrow We Will Be Killed with Our Families is the winner of the National Book Critics Circle Award for Nonfiction.<br/><br/>An unforgettable firsthand account of a people\"s response to genocide and what it tells us about humanity.<br/><br/>This remarkable debut book from Philip Gourevitch chronicles what has happened in Rwanda and neighboring states since 1994, when the Rwandan government called on everyone in the Hutu majority to murder everyone in the Tutsi minority. Though the killing was low-tech--largely by machete--it was carried out at shocking speed: some 800,000 people were exterminated in a hundred days. A Tutsi pastor, in a letter to his church president, a Hutu, used the chilling phrase that gives Gourevitch his title.<br/><br/>With keen dramatic intensity, Gourevitch frames the genesis and horror of Rwanda\"s "genocidal logic' in the anguish of its aftermath: the mass displacements, the temptations of revenge and the quest for justice, the impossibly crowded prisons and refugee camps. Through intimate portraits of Rwandans in all walks of life, he focuses on the psychological and political challenges of survival and on how the new leaders of postcolonial Africa went to war in the Congo when resurgent genocidal forces threatened to overrun central Africa.<br/><br/>Can a country composed largely of perpetrators and victims create a cohesive national society? This moving contribution to the literature of witness tells us much about the struggle everywhere to forge sane, habitable political orders, and about the stubbornness of the human spirit in a world of extremity.', 'language": "en", "image": "https://images.isbndb.com/covers/33/57/9780312243357.jpg", "title_long": "We Wish to Inform You That Tomorrow We Will be Killed With Our Families: Stories from Rwanda", "edition": "First Edition", "dimensions": "Height: 8.25 Inches, Length: 5.4499891 Inches, Weight: 0.76 Pounds, Width: 0.93 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.4499891}, "width": {"unit": "inches", "value": 0.93}, "weight": {"unit": "pounds", "value": 0.76}, "height": {"unit": "inches", "value": 8.25}}, "pages": 356, "date_published": "1999-09-01", "subjects": ["Biographies & Memoirs', 'Community & Culture', 'Black & African American', 'Historical', 'Africa', 'History', 'Central Africa', 'Reference', 'Politics & Social Sciences', 'Social Sciences', 'Criminology', 'Violence in Society', 'Sociology', 'Race Relations', 'Politics & Government', 'International & World Politics'], 'authors": ["Philip Gourevitch'], 'title": "We Wish to Inform You That Tomorrow We Will be Killed With Our Families: Stories from Rwanda", "isbn13": "9780312243357", "msrp": 19, "binding": "Paperback", "isbn": "0312243359", "isbn10": "0312243359", "other_isbns": [{'isbn": "9780374706487", "binding": "printisbncanonical"}]}}