{"book": {"publisher": "Picador", "synopsis": "A Picador Paperback Original<br/><br/>"The Paris Review is one of the few truly essential literary magazines of the twentieth century--and now of the twenty-first. Frequently weird, always wonderful."--Margaret Atwood<br/><br/>How do great writers do it? From James M. Cain\"s hard-nosed observation that 'writing a novel is like working on foreign policy. There are problems to be solved. It\'s not all inspirational,' to Joan Didion\'s account of how she composes a book--'I constantly retype my own sentences. Every day I go back to page one and just retype what I have. It gets me into a rhythm'--The Paris Review has elicited some of the most revelatory and revealing thoughts from the literary masters of our age.<br/><br/>For more than half a century, the magazine has spoken with most of our leading novelists, poets, and playwrights, and the interviews themselves have come to be recognized as classic works of literature, an essential and definitive record of the writing life. They have won the coveted George Polk Award and have been a contender for the Pulitzer Prize.<br/><br/>Paris Review former editor Philip Gourevitch introduces an entirely original selection of sixteen of the most celebrated interviews. Often startling, always engaging, these encounters contain an immense scope of intelligence, personality, experience, and wit from the likes of Elizabeth Bishop, Ernest Hemingway, Truman Capote, Rebecca West, and Billy Wilder. This is an indispensable book for all writers and readers.', 'language": "en", "image": "https://images.isbndb.com/covers/17/54/9780312361754.jpg", "title_long": "The Paris Review Interviews, I: 16 Celebrated Interviews (The Paris Review Interviews, 1)", "edition": "First Edition", "dimensions": "Height: 8.5 Inches, Length: 5.5 Inches, Weight: 1.3999353637 Pounds, Width: 1.17 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 1.17}, "weight": {"unit": "pounds", "value": 1.3999353637}, "height": {"unit": "inches", "value": 8.5}}, "pages": 528, "date_published": "2006-10-17", "subjects": ["Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Literature & Fiction', 'Essays & Correspondence', 'History & Criticism', 'Movements & Periods', 'Self Service', 'Custom Stores'], 'authors": ["The Paris Review'], 'title": "The Paris Review Interviews, I: 16 Celebrated Interviews (The Paris Review Interviews, 1)", "isbn13": "9780312361754", "msrp": 24, 'binding": "Paperback", "isbn": "0312361750", "isbn10": "0312361750"}}