{"book": {"publisher": "St. Martin"s Press", "synopsis": "Author of The Hidden Diary of Marie Antoinette<br/><br/>Courageous, attractive, romantic, intelligent, Catherine Parr became the sixth wife of Henry VIII. Her story, as Carolly Erickson re-creates it, is page-turning drama: from the splendors of the Field of the Cloth of Gold to the gory last years of the outsize King Henry, when heads rolled and England trembled, Catherine bestrode her destiny and survived to marry her true love.<br/>Catherine Parr attracted the king’s lust and, though much in love with the handsome Thomas Seymour, was thrown into the intrigue-filled snake pit of the royal court. While victims of the king’s wrath suffered torture and execution, Catherine persevered—until, at last, she came within the orbit of the royal fury. King Henry toyed with her, first ordering her arrested, then granting her clemency. She managed to evade execution, but she knew that the king had his wandering eye fixed on wife number seven.<br/>She was spared by his death and married the attractive but dangerously unbalanced Seymour. Her triumph was shadowed by rivalry with the young Princess Elizabeth, whose lands and influence the lecherous Seymour coveted. Catherine won the contest, but at great cost.<br/>In The Last Wife of Henry VIII, critically acclaimed author Carolly Erickson brings this dramatic story of survival and redemption to life.", "language": "en", "image": "https://images.isbndb.com/covers/21/89/9780312352189.jpg", "title_long": "The Last Wife of Henry VIII: A Novel", "edition": "First Edition", "dimensions": "Height: 9.57 inches, Length: 6.24 inches, Weight: 1.4 pounds, Width: 1.155 inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.24}, "width": {"unit": "inches", "value": 1.155}, "weight": {"unit": "pounds", "value": 1.4}, "height": {"unit": "inches", "value": 9.57}}, "pages": 336, "date_published": "2006-10-03", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'United States', 'Contemporary'], 'authors": ["Carolly Erickson'], 'title": "The Last Wife of Henry VIII: A Novel", "isbn13": "9780312352189", "msrp": 24.95, "binding": "Hardcover", "isbn": "0312352182", "isbn10": "0312352182", "other_isbns": [{'isbn": "9781429969406", "binding": "print"}]}}