{"book": {"publisher": "St. Martin"s Press", "synopsis": ""...I was convinced that Story of O was going to revolutionize the book trade, that I would sell hundreds of thousands of copies across the world, and that moral attitudes would change overnight. The audacity of this novel seemed to me to be liberating rather than provocative. I perceived the promise of a new freedom. And I expected to cause a shock."--Jean-Jacques Pauvert, from the Introduction<br/><br/>When Story of O was first published in 1954 in Paris by Jean-Jacques Pauvert, it narrowly escaped censorship by the Department of the Interior and eventually became the most widely translated French novel in the world.<br/><br/>It describes in cool, elegant language the experiences of a young woman as she willingly enters a dark maze of perverse sexual practices within a clandestine amoral society. Revelling in pure fantasy, its theme is total submission through love to excesses of sadism and masochism, and the bond of 'ownership.'<br/><br/>Now Doris Kloster, a photographer specializing in issues of women\'s sexuality and power, has realized a long-standing dream. She has created a photographic representation of one of the most famous and controversial erotic novels ever published.<br/><br/>The result is another sensation. The Illustrated Story of O presents over 50 superb images which mirror perfectly the intense eroticism of the novel. Shooting entirely in Paris and its environs, Doris Kloster has succeeded in matching characters, locations, costumes and props to the original descriptions. And each magnificent color photograph is accompanied by a short extract from the novel. In addition, there is a Preface from Doris Kloster herself and an Introduction from Jean-Jacques Pauvert, the original publisher of the novel.<br/><br/>The Illustrated Story of O presents a rich visual feast that will delight fans of Doris Kloster\'s work, and appeal strongly to connoisseurs of the darker excesses of sexuality. It is destined to become a classic collector\'s edition.', 'language": "en", "image": "https://images.isbndb.com/covers/60/59/9780312266059.jpg", "title_long": "The Illustrated Story Of O", "edition": 1, "dimensions": "height: 286 mm, length: 279 mm, width: 19 mm, weight: 1157 g", "dimensions_structured": {"length": {"unit": "mm", "value": 279}, "width": {"unit": "mm", "value": 19}, "weight": {"unit": "g", "value": 1157}, "height": {"unit": "mm", "value": 286}}, "pages": 160, "date_published": "2001-09-20", "subjects": ["Arts & Photography', 'Individual Artists', 'Photography & Video', 'Erotic Photography', 'Individual Photographers', 'Photojournalism & Essays'], 'authors": ['Pauline Reage'], 'title": "The Illustrated Story Of O", "isbn13": "9780312266059", "msrp": "0.00", "binding": "Hardcover", "isbn": "0312266057", "isbn10": "0312266057"}}