{"book": {"publisher": "St. Martin"s Griffin", "synopsis": "Be Happy or I\"ll Scream is for every married woman who has found just the tiniest bit of disconnect between the image of a perfect family in her head-think "The Brady Bunch' or 'The Huxtables'-and the evidence in front of her eyes. Instead of darling and compliant rosy-cheeked children and an adorably tolerant husband ready to go along with zany shenanigans, most women are faced with: kids who view family outings with all the enthusiasm of hardened inmates forced to bust rocks in roadside Alabama and a man who would trade every last one of her kooky ideas for a just a teeny little bit more sex and a hot meal on the table at six.<br/><br/>Sheri Lynch, co-cost of radio\'s syndicated Bob & Sheri, is a superb humorist of modern marriage, mores, and motherhood. Her Hello, My Name Is Mommy decoded the pitfalls of pregnancy and trials of new motherhood. Be Happy or I\'ll Scream taps into the wackier, even more wonderful world of family and husband management, kid-raising, and sanity maintenance in the face of it all. Her take on what life is really like inside a marriage-as opposed to what it looks like on the holiday card version of same-will ring both wacky and true to any woman who was ever foolish enough to dream of the perfect marriage and family.', 'language": "en", "image": "https://images.isbndb.com/covers/23/40/9780312342340.jpg", "title_long": "Be Happy or I"ll Scream!: My Deranged Quest for the Perfect Husband, Family, and Life", 'edition": "REPRINT", "dimensions": "Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.61068046574 Pounds, Width: 0.5448808 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.5448808}, "weight": {"unit": "pounds", "value": 0.61068046574}, "height": {"unit": "inches", "value": 8.5}}, "pages": 240, "date_published": "2007-02-06", "subjects": ["Humor & Entertainment', 'Humor', 'Parenting & Families', 'Health, Fitness & Dieting', 'Literature & Fiction', 'Humor & Satire', 'Satire', 'Parenting & Relationships', 'Parenting'], 'authors": ["Sheri Lynch'], 'title": "Be Happy or I"ll Scream!: My Deranged Quest for the Perfect Husband, Family, and Life", 'isbn13": "9780312342340", "msrp": 19.99, "binding": "Paperback", "isbn": "0312342349", "isbn10": "0312342349", "other_isbns": [{'isbn": "9781429906838", "binding": "printisbncanonical"}]}}