{"book": {"publisher": "St. Martin"s Griffin", "synopsis": "Based on an actual historical event but told through fictional diaries, this is the story of May Dodd―a remarkable woman who, in 1875, travels through the American West to marry the chief of the Cheyenne Nation.<br/><br/>One Thousand White Women begins with May Dodd’s journey into an unknown world. Having been committed to an insane asylum by her blue-blood family for the crime of loving a man beneath her station, May finds that her only hope for freedom and redemption is to participate in a secret government program whereby women from “civilized” society become the brides of Cheyenne warriors. What follows is a series of breathtaking adventures―May’s brief, passionate romance with the gallant young army captain John Bourke; her marriage to the great chief Little Wolf; and her conflict of being caught between loving two men and living two completely different lives.<br/><br/>“Fergus portrays the perceptions and emotions of women…with tremendous insight and sensitivity.”―Booklist<br/><br/>“A superb tale of sorrow, suspense, exultation, and triumph.” ―Winston Groom, author of Forrest Gump", "language": "en", "image": "https://images.isbndb.com/covers/94/32/9780312199432.jpg", "title_long": "One Thousand White Women: The Journals of May Dodd (One Thousand White Women Series, 1)", "edition": "First Edition", "dimensions": "Height: 8.15 Inches, Length: 5.3999892 Inches, Weight: 0.92 Pounds, Width: 1.25 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.3999892}, "width": {"unit": "inches", "value": 1.25}, "weight": {"unit": "pounds", "value": 0.92}, "height": {"unit": "inches", "value": 8.15}}, "pages": 496, "date_published": "1999-02-15", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'Westerns', 'United States', 'Native American', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Jim Fergus'], 'title": "One Thousand White Women: The Journals of May Dodd (One Thousand White Women Series, 1)", "isbn13": "9780312199432", "msrp": 9.88, "binding": "Paperback", "isbn": "0312199430", "isbn10": "0312199430", "other_isbns": [{'isbn": "9781429938846", "binding": "printisbncanonical"}]}}