{"book": {"publisher": "St. Martin"s Griffin", "synopsis": "Maria Coffey"s Where the Mountain Casts Its Shadow is a powerful, affecting and important book that exposes the far reaching personal costs of extreme adventure.<br/><br/>Without risk, say mountaineers, there would be none of the self-knowledge that comes from pushing life to its extremes. For them, perhaps, it is worth the cost. But when tragedy strikes, what happens to the people left behind? Why would anyone choose to invest in a future with a high-altitude risk-taker? What is life like in the shadow of the mountain? Such questions have long been taboo in the world of mountaineering. Now, the spouses, parents and children of internationally renowned climbers finally break their silence, speaking out about the dark side of adventure.<br/><br/>Maria Coffey confronted one of the harshest realities of mountaineering when her partner Joe Tasker disappeared on the Northeast Ridge of Everest in 1982. In Where the Mountain Casts Its Shadow, Coffey offers an intimate portrait of adventure and the conflicting beauty, passion, and devastation of this alluring obsession. Through interviews with the world"s top climbers, or their widows and families-Jim Wickwire, Conrad Anker, Lynn Hill, Joe Simpson, Chris Bonington, Ed Viesturs, Anatoli Boukreev, Alex Lowe, and many others-she explores what compels men and women to give their lives to the high mountains. She asks why, despite the countless tragedies, the world continues to laud their exploits.<br/><br/>With an insider's understanding, Coffey reveals the consequences of loving people who pursue such risk-the exhilarating highs and inevitable lows, the stress of long separations, the constant threat of bereavement, and the lives shattered in the wake of climbing accidents.', 'language": "en", "image": "https://images.isbndb.com/covers/90/12/9780312339012.jpg", "title_long": "Where the Mountain Casts Its Shadow: The Dark Side of Extreme Adventure", "edition": "First Edition", "dimensions": "Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.7 Pounds, Width: 0.58 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.58}, "weight": {"unit": "pounds", "value": 0.7}, "height": {"unit": "inches", "value": 8.5}}, "pages": 256, "date_published": "2005-04-01", "subjects": ["Biographies & Memoirs', 'Memoirs', 'Travelers & Explorers', 'Science & Math', 'Nature & Ecology', 'Mountains', 'Sports & Outdoors', 'Mountaineering', 'Mountain Climbing'], 'authors": ["Maria Coffey'], 'title": "Where the Mountain Casts Its Shadow: The Dark Side of Extreme Adventure", "isbn13": "9780312339012", "msrp": 14.95, "binding": "Paperback", "isbn": "0312339011", "isbn10": "0312339011", "other_isbns": [{'isbn": "9781429977425", "binding": "printisbncanonical"}]}}