{"book": {"publisher": "St. Martin"s Paperbacks", "synopsis": "WHEN A GOOD-GIRL DIVORCÉE Playing by the rules has left Samantha Monroe with an AWOL ex-husband, maxed out credit cards, and the task of raising three children on a hairstylist"s salary. It"s time for a new game plan. When Sam learns that politician Jack Tolliver needs someone to play the part of his fiancée for six months in return for a generous paycheck, she's ready to sign up on the spot.<br/>MEETS A BAD-BOY POLITICIAN<br/>Jack needs Sam and her kids to help tone down his image from womanizing cad to dependable dad. But he was expecting Sam to be a frumpy single mom, not a wickedly smart, sexy redhead. Keeping nosey newshounds from discovering that his engagement is a charade is going to be a tough job, but one mind-blowing kiss from Sam and suddenly Jack is ready to put in all the overtime necessary…<br/>LOVE WINS IN A LANDSLIDE…<br/>Now, with scheming opponents itching to bring Jack down, Sam's ex returning to stir up trouble, one stubborn pre-schooler, two squabbling teenagers, a crazy dog, and some out-of-this-world sex, Jack and Sam are discovering that playing make-believe can be complicated―but not nearly as much as falling in love…', 'language": "en", "image": "https://images.isbndb.com/covers/95/02/9780312939502.jpg", "title_long": "The Kept Woman", "dimensions": "Height: 6.77 Inches, Length: 4.17 Inches, Weight: 0.40124131684 Pounds, Width: 1.0200767 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.17}, "width": {"unit": "inches", "value": 1.0200767}, "weight": {"unit": "pounds", "value": 0.40124131684}, "height": {"unit": "inches", "value": 6.77}}, "pages": 384, "date_published": "2006-06-27", "subjects": ["Literature & Fiction', 'United States', 'Contemporary', 'Romance'], 'authors": ["Susan Donovan'], 'title": "The Kept Woman", "isbn13": "9780312939502", "msrp": 6.99, "binding": "Mass Market Paperback", "isbn": "0312939507", "isbn10": "0312939507", "other_isbns": [{'isbn": "9781429903738", "binding": "printisbncanonical"}]}}