{"book": {"publisher": "St. Martin"s Paperbacks", "synopsis": "At an international conference in Prague, Lt. Col. Jon Smith, an Army research doctor specializing in infectious diseases and secretly an agent attached to Covert-One, is contacted by a Russian colleague, Dr. Valentine Petrenko. Petrenko is concerned about a small cluster of mysterious deaths in Moscow and about the Russian government"s refusal to release publicly any information or data on the outbreak. When the two meet, they are attacked by a group of mysterious men and Petrenko is killed, his notes and medical samples are lost, and Smith barely escapes with his life.<br/>At the same time, a series of government officials around the world are coming down with a mysterious, fast-acting virus with a 100% fatality rate. These deaths are somehow related to the increasing militarism from the new Russian government, headed by the autocratic and ambitious President Victor Dudarev. With few clues and precious little time, Smith and Covert-One must unravel this mysterious plot and find the mysterious figure who stands at the center of it all…", 'language": "en", "image": "https://images.isbndb.com/covers/07/18/9780312990718.jpg", "title_long": "Robert Ludlum"s The Moscow Vector: A Covert-One Novel", 'edition": "First Edition", "dimensions": "Height: 6.8499863 Inches, Length: 3.9598346 Inches, Weight: 0.49 Pounds, Width: 1.2499975 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 3.9598346}, "width": {"unit": "inches", "value": 1.2499975}, "weight": {"unit": "pounds", "value": 0.49}, "height": {"unit": "inches", "value": 6.8499863}}, "pages": 464, "date_published": "2006-02-07", "subjects": ["Literature & Fiction', 'Contemporary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Spies & Politics', 'Suspense', 'Self Service', 'Custom Stores'], 'authors": ["Robert Ludlum', 'Patrick Larkin'], 'title": "Robert Ludlum"s The Moscow Vector: A Covert-One Novel", 'isbn13": "9780312990718", "msrp": 7.99, "binding": "Mass Market Paperback", "isbn": "0312990715", "isbn10": "0312990715", "other_isbns": [{'isbn": "9781429906753", "binding": "printisbncanonical"}]}}