{"book": {"publisher": "Picador", "synopsis": "From the author of Songdogs, a magnificent work of imagination and history set in the tunnels of New York City.<br/><br/>In the early years of the century, Nathan Walker leaves his native Georgia for New York City and the most dangerous job in America. A sandhog, he burrows beneath the East River, digging the tunnel that will carry trains from Brooklyn to Manhattan. Above ground, the sandhogs--black, white, Irish, Italian--keep their distance from each other until a spectacular accident welds a bond between Walker and his fellow diggers--a bond that will bless and curse the next three generations.<br/><br/>Years later, Treefrog, a homeless man driven below by a shameful secret, endures a punishing winter in his subway nest. In tones ranging from bleak to disturbingly funny, Treefrog recounts his strategies of survival--killing rats, scavenging for discarded soda cans, washing in the snow. Between Nathan Walker and Treefrog stretch seventy years of ill-fated loves and unintended crimes.<br/><br/>In a triumph of plotting, the two stories fuse to form a tale of family, race, and redemption that is as bold and fabulous as New York City itself. In This Side of Brightness, Colum McCann confirms his place in the front ranks of modern writers.", "language": "en", "image": "https://images.isbndb.com/covers/19/77/9780312421977.jpg", "title_long": "This Side of Brightness: A Novel", "edition": "First Edition", "dimensions": "Height: 8.2700622 Inches, Length: 5.5098315 Inches, Weight: 0.59 Pounds, Width: 0.7901559 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.5098315}, "width": {"unit": "inches", "value": 0.7901559}, "weight": {"unit": "pounds", "value": 0.59}, "height": {"unit": "inches", "value": 8.2700622}}, "pages": 304, "date_published": "2003-01-01", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Family Saga', 'Historical', 'Self Service', 'Custom Stores'], 'authors": ["Colum McCann'], 'title": "This Side of Brightness: A Novel", "isbn13": "9780312421977", "msrp": "0.00", "binding": "Paperback", "isbn": "0312421974", "isbn10": "0312421974", "other_isbns": [{'isbn": "9781466848702", "binding": "printisbncanonical"}]}}