{"book": {"publisher": "St. Martin"s Press", "synopsis": "Barbara Taylor Bradford introduced the illustrious Harte family in her blockbuster A Woman of Substance. Now she has created an unforgettable new dynasty: the Deravenels.<br/><br/>On a bitterly cold day in 1904, the Deravenel family"s future changes forever. When Cecily Deravenel tells her eighteen-year-old son Edward of the death of his father, brother, uncle, and cousin in a fire, a part of him dies as well. Edward and his cousin Neville Watkins are suspicious of the deaths. They vow to seek the truth, avenge the deaths, and retake control of their family"s business empire.<br/>As he grows into a handsome, charismatic man, Edward is torn between duty and desire. There are women in his life for whom he'll risk everything--and one woman who might destroy him. But madness and secrecy lie at the heart of the family, and Edward's enemies are far more ruthless than he knows. He will need his strength more than ever when the house of Deravenel is fatally rocked by betrayal from within. Who will become the ultimate ruler of the Deravenels?<br/>Power and money, passion and adultery, ambition and treachery all illuminate a dramatic epic saga that brings to life the glittering Edwardian Era. The Ravenscar Dynasty is based on the familial factions of England's Wars of the Roses, brought to life by the magical, memorable storytelling power that is Barbara Taylor Bradford.', 'language": "en", "image": "https://images.isbndb.com/covers/46/02/9780312354602.jpg", "title_long": "The Ravenscar Dynasty (Ravenscar Series)", "edition": "First Edition", "dimensions": "Height: 9.68 Inches, Length: 6.22 Inches, Weight: 1.65 Pounds, Width: 1.48 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.22}, "width": {"unit": "inches", "value": 1.48}, "weight": {"unit": "pounds", "value": 1.65}, "height": {"unit": "inches", "value": 9.68}}, "pages": 496, "date_published": "2006-12-26", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Family Saga', 'Historical', 'United States'], 'authors": ["Barbara Taylor Bradford'], 'title": "The Ravenscar Dynasty (Ravenscar Series)", "isbn13": "9780312354602", "msrp": 25.95, "binding": "Hardcover", "isbn": "0312354606", "isbn10": "0312354606", "other_isbns": [{'isbn": "9781429916882", "binding": "print"}]}}