{"book": {"publisher": "St. Martin"s Press", "synopsis": "A huge dog came out of the woods from our right and lunged at my face. I ducked the snapping jaws by throwing myself backward hard enough to crack my head on the ground. The dog went over my head, landing in a heap, but then whirled around . . .<br/><br/>Summoned by a friend, ex-cop Cam Richter agrees to do a favor: investigate the assault of a young woman in a remote area of the Great Smoky Mountains National Park. Cam knows the misty hills and shadowed hollers of the park, and his outdoor skills might break a case that local cops can"t---or maybe don"t want to---solve.<br/>Cam has no idea how dangerous his search will become, because in this part of Appalachia, matriarch Grinny Creigh and her extended family destroy those who intrude into their web. The Creighs control the crystal meth trade and own just about everything and everyone in their neck of the woods. But they also operate a much worse enterprise, a dark secret that terrifies any children unfortunate enough to come within their grasp.<br/>Blocked by a menacing sheriff with ties to the family, Cam is shut down and sent away, no wiser about why the young woman was attacked and what she saw. He returns, stealthily stalking the Creighs and their secrets, moving ever closer to Grinny's mountain house and what it might conceal . . . not knowing that his presence on her web has been detected, and that the Creighs are hunting him with creatures bred for that purpose and starved into relentless fury.<br/>Spider Mountain features nonstop action, frightening night pursuits through deep wilderness, and a shocking finale---a masterful novel of suspense by the author of The Cat Dancers.', 'language": "en", "image": "https://images.isbndb.com/covers/37/99/9780312333799.jpg", "title_long": "Spider Mountain: A Novel", "edition": "First Edition", "dimensions": "Height: 9.58 Inches, Length: 6.32 Inches, Weight: 1.15 Pounds, Width: 1.04 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.32}, "width": {"unit": "inches", "value": 1.04}, "weight": {"unit": "pounds", "value": 1.15}, "height": {"unit": "inches", "value": 9.58}}, "pages": 320, "date_published": "2006-12-26", "subjects": ["Literature & Fiction', 'Action & Adventure', 'Mystery, Thriller & Suspense', 'Contemporary', 'Mystery', 'Thrillers & Suspense', 'Spies & Politics'], 'authors": ["P. T. Deutermann'], 'title": "Spider Mountain: A Novel", "isbn13": "9780312333799", "msrp": "0.00", "binding": "Hardcover", "isbn": "031233379X", "isbn10": "031233379X", "other_isbns": [{'isbn": "9781429987813", "binding": "print"}]}}