{"book": {"publisher": "St. Martin"s Griffin", "synopsis": "The Autobiography of Henry VIII is the magnificent historical novel that established Margaret George"s career. Evocatively written in the first person as Henry VIII"s private journals, the novel was the product of fifteen years of meticulous research and five handwritten drafts.<br/><br/>Much has been written about the mighty, egotistical Henry VIII: the man who dismantled the Church because it would not grant him the divorce he wanted; who married six women and beheaded two of them; who executed his friend Thomas More; who sacked the monasteries; who longed for a son and neglected his daughters, Mary and Elizabeth; who finally grew fat, disease-ridden, dissolute.<br/><br/>Now, in her magnificent work of storytelling and imagination Margaret George bring us Henry VIII's story as he himself might have told it, in memoirs interspersed with irreverent comments from his jester and confident, Will Somers. Brilliantly combining history, wit, dramatic narrative, and an extraordinary grasp of the pleasures and perils of power, this monumental novel shows us Henry the man more vividly than he has ever been seen before.', 'language": "en", "image": "https://images.isbndb.com/covers/43/90/9780312194390.jpg", "title_long": "The Autobiography of Henry VIII: With Notes by His Fool, Will Somers: A Novel", "edition": "First Edition", "dimensions": "Height: 9.15 Inches, Length: 6.1401452 Inches, Weight: 2.02 Pounds, Width: 1.6 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.1401452}, "width": {"unit": "inches", "value": 1.6}, "weight": {"unit": "pounds", "value": 2.02}, "height": {"unit": "inches", "value": 9.15}}, "pages": 960, "date_published": "1998-09-15", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'Biographical', 'Epistolary', 'United States', 'Contemporary', 'Self Service', 'Custom Stores'], 'authors": ["Margaret George'], 'title": "The Autobiography of Henry VIII: With Notes by His Fool, Will Somers: A Novel", "isbn13": "9780312194390", "msrp": 25.99, "binding": "Paperback", "isbn": "0312194390", "isbn10": "0312194390", "other_isbns": [{'isbn": "9781429924702", "binding": "printisbncanonical"}]}}