{"book": {"publisher": "Holtzbrinck", "synopsis": "Wherever vampires existed in the imaginations of different peoples, they adapted themselves to the customs of the local culture. As a result, vampire lore is extremely diverse. So too, representations of the vampire in creative works have been marked by much originality. In The Vampyre (1819), John Polidori introduced Lord Ruthven and established the vampire craze of the 19th century that resulted in a flood of German vampire poetry, French vampire drama, and British vampire fiction. This tradition culminated in Bram Stoker"s Dracula (1897), which fixed the character of the Transylvanian nobleman as the archetypal vampire firmly in the public imagination. Numerous films drew from Stoker"s novel to varying degrees, with each emphasizing different elements of his vampire character. And more recent writers have created works in which vampirism is used to explore contemporary social concerns.<br/><br/>The contributors to this volume discuss representations of the vampire in fiction, folklore, film, and popular culture. The first section includes chapters on Stoker and his works, with attention to such figures as Oscar Wilde and Edvard Munch. The second section explores the vampire in film and popular culture from Bela Lugosi to Blacula. The volume then looks at such modern writers as Anne Rice and Chelsea Quinn Yarbro who have adapted the vampire legend to meet their artistic needs. A final section studies contemporary issues, such as vampirism as a metaphor for AIDS in Killing Zoe.", 'language": "en", "image": "https://images.isbndb.com/covers/93/35/9780313309335.jpg", "title_long": "The Fantastic Vampire: Studies in the Children of the Night - Selected Essays from the Eighteenth International Conference on the Fantastic in the ... to the Study of Science Fiction and Fantasy)", "dimensions": "Height: 9 Inches, Length: 5.999988 Inches, Weight: 0.9 Pounds, Width: 0.5618099 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.999988}, "width": {"unit": "inches", "value": 0.5618099}, "weight": {"unit": "pounds", "value": 0.9}, "height": {"unit": "inches", "value": 9}}, "pages": 200, "date_published": "2002-03-30", "subjects": ["Arts & Photography', 'Performing Arts', 'Humor & Entertainment', 'Movies', 'Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Movements & Periods', 'Genres & Styles', 'Regional & Cultural', 'Science Fiction & Fantasy', 'Fantasy', 'Science Fiction', 'Politics & Social Sciences', 'Social Sciences', 'Popular Culture'], 'authors": ["James Craig Holte'], 'title": "The Fantastic Vampire: Studies in the Children of the Night - Selected Essays from the Eighteenth International Conference on the Fantastic in the ... to the Study of Science Fiction and Fantasy)", "isbn13": "9780313309335", "msrp": 95, 'binding": "Hardcover", "isbn": "0313309337", "isbn10": "0313309337"}}