{"book": {"publisher": "Little, Brown and Company", "synopsis": "The first volume in William Manchester"s masterful, magnum opus account of Winston Churchill"s life. The Last Lion: Visions of Glory follows the first fifty-eight years of Churchill"s life--the years that mold him into the man who will become one of the most influential politicians of the twentieth century.<br/><br/>In this, the first volume, Manchester follows Churchill from his birth to 1932, when he began to warn against the re-militarization of Germany. Born of an American mother and the gifted but unstable son of a duke, his childhood was one of wretched neglect. He sought glory on the battlefields of Cuba, Sudan, India, South Africa and the trenches of France. In Parliament he was the prime force behind the creation of Iraq and Jordan, laid the groundwork for the birth of Israel, and negotiated the independence of the Irish Free State. Yet, as Chancellor of the Exchequer he plunged England into economic crisis, and his fruitless attempt to suppress Gandhi's quest for Indian independence brought political chaos to Britain.<br/><br/>Throughout, Churchill learned the lessons that would prepare him for the storm to come, and as the 1930's began, he readied himself for the coming battle against Nazism--an evil the world had never before seen.', 'language": "en", "image": "https://images.isbndb.com/covers/50/37/9780316545037.jpg", "title_long": "The Last Lion: Winston Spencer Churchill: Visions of Glory 1874-1932", "edition": "First Edition", "dimensions": "Height: 9.5 Inches, Length: 6.375 Inches, Weight: 2.85 Pounds, Width: 2 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.375}, "width": {"unit": "inches", "value": 2}, "weight": {"unit": "pounds", "value": 2.85}, "height": {"unit": "inches", "value": 9.5}}, "pages": 992, "date_published": "1983-05-30", "subjects": ["Biographies & Memoirs', 'Historical', 'Europe', 'Leaders & Notable People', 'Military', 'Political', 'Presidents & Heads of State', 'History', 'Great Britain', 'World War I', 'World War II', 'World', 'Religion & Spirituality', 'Hinduism', 'Gandhi', 'Self Service', 'Custom Stores'], 'authors": ["William Manchester'], 'title": "The Last Lion: Winston Spencer Churchill: Visions of Glory 1874-1932", "isbn13": "9780316545037", "msrp": 50, "binding": "Hardcover", "isbn": "0316545031", "isbn10": "0316545031", "other_isbns": [{'isbn": "9780316244855", "binding": "saleableprint"}]}}