{"book": {"publisher": "Back Bay Books", "synopsis": "An award-wining and "outrageously entertaining" true crime story (San Francisco Chronicle) about the professional hockey player-turned-bank robber whose bizarre and audacious crime spree galvanized Hungary in the decade after the fall of the Iron Curtain.<br/><br/>During the 1990s, while playing for the biggest hockey team in Budapest, Attila Ambrus took up bank robbery to make ends meet. Arrayed against him was perhaps the most incompetent team of crime investigators the Eastern Bloc had ever seen: a robbery chief who had learned how to be a detective by watching dubbed Columbo episodes; a forensics man who wore top hat and tails on the job; and a driver so inept he was known only by a Hungarian word that translates to Mound of Ass-Head.<br/><br/>Ballad of the Whiskey Robber is the completely bizarre and hysterical story of the crime spree that made a nobody into a somebody, and told a forlorn nation that sometimes the brightest stars come from the blackest holes. Like The Professor and the Madman and The Orchid Thief, Julian Rubinstein\"s bizarre crime story is so odd and so wicked that it is completely irresistible.<br/><br/>'A whiz-bang read...Hilarious and oddly touching...Rubinstein writes in a guns-ablazing style that perfectly fits the whiskey robber\'s tale.' --Salon', 'language": "en", "image": "https://images.isbndb.com/covers/07/33/9780316010733.jpg", "title_long": "Ballad of the Whiskey Robber: A True Story of Bank Heists, Ice Hockey, Transylvanian Pelt Smuggling, Moonlighting Detectives, and Broken Hearts", "edition": "Revised ed.", "dimensions": "Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.7 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 0.7}, "height": {"unit": "inches", "value": 8.25}}, "pages": 352, "date_published": "2005-09-13", "subjects": ["Biographies & Memoirs', 'True Crime', 'Crime & Criminal Biographies', 'Sports & Outdoors', 'Biographies', 'Hockey', 'Politics & Social Sciences', 'Social Sciences', 'Criminology', 'Politics & Government', 'International & World Politics', 'Specific Topics'], 'authors": ["Julian Rubinstein'], 'title": "Ballad of the Whiskey Robber: A True Story of Bank Heists, Ice Hockey, Transylvanian Pelt Smuggling, Moonlighting Detectives, and Broken Hearts", "isbn13": "9780316010733", "msrp": 16.99, 'binding": "Paperback", "isbn": "0316010731", "isbn10": "0316010731"}}