{"book": {"publisher": "Little, Brown and Company", "synopsis": "When a single mom and aspiring actress ends up on an important jury, she must team up with an FBI agent to hunt down a vicious and powerful mob boss.<br/><br/>Andie DeGrasse is not your typical juror. Hoping to get dismissed from the pool, she tells the judge that most of her legal knowledge comes from a bit part curling around a stripper\"s pole in The Sopranos. But she still ends up as juror #11 in a landmark trial against a notorious mob boss.<br/><br/>The case quickly becomes the new Trial of the Century. Mafia don Dominic Cavello, known as the Electrician, is linked to hundreds of gruesome, unspeakable crimes. Senior FBI agent Nick Pellisante has been tracking him for years. He knows Cavello\"s power reaches far beyond the courtroom, but the FBI\"s evidence against the ruthless killer is iron-clad. Conviction is a sure thing.<br/><br/>As the jury is about to reach a verdict, the Electrician makes one devastating move that no one could have predicted. The entire nation is reeling, and Andie\'s world is shattered. For her, the hunt for the Electrician becomes personal, and she and Pellisante come together in an unbreakable bond: they will exact justice . . . at any cost.<br/><br/>James Patterson spins an all-out heart-pounding legal thriller that pits two people against the most vicious and powerful mobster since John Gotti. Judge & Jury is a stunning feat by 'one of America\'s most influential authors' (New York Times).', 'language": "en", "image": "https://images.isbndb.com/covers/39/32/9780316013932.jpg", "title_long": "Judge & Jury", "dimensions": "Height: 9.25 Inches, Length: 6 Inches, Weight: 1.7 Pounds, Width: 1.08 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1.08}, "weight": {"unit": "pounds", "value": 1.7}, "height": {"unit": "inches", "value": 9.25}}, "pages": 432, "date_published": "2006-07-31", "subjects": ["Literature & Fiction', 'United States', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Legal', 'Suspense', 'Crime', 'Self Service', 'Custom Stores'], 'authors": ["James Patterson', 'Andrew Gross'], 'title": "Judge & Jury", "isbn13": "9780316013932", "msrp": "0.00", "binding": "Hardcover", "related": {"Kindle Edition": "075956700X"}, "isbn": "0316013935", "isbn10": "0316013935", "other_isbns": [{'isbn": "9780759567009", "binding": "print"}]}}