{"book": {"publisher": "Little, Brown Books for Young Readers", "synopsis": "Fall in love with the addictive, suspenseful love story between a teenage girl and a vampire with the book that sparked a "literary phenomenon" and redefined romance for a generation (New York Times).<br/>Isabella Swan\"s move to Forks, a small, perpetually rainy town in Washington, could have been the most boring move she ever made. But once she meets the mysterious and alluring Edward Cullen, Isabella\'s life takes a thrilling and terrifying turn.<br/>Up until now, Edward has managed to keep his vampire identity a secret in the small community he lives in, but now nobody is safe, especially Isabella, the person Edward holds most dear. The lovers find themselves balanced precariously on the point of a knife -- between desire and danger.<br/>Deeply romantic and extraordinarily suspenseful, Twilight captures the struggle between defying our instincts and satisfying our desires. This is a love story with bite.<br/>It\'s here! #1 bestselling author Stephenie Meyer makes a triumphant return to the world of Twilight with the highly anticipated companion, Midnight Sun: the iconic love story of Bella and Edward told from the vampire\'s point of view.<br/>'People do not want to just read Meyer\'s books; they want to climb inside them and live there.' -- Time<br/>'A literary phenomenon.' -- The New York Times', 'language": "en", "image": "https://images.isbndb.com/covers/58/44/9780316015844.jpg", "title_long": "Twilight 1.2.3.4 & 5 (dvd)", "edition": "Reprint", "dimensions": "Weight: 1 Pounds", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 2}, "weight": {"unit": "pounds", "value": 0.992080179}, "height": {"unit": "inches", "value": 8.25}}, "pages": 544, "date_published": "2006", "subjects": ["Teen & Young Adult', 'Literature & Fiction', 'Social & Family Issues', 'Science Fiction & Fantasy', 'Horror', 'Fantasy', 'Romance', 'Paranormal'], 'authors": ["Stephenie Meyer'], 'title": "Twilight 1.2.3.4 & 5 (dvd)", "isbn13": "9780316015844", "msrp": 16.99, 'binding": "DVD", "isbn": "0316015849", "isbn10": "0316015849"}}