{"book": {"publisher": "Little, Brown and Company", "synopsis": "Updated with a new foreword by Tom Hanks: acclaimed historian William Manchester A World Lit Only by Fire is a "captivating and marvelously vivid" popular history of the Middle Ages (Publishers Weekly).<br/><br/>From tales of chivalrous knights to the barbarity of the Inquisition and the misery of the Black Death, no era has been a greater source of awe, horror, and wonder than the Middle Ages. In graceful prose, and with the authority of his extraordinary gift for narrative history, William Manchester leads us from a civilization teetering on the brink of collapse to the grandeur of its rebirth during the Renaissance, a dense explosion of energy that spawned some of history’s greatest poets, philosophers, painters, adventurers, and reformers, as well as some of its most spectacular villains. The result is an unforgettable journey into the medieval mind, as Manchester ingeniously re-creates the lives of ordinary people and offers vivid portraits of the era’s most astonishing figures, such as Galileo, Machiavelli, Anne Boleyn, and Ferdinand Magellan.<br/><br/>"Manchester provides easy access to a fascinating age when our modern mentality was just being born.' —Chicago Tribune', 'language": "en", "image": "https://images.isbndb.com/covers/55/63/9780316545563.jpg", "title_long": "A World Lit Only by Fire: The Medieval Mind and the Renaissance: Portrait of an Age", "edition": "Reprint", "dimensions": "Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.85539357656 Pounds, Width: 0.875 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.875}, "weight": {"unit": "pounds", "value": 0.85539357656}, "height": {"unit": "inches", "value": 8.25}}, "pages": 322, "date_published": "1993-06-01", "subjects": ["History', 'Europe', 'World', 'Expeditions & Discoveries', 'Women in History', 'Literature & Fiction', 'History & Criticism', 'Movements & Periods', 'Self Service', 'Custom Stores'], 'authors": ["William Manchester'], 'title": "A World Lit Only by Fire: The Medieval Mind and the Renaissance: Portrait of an Age", "isbn13": "9780316545563", "msrp": 16.99, "binding": "Paperback", "isbn": "0316545562", "isbn10": "0316545562", "other_isbns": [{'isbn": "9780316082792", "binding": "vbidalias"}]}}