{"book": {"publisher": "Little, Brown and Company", "synopsis": "The Last Coyote: LAPD homicide detective Harry Bosch is suspended from the force for attacking his commanding officer. Unable to remain idle, he investigates the long-unsolved murder of a Hollywood prostitute. Trunk Music: Harry returns to the force to investigate the murder of a movie producer with Mafia ties. Up against both the LAPD\"s organized crime unit and the mob, Harry follows the money trail to Las Vegas, where the case becomes personal. Angels Flight: The murder of a prominent African-American attorney who made his career suing the police for racism and brutality means that Harry\"s friends and associates have become suspects; and he must work closely with longtime enemies suspicious of his maverick ways to investigate them. Together for the first time, these three chilling, pulse-pounding novels chart the volatile, breakneck career of the sleuth the New York Post calls "the quintessential mystery book hero' and prove that 'Michael Connelly\'s Harry Bosch novels are the most impressive body of work by any writer of crime thrillers now active' (Washington Post).', 'language": "en", "image": "https://images.isbndb.com/covers/45/66/9780316614566.jpg", "title_long": "The Harry Bosch Novels Volume 2: The Last Coyote, Trunk Music, Angels Flight", "edition": "1", "dimensions": "Height: 9.5 Inches, Length: 6.25 Inches, Weight: 2.55 Pounds, Width: 2.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.25}, "width": {"unit": "inches", "value": 2.5}, "weight": {"unit": "pounds", "value": 2.55}, "height": {"unit": "inches", "value": 9.5}}, "pages": 832, "date_published": "2003-11", "subjects": ["Mystery, Thriller & Suspense', 'Mystery', 'Police Procedurals', 'Thrillers & Suspense', 'Self Service', 'Custom Stores'], 'authors": ["Michael Connelly'], 'title": "The Harry Bosch Novels Volume 2: The Last Coyote, Trunk Music, Angels Flight", "isbn13": "9780316614566", "msrp": 17.99, "binding": "Hardcover", "isbn": "0316614564", "isbn10": "0316614564", "other_isbns": [{'isbn": "9780759508408", "binding": "print"}]}}