{"book": {"publisher": "Little, Brown and Company", "synopsis": "For a cop, a night on the job means killing time and trying not to get killed. If you"re a cop in Hollywood Division, it also means dealing with the most overwrought, desperate, and deluded criminals anywhere. When you"re patrolling Sunset and Hollywood Boulevards, neither a good reputation nor the lessons of scandals past will help you keep your cool, your sanity, or your life when things heat up.The robbery of a Hollywood jewelry store, complete with masks and a hand grenade, quickly connects to a Russian nightclub, an undercover operation gone bloodily wrong, and a cluelessly ambitious pair of tweakers. Putting the pieces together are the sergeant they call the Oracle and his squad of street cops. There"s Budgie Polk, a twenty-something firecracker with a four-month-old at home, and Wesley Drubb, a rich boy who joined the force seeking thrills. Fausto Gamboa is the tetchy veteran, and Hollywood Nate is the one who never shuts up about movies. They spend their days in patrol cars and their nights in the underbelly of a city that never sleeps. From their headquarters at Hollywood Station, they see the glamour city for what it is: a field of land mines, where the mundane is dangerous and the dangerous is mundane.', 'language": "en", "image": "https://images.isbndb.com/covers/61/43/9780316066143.jpg", "title_long": "Hollywood Station: A Novel", "edition": "First Edition", "dimensions": "Height: 9.75 Inches, Length: 6.5 Inches, Weight: 1.2 Pounds, Width: 1.25 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.5}, "width": {"unit": "inches", "value": 1.25}, "weight": {"unit": "pounds", "value": 1.2}, "height": {"unit": "inches", "value": 9.75}}, "pages": 340, "date_published": "2006-11-28", "subjects": ["Mystery, Thriller & Suspense', 'Mystery', 'Police Procedurals'], 'authors": ["Joseph Wambaugh'], 'title": "Hollywood Station: A Novel", "isbn13": "9780316066143", "msrp": 24.99, 'binding": "Hardcover", "isbn": "0316066141", "isbn10": "0316066141"}}