{"book": {"publisher": "Pearson", "synopsis": "From Longman"s new Cultural Editions Series, Oscar Wilde"s The Picture of Dorian Gray, edited by Andrew Elfenbein, includes the novel and contextual materials from the era of Oscar Wilde.<br/>This edition of Oscar Wilde"s classic work, The Picture of Dorian Gray, highlights the novel's modernity in both its form and its revolutionary content, and traces its links to modernist literature and the culture of modernity alike.<br/>Previous editions of the novel have only seen it in a late Victorian context, or as an extension of the aesthetic theories of Walter Pater and the “art for art's sake” movement. As presented in this new edition, however, the freshness and originality of the book emerges, along with its strong social messages. The book is a pastiche of genres that propels nineteenth-century realism into twentieth-century modernism ahead of its own time. Wilde's novel offers a myth for modernity whose hold on the cultural imagination has only strengthened over time-Dorian Gray's uncanny bond with his own portrait underscores the loss of selfhood everyone experiences in a world of images and copies, paves the way for the discourses of homosexuality and the understanding of lifestyle as identity so current today, and provides clues to the mysteries of modern ethics and politics. The edition also emphasizes the role of gender and the rise of female emancipation underlying the Sybil Vane subplot, a focus on women that intensifies the book's relevance to modern transformations of men and women alike.', 'language": "en", "image": "https://images.isbndb.com/covers/71/37/9780321427137.jpg", "title_long": "Picture of Dorian Gray, The, A Longman Cultural Edition", "edition": "1", "dimensions": "Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.89948602896 Pounds, Width: 1.55 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 1.55}, "weight": {"unit": "pounds", "value": 0.89948602896}, "height": {"unit": "inches", "value": 8.25}}, "pages": 352, "date_published": "2006-10-16", "subjects": ["Literature & Fiction', 'Classics', 'History & Criticism', 'Criticism & Theory', 'Movements & Periods', 'Reference', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Oscar Wilde', 'Andrew Elfenbein'], 'title": "Picture of Dorian Gray, The, A Longman Cultural Edition", "isbn13": "9780321427137", "msrp": 19.99, 'binding": "Paperback", "isbn": "0321427130", "isbn10": "0321427130"}}