{"book": {"publisher": "Pan Macmillan", "synopsis": "Foxmask is the continuation of the tale started in Wolfskin, a story of the clash between the warlike Norsemen and the mysterious and magical people who lived at the top of the world in the land that became Scotland. Young Eyvind wanted to become a great Viking warrior-a Wolfskin-and carry honor out in the name of his god, Thor. He and his kin traveled to a magical land across the sea, a windswept and barren place, but one filled with unexpected beauty and hidden treasure. Eyvind and his people settle and he finds a soulmate in young Nessa, seer and princess. But someone has come along to this new land who is not what he seems. Eyvind"s heartfriend Somerled had his own agenda . . . and his machinations nearly destroyed all that the two peoples had built. Truth and honor triumphed and though a terrible price was paid, peace has settled upon the land. A new generation is coming to adulthood: Norse and Orkney folk together. But the past is a thing that may be shunned but not forgotten. And when the terrible secret surrounding one young man"s paternity comes to light, it sets in motion a chain of events that could send the best and brightest of the land on a journey to discover the truth. And that truth could destroy whatever joy these people have ever known.", 'language": "en", "image": "https://images.isbndb.com/covers/18/44/9780330411844.jpg", "title_long": "Foxmask", "dimensions": "Height: 7.00786 Inches, Length: 4.37007 Inches, Weight: 0.74295782294 Pounds, Width: 1.5748 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.37007}, "width": {"unit": "inches", "value": 1.5748}, "weight": {"unit": "pounds", "value": 0.74295782294}, "height": {"unit": "inches", "value": 7.00786}}, "pages": 400, "date_published": "2005", "subjects": ["Science Fiction & Fantasy', 'Fantasy', 'Historical'], 'authors": ["Juliet Marillier'], 'title": "Foxmask", "isbn13": "9780330411844", "msrp": 16.5, 'binding": "Paperback", "isbn": "0330411845", "isbn10": "0330411845"}}