{"book": {"publisher": "Sceptre", "synopsis": "This is a previously-published edition of ISBN 9780340637876.<br/><br/>From the fall of Rome to the rise of Charlemagne - the "dark ages" - learning, scholarship, and culture disappeared from the European continent. The great heritage of western civilization - from the Greek and Roman classics to Jewish and Christian works - would have been utterly lost were it not for the holy men and women of unconquered Ireland.<br/><br/>In this delightful and illuminating look into a crucial but little-known "hinge' of history, Thomas Cahill takes us to the 'island of saints and scholars, ' the Ireland of St. Patrick and the Book of Kells. Here, far from the barbarian despoliation of the continent, monks and scribes laboriously, lovingly, even playfully preserved the west\'s written treasures. With the return of stability in Europe, these Irish scholars were instrumental in spreading learning. Thus the Irish not only were conservators of civilization, but became shapers of the medieval mind, putting their unique stamp on western culture.', 'language": "en", "image": "https://images.isbndb.com/covers/78/76/9780340637876.jpg", "title_long": "How the Irish Saved Civilization: The Untold Story of Ireland"s Heroic Role from the Fall of Rome to the Rise of Medieval Europe", 'edition": "New Ed", "dimensions": "Height: 7.71652 Inches, Length: 5.1181 Inches, Weight: 0.440924524 Pounds, Width: 0.7874 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.1181}, "width": {"unit": "inches", "value": 0.7874}, "weight": {"unit": "pounds", "value": 0.440924524}, "height": {"unit": "inches", "value": 7.71652}}, "pages": 224, "date_published": "1996", "subjects": ["History', 'Historical Study & Educational Resources', 'World'], 'authors": ['Thomas Cahill'], 'title": "How the Irish Saved Civilization: The Untold Story of Ireland"s Heroic Role from the Fall of Rome to the Rise of Medieval Europe", 'isbn13": "9780340637876", "msrp": "0.00", "binding": "Paperback", "isbn": "0340637870", "isbn10": "0340637870"}}