{"book": {"publisher": "Ballantine Books", "synopsis": "Here at last is the eagerly awaited new novel from New York Times bestselling author Gail Godwin. Queen of the Underworld is sweeping and sultry literary fiction, featuring a memorable young heroine and engaging characters whose intimate dramas interconnect with hers.<br/>In the summer of 1959, as Castro clamps down on Cuba and its first wave of exiles flees to the States to wait out what they hope to be his short-lived reign, Emma Gant, fresh out of college, begins her career as a reporter. Her fierce ambition and belief in herself are set against the stories swirling around her, both at the newspaper office and in her downtown Miami hotel, which is filling up with refugees.<br/>Emma’s avid curiosity about life thrives amid the tropical charms and intrigues of Miami. While toiling at the news desk, she plans the fictional stories she will write in her spare time. She spends her nights getting to know the Cuban families in her hotel–and rendezvousing with her married lover, Paul Nightingale, owner of a private Miami Beach club.<br/>As Emma experiences the historical events enveloping the city, she trains her perceptive eye on the people surrounding her: a newfound Cuban friend who joins the covert anti-Castro training brigade, a gambling racketeer who poses a grave threat to Paul, and a former madam, still in her twenties, who becomes both Emma’s obsession and her alter ego. Emma’s life, like a complicated dance that keeps sweeping her off her balance, is suddenly filled with divided loyalties, shady dealings, romantic and professional setbacks, and, throughout, her adamant determination to avoid “usurpation” by others and remain the protagonist of her own quest.", "language": "en", "image": "https://images.isbndb.com/covers/31/95/9780345483195.jpg", "title_long": "Queen of the Underworld: A Novel (Reader"s Circle)", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.34 Inches, Weight: 0.57540650382 Pounds, Width: 0.83 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.34}, "width": {"unit": "inches", "value": 0.83}, "weight": {"unit": "pounds", "value": 0.57540650382}, "height": {"unit": "inches", "value": 8}}, "pages": 368, "date_published": "2007-01-30", "subjects": ["Literature & Fiction', 'Dramas & Plays', 'Comedy', 'Genre Fiction', 'Historical', 'Coming of Age', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Gail Godwin'], 'title": "Queen of the Underworld: A Novel (Reader"s Circle)", 'isbn13": "9780345483195", "msrp": 14.95, 'binding": "Paperback", "isbn": "0345483197", "isbn10": "0345483197"}}