{"book": {"publisher": "Seal", "synopsis": "The Fourth Handasks an interesting question: “How can anyone identify a dream of the future?” The answer: “Destiny is not imaginable, except in dreams or to those in love."<br/><br/>While reporting a story from India, a New York television journalist has his left hand eaten by a lion; millions of TV viewers witness the accident. In Boston, a renowned hand surgeon awaits the opportunity to perform the nation’s first hand transplant; meanwhile, in the distracting aftermath of an acrimonious divorce, the surgeon is seduced by his housekeeper. A married woman in Wisconsin wants to give the one-handed reporter her husband’s left hand – that is, after her husband dies. But the husband is alive, relatively young, and healthy.<br/><br/>This is how John Irving’s tenth novel begins; it seems, at first, to be a comedy, perhaps a satire, almost certainly a sexual farce. Yet, in the end, The Fourth Hand is as realistic and emotionally moving as any of Mr. Irving’s previous novels – including The World According to Garp, A Prayer for Owen Meany, and A Widow for One Year – or his Oscar-winning screenplay of The Cider House Rules.<br/><br/>The Fourth Hand is characteristic of John Irving’s seamless storytelling and further explores some of the author’s recurring themes – loss, grief, love as redemption. But this novel also breaks new ground; it offers a penetrating look at the power of second chances and the will to change.<br/><br/>From the Trade Paperback edition.", "language": "en", "image": "https://images.isbndb.com/covers/31/59/9780345463159.jpg", "title_long": "The Fourth Hand", "edition": "1st ptg.", "dimensions": "Height: 6.88 Inches, Length: 4.17 Inches, Weight: 0.395 Pounds, Width: 0.98 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.17}, "width": {"unit": "inches", "value": 0.98}, "weight": {"unit": "pounds", "value": 0.395}, "height": {"unit": "inches", "value": 6.88}}, "pages": 368, "date_published": "2003-04-29", "subjects": ["Literature & Fiction', 'Literary'], 'authors": ["John Irving'], 'title": "The Fourth Hand", "isbn13": "9780345463159", "msrp": 7.99, 'binding": "Mass Market Paperback", "isbn": "0345463153", "isbn10": "0345463153"}}