{"book": {"publisher": "Del Rey", "synopsis": "In the first novel of the New York Times bestselling Temeraire series, a rare bond is formed between a young man and a dragon, and together they must battle in the Napoleonic Wars.<br/><br/>“A terrifically entertaining fantasy novel.”—Stephen King<br/><br/>Aerial combat brings a thrilling new dimension to the Napoleonic Wars as valiant warriors rise to Britain’s defense by taking to the skies . . . not aboard aircraft but atop the mighty backs of fighting dragons.<br/><br/>When HMS Reliant captures a French frigate and seizes its precious cargo, an unhatched dragon egg, fate sweeps Capt. Will Laurence from his seafaring life into an uncertain future–and an unexpected kinship with a most extraordinary creature. Thrust into the rarified world of the Aerial Corps as master of the dragon Temeraire, he will face a crash course in the daring tactics of airborne battle. For as France’s own dragon-borne forces rally to breach British soil in Bonaparte’s boldest gambit, Laurence and Temeraire must soar into their own baptism of fire.<br/><br/>“Just when you think you’ve seen every variation possible on the dragon story, along comes Naomi Novik. . . . Her wonderful Temeraire is a dragon for the ages.”—Terry Brooks<br/><br/>Don’t miss any of Naomi Novik’s magical Temeraire series<br/>HIS MAJESTY’S DRAGON • THRONE OF JADE • BLACK POWDER WAR • EMPIRE OF IVORY • VICTORY OF EAGLES • TONGUES OF SERPENTS • CRUCIBLE OF GOLD • BLOOD OF TYRANTS • LEAGUE OF DRAGONS", "language": "en", "image": "https://images.isbndb.com/covers/12/83/9780345481283.jpg", "title_long": "His Majesty"s Dragon (Temeraire, Book 1)", "edition": "Reissue", "dimensions": "Height: 6.88 Inches, Length: 4.17 Inches, Weight: 0.41 Pounds, Width: 0.99 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.17}, "width": {"unit": "inches", "value": 0.99}, "weight": {"unit": "pounds", "value": 0.41}, "height": {"unit": "inches", "value": 6.88}}, "pages": 384, "date_published": "2006", "subjects": ["Science Fiction & Fantasy', 'Fantasy', 'Epic', 'Historical', 'Science Fiction', 'Alternate History'], 'authors": ["Naomi Novik'], 'title": "His Majesty"s Dragon (Temeraire, Book 1)", 'isbn13": "9780345481283", "msrp": 7.99, "binding": "Mass Market Paperback", "related": {"ePub": "034549072X"}, "isbn": "0345481283", "isbn10": "0345481283", "other_isbns": [{'isbn": "9780345490728", "binding": "printisbn"}]}}