{"book": {"publisher": "Ballentine Books", "synopsis": "““As compelling as Tan’s first bestseller, The Joy Luck Club. . . No one writes about mothers and daughters with more empathy than Amy Tan.”<br/>–The Philadelphia Inquirer<br/><br/>“[An] absorbing tale of the mother-daughter bond . . . this book sing[s] with emotion and insight.”<br/>–People<br/><br/>Ruth Young and her widowed mother, LuLing, have always had a tumultuous relationship. Now, before she succumbs to forgetfulness, LuLing gives Ruth some of her writings, which reveal a side of LuLing that Ruth has never known. . . .<br/><br/>In a remote mountain village where ghosts and tradition rule, LuLing grows up in the care of her mute Precious Auntie as the family endures a curse laid upon a relative known as the bonesetter. When headstrong LuLing rejects the marriage proposal of the coffinmaker, a shocking series of events are set in motion–all of which lead back to Ruth and LuLing in modern San Francisco. The truth that Ruth learns from her mother’s past will forever change her perception of family, love, and forgiveness.<br/><br/>“A strong novel, filled with idiosyncratic, sympathetic characters; haunting images; historical complexity; significant contemporary themes; and suspenseful mystery.”<br/>–Los Angeles Times<br/><br/>“For Tan, the true keeper of memory is language, and so the novel is layered with stories that have been written down–by mothers for their daughters, passing along secrets that cannot be said out loud but must not be forgotten.”<br/>–The New York Times Book Review<br/><br/>“Tan at her best . . . rich and hauntingly forlorn . . . The writing is so exacting and unique in its detail.”<br/>–San Francisco Chronicle", "language": "en", "image": "https://images.isbndb.com/covers/73/70/9780345457370.jpg", "title_long": "The Bonesetter"s Daughter", "edition": "5th", "dimensions": "Weight: 0.7 Pounds", "dimensions_structured": {"weight": {"unit": "pounds", "value": 0.7}}, "pages": 385, "date_published": "2001", "subjects": ["Literature & Fiction', 'Literary', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Thrillers & Suspense', 'Psychological Thrillers'], 'authors": ['Amy Tan'], 'title": "The Bonesetter"s Daughter", 'isbn13": "9780345457370", "msrp": "0.00", "binding": "Paperback", "isbn": "0345457374", "isbn10": "0345457374"}}