{"book": {"publisher": "Del Rey", "synopsis": "Mars has become divided by love. Not one, but two princes and a Jeddak are vying for the love of Thuvia of Ptarth. When she is mysteriously kidnapped, treachery threatens to throw Barsoom into bloody war. Now Cathoris must follow in the footsteps of his father, John Carter, and overcome phantom armies, dangerous spies and savage beasts as he attempts to save his true love and reunite Mars. The fourth Martian novel from Burroughs.<br/><br/>Excerpt:<br/>Upon a massive bench of polished ersite beneath the gorgeous blooms of a giant pimalia a woman sat. Her shapely, sandalled foot tapped impatiently upon the jewel-strewn walk that wound beneath the stately sorapus trees across the scarlet sward of the royal gardens of Thuvan Dihn, Jeddak of Ptarth, as a dark-haired, red-skinned warrior bent low toward her, whispering heated words close to her ear. "Ah, Thuvia of Ptarth," he cried, "you are cold even before the fiery blasts of my consuming love! No harder than your heart, nor colder is the hard, cold ersite of this thrice happy bench which supports your divine and fadeless form! Tell me, O Thuvia of Ptarth, that I may still hope-that though you do not love me now, yet some day, some day, my princess, I-' The girl sprang to her feet with an exclamation of surprise and displeasure. Her queenly head was poised haughtily upon her smooth red shoulders. Her dark eyes looked angrily into those of the man.', 'language": "en", "image": "https://images.isbndb.com/covers/99/35/9780345339935.jpg", "title_long": "Thuvia, Maid of Mars: (#4) (Martian Tales of Edgar Rice Burroughs)", "dimensions": "Height: 6.75 Inches, Length: 4.25 Inches, Weight: 0.25 Pounds, Width: 0.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.25}, "width": {"unit": "inches", "value": 0.5}, "weight": {"unit": "pounds", "value": 0.25}, "height": {"unit": "inches", "value": 6.75}}, "pages": 30, "date_published": "1986-07-12", "subjects": ["Literature & Fiction', 'Classics', 'Science Fiction & Fantasy', 'Science Fiction'], 'authors": ['Edgar Rice Burroughs'], 'title": "Thuvia, Maid of Mars: (#4) (Martian Tales of Edgar Rice Burroughs)", "isbn13": "9780345339935", "msrp": "0.00", "binding": "Paperback", "isbn": "0345339932", "isbn10": "0345339932"}}