{"book": {"publisher": "Ballantine Books", "synopsis": ""Once upon a time, there was a woman who discovered that she had turned into the wrong person." So Anne Tyler opens this irresistible new novel.<br/><br/>The woman is Rebecca Davitch, a fifty-three-year-old grandmother. Is she an impostor in her own life? she asks herself. Is it indeed her own life? Or is it someone else’s?<br/><br/>On the surface, Beck, as she is known to the Davitch clan, is outgoing, joyous, a natural celebrator. Giving parties is, after all, her vocation—something she slipped into even before finishing college, when Joe Davitch spotted her at an engagement party in his family’s crumbling nineteenth-century Baltimore row house, where giving parties was the family business. What caught his fancy was that she seemed to be having such a wonderful time. Soon this large-spirited older man, a divorcé with three little girls, swept her into his orbit, and before she knew it she was embracing his extended family plus a child of their own, and hosting endless parties in the ornate, high-ceilinged rooms of The Open Arms.<br/><br/>Now, some thirty years later, after presiding over a disastrous family picnic, Rebecca is caught un-awares by the question of who she really is. How she answers it—how she tries to recover her girlhood self, that dignified grownup she had once been—is the story told in this beguiling, funny, and deeply moving novel.<br/><br/>As always with Anne Tyler’s novels, once we enter her world it is hard to leave. But in Back When We Were Grownups she so sharpens our perceptions and awakens so many untapped feelings that we come away not only refreshed and delighted, but also infinitely wiser.<br/><br/>From the Hardcover edition.", 'language": "en", "image": "https://images.isbndb.com/covers/72/48/9780345477248.jpg", "title_long": "Back When We Were Grownups", "edition": "Reprint", "dimensions": "Height: 6.8 Inches, Length: 4.2 Inches, Weight: 0.3669 Pounds, Width: 1.2 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.2}, "width": {"unit": "inches", "value": 1.2}, "weight": {"unit": "pounds", "value": 0.3669}, "height": {"unit": "inches", "value": 6.8}}, "pages": 336, "date_published": "2004-10-26", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Family Life', 'Psychological', 'Literary'], 'authors": ["Anne Tyler'], 'title": "Back When We Were Grownups", "isbn13": "9780345477248", "msrp": 7.5, 'binding": "Mass Market Paperback", "isbn": "0345477243", "isbn10": "0345477243"}}