{"book": {"publisher": "Random House Worlds", "synopsis": "Discover who’s who and what’s what in the Star Wars universe with this beautifully illustrated guide–now in full color for the first time.<br/><br/>When it comes to extraterrestrial life-forms, there’s more to science fiction’s most famous galaxy than just Jawas, Wookiees, Ewoks, and Hutts. From the skylanes of Coruscant to the worlds of the Outer Rim, an untold number of species populate those planets far, far away. And if you confuse Gungans with Gamorreans, or don’t know a bantha from a tauntaun, you definitely need the in-depth data that only this revised, expanded, and updated guide can deliver.<br/>This comprehensive overview includes beings from all six of the classic movies–plus the novels, cartoon series, comics, and video games. It’s an even bigger cross section of species than what you’ll find in the Mos Eisley cantina. And each entry, from acklay to Zabrak, from amphibians to vacuum-breathers, features everything you need to know, including<br/><br/>• complete physical description and official designation, so you can tell your sentients from your non-sentients, and your humanoids from your insectoids<br/>• homeworld: from dry and dusty Tatooine, stormy and waterlogged Kamino, to arctic Hoth, and countless other strange and varied worlds<br/>• phonetic pronunciation: Askajian, H’nemthe, Iktotchi, Ssi-ruu, and Xexto/Quermian aren’t as easy to say as they are to, er, spell<br/>• notable appearance: a listing of one of the more significant appearances of each species in the teeming Star Wars storyline<br/><br/>Plus, this brand-new edition includes a glossary of crucial descriptive terms and a completely original, full color illustration for each of more than one hundred individual species. It’s a big galaxy, and someone has to organize it. Count on Star Wars®: The New Essential Guide to Alien Species–and don’t leave your homeworld without it.", "language": "en", "image": "https://images.isbndb.com/covers/76/06/9780345477606.jpg", "title_long": "The New Essential Guide to Alien Species (Star Wars)", "edition": "NO-VALUE", "dimensions": "Height: 10.9 Inches, Length: 8.52 Inches, Weight: 2.07014064018 Pounds, Width: 0.61 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 8.52}, "width": {"unit": "inches", "value": 0.61}, "weight": {"unit": "pounds", "value": 2.07014064018}, "height": {"unit": "inches", "value": 10.9}}, "pages": 240, "date_published": "2006-10-31", "subjects": ["Science Fiction & Fantasy', 'Science Fiction', 'History & Criticism', 'Space Opera'], 'authors": ["Ann Margaret Lewis', 'Helen Keier'], 'title": "The New Essential Guide to Alien Species (Star Wars)", "isbn13": "9780345477606", "msrp": 14.99, "binding": "Paperback", "related": {"ePub": "0345542797"}, "isbn": "034547760X", "isbn10": "034547760X", "other_isbns": [{'isbn": "9780345542793", "binding": "printisbn"}]}}