{"book": {"publisher": "Del Rey", "synopsis": "TheNew York Times bestselling author of the classic Shannara epic, Terry Brooks, has proven himself one of the modern masters of fantasy, brilliantly creating breathtaking worlds of magic, adventure, and intrigue. Now, for the first time in one marvelous collector’s edition hardcover, here’s the complete trilogy of the Voyage of the Jerle Shannara: Ilse Witch, Antrax, and Morgawr. In these enchanting novels, a colorful contingent of characters takes to the skies aboard a magnificent airship–the Jerle Shannara–on a quest fraught with wonder and danger.<br/><br/>Ilse Witch<br/>A half-drowned elf carries a map covered with cryptic symbols–and Walker Boh, the last of the Druids, has the skill to decipher them. But someone else understands the map’s significance: the ruthless Ilse Witch, who will stop at nothing to possess it–and the powerful magic it leads to.<br/><br/>Antrax<br/>While in search of the elusive magic, Walker Boh is lured into a trap–caught in a dark maze beneath a ruined city, stalked by a hungry, unseen enemy. It is Antrax: a spirit that feeds off enchantment and traps the souls of men. Now the fate of the Four Lands hangs in the balance.<br/><br/>Morgawr<br/>The intrepid heroes aboard the Jerle Shannara have reached their breaking point. A centuries-old sorcerer, the Morgawr, vows to find and control the fabled ancient books of magic–and he is an adversary of awesome might with a fleet of airships and a crew of walking dead men at his command.<br/><br/>In The Voyage of the Jerle Shannara, Terry Brooks weaves together high adventure, vividly wrought characters, and a spellbinding world into an irresistible story of heroism and sacrifice, love and honor.", "language": "en", "image": "https://images.isbndb.com/covers/28/69/9780345492869.jpg", "title_long": "The Voyage of the Jerle Shannara Trilogy (Antrax / Morgawr / Ilse Witch)", "edition": 1, 'dimensions": "Height: 9.75 Inches, Length: 6.75 Inches, Weight: 3.85 Pounds, Width: 2.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.75}, "width": {"unit": "inches", "value": 2.5}, "weight": {"unit": "pounds", "value": 3.85}, "height": {"unit": "inches", "value": 9.75}}, "pages": 1248, "date_published": "2006-11-14", "subjects": ["Literature & Fiction', 'United States', 'Science Fiction & Fantasy', 'Fantasy', 'Epic'], 'authors": ["Terry Brooks'], 'title": "The Voyage of the Jerle Shannara Trilogy (Antrax / Morgawr / Ilse Witch)", "isbn13": "9780345492869", "msrp": 18.99, "binding": "Hardcover", "related": {"Kindle Edition": "0307807959"}, "isbn": "0345492862", "isbn10": "0345492862", "other_isbns": [{'isbn": "9780307807953", "binding": "printisbn"}]}}