{"book": {"publisher": "Random House Publishing Group", "synopsis": "A prescient warning of a future we now inhabit, where fake news stories and Internet conspiracy theories play to a disaffected American populace<br/><br/>“A glorious book . . . A spirited defense of science . . . From the first page to the last, this book is a manifesto for clear thought.”—Los Angeles Times<br/><br/>How can we make intelligent decisions about our increasingly technology-driven lives if we don’t understand the difference between the myths of pseudoscience and the testable hypotheses of science? Pulitzer Prize-winning author and distinguished astronomer Carl Sagan argues that scientific thinking is critical not only to the pursuit of truth but to the very well-being of our democratic institutions.<br/><br/>Casting a wide net through history and culture, Sagan examines and authoritatively debunks such celebrated fallacies of the past as witchcraft, faith healing, demons, and UFOs. And yet, disturbingly, in today"s so-called information age, pseudoscience is burgeoning with stories of alien abduction, channeling past lives, and communal hallucinations commanding growing attention and respect. As Sagan demonstrates with lucid eloquence, the siren song of unreason is not just a cultural wrong turn but a dangerous plunge into darkness that threatens our most basic freedoms.<br/><br/>Praise for The Demon-Haunted World<br/><br/>“Powerful . . . A stirring defense of informed rationality. . . Rich in surprising information and beautiful writing.”—The Washington Post Book World<br/><br/>“Compelling.”—USA Today<br/><br/>“A clear vision of what good science means and why it makes a difference. . . . A testimonial to the power of science and a warning of the dangers of unrestrained credulity.”—The Sciences<br/><br/>“Passionate.”—San Francisco Examiner-Chronicle", "language": "en", "image": "https://images.isbndb.com/covers/94/61/9780345409461.jpg", "title_long": "The Demon-Haunted World: Science as a Candle in the Dark", "edition": "Reprint", "dimensions": "Height: 8.26 Inches, Length: 5.47 Inches, Weight: 0.82 Pounds, Width: 0.81 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.47}, "width": {"unit": "inches", "value": 0.81}, "weight": {"unit": "pounds", "value": 0.82}, "height": {"unit": "inches", "value": 8.26}}, "pages": 457, "date_published": "1997-02-25", "subjects": ["Reference', 'Encyclopedias & Subject Guides', 'Mythology & Folklore', 'Science & Math', 'History & Philosophy', 'Research'], 'authors": ["Carl Sagan', 'Ann Druyan'], 'title": "The Demon-Haunted World: Science as a Candle in the Dark", "isbn13": "9780345409461", "msrp": 18, "binding": "Paperback", "related": {"Kindle Edition": "0307801047", "ePub": "0307801047"}, "isbn": "0345409469", "isbn10": "0345409469", "other_isbns": [{'isbn": "9780307801043", "binding": "print"}]}}