{"book": {"publisher": "Fawcett", "synopsis": "No one knows the dark side of “The Street” better than master storyteller Stephen Frey, author of such riveting novels as Shadow Account and The Day Trader. Now, in his most ambitious work to date, Frey proves that no writer can put a high-powered hero at greater risk, nor offer readers more thrilling rewards.<br/>A towering legend among New York private equity partnerships, Everest Capital is aptly named. When its founder meets an untimely death, thirty-six-year-old superstar Christian Gillette gets the top job. But with the power and prestige come risks. The day he narrowly escapes a fiery explosion that consumes his limo and takes two innocent lives, Gillette instantly understands how intense those risks are.<br/><br/>It comes as no surprise to him that he has enemies in the world of multibillion—dollar deals. But now that he controls Everest, he’s not going to let those enemies keep him from taking the firm–and himself–to even greater heights. Gillette has never hesitated to be aggressive, even ruthless, in his pursuit of success. This time will be no exception.<br/><br/>But in order to forge the alliances necessary to achieve his goals, Gillette forsakes a cardinal rule: Never trust anyone. The only certainties are the insidious campaign of corporate sabotage that could cost Gillette his job and the relentless assassination attempts that could cost him his life. To break a deadly conspiracy of greed, he’ll be forced to walk–then run–an ever-blurring line between loyalty and betrayal, attack and retreat, survival and destruction . . . in the ultimate game of profit and loss.<br/><br/>With The Chairman, Stephen Frey presides with intensified skill over the market he has so dramatically cornered–sharpening his patented brand of hard-boiled high-finance intrigue to its keenest cutting edge yet.", "language": "en", "image": "https://images.isbndb.com/covers/76/15/9780345457615.jpg", "title_long": "The Chairman: A Novel (Christian Gillette)", "edition": "Reprint", "dimensions": "Height: 6.86 Inches, Length: 4.22 Inches, Weight: 0.53792791928 Pounds, Width: 0.93 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 4.22}, "width": {"unit": "inches", "value": 0.93}, "weight": {"unit": "pounds", "value": 0.53792791928}, "height": {"unit": "inches", "value": 6.86}}, "pages": 432, "date_published": "2005-12-27", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Spies & Politics', 'Suspense', 'Crime', 'Financial', 'Self Service', 'Custom Stores'], 'authors": ["Stephen Frey'], 'title": "The Chairman: A Novel (Christian Gillette)", "isbn13": "9780345457615", "msrp": 7.99, 'binding": "Mass Market Paperback", "isbn": "0345457617", "isbn10": "0345457617"}}