{"book": {"publisher": "Random House Worlds", "synopsis": "The war that erupted in Star Wars:Episode IIAttack of the Clones is nearing its boiling point, as the dauntless Separatist forces continue their assault on the teetering Republic–and the diabolical triumvirate of Count Dooku, General Grievous, and their Master, Darth Sidious, fine-tune their strategy for conquest. In Episode III Revenge of the Sith the fates of key players on both sides of the conflict will be sealed. But first, crucial events that pave the way to that time of reckoning unfold in a labyrinth of evil. . . .<br/><br/>Capturing Trade Federation Viceroy–and Separatist Councilmember–Nute Gunray is the mission that brings Jedi Knights Obi-Wan Kenobi and Anakin Skywalker, with a squad of clones in tow, to Neimoidia. But the treacherous ally of the Sith proves as slippery as ever, evading his Jedi pursuers even as they narrowly avoid deadly disaster. Still, their daring efforts yield an unexpected prize: a unique holotransceiver that bears intelligence capable of leading the Republic forces to their ultimate quarry, the ever-elusive Darth Sidious.<br/><br/>Swiftly taking up the chase, Anakin and Obi-Wan follow clues from the droid factories of Charros IV to the far-flung worlds of the Outer Rim . . . every step bringing them closer to pinpointing the location of the Sith Lord–whom they suspect has been manipulating every aspect of the Separatist rebellion. Yet somehow, in the escalating galaxy-wide chess game of strikes, counterstrikes, ambushes, sabotage, and retaliations, Sidious stays constantly one move ahead.<br/><br/>Then the trail takes a shocking turn. For Sidious and his minions have set in motion a ruthlessly orchestrated campaign to divide and overwhelm the Jedi forces–and bring the Republic to its knees.", "language": "en", "image": "https://images.isbndb.com/covers/57/32/9780345475732.jpg", "title_long": "Labyrinth of Evil (Star Wars, Episode III Prequel Novel)", "edition": "Reprint", "dimensions": "Height: 6.73 Inches, Length: 4.17 Inches, Weight: 0.48722159902 Pounds, Width: 1 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 4.17}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 0.48722159902}, "height": {"unit": "inches", "value": 6.73}}, "pages": 370, "date_published": "2005-09-27", "subjects": ["Literature & Fiction', 'Genre Fiction', 'TV, Movie, Video Game Adaptations', 'Action & Adventure', 'Classics', 'Science Fiction & Fantasy', 'Science Fiction', 'Adventure', 'Space Opera', 'Self Service', 'Custom Stores'], 'authors": ["James Luceno'], 'title": "Labyrinth of Evil (Star Wars, Episode III Prequel Novel)", "isbn13": "9780345475732", "msrp": 7.99, "binding": "Mass Market Paperback", "related": {"Kindle Edition": "0307795799", "ePub": "0307795799"}, "isbn": "0345475739", "isbn10": "0345475739", "other_isbns": [{'isbn": "9780307795793", "binding": "printisbn"}]}}