{"book": {"publisher": "Del Rey Books", "synopsis": "Dive into the epic series featuring the brave warriors of Omega Squad—an elite team of clone commandos fighting to protect the Galactic Republic.<br/><br/>Following the eruption of the bloody Clone Wars at the battle of Geonosis, both sides remain deadlocked in a stalemate that can be broken only by elite warrior teams like Omega Squad, clone commandos with terrifying combat skills and a lethal arsenal.<br/><br/>For Omega Squad, deployed deep behind enemy lines, it’s the same old special ops grind: sabotage, espionage, ambush, and assassination. But when Omega Squad is rushed to Coruscant, the war’s most dangerous new hotspot, the commandos discover they’re not the only ones penetrating the heart of the enemy.<br/><br/>A surge in Separatist attacks has been traced to a network of cells in the Republic’s capital, masterminded by a mole in Command Headquarters. To identify and destroy a Separatist spy and terror network in a city full of civilians will require special talents and skills. Not even the leadership of Jedi generals, along with the assistance of Delta Squad and a certain notorious ARC trooper, can even the odds against the Republic Commandos. And while success may not bring victory in the Clone Wars, failure means certain defeat.", "language": "en", "image": "https://images.isbndb.com/covers/00/94/9780345490094.jpg", "title_long": "Triple Zero", "edition": "First Edition", "dimensions": "Weight: 0.48060773116 Pounds", "dimensions_structured": {'weight": {"unit": "pounds", "value": 0.48060773116}}, "pages": 427, "date_published": "2006", "subjects": ["Science Fiction & Fantasy', 'Science Fiction', 'Adventure', 'Space Opera'], 'authors": ["Karen Traviss'], 'title": "Triple Zero", "isbn13": "9780345490094", "msrp": 7.99, "binding": "Paperback", "related": {"Kindle Edition": "0307795926", "ePub": "0307795926"}, "isbn": "0345490096", "isbn10": "0345490096", "other_isbns": [{'isbn": "9780307795922", "binding": "printisbn"}]}}