{"book": {"publisher": "Del Rey", "synopsis": "More than a quarter of a century after The Sword of Shannara carved out its place in the pantheon of great epic fantasy, the magic of Terry Brooks’s New York Times bestselling saga burns as brightly as ever. Three complete series have chronicled the ever-unfolding history of Shannara. But more stories are still to be told—and new adventures have yet to be undertaken. Book One of High Druid of Shannara invites both the faithful longtime reader and the curious newcomer to take the first step on the next extraordinary quest.<br/><br/>Twenty years have passed since Grianne Ohmsford denounced her former life as the dreaded Ilse Witch—saved by the love of her brother, the magic of the Sword of Shannara, and the destruction of her evil mentor, the Morgawr. Now, fulfilling the destiny predicted for her, she has established the Third Druid Council, and dedicated herself to its goals of peace, harmony among the races, and defense of the Four Lands. But the political intrigue, secret treachery, and sinister deeds that have haunted Druid history for generations continue to thrive. And despite her devotion to the greater good as Ard Rhys—the High Druid of Paranor, Grianne still has bitter enemies.<br/><br/>Among the highest ranks of the Council she leads lurk those who cannot forget her reign of terror as the Ilse Witch, who covet her seat of power, and who will stop at nothing to see her deposed . . . or destroyed. Even Grianne’s few allies—chief among them her trusted servant Tagwen—know of the plots against her. But they could never anticipate the sudden, ominous disappearance of the Ard Rhys, in the dead of night and without a trace. Now, barely a step ahead of the dark forces bent on stopping him, Tagwen joins Grianne’s brave young nephew, Pen Ohmsford, and the wise, powerful elf Ahren Elessedil on a desperate and dangerous mission of search and rescue—to deliver the High Druid of Shannara from an unspeakable fate.<br/><br/>Expect no end of wonders, no shortage of adventure, exhilaration, suspense, and enchantment, as Terry Brooks demonstrates, once again, that there is no end to his magic of invention and mastery of storytelling.<br/><br/>From the Hardcover edition.", "language": "en", "image": "https://images.isbndb.com/covers/38/98/9780345483898.jpg", "title_long": "Jarka Ruus (High Druid of Shannara, Book 1)", "edition": "Reprint", "dimensions": "Height: 8.25 Inches, Length: 5.75 Inches, Weight: 0.7 Pounds, Width: 0.75 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.75}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 0.7}, "height": {"unit": "inches", "value": 8.25}}, "pages": 416, "date_published": "2005-07-26", "subjects": ["Business & Money', 'Economics', 'Economic Conditions', 'Commerce', 'Science Fiction & Fantasy', 'Fantasy', 'Epic'], 'authors": ["Terry Brooks'], 'title": "Jarka Ruus (High Druid of Shannara, Book 1)", "isbn13": "9780345483898", "msrp": 13.95, 'binding": "Paperback", "isbn": "0345483898", "isbn10": "0345483898"}}