{"book": {"publisher": "Ballantine Books", "synopsis": "The acknowledged master of psychological suspense and heart-stopping terror, New York Times bestselling author John Saul now invites you to descend to chilling new depths of darkness--and discover a secret, savage world that exists beneath our very feet.<br/><br/>The promising future of New York City college student Jeff Converse has suddenly been shattered by a nightmarish turn of events. Falsely convicted of a brutal crime, Jeff sees his life vanishing before his eyes. But someone has other plans for Jeff, in a far deadlier place than any penitentiary. He finds himself beneath the teeming streets of Manhattan, in a hidden landscape of twisting tunnels and forgotten subterranean chambers. Here, an invisible population of the homeless, the desperate, and the mad has carved out its own shadow society.<br/><br/>But they are not alone. The pitch-dark tunnels and abandoned subway stations are haunted by the unmistakable sounds of predators in search of game. Someone has made this forsaken civilization beneath the city a private killing ground . . . and the hunt is on.<br/><br/>Trapped in a treacherous underground maze, cut off at every turn by ragged gangs of sinister "gamekeepers," and stalked relentlessly by unseen hunters, Jeff faces overwhelming odds in the race to reach salvation and elude capture. With no weapon but his wits, and an unimaginable threat lurking around every dark corner, Jeff must somehow move heaven and earth to escape from a living hell.<br/><br/>The Manhattan Hunt Club is the most thrilling and suspenseful novel yet from the ingenious mind of John Saul.<br/><br/>From the Hardcover edition.", 'language": "en", "image": "https://images.isbndb.com/covers/06/43/9780345490643.jpg", "title_long": "The Manhattan Hunt Club: A Novel", "dimensions": "Height: 6.91 Inches, Length: 4.32 Inches, Weight: 0.42 Pounds, Width: 1.08 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.32}, "width": {"unit": "inches", "value": 1.08}, "weight": {"unit": "pounds", "value": 0.42}, "height": {"unit": "inches", "value": 6.91}}, "pages": 384, "date_published": "2006-03-28", "subjects": ["Literature & Fiction'], 'authors": ["John Saul'], 'title": "The Manhattan Hunt Club: A Novel", "isbn13": "9780345490643", "msrp": 4.99, 'binding": "Mass Market Paperback", "isbn": "0345490649", "isbn10": "0345490649"}}