{"book": {"publisher": "Random House Trade Paperbacks", "synopsis": "NATIONAL BESTSELLER • “In this highly opinionated and highly readable history, Kurlansky makes a case for why 1968 has lasting relevance in the United States and around the world.”—Dan Rather<br/><br/>To some, 1968 was the year of sex, drugs, and rock and roll. Yet it was also the year of the Martin Luther King, Jr., and Bobby Kennedy assassinations; the riots at the Democratic National Convention in Chicago; Prague Spring; the antiwar movement and the Tet Offensive; Black Power; the generation gap; avant-garde theater; the upsurge of the women’s movement; and the beginning of the end for the Soviet Union.<br/><br/>In this monumental book, Mark Kurlansky brings to teeming life the cultural and political history of that pivotal year, when television’s influence on global events first became apparent, and spontaneous uprisings occurred simultaneously around the world. Encompassing the diverse realms of youth and music, politics and war, economics and the media, 1968 shows how twelve volatile months transformed who we were as a people—and led us to where we are today.", "language": "en", "image": "https://images.isbndb.com/covers/58/26/9780345455826.jpg", "title_long": "1968: The Year That Rocked the World", "edition": "59352nd", "dimensions": "Height: 8.22 Inches, Length: 5.53 Inches, Weight: 0.85 Pounds, Width: 1.03 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.53}, "width": {"unit": "inches", "value": 1.03}, "weight": {"unit": "pounds", "value": 0.85}, "height": {"unit": "inches", "value": 8.22}}, "pages": 480, "date_published": "2005-01-11", "subjects": ["History', 'Americas', 'United States', 'Asia', 'Europe', 'France', 'Military', 'World'], 'authors": ["Mark Kurlansky'], 'title": "1968: The Year That Rocked the World", "isbn13": "9780345455826", "msrp": 18, "binding": "Paperback", "related": {"Kindle Edition": "0345471911", "ePub": "0345471911"}, "isbn": "0345455827", "isbn10": "0345455827", "other_isbns": [{'isbn": "9780345471918", "binding": "print"}]}}