{"book": {"publisher": "Del Rey", "synopsis": "The High Druid of Shannara trilogy draws to a thrilling close as a young hero nears completion of his trial by fire, a banished ruler fights for her life in a wilderness of dread, and forces of darkness and light square off in a battle unto death for the right to absolute rule. Prepare to be spellbound by the masterly hand of bestselling legend weaver Terry Brooks, conjuring at the peak of his skills.<br/><br/>For reasons known only to himself, the King of the Silver River has charged young Penderrin Ohmsford, barely more than a boy, with the daunting task of rescuing his aunt, Grianne, Ard Rhys of the Druid order, from her forced exile in the terrifying dimension of all things damned: the Forbidding. With the noble dwarf Tagwen and the prodigal elven princess Khyber Elessedil by his side–and with the outcome of the bloody war between the Federation and the Free-born at stake–Pen has accepted his mission without question. But not without risk . . . or sacrifice.<br/><br/>Because Shadea a’Ru, the ruthless Druid responsible for imprisoning the true Ard Rhys and usurping leadership at Paranor, has sent her agents and assassins in relentless pursuit of Pen and his comrades. And in securing the talisman he needs to breach the Forbidding, Pen has paid a devastating price. Now if the Free-born forces–already decimated by the Federation’s death-dealing new weapon–should fall, Shadea’s domination of the Four Lands will be assured. Nothing short of Pen’s success can turn the tide.<br/><br/>But Pen’s challenge grows greater when he learns that his parents, Bek Ohmsford and Rue Meridian, have fallen into Shadea’ s hands. He must try to help them–but once within the walls of Druid’s Keep, where Shadea’s minions and dark magic lurk at every turn, Pen’s survival is far from assured. Yet it will all pale in comparison to the horrors that wait inside the Forbidding–horrors poised to break free upon the Four Lands when the time is right. . . .", "language": "en", "image": "https://images.isbndb.com/covers/11/32/9780345451132.jpg", "title_long": "High Druid of Shannara: Straken", "edition": "Reprint", "dimensions": "Height: 8.17 Inches, Length: 5.48 Inches, Weight: 0.68784225744 Pounds, Width: 0.83 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.48}, "width": {"unit": "inches", "value": 0.83}, "weight": {"unit": "pounds", "value": 0.68784225744}, "height": {"unit": "inches", "value": 8.17}}, "pages": 384, "date_published": "2006-08-15", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Action & Adventure', 'Fantasy', 'Mystery, Thriller & Suspense', 'Science Fiction & Fantasy', 'Epic', 'Sword & Sorcery', 'Science Fiction', 'Adventure'], 'authors": ["Terry Brooks'], 'title": "High Druid of Shannara: Straken", "isbn13": "9780345451132", "msrp": 14.95, 'binding": "Paperback", "isbn": "0345451139", "isbn10": "0345451139"}}