{"book": {"publisher": "Ballantine Books", "synopsis": "Evil exists. Evil walks the streets. And evil has spawned a diabolical new disciple in this white-knuckle thriller from New York Times bestselling author Tess Gerritsen.<br/><br/>PECCAVI<br/>The Latin word is scrawled in blood at the scene of a young woman’s brutal murder: I HAVE SINNED. It’s a chilling Christmas greeting for Boston medical examiner Maura Isles and Detective Jane Rizzoli, who swiftly link the victim to controversial celebrity psychiatrist Joyce O’Donnell–Jane’s professional nemesis and member of a sinister cabal called the Mephisto Club.<br/><br/>On top of Beacon Hill, the club’s acolytes devote themselves to the analysis of evil: Can it be explained by science? Does it have a physical presence? Do demons walk the earth? Drawing on a wealth of dark historical data and mysterious religious symbolism, the Mephisto scholars aim to prove a startling theory: that Satan himself exists among us.<br/><br/>With the grisly appearance of a corpse on their doorstep, it’s clear that someone–or something–is indeed prowling the city. The members of the club begin to fear the very subject of their study. Could this maniacal killer be one of their own–or have they inadvertently summoned an evil entity from the darkness?<br/><br/>Delving deep into the most baffling and unusual case of their careers, Maura and Jane embark on a terrifying journey to the very heart of evil, where they encounter a malevolent foe more dangerous than any they have ever faced . . . one whose work is only just beginning.", "language": "en", "image": "https://images.isbndb.com/covers/69/99/9780345476999.jpg", "title_long": "The Mephisto Club: A Novel", "edition": "First Edition", "dimensions": "Height: 9.5 Inches, Length: 6.5 Inches, Weight: 1.4 Pounds, Width: 1 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.5}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 1.4}, "height": {"unit": "inches", "value": 9.5}}, "pages": 368, "date_published": "2006-09-12", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Medical', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Thrillers & Suspense', 'Suspense'], 'authors": ["Tess Gerritsen'], 'title": "The Mephisto Club: A Novel", "isbn13": "9780345476999", "msrp": 25.95, "binding": "Hardcover", "related": {"Kindle Edition": "0345495306", "ePub": "0345495306"}, "isbn": "0345476999", "isbn10": "0345476999", "other_isbns": [{'isbn": "9780345495303", "binding": "printisbn"}]}}