{"book": {"publisher": "Del Rey", "synopsis": "From science fiction legend Alan Dean Foster comes a thrilling Pip and Flinx adventure, wherein a certain red-haired, green-eyed young man blessed (or cursed) with strange powers finds himself and his mini-dragon sidekick on a top-secret mission concerning deep space, alien worlds . . . and a primordial horror intent on devouring all of it.<br/><br/>In the outer depths of the universe lies the Great Emptiness, where something dreadful lurks, hidden behind a great gravitational lens of dark matter. Something horrific that howls and writhes and rages across three hundred million light-years of space–and is now heading straight for the Commonwealth and moving faster all the time.<br/><br/>One slim chance exists to avert catastrophe, and only Flinx can take it. Roaming the galaxy is a conscious planet-size weapons system, the legacy of a long-extinct race. As Flinx is the only one who has ever experienced mental contact with the machine, it is his job to find the powerful alien artifact and coax it into joining the battle against the behemoth from beyond.<br/><br/>So Pip and Flinx valiantly sail into the unknown aboard their little spaceship, which is immediately forced down for emergency repairs on planet Arrawd, home to less advanced sentients and therefore off-limits to space travelers. But what with Arrawd being very beautiful, and Flinx being Flinx, this particular rule doesn’t stand a chance.<br/><br/>Now, Flinx is no stranger to murderous attacks and stalking assassins—evading them occupies most of his waking hours–but to be besieged by hordes bent on worshipping him as a god? Worse still, escaping this fate is going to be as impossible as fulfilling his dire mission. What’s a deity to do?", "language": "en", "image": "https://images.isbndb.com/covers/16/12/9780345461612.jpg", "title_long": "Running from the Deity: A Pip & Flinx Adventure (Adventures of Pip & Flinx)", "edition": "Reprint", "dimensions": "Height: 6.9 Inches, Length: 4.15 Inches, Weight: 0.330693393 Pounds, Width: 0.8 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 4.15}, "width": {"unit": "inches", "value": 0.8}, "weight": {"unit": "pounds", "value": 0.330693393}, "height": {"unit": "inches", "value": 6.9}}, "pages": 304, "date_published": "2006-11-28", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Action & Adventure', 'Science Fiction & Fantasy', 'Science Fiction', 'Adventure', 'Space Opera', 'Exploration'], 'authors": ["Alan Dean Foster'], 'title": "Running from the Deity: A Pip & Flinx Adventure (Adventures of Pip & Flinx)", "isbn13": "9780345461612", "msrp": 7.99, 'binding": "Mass Market Paperback", "isbn": "0345461614", "isbn10": "0345461614"}}