{"book": {"publisher": "Ballantine Books", "synopsis": "Why does God exist? How have the three dominant monotheistic religions—Judaism, Christianity, and Islam—shaped and altered the conception of God? How have these religions influenced each other? In this stunningly intelligent book, Karen Armstrong, one of Britain"s foremost commentators on religious affairs, traces the history of how men and women have perceived and experienced God, from the time of Abraham to the present.<br/><br/>The epic story begins with the Jews" gradual transformation of pagan idol worship in Babylon into true monotheism—a concept previously unknown in the world. Christianity and Islam both rose on the foundation of this revolutionary idea, but these religions refashioned "the One God' to suit the social and political needs of their followers. From classical philosophy and medieval mysticism to the Reformation, Karen Armstrong performs the near miracle of distilling the intellectual history of monotheism into one superbly readable volume, destined to take its place as a classic.<br/><br/>Praise for History of God<br/><br/>“An admirable and impressive work of synthesis that will give insight and satisfaction to thousands of lay readers.”—The Washington Post Book World<br/><br/>“A brilliantly lucid, spendidly readable book. [Karen] Armstrong has a dazzling ability: she can take a long and complex subject and reduce it to the fundamentals, without oversimplifying.”—The Sunday Times (London)<br/><br/>“Absorbing . . . A lode of learning.”—Time<br/><br/>“The most fascinating and learned study of the biggest wild goose chase in history—the quest for God. Karen Armstrong is a genius.”—A.N. Wilson, author of Jesus: A Life', 'language": "en", "image": "https://images.isbndb.com/covers/45/60/9780345384560.jpg", "title_long": "A History of God: The 4,000-Year Quest of Judaism, Christianity and Islam", "edition": "Reprint", "dimensions": "Height: 8.21 Inches, Length: 5.43 Inches, Weight: 0.87 Pounds, Width: 0.99 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.43}, "width": {"unit": "inches", "value": 0.99}, "weight": {"unit": "pounds", "value": 0.87}, "height": {"unit": "inches", "value": 8.21}}, "pages": 496, "date_published": "1994-08-09", "subjects": ["Christian Books & Bibles', 'Christian Living', 'Worship & Devotion', 'History', 'World', 'Religious', 'Religion & Spirituality', 'Judaism', 'Religious Studies', 'Comparative Religion', 'Ritual', 'Faith'], 'authors": ["Karen Armstrong'], 'title": "A History of God: The 4,000-Year Quest of Judaism, Christianity and Islam", "isbn13": "9780345384560", "msrp": 18, "binding": "Paperback", "related": {"ePub": "0307798585"}, "isbn": "0345384563", "isbn10": "0345384563", "other_isbns": [{'isbn": "9780307798589", "binding": "printisbn"}]}}