{"book": {"publisher": "Del Rey", "synopsis": "Critics have compared the engrossing space operas of Peter F. Hamilton to the classic sagas of such sf giants as Isaac Asimov and Frank Herbert. But Hamilton’s bestselling fiction—powered by a fearless imagination and world-class storytelling skills—has also earned him comparison to Tolstoy and Dickens. Hugely ambitious, wildly entertaining, philosophically stimulating: the novels of Peter F. Hamilton will change the way you think about science fiction. Now, with Pandora’s Star, he begins a new multivolume adventure, one that promises to be his most mind-blowing yet.<br/><br/>The year is 2380. The Intersolar Commonwealth, a sphere of stars some four hundred light-years in diameter, contains more than six hundred worlds, interconnected by a web of transport “tunnels” known as wormholes. At the farthest edge of the Commonwealth, astronomer Dudley Bose observes the impossible: Over one thousand light-years away, a star . . . vanishes. It does not go supernova. It does not collapse into a black hole. It simply disappears. Since the location is too distant to reach by wormhole, a faster-than-light starship, the Second Chance, is dispatched to learn what has occurred and whether it represents a threat. In command is Wilson Kime, a five-time rejuvenated ex-NASA pilot whose glory days are centuries behind him.<br/><br/>Opposed to the mission are the Guardians of Selfhood, a cult that believes the human race is being manipulated by an alien entity they call the Starflyer. Bradley Johansson, leader of the Guardians, warns of sabotage, fearing the Starflyer means to use the starship’s mission for its own ends,.<br/><br/>Pursued by a Commonwealth special agent convinced the Guardians are crazy but dangerous, Johansson flees. But the danger is not averted. Aboard the Second Chance, Kime wonders if his crew has been infiltrated. Soon enough, he will have other worries. A thousand light-years away, something truly incredible is waiting: a deadly discovery whose unleashing will threaten to destroy the Commonwealth . . . and humanity itself.<br/><br/>Could it be that Johansson was right?", "language": "en", "image": "https://images.isbndb.com/covers/16/29/9780345461629.jpg", "title_long": "Pandora"s Star", "edition": "First Edition", "dimensions": "Height: 9.25 Inches, Length: 6.25 Inches, Weight: 2.3 Pounds, Width: 2 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.25}, "width": {"unit": "inches", "value": 2}, "weight": {"unit": "pounds", "value": 2.3}, "height": {"unit": "inches", "value": 9.25}}, "pages": 768, "date_published": "2004-03-02", "subjects": ["Science Fiction & Fantasy', 'Science Fiction', 'Adventure', 'Space Opera'], 'authors": ["Peter F. Hamilton'], 'title": "Pandora"s Star", 'isbn13": "9780345461629", "msrp": 26.95, "binding": "Hardcover", "related": {"ePub": "0345472195"}, "isbn": "0345461622", "isbn10": "0345461622", "other_isbns": [{'isbn": "9780345472199", "binding": "printisbn"}]}}