{"book": {"publisher": "Ballantine Books", "synopsis": "“Michael Malice is one of the most puzzling twenty-first century Americans I have ever met.”<br/>–Harvey Pekar<br/><br/>Who’s Michael Malice, and how did he become the subject of a graphic novel by Harvey Pekar, the curmudgeon from Cleveland?<br/><br/>First of all, Michael Malice is a real person. He’s 5’6” and weighs 130 pounds. Although on the cusp of thirty, he could easily pass for a scrawny teenager.<br/><br/>One day Michael, a guy with a patchwork employment record and dreams as big as his ego, meets Harvey and begins to relay all these wild stories about his life. Simple as that. Harvey thinks the guy is bright but a bit of a riddle–though not the kind wrapped in an enigma. It’s strange. He seems like the type of person you meet every day, rather ordinary, until you really get to know him. Then you realize he’s exceptional, unusual, and contradictory. Pleasant one minute, really nasty the next. But isn’t cruelty part of human nature? We digress. . . .<br/><br/>Harvey writes up and illustrates one of Michael Malice’s tales, “Fish Story,” which is part of American Splendor: Our Movie Year. It makes a splash and spawns this book, Harvey’s first hardcover, a graphic novel event about one guy’s life.<br/><br/>Ego & Hubris relates how, a year and a half after his birth in the Ukraine, Michael Malice moved with his parents to Brooklyn. He’s an intransigent kid, a hard-ass–both a demon to and demonized by the people who cross his path. His life is a constant struggle for validation in a world where the machine keeps trying to break him down. But Michael has a way with people . . . or rather, has a way of getting even with people. Hey, if you can’t live up to your parents’ expectations, at least you can live up to your name.<br/><br/>Michael had never come close to fulfilling his huge dreams–until now. And just as Harvey’s been the everyman for a certain generation of graphic-novel readers, Michael Malice will be the everyman for a new generation.", "language": "en", "image": "https://images.isbndb.com/covers/93/96/9780345479396.jpg", "title_long": "Ego & Hubris: The Michael Malice Story", "edition": "First Edition", "dimensions": "Height: 9.5 Inches, Length: 6.25 Inches, Weight: 0.9 Pounds, Width: 0.75 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.25}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 0.9}, "height": {"unit": "inches", "value": 9.5}}, "pages": 160, "date_published": "2006-04-11", "subjects": ["Biographies & Memoirs', 'Memoirs', 'Comics & Graphic Novels', 'Manga', 'Nonfiction', 'Self Service', 'Custom Stores'], 'authors": ["Harvey Pekar'], 'title": "Ego & Hubris: The Michael Malice Story", "isbn13": "9780345479396", "msrp": 19.95, 'binding": "Hardcover", "isbn": "0345479394", "isbn10": "0345479394"}}