{"book": {"publisher": "Ballantine Books", "synopsis": "From the award-winning author of Altered Carbon and Broken Angels–a turbocharged new thriller set in a world where killers are stars, media is mass entertainment,<br/>and freedom is a dangerous proposition . . .<br/><br/>A coup in Cambodia. Guns to Guatemala. For the men and women of Shorn Associates, opportunity is calling. In the superheated global village of the near future, big money is made by finding the right little war and supporting one side against the other–in exchange for a share of the spoils. To succeed, Shorn uses a new kind of corporate gladiator: sharp-suited, hard-driving gunslingers who operate armored vehicles and follow a Samurai code. And Chris Faulkner is just the man for the job.<br/><br/>He fought his way out of London’s zone of destitution. And his kills are making him famous. But unlike his best friend and competitor at Shorn, Faulkner has a side that outsiders cannot see: the side his wife is trying to salvage, that another woman–a porn star turned TV news reporter–is trying to exploit. Steeped in blood, eyed by common criminals looking for a shot at fame, Faulkner is living on borrowed time. Until he’s given one last shot at getting out alive. . . .", "language": "en", "image": "https://images.isbndb.com/covers/77/45/9780345457745.jpg", "title_long": "Market Forces: A Novel", "dimensions": "Height: 9.21 Inches, Length: 6.21 Inches, Weight: 1.1375 Pounds, Width: 0.98 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.21}, "width": {"unit": "inches", "value": 0.98}, "weight": {"unit": "pounds", "value": 1.1375}, "height": {"unit": "inches", "value": 9.21}}, "pages": 464, "date_published": "2005-03-01", "subjects": ["Literature & Fiction', 'Humor & Satire', 'Satire', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Science Fiction & Fantasy', 'Science Fiction', 'Adventure', 'Hard Science Fiction', 'Cyberpunk', 'Teen & Young Adult'], 'authors": ["Richard K. Morgan'], 'title": "Market Forces: A Novel", "isbn13": "9780345457745", "msrp": 14.48, "binding": "Paperback", "related": {"Kindle Edition": "0345457765", "ePub": "0345457765"}, "isbn": "0345457749", "isbn10": "0345457749", "other_isbns": [{'isbn": "9780345457769", "binding": "printisbn"}]}}