{"book": {"publisher": "Ballantine Books", "synopsis": "Skilled in passion, artful in deception, and driven by betrayal, she is the glittering center of the royal court–but the most desired woman of Renaissance France will draw the wrath of a dangerous adversary.<br/><br/>Paris, 1575. The consort of some of Europe’s most influential men, Gabrielle Cheney is determined to secure her future by winning the heart of Henry, the Huguenot king of Navarre. As his mistress, Gabrielle hopes she might one day become the power behind the French throne. But her plans are jeopardized by Captain Nicolas Rémy, a devoted warrior whose love Gabrielle desires–and fears–above all. She will also incur the malevolence of the Dark Queen, Catherine de’ Medici, whose spies and witch-hunters are legion, and who will summon the black arts to maintain her authority. With the lives of those she loves in peril, Gabrielle must rebel against her queen to fulfill a glorious destiny she has sacrificed everything to gain.<br/><br/>Alive with vivid period detail and characters as vibrant as they are memorable, The Courtesanis a sweeping historical tale of dangerous intrigues, deep treachery, and one woman’s unshakable resolve to honor her heart.", "language": "en", "image": "https://images.isbndb.com/covers/79/76/9780345437976.jpg", "title_long": "The Courtesan: A Novel (The Dark Queen Saga)", "edition": "English Language", "dimensions": "Height: 7.99 Inches, Length: 5.17 Inches, Weight: 0.91 Pounds, Width: 1.22 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.17}, "width": {"unit": "inches", "value": 1.22}, "weight": {"unit": "pounds", "value": 0.91}, "height": {"unit": "inches", "value": 7.99}}, "pages": 534, "date_published": "2005-07-26", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense', 'Romance', 'Self Service', 'Custom Stores'], 'authors": ["Susan Carroll'], 'title": "The Courtesan: A Novel (The Dark Queen Saga)", "isbn13": "9780345437976", "msrp": 12.16, "binding": "Paperback", "related": {"ePub": "0345484649"}, "isbn": "0345437977", "isbn10": "0345437977", "other_isbns": [{'isbn": "9780345484642", "binding": "printisbn"}]}}