{"book": {"publisher": "Ballantine Books", "synopsis": "NEW YORK TIMES BESTSELLER • “This is Jeff Shaara at his best, giving us another superb [and] historically grounded novel of one of the most dramatic struggles of World War II.”—George McGovern<br/><br/>Utilizing the voices of the conflict’s most heroic figures, some immortal and some unknown, Jeff Shaara tells the story of America’s pivotal role in World War II: fighting to hold back the Japanese conquest of the Pacific while standing side-by-side with her British ally, the last hope for turning the tide of the war against Germany. As British and American forces strike into the soft underbelly of Hitler’s Fortress Europa, the new weapons of war come clearly into focus.<br/><br/>In North Africa, tank battles unfold in a tapestry of dust and fire unlike any the world has ever seen. In Sicily, the Allies attack their enemy with a barely tested weapon: the paratrooper. As battles rage along the coasts of the Mediterranean, the momentum of the war begins to shift, setting the stage for the Battle of Normandy. The first book in a trilogy about the military conflict that defined thetwentieth century, The Rising Tide is an unprecedented and intimate portrait of those who waged this astonishing global war.<br/><br/>Praise for The Rising Tide<br/><br/>“[A] sprawling tale thoroughly researched and told withmeticulous detail . . . All that’s missing is the smell of gunpowder.”—MSNBC online<br/><br/>“Masterful.”—Publishers Weekly (starred review)<br/><br/>“The Rising Tide imparts the actual sights, sounds and dialogue from the grounds of 1940s Sicily and North Africa.”—New York Daily News", "language": "en", "image": "https://images.isbndb.com/covers/14/14/9780345461414.jpg", "title_long": "The Rising Tide: A Novel of World War II", "edition": "First Edition", "dimensions": "Height: 9.57 Inches, Length: 6.51 Inches, Weight: 2.07454988542 Pounds, Width: 1.54 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.51}, "width": {"unit": "inches", "value": 1.54}, "weight": {"unit": "pounds", "value": 2.07454988542}, "height": {"unit": "inches", "value": 9.57}}, "pages": 576, "date_published": "2006-11-07", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'War', 'Action & Adventure', 'War & Military', 'United States', 'Self Service', 'Custom Stores'], 'authors": ["Jeff Shaara'], 'title": "The Rising Tide: A Novel of World War II", "isbn13": "9780345461414", "msrp": "0.00", "binding": "Hardcover", "isbn": "034546141X", "isbn10": "034546141X", "other_isbns": [{'isbn": "9780345495334", "binding": "printisbn"}]}}