{"book": {"publisher": "Ballantine Books", "synopsis": "In the latest installment of The Vampire Chronicles, Anne Rice summons up dazzling worlds to bring us the story of Armand - eternally young, with the face of a Botticelli angel. Armand, who first appeared in all his dark glory more than twenty years ago in the now-classic Interview with the Vampire, the first of The Vampire Chronicles, the novel that established its author worldwide as a magnificent storyteller and creator of magical realms.<br/><br/>Now, we go with Armand across the centuries to the Kiev Rus of his boyhood - a ruined city under Mongol dominion - and to ancient Constantinople, where Tartar raiders sell him into slavery. And in a magnificent palazzo in the Venice of the Renaissance we see him emotionally and intellectually in thrall to the great vampire Marius, who masquerades among humankind as a mysterious, reclusive painter and who will bestow upon Armand the gift of vampiric blood.<br/><br/>As the novel races to its climax, moving through scenes of luxury and elegance, of ambush, fire, and devil worship to nineteenth-century Paris and today"s New Orleans, we see its eternally vulnerable and romantic hero forced to choose between his twilight immortality and the salvation of his immortal soul.", "language": "en", "image": "https://images.isbndb.com/covers/48/07/9780345434807.jpg", "title_long": "The Vampire Armand (The Vampire Chronicles) Book 6", "edition": "First Edition", "dimensions": "Height: 6.86 Inches, Length: 4.17 Inches, Weight: 0.52 Pounds, Width: 0.95 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.17}, "width": {"unit": "inches", "value": 0.95}, "weight": {"unit": "pounds", "value": 0.52}, "height": {"unit": "inches", "value": 6.86}}, "pages": 457, "date_published": "2000-10-03", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Horror', 'United States', 'Contemporary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Historical', 'Supernatural', 'Science Fiction & Fantasy', 'Fantasy', 'Paranormal & Urban', 'Romantic', 'Self Service', 'Custom Stores'], 'authors": ["Anne Rice'], 'title": "The Vampire Armand (The Vampire Chronicles) Book 6", "isbn13": "9780345434807", "msrp": 7.99, "binding": "Mass Market Paperback", "related": {"Kindle Edition": "0345464532", "ePub": "0345464532"}, "isbn": "0345434803", "isbn10": "0345434803", "other_isbns": [{'isbn": "9780345464538", "binding": "printisbn"}]}}