{"book": {"publisher": "Ballantine Books", "synopsis": "“[A] fantastically hopped-up thriller . . . a wrong-man plot worthy of Hitchcock.”—Entertainment Weekly (Editor’s Choice)<br/><br/>In development as a major motion picture!<br/><br/>It’s three thousand miles from the green fields of glory, where Henry “call me Hank” Thompson once played California baseball, to the Lower East Side of Manhattan, where the tenements are old, the rents are high, and the drunks are dirty. But now Hank is here, working as a bartender and taking care of a cat named Bud who is surely going to get him killed.<br/><br/>It begins when Hank’s neighbor, Russ, has to leave town in a rush and hands over Bud in a carrier. But it isn’t until two Russians in tracksuits drag Hank over the bar at the joint where he works and beat him to a pulp that he starts to get the idea: Someone wants something from him. He just doesn’t know what it is, where it is, or how to make them understand he doesn’t have it.<br/><br/>Within twenty-four hours Hank is running over rooftops, swinging his old aluminum bat for the sweet spot of a guy’s head, playing hide and seek with the NYPD, riding the subway with a dead man at his side, and counting a whole lot of cash on a concrete floor.<br/><br/>All because of two cowboys, two Russian mafia men, and some of the weirdest goons ever assembled in one place. All because of Bud. All because once, in another life, in another world, the only thing Hank wanted was to take third base—without getting caught.", "language": "en", "image": "https://images.isbndb.com/covers/47/81/9780345464781.jpg", "title_long": "Caught Stealing: A Novel (Henry Thompson)", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.22 Inches, Weight: 0.51147244784 Pounds, Width: 0.58 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.22}, "width": {"unit": "inches", "value": 0.58}, "weight": {"unit": "pounds", "value": 0.51147244784}, "height": {"unit": "inches", "value": 8}}, "pages": 272, "date_published": "2005-05-31", "subjects": ["Literature & Fiction', 'Genre Fiction', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Hard-Boiled', 'Thrillers & Suspense', 'Suspense', 'Crime', 'Self Service', 'Custom Stores'], 'authors": ["Charlie Huston'], 'title": "Caught Stealing: A Novel (Henry Thompson)", "isbn13": "9780345464781", "msrp": 16, 'binding": "Paperback", "isbn": "0345464788", "isbn10": "0345464788"}}