{"book": {"publisher": "Ballantine Books", "synopsis": "From the New York Times bestselling author of The Jetsetters . . . Years ago, five-year-old Ellie disappeared. But then her sister finds her photograph in the pages of a magazine, leading her to ask: Was Ellie ever really missing?<br/><br/>“Invites comparison to The Lovely Bones . . . Ward’s depiction of family, with its attendant love and guilt, will keep you turning pages.”—People<br/><br/>Joseph and Isabelle Winters seem to have it all: a grand home in Holt, New York, a trio of radiant daughters, and a sense that they are safe in their affluent corner of America. But when five-year-old Ellie disappears, the fault lines within the family are exposed: Joseph, once a successful businessman, succumbs to his demons; Isabelle retreats into memories of her debutante days in Savannah; and Ellie’s bereft sisters grow apart—Madeline reluctantly stays home, while Caroline runs away.<br/><br/>Fifteen years later, Caroline, now a New Orleans cocktail waitress, sees a photograph of a woman in a magazine. Convinced that it is Ellie all grown up, Caroline embarks on a search for her missing sister. Armed with copies of the photo, an amateur detective guide, and a cooler of Dixie beer, Caroline travels through the New Mexico desert, the mountains of Colorado, and the smoky underworld of Montana, determined to salvage her broken family.", "language": "en", "image": "https://images.isbndb.com/covers/31/71/9780345483171.jpg", "title_long": "How to Be Lost: A Novel", "edition": "Reprint", "dimensions": "Height: 7.9 Inches, Length: 5.15 Inches, Weight: 0.52 Pounds, Width: 0.74 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.15}, "width": {"unit": "inches", "value": 0.74}, "weight": {"unit": "pounds", "value": 0.52}, "height": {"unit": "inches", "value": 7.9}}, "pages": 305, "date_published": "2005-08-30", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Family Saga', 'Short Stories & Anthologies', 'Short Stories', 'Action & Adventure', 'Humor & Satire', 'Literary', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Self Service', 'Custom Stores'], 'authors": ["Amanda Eyre Ward'], 'title": "How to Be Lost: A Novel", "isbn13": "9780345483171", "msrp": 13.95, "binding": "Paperback", "related": {"ePub": "0812988396"}, "isbn": "0345483170", "isbn10": "0345483170", "other_isbns": [{'isbn": "9780812988390", "binding": "printisbn"}]}}