{"book": {"publisher": "Ballantine Books", "synopsis": "New York City, 1972—A dabbler in mathematics and chess, Catherine Velis is also a computer expert for a Big Eight accounting firm. Before heading off to a new assignment in Algeria, Cat has her palm read by a fortune-teller. The woman warns Cat of danger. Then an antiques dealer approaches Cat with a mysterious offer: He has an anonymous client who is trying to collect the pieces of an ancient chess service, purported to be in Algeria. If Cat can bring the pieces back, there will be a generous reward.<br/><br/>The South of France, 1790—Mireille de Remy and her cousin Valentine are young novices at the fortresslike Montglane Abbey. With France aflame in revolution, the two girls burn to rebel against constricted convent life—and their means of escape is at hand. Buried deep within the abbey are pieces of the Montglane Chess Service, once owned by Charlemagne. Whoever reassembles the pieces can play a game of unlimited power. But to keep the Game a secret from those who would abuse it, the two young women must scatter the pieces throughout the world. . . .", "language": "en", "image": "https://images.isbndb.com/covers/90/88/9780345419088.jpg", "title_long": "The Eight: A Novel", "edition": "Reprint", "dimensions": "Height: 8.02 Inches, Length: 5.11 Inches, Weight: 1.3 Pounds, Width: 1.31 inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.11}, "width": {"unit": "inches", "value": 1.31}, "weight": {"unit": "pounds", "value": 1.3}, "height": {"unit": "inches", "value": 8.02}}, "pages": 624, "date_published": "1997-06-23", "subjects": ["Literature & Fiction', 'Action & Adventure', 'United States', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Spies & Politics', 'Suspense', 'Technothrillers', 'Crime', 'Historical', 'Supernatural', 'Self Service', 'Custom Stores'], 'authors": ["Katherine Neville'], 'title": "The Eight: A Novel", "isbn13": "9780345419088", "msrp": 17, 'binding": "Paperback", "isbn": "0345419081", "isbn10": "0345419081"}}