{"book": {"publisher": "Random House Publishing Group", "synopsis": "Former president Jimmy Carter reflects on aging, blending memoir, anecdote, political savvy, and practical advice to truly illuminate the rich promises of growing older.<br/><br/>“As we"ve grown older, the results have been surprisingly good,” writes former president Jimmy Carter in this wise, deeply personal meditation on the new experiences that come to us with age. President Carter had never enjoyed more prestige or influence on the world stage, nor had he ever felt more profound happiness with himself, with his accomplishments, and with his beloved wife, Rosalynn, than in his golden years. In The Virtues of Aging, Jimmy Carter shares the knowledge and the pleasures that age have brought him.<br/><br/>The approach to old age was not an easy one for President Carter. At fifty-six, having lost a presidential election, he found himself involuntarily retired from a job he loved and facing a large debt on his farm and warehouse business. President Carter writes movingly here of how he and Rosalynn overcame their despair and disappointment as together they met the challenges ahead.<br/><br/>President Carter delves into issues he and millions of others confront in planning for retirement, undertaking new diet and exercise regimens, coping with age prejudice, and sorting out key political questions. On a more intimate level, Carter paints a glowing portrait of his happy marriage to Rosalynn, a relationship that deepened when they became grandparents. Here too are fascinating sketches of world leaders, Nobel laureates, and great thinkers President Carter has been privileged to know—and the valuable lessons on aging he learned from them.<br/><br/>The Virtues of Aging celebrates both the blessings that come to us as we grow older and the blessings older people can bestow upon others. An important and moving book, written with gentleness, humor, and love, The Virtues of Aging is a treasure for readers of all ages.", "language": "en", "image": "https://images.isbndb.com/covers/59/28/9780345425928.jpg", "title_long": "The Virtues of Aging (Library of Contemporary Thought)", "edition": "Reissue", "dimensions": "Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.3747858454 Pounds, Width: 0.37 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.37}, "weight": {"unit": "pounds", "value": 0.3747858454}, "height": {"unit": "inches", "value": 8.25}}, "pages": 160, "date_published": "1998-10-13", "subjects": ["Biographies & Memoirs', 'Leaders & Notable People', 'Military', 'Presidents & Heads of State', 'Health, Fitness & Dieting', 'Aging', 'Parenting & Relationships', 'Politics & Social Sciences', 'Social Sciences', 'Customs & Traditions', 'Gerontology', 'Sociology', 'Self Service', 'Custom Stores'], 'authors": ["Jimmy Carter'], 'title": "The Virtues of Aging (Library of Contemporary Thought)", "isbn13": "9780345425928", "msrp": 15, "binding": "Paperback", "related": {"ePub": "0307764664"}, "isbn": "0345425928", "isbn10": "0345425928", "other_isbns": [{'isbn": "9780307764669", "binding": "printisbn"}]}}