{"book": {"publisher": "Ballantine Books", "synopsis": "A POWERFUL, DEEPLY MOVING NARRATIVE OF HOPE REBORN<br/>IN THE SHADOW OF DESPAIR<br/><br/>Fifty years after it was bombed to rubble, Berlin is once again a city in which Jews gather for the Passover seder. Paris and Antwerp have recently emerged as important new centers of Jewish culture. Small but proud Jewish communities are revitalizing the ancient centers of Budapest, Prague, and Amsterdam. These brave, determined Jewish men and women have chosen to settle–or remain–in Europe after the devastation of the Holocaust, but they have paid a price. Among the unexpected dangers, they have had to cope with an alarming resurgence of Nazism in Europe, the spread of Arab terrorism, and the impact of the Jewish state on European life.<br/><br/>Delving into the intimate stories of European Jews from all walks of life, Kurlansky weaves together a vivid tapestry of individuals sustaining their traditions, and flourishing, in the shadow of history. An inspiring story of a tenacious people who have rebuilt their lives in the face of incomprehensible horror, A Chosen Few is a testament to cultural survival and a celebration of the deep bonds that endure between Jews and European civilization.<br/><br/>“Consistently absorbing . . . A Chosen Few investigates the relatively uncharted territory of an encouraging phenomenon.”<br/>–Los Angeles Times<br/><br/>“I can think of no book that portrays with such intelligence, historical understanding, and journalistic flair what life has been like for Jews determined to build lives in Europe.”<br/>–SUSAN MIRON<br/>Forward", "language": "en", "image": "https://images.isbndb.com/covers/81/49/9780345448149.jpg", "title_long": "A Chosen Few: The Resurrection of European Jewry (Ballantine Reader"s Circle)", "edition": "First Thus", "dimensions": "Height: 8.23 Inches, Length: 5.54 Inches, Weight: 0.9369646135 Pounds, Width: 0.99 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.54}, "width": {"unit": "inches", "value": 0.99}, "weight": {"unit": "pounds", "value": 0.9369646135}, "height": {"unit": "inches", "value": 8.23}}, "pages": 464, "date_published": "2002-03-26", "subjects": ["History', 'Europe', 'World', 'Jewish'], 'authors": ["Mark Kurlansky'], 'title": "A Chosen Few: The Resurrection of European Jewry (Ballantine Reader"s Circle)", 'isbn13": "9780345448149", "msrp": "0.00", "binding": "Paperback", "related": {"Kindle Edition": "0307482898", "ePub": "0307482898"}, "isbn": "0345448146", "isbn10": "0345448146", "other_isbns": [{'isbn": "9780307482891", "binding": "printisbn"}]}}