{"book": {"publisher": "Random House Worlds", "synopsis": "Celebrate the fortieth anniversary of Star Trek® with the original mission logs chronicling some of the crew’s most bizarre missions and strangest encounters with alien races across the galaxy . . . where no man has gone before™.<br/><br/>The Counter-Clock Incident<br/>The Enterprise’s first captain, Commodore Robert April, is aboard the starship one last time en route to his retirement ceremonies. On the way, Kirk attempts to save an alien ship headed straight for the Beta Niobe Nova.<br/><br/>Instead, the Enterprise plunges through the heart of the nova and into an alternate universe where everything runs backward. Day is night, stars are black not white, and time flows into the past as people get younger with every breath they take.<br/><br/>The Eye of the Beholder<br/>When the Enterprise is sent to investigate a missing starship near Lactran VII, Kirk beams down to discover the Lactrans are giant, highly intelligent slugs, who admire humans for one reason: they make lovely pets.<br/><br/>The situation appears hopeless when the landing party is locked up as exhibits in the planet’s zoo. Amazingly, Spock manages to convince the Lactrans that humans are not dumb animals and they agree to let the crew go—on one condition. Kirk and company must become interstellar big-game hunters and capture the powerful, ferocious jawanda on a remote planet.", "language": "en", "image": "https://images.isbndb.com/covers/58/46/9780345495846.jpg", "title_long": "Star Trek Logs Seven and Eight", "dimensions": "Height: 7.9 Inches, Length: 5.2 Inches, Weight: 0.59965735264 Pounds, Width: 1.1 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 1.1}, "weight": {"unit": "pounds", "value": 0.59965735264}, "height": {"unit": "inches", "value": 7.9}}, "pages": 368, "date_published": "2006-09-05", "subjects": ["Literature & Fiction', 'Genre Fiction', 'TV, Movie, Video Game Adaptations', 'United States', 'Science Fiction & Fantasy', 'Science Fiction', 'Adventure', 'Space Opera'], 'authors": ["Alan Dean Foster'], 'title": "Star Trek Logs Seven and Eight", "isbn13": "9780345495846", "msrp": 13.95, 'binding": "Paperback", "isbn": "0345495845", "isbn10": "0345495845"}}