{"book": {"publisher": "Ballantine Books", "synopsis": "From the bestselling author of London and Sarum—amagnificent epic about love and battle, family life and political intrigue in Ireland over the course of eleven centuries. The Princes of Ireland brilliantly weaves impeccable historical research and mesmerizing storytelling in capturing the essence of a place and its people.<br/><br/>Edward Rutherfurd has introduced millions of readers to the human dramas that are the lifeblood of history. From his first bestseller, Sarum, to the international sensation London, he has captivated audiences with gripping narratives that follow the fortunes of several fictional families down through the ages. The Princes of Ireland, a sweeping panorama steeped in the tragedy and glory that is Ireland, epitomizes the power and richness of Rutherfurd"s storytelling magic.<br/><br/>The saga begins in tribal, pre-Christian Ireland during the reign of the fierce and mighty High Kings at Tara, with the tale of two lovers, the princely Conall and the ravishing Deirdre, whose travails cleverly echo the ancient Celtic legend of Cuchulainn. From that stirring beginning, Rutherfurd takes the reader on a powerfully-imagined journey through the centuries. Through the interlocking stories of a memorable cast of characters—druids and chieftains, monks and smugglers, noblewomen and farmwives, merchants and mercenaries, rebels and cowards—we see Ireland through the lens of its greatest city.<br/><br/>While vividly and movingly conveying the passions and struggles that shaped the character of Dublin, Rutherfurd portrays the major events in Irish history: The tribal culture of pagan Ireland; the mission of St. Patrick; the coming of the Vikings and the founding of Dublin; the glories of the great nearby monastery of Glendalough and the making of treasures like the Book of Kells; the extraordinary career of Brian Boru; the trickery of Henry II, which gave England its first foothold in Medieval Ireland. The stage is then set for the great conflict between the English kings and the princes of Ireland, and the disastrous Irish invasion of England, which incurred the wrath of Henry VIII and where this book, the first of the two part Dublin Saga, draws to a close, as the path of Irish history takes a dramatic and irrevocable turn.<br/><br/>Rich, colorful and impeccably researched, The Princes of Ireland is epic entertainment spun by a master.", "language": "en", "image": "https://images.isbndb.com/covers/23/59/9780345472359.jpg", "title_long": "The Princes of Ireland: The Dublin Saga", "edition": "Reprint", "dimensions": "Height: 8.21 Inches, Length: 5.45 Inches, Weight: 1.3125 Pounds, Width: 1.38 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.45}, "width": {"unit": "inches", "value": 1.38}, "weight": {"unit": "pounds", "value": 1.3125}, "height": {"unit": "inches", "value": 8.21}}, "pages": 800, "date_published": "2005-03-01", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Family Saga', 'Historical', 'British & Irish', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Edward Rutherfurd'], 'title": "The Princes of Ireland: The Dublin Saga", "isbn13": "9780345472359", "msrp": 12.99, "binding": "Paperback", "related": {"ePub": "0385512570"}, "isbn": "0345472357", "isbn10": "0345472357", "other_isbns": [{'isbn": "9780385512572", "binding": "printisbn"}]}}