{"book": {"publisher": "Ballantine Books", "synopsis": "Since her first captivating book blazed onto bestseller lists, and through the many more that followed, Fern Michaels has entertained millions of devoted fans with sumptuous tales filled with hypnotic passion and full-scale emotion. Paramount among a list of more than fifty published titles, is her Texas series, an engaging tour de force tracing the exploits of the illustrious Coleman family--four generations of a powerful American dynasty. Here, for the first time in a hardcover edition, is the second volume of the timeless saga that began on a 250,000-acre spread called Sunbridge.<br/><br/>The magnificent Austin empire built by the domineering Seth Coleman before World War II now belongs to Moss and Billie"s daughter Maggie. She has invited the whole family--and several hundreds guests--to a Fourth of July barbecue in celebration of a renewed sense of family pride she"s determined to forge at Sunbridge. But as loved ones gather, they bring along old resentments and new temptations destined to generate more than a little heat.<br/><br/>Finally Maggie has decided to divorce Cranston Tanner. But as she struggles to be a good mother to her resentful son Cole, her love for a special man could cost her the loyalty of her family. In the meantime, Cole becomes locked in a bitter rivalry with his cousin Riley, heir apparent to Sunbridge, who is open and loving--and in very serious trouble-- while Maggie"s vulnerable daughter Sawyer, a brilliant aeronautics engineer nursing a broken heart, is about to face a much greater tragedy. And Maggie's sister, Susan, the renowned musician, arrives home for the most terrifying performance of her life.', 'language": "en", "image": "https://images.isbndb.com/covers/96/03/9780345449603.jpg", "title_long": "Texas Heat", "dimensions": "Height: 9.75 Inches, Length: 6 Inches, Weight: 1.45 Pounds, Width: 1.25 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1.25}, "weight": {"unit": "pounds", "value": 1.45}, "height": {"unit": "inches", "value": 9.75}}, "pages": 400, "date_published": "2001-11-27", "subjects": ["Literature & Fiction', 'Contemporary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense', 'Romance'], 'authors": ["Fern Michaels'], 'title": "Texas Heat", "isbn13": "9780345449603", "msrp": 15.95, 'binding": "Hardcover", "isbn": "0345449606", "isbn10": "0345449606"}}