{"book": {"publisher": "Random House Worlds", "synopsis": "From the Geonosian sonic blaster to the Wookiee bowcaster; from the Imperial energy grenade to the Yuuzhan Vong fire spitter; from dart shooters and laser cannons to Sun Crushers and World Devastators, find the facts about Star Wars firepower—and much more—in The New Essential Guide to Weapons & Technology.<br/><br/>There’s more to the arms, artillery, and exotic equipment of the Star Wars galaxy than Jedi lightsabers and blasters. Species such as the tree-dwelling Wookiees, the amphibious Gungans, and the deadly Yuuzhan Vong have yielded a staggering array of unique weapons and devices. And as the Star Wars mythos continues to grow—in prequels and video games, on screen, in print, and beyond—these remarkable technical creations also multiply and evolve.<br/><br/>The New Essential Guide to Weapons & Technology is the fully updated and greatly expanded reference resource that organizes and explains every key class, make, and model of Star Wars munitions—from the smallest personal sidearms to the most devastating interplanetary superweapons—along with a host of other high-tech paraphernalia. This exhaustive compendium includes:<br/><br/>• New in this edition: A fascinating look at the historical significance of Star Wars weaponry and the major technological turning points—including the Clone Wars, the creation of the first Death Star, and the Yuuzhan Vong invasion<br/>• A roster of the major manufacturers who created the most powerful armaments for the Old and New Republics, the Empire, the Sith, the Rebel Alliance, andall of the exotic governments that populate the Star Wars galaxy<br/>• In-depth descriptions of more than 100 weapons and more than 100 additional devices used for defense, communication, survival, and security—including key technology featured in the films", "language": "en", "image": "https://images.isbndb.com/covers/90/30/9780345449030.jpg", "title_long": "The New Essential Guide to Weapons and Technology, Revised Edition (Star Wars)", "edition": "NO-VALUE", "dimensions": "Height: 10.8 Inches, Length: 8.52 Inches, Weight: 1.9510910187 Pounds, Width: 0.58 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 8.52}, "width": {"unit": "inches", "value": 0.58}, "weight": {"unit": "pounds", "value": 1.9510910187}, "height": {"unit": "inches", "value": 10.8}}, "pages": 224, "date_published": "2004-10-26", "subjects": ["Arts & Photography', 'Performing Arts', 'Humor & Entertainment', 'Movies', 'History & Criticism', 'Literature & Fiction', 'Genre Fiction', 'Action & Adventure', 'Reference', 'Science Fiction & Fantasy', 'Science Fiction', 'Adventure', 'Space Opera'], 'authors": ["Haden Blackman'], 'title": "The New Essential Guide to Weapons and Technology, Revised Edition (Star Wars)", "isbn13": "9780345449030", "msrp": 30, 'binding": "Paperback", "isbn": "0345449037", "isbn10": "0345449037"}}