{"book": {"publisher": "Ballantine Books", "synopsis": ""To quietly persevere in storing up what is learned, to continue studying without respite, to instruct others without growing weary--is this not me?"<br/>--Confucius<br/><br/>Confucius is recognized as China\"s first and greatest teacher, and his ideas have been the fertile soil in which the Chinese cultural tradition has flourished. Now, here is a translation of the recorded thoughts and deeds that best remember Confucius--informed for the first time by the manuscript version found at Dingzhou in 1973, a partial text dating to 55 BCE and only made available to the scholarly world in 1997. The earliest Analects yet discovered, this work provides us with a new perspective on the central canonical text that has defined Chinese culture--and clearly illuminates the spirit and values of Confucius.<br/><br/>Confucius (551-479 BCE) was born in the ancient state of Lu into an era of unrelenting, escalating violence as seven of the strongest states in the proto-Chinese world warred for supremacy. The landscape was not only fierce politically but also intellectually. Although Confucius enjoyed great popularity as a teacher, and many of his students found their way into political office, he personally had little influence in Lu. And so he began to travel from state to state as an itinerant philosopher to persuade political leaders that his teachings were a formula for social and political success. Eventually, his philosophies came to dictate the standard of behavior for all of society--including the emperor himself.<br/><br/>Based on the latest research and complete with both Chinese and English texts, this revealing translation serves both as an excellent introduction to Confucian thought and as an authoritative addition to sophisticated debate.', 'language": "en", "image": "https://images.isbndb.com/covers/40/74/9780345434074.jpg", "title_long": "The Analects of Confucius: A Philosophical Translation (Classics of Ancient China)", "edition": "1", "dimensions": "Height: 8.23 Inches, Length: 5.5 Inches, Weight: 0.70106999316 Pounds, Width: 0.79 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.79}, "weight": {"unit": "pounds", "value": 0.70106999316}, "height": {"unit": "inches", "value": 8.23}}, "pages": 352, "date_published": "1999-09-07", "subjects": ["Biographies & Memoirs', 'Historical', 'Asia', 'Professionals & Academics', 'Philosophers', 'Literature & Fiction', 'Genre Fiction', 'Religion & Spirituality', 'Other Eastern Religions & Sacred Texts', 'Confucianism'], 'authors": [], "title": "The Analects of Confucius: A Philosophical Translation (Classics of Ancient China)", "isbn13": "9780345434074", "msrp": 17, "binding": "Paperback", "related": {"ePub": "0307775712"}, "isbn": "0345434072", "isbn10": "0345434072", "other_isbns": [{'isbn": "9780307775719", "binding": "print"}]}}