{"book": {"publisher": "Del Rey", "synopsis": "Embark upon a quest rife with magic, wonder, and forces as dark as midnight. . . .<br/><br/>Parallel universes and grave danger are nothing new to Nathan Ward. During his last mission, he risked life and limb to retrieve the Grail for safekeeping. But Nathan’s adventures are just beginning. Lately his dreams have been transporting him to a desolate city whose people have fled—save for a sickly king and his daughter, Princess Nell. In their decaying hilltop castle, they live in the shadow of a terrifying curse inflicted by a sword that holds within its gleaming metal an ancient demon conjured by the universe’s most powerful wizard. It is a sword that brings death to anyone who dares to draw it from its sheath.<br/><br/>But the king is dying, and the legend claims that only a stranger can save him . . . and that this stranger alone is destined to awake—and defeat—the dark evil in the sword. But who among mortals and spirits could ever imagine that a boy materializing into alternate worlds still dressed in his pajamas could be the chosen one . . . the one entrusted with the long-lost plan to retrieve the Grail relics and save a dying cosmos?", "language": "en", "image": "https://images.isbndb.com/covers/08/06/9780345460806.jpg", "title_long": "The Sword of Straw: A Novel (The Sangreal Trilogy)", "dimensions": "Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.55 Pounds, Width: 0.75 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 0.55}, "height": {"unit": "inches", "value": 8.5}}, "pages": 320, "date_published": "2006-03-28", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Science Fiction & Fantasy', 'Fantasy', 'Epic', 'Paranormal & Urban'], 'authors": ["Amanda Hemingway'], 'title": "The Sword of Straw: A Novel (The Sangreal Trilogy)", "isbn13": "9780345460806", "msrp": 12.95, "binding": "Paperback", "related": {"ePub": "0345490800"}, "isbn": "0345460804", "isbn10": "0345460804", "other_isbns": [{'isbn": "9780345490803", "binding": "printisbn"}]}}