{"book": {"publisher": "Farrar, Straus and Giroux", "synopsis": "When three-month-old Lia Lee Arrived at the county hospital emergency room in Merced, California, a chain of events was set in motion from which neither she nor her parents nor her doctors would ever recover. Lia\"s parents, Foua and Nao Kao, were part of a large Hmong community in Merced, refugees from the CIA-run "Quiet War" in Laos. The Hmong, traditionally a close-knit and fiercely people, have been less amenable to assimilation than most immigrants, adhering steadfastly to the rituals and beliefs of their ancestors. Lia\'s pediatricians, Neil Ernst and his wife, Peggy Philip, cleaved just as strongly to another tradition: that of Western medicine. When Lia Lee Entered the American medical system, diagnosed as an epileptic, her story became a tragic case history of cultural miscommunication.<br/><br/>Parents and doctors both wanted the best for Lia, but their ideas about the causes of her illness and its treatment could hardly have been more different. The Hmong see illness aand healing as spiritual matters linked to virtually everything in the universe, while medical community marks a division between body and soul, and concerns itself almost exclusively with the former. Lia\'s doctors ascribed her seizures to the misfiring of her cerebral neurons; her parents called her illness, qaug dab peg--the spirit catches you and you fall down--and ascribed it to the wandering of her soul. The doctors prescribed anticonvulsants; her parents preferred animal sacrifices.<br/><br/>Winner of the National Book Critics Circle Award for Nonfiction.', 'language": "en", "image": "https://images.isbndb.com/covers/56/44/9780374525644.jpg", "title_long": "The Spirit Catches You and You Fall down: A Hmong Child, Her American Doctors, and the Collision of Two Cultures", "edition": "1ST NOONDA", "dimensions": "Height: 8.28 Inches, Length: 5.52 Inches, Weight: 0.79 Pounds, Width: 0.945 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.52}, "width": {"unit": "inches", "value": 0.945}, "weight": {"unit": "pounds", "value": 0.79}, "height": {"unit": "inches", "value": 8.28}}, "pages": 341, "date_published": "1998-09-28", "subjects": ["Literature & Fiction', 'History & Criticism', 'Regional & Cultural', 'Reference', 'Politics & Social Sciences', 'Social Sciences', 'Anthropology', 'Cultural', 'Sociology', 'Medicine'], 'authors": ["Anne Fadiman'], 'title": "The Spirit Catches You and You Fall down: A Hmong Child, Her American Doctors, and the Collision of Two Cultures", "isbn13": "9780374525644", "msrp": 15, 'binding": "Paperback", "isbn": "0374525641", "isbn10": "0374525641"}}