{"book": {"publisher": "Farrar, Straus and Giroux", "synopsis": "A page-turning novel that is also an exploration of the great philosophical concepts of Western thought, Jostein Gaarder\"s Sophie\"s World has fired the imagination of readers all over the world, with more than twenty million copies in print.<br/><br/>One day fourteen-year-old Sophie Amundsen comes home from school to find in her mailbox two notes, with one question on each: "Who are you?' and 'Where does the world come from?' From that irresistible beginning, Sophie becomes obsessed with questions that take her far beyond what she knows of her Norwegian village. Through those letters, she enrolls in a kind of correspondence course, covering Socrates to Sartre, with a mysterious philosopher, while receiving letters addressed to another girl. Who is Hilde? And why does her mail keep turning up? To unravel this riddle, Sophie must use the philosophy she is learning―but the truth turns out to be far more complicated than she could have imagined.', 'language": "en", "image": "https://images.isbndb.com/covers/07/16/9780374530716.jpg", "title_long": "Sophie"s World: A Novel About the History of Philosophy (Fsg Classics)", 'edition": "Reprint", "dimensions": "Height: 8.2677 Inches, Length: 5.9055 Inches, Weight: 0.95 Pounds, Width: 0.86614 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.9055}, "width": {"unit": "inches", "value": 0.86614}, "weight": {"unit": "pounds", "value": 0.95}, "height": {"unit": "inches", "value": 8.2677}}, "pages": 544, "date_published": "2007-03-20", "subjects": ["Literature & Fiction', 'Literary', 'Reference', 'Politics & Social Sciences', 'Philosophy', 'History & Surveys', 'Self Service', 'Custom Stores'], 'authors": ["Jostein Gaarder'], 'title": "Sophie"s World: A Novel About the History of Philosophy (Fsg Classics)", 'isbn13": "9780374530716", "msrp": 15, "binding": "Paperback", "isbn": "0374530718", "isbn10": "0374530718", "other_isbns": [{'isbn": "9781466804272", "binding": "printisbncanonical"}]}}