{"book": {"publisher": "Farrar, Straus and Giroux", "synopsis": "Jonathan Franzen arrived late, and last, in a family of boys in Webster Groves, Missouri. The Discomfort Zone is his intimate memoir of his growth from a "small and fundamentally ridiculous person," through an adolescence both excruciating and strangely happy, into an adult with embarrassing and unexpected passions. It\"s also a portrait of a middle-class family weathering the turbulence of the 1970s, and a vivid personal history of the decades in which America turned away from its midcentury idealism and became a more polarized society.<br/><br/>The story Franzen tells here draws on elements as varied as the explosive dynamics of a Christian youth fellowship in the 1970s, the effects of Kafka\'s fiction on his protracted quest to lose his virginity, the elaborate pranks that he and his friends orchestrated from the roof of his high school, his self-inflicted travails in selling his mother\'s house after her death, and the web of connections between his all-consuming marriage, the problem of global warming, and the life lessons to be learned in watching birds.<br/><br/>These chapters of a Midwestern youth and a New York adulthood are warmed by the same combination of comic scrutiny and unqualified affection that characterize Franzen\'s fiction, but here the main character is the author himself. Sparkling, daring, arrestingly honest, The Discomfort Zone narrates the formation of a unique mind and heart in the crucible of an everyday American family.', 'language": "en", "image": "https://images.isbndb.com/covers/91/94/9780374299194.jpg", "title_long": "The Discomfort Zone: A Personal History", "edition": "First Edition", "dimensions": "Height: 8.47 Inches, Length: 5.62 Inches, Weight: 0.78 Pounds, Width: 0.91 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.62}, "width": {"unit": "inches", "value": 0.91}, "weight": {"unit": "pounds", "value": 0.78}, "height": {"unit": "inches", "value": 8.47}}, "pages": 195, "date_published": "2006-09-05", "subjects": ["Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Memoirs', 'Self Service', 'Custom Stores'], 'authors": ["Jonathan Franzen'], 'title": "The Discomfort Zone: A Personal History", "isbn13": "9780374299194", "msrp": 22, "binding": "Hardcover", "isbn": "0374299196", "isbn10": "0374299196", "other_isbns": [{'isbn": "9780374707620", "binding": "print"}]}}