{"book": {"publisher": "Farrar, Straus and Giroux", "synopsis": "Beleaguered parents will breathe sighs of relief and gratitude over this bestselling guide to raising teenagers. In this revised edition, Dr. Anthony E. Wolf tackles the changes in recent years with the same wit and compassion as the original edition.<br/><br/>Delve into a practical and compassionate tour of adolescence, laden with insight and understanding. Embarking on an exploration that spans from understanding teen behaviors to communicating effectively with your teen, this book serves as a beacon for those lost in the labyrinth of parenting teens. With crucial additions focused on the influence of the internet, substance use, and LGBTQ+ youth, it adapts to the evolving landscapes your teenager might be trekking.<br/><br/>A much-needed counsel for those seeking to master the discipline and challenges of teenage parenting, this book also delves into the enigmatic workings of the teenage brain. Whether you"re an experienced guardian or a novice stepping into parenting boots, discover tactics to nurture and engage with your teenager better. Embark on this enlightening journey that not only helps you understand your teen’s world and the crucial role you possess in their expedition.", "language": "en", "image": "https://images.isbndb.com/covers/85/39/9780374528539.jpg", "title_long": "Get Out of My Life, but First Could You Drive Me & Cheryl to the Mall: A Parent"s Guide to the New Teenager, Revised and Updated", 'edition": "Revised", "dimensions": "Height: 8.1999836 Inches, Length: 5.55 Inches, Weight: 0.49 Pounds, Width: 0.65 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.55}, "width": {"unit": "inches", "value": 0.65}, "weight": {"unit": "pounds", "value": 0.49}, "height": {"unit": "inches", "value": 8.1999836}}, "pages": 240, "date_published": "2002-08-01", "subjects": ["Parenting & Relationships', 'Parenting', 'Teenagers'], 'authors": ["Anthony E. Wolf'], 'title": "Get Out of My Life, but First Could You Drive Me & Cheryl to the Mall: A Parent"s Guide to the New Teenager, Revised and Updated", 'isbn13": "9780374528539", "msrp": 16, "binding": "Paperback", "isbn": "0374528535", "isbn10": "0374528535", "other_isbns": [{'isbn": "9781466824232", "binding": "printisbncanonical"}]}}