{"book": {"publisher": "Vintage", "synopsis": "“There"s no writer alive like de Botton” (Chicago Tribune), and now this internationally heralded author turns his attention to the insatiable human quest for status—a quest that has less to do with material comfort than love.<br/><br/>Anyone who’s ever lost sleep over an unreturned phone call or the neighbor’s Lexus had better read Alain de Botton’s irresistibly clear-headed new book, immediately. For in its pages, a master explicator of our civilization and its discontents explores the notion that our pursuit of status is actually a pursuit of love, ranging through Western history and thought from St. Augustine to Andrew Carnegie and Machiavelli to Anthony Robbins.<br/><br/>Whether it’s assessing the class-consciousness of Christianity or the convulsions of consumer capitalism, dueling or home-furnishing, Status Anxiety is infallibly entertaining. And when it examines the virtues of informed misanthropy, art appreciation, or walking a lobster on a leash, it is not only wise but helpful.", "language": "en", "image": "https://images.isbndb.com/covers/53/57/9780375725357.jpg", "title_long": "Status Anxiety", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.2 Inches, Weight: 0.575 Pounds, Width: 0.71 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 0.71}, "weight": {"unit": "pounds", "value": 0.575}, "height": {"unit": "inches", "value": 8}}, "pages": 320, "date_published": "2005-05-10", "subjects": ["Self-Help', 'Happiness', 'Self-Esteem', 'Health, Fitness & Dieting', 'Psychology & Counseling', 'Social Psychology & Interactions', 'Reference', 'Politics & Social Sciences', 'Philosophy', 'History & Surveys', 'Movements'], 'authors": ["Alain De Botton'], 'title": "Status Anxiety", "isbn13": "9780375725357", "msrp": 16, "binding": "Paperback", "related": {"ePub": "0307491331"}, "isbn": "0375725350", "isbn10": "0375725350", "other_isbns": [{'isbn": "9780307491336", "binding": "printisbn"}]}}