{"book": {"publisher": "Pantheon", "synopsis": "THE NO. 1 LADIES’ DETECTIVE AGENCY - Book 8<br/><br/>Fans around the world adore the best-selling No. 1 Ladies’ Detective Agency series and its proprietor, Precious Ramotswe, Botswana’s premier lady detective. In this charming series, Mma Ramotswe—with help from her loyal associate, Grace Makutsi—navigates her cases and her personal life with wisdom, good humor, and the occasional cup of tea.<br/><br/>In the life of Precious Ramotswe–a woman duly proud of her fine traditional build– there is rarely a dull moment, and in the latest installment in the universally beloved No. 1 Ladies’ Detective Agency series there is much happening on Zebra Drive and Tlokweng Road. Mma Ramotswe is experiencing staffing difficulties. First Mr. J.L.B. Mate-koni asks to be put in charge of a case involving an errant husband. But can a man investigate such matters as successfully as the number one lady detective can? Then she has a minor falling-out with her assistant, Mma Makutsi, who decides to leave the agency, taking the 97 percent she received on her typing final from the Botswana Secretarial College with her.<br/><br/>Along the way, Mma Ramotswe is asked to investigate a couple of tricky cases. Will she be able to explain an unexpected series of deaths at the hospital in Mochudi? And what about the missing office supplies at a local printing company? These are the types of questions that she is uniquely well suited to answer.<br/><br/>In the end, whatever happens, Mma Ramotswe knows she can count on Mr. J.L.B. Matekoni, who stands for all that is solid and true in a shifting world. And there is always her love for Botswana, a country of which she is justifiably proud.", "language": "en", "image": "https://images.isbndb.com/covers/27/37/9780375422737.jpg", "title_long": "The Good Husband of Zebra Drive", "edition": "1", "dimensions": "Height: 8.2 Inches, Length: 5.78 Inches, Weight: 0.85 Pounds, Width: 0.93 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.78}, "width": {"unit": "inches", "value": 0.93}, "weight": {"unit": "pounds", "value": 0.85}, "height": {"unit": "inches", "value": 8.2}}, "pages": 224, "date_published": "2007-04-17", "subjects": ["Literature & Fiction', 'Women's Fiction', 'Contemporary', 'British & Irish', 'Humor & Satire', 'Humorous', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Self Service', 'Custom Stores'], 'authors": ["Alexander McCall Smith'], 'title": "The Good Husband of Zebra Drive", "isbn13": "9780375422737", "msrp": "0.00", "binding": "Hardcover", "related": {"ePub": "0375424792"}, "isbn": "0375422730", "isbn10": "0375422730", "other_isbns": [{'isbn": "9780375424793", "binding": "printisbn"}]}}