{"book": {"publisher": "Random House Reference", "synopsis": "When too tightly leashed, writing chokes and loses its vitality. Although the rules of composition popularized in William Strunk Jr. and E. B. White’s Elements of Style have been de rigueur for decades, they won’t exactly set your writing free.<br/><br/>To the rescue comes Spunk & Bite, a guide to bold and radiant language and style. The secret, according to bestselling author and former publishing executive Arthur Plotnik, is to embrace those qualities that composition rulebooks sidestep–among them, surprise, personality, engagement, edge, and fearlessness. Drawing on selections from today’s most exciting writers–Jonathan Franzen, Sandra Cisneros, Bill Bryson, Maureen Dowd, and many dozens more–Plotnik reveals the tricks and techniques that make prose fresh, forceful, and publishable.<br/><br/>For all types of writing–novels, articles, poems, ad copy, blogs, and even e-mail–this uncommon handbook reveals how to make your words so fetching that readers beg for more.<br/><br/>Arthur Plotnik is an author, and former publishing executive. Two of his works have been featured as Book of the Month Club selections: The Elements of Editing and The Elements of Expression: Putting Thoughts into Words . Reviewers have consistently praised Plotnik’s writing for its accuracy, style, and wit, often ranking it with Strunk & White in practicality.<br/><br/>Plotnik studied under Philip Roth and Vance Bourjaily at the Iowa Writers Workshop . As a publisher, he brought five national awards to the American Library Association’s book imprint. He also won numerous honors as editor of ALA’s flagship magazine, American Libraries.", "language": "en", "image": "https://images.isbndb.com/covers/11/51/9780375721151.jpg", "title_long": "Spunk & Bite: A Writer"s Guide to Punchier, More Engaging Language & Style", "edition": "2nd prt.", "dimensions": "Height: 8.5 Inches, Length: 5.8 Inches, Weight: 1 Pounds, Width: 1.1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.8}, "width": {"unit": "inches", "value": 1.1}, "weight": {"unit": "pounds", "value": 1}, "height": {"unit": "inches", "value": 8.5}}, "pages": 272, "date_published": "2005-11-15", "subjects": ["Reference', 'Foreign Language Study & Reference', 'Writing, Research & Publishing Guides', 'Publishing & Books', 'Writing', 'Research'], 'authors": ["Arthur Plotnik'], 'title": "Spunk & Bite: A Writer"s Guide to Punchier, More Engaging Language & Style", 'isbn13": "9780375721151", "msrp": 16.95, 'binding": "Hardcover", "isbn": "0375721150", "isbn10": "0375721150"}}