{"book": {"publisher": "Robert R. Knapp", "synopsis": "A New York Times Notable Book<br/>Winner of the Guardian Fiction Prize<br/>Winner of the Irish Times Fiction Award and International Award<br/><br/>"A swift and masterful transformation of family griefs and political violence into something at once rhapsodic and heartbreaking. If Issac Babel had been born in Derry, he might have written this sudden, brilliant book."<br/>--Seamus Heaney<br/><br/>Hugely acclaimed in Great Britain, where it was awarded the Guardian Fiction Prize and short-listed for the Booker, Seamus Deane\"s first novel is a mesmerizing story of childhood set against the violence of Northern Ireland in the 1940s and 1950s.<br/><br/>The boy narrator grows up haunted by a truth he both wants and does not want to discover. The matter: a deadly betrayal, unspoken and unspeakable, born of political enmity. As the boy listens through the silence that surrounds him, the truth spreads like a stain until it engulfs him and his family. And as he listens, and watches, the world of legend--the stone fort of Grianan, home of the warrior Fianna; the Field of the Disappeared, over which no gulls fly--reveals its transfixing reality. Meanwhile the real world of adulthood unfolds its secrets like a collection of folktales: the dead sister walking again; the lost uncle, Eddie, present on every page; the family house 'as cunning and articulate as a labyrinth, closely designed, with someone sobbing at the heart of it.'<br/><br/>Seamus Deane has created a luminous tale about how childhood fear turns into fantasy and fantasy turns into fact. Breathtakingly sad but vibrant and unforgettable, Reading in the Dark is one of the finest books about growing up--in Ireland or anywhere--that has ever been written.', 'language": "en", "image": "https://images.isbndb.com/covers/02/31/9780375700231.jpg", "title_long": "Handbook in Researach and Evaluation", "edition": "First Edition", "dimensions": "Height: 8 Inches, Length: 5.1 Inches, Weight: 0.47 Pounds, Width: 0.6 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.1}, "width": {"unit": "inches", "value": 0.6}, "weight": {"unit": "pounds", "value": 0.47}, "height": {"unit": "inches", "value": 8}}, "pages": 245, "date_published": "1972", "subjects": ["Arts & Photography', 'History & Criticism', 'History', 'Literature & Fiction', 'Genre Fiction', 'Historical', 'Contemporary', 'Literary'], 'authors": ["Stepen Isaac'], 'title": "Handbook in Researach and Evaluation", "isbn13": "9780375700231", "msrp": 10.59, 'binding": "Paperback", "isbn": "0375700234", "isbn10": "0375700234"}}