{"book": {"publisher": "Signet", "synopsis": "The debut novel from Nobel Prize–winning author Alice Munro, “one of the most eloquent and gifted writers of contemporary fiction” (The New York Times).<br/><br/>“Munro has an unerring talent for uncovering the extraordinary in the ordinary.”—Newsweek<br/><br/>Rural Ontario, 1940s. Del Jordan lives out at the end of the Flats Road on her father’s fox farm, where her most frequent companions are an eccentric bachelor family friend and her rough younger brother. When she begins spending more time in town, she is surrounded by women—her mother, an agnostic, opinionated woman who sells encyclopedias to local farmers; her mother’s boarder, the lusty Fern Dogherty; and her best friend, Naomi, with whom she shares the frustrations and unbridled glee of adolescence.<br/><br/>Through these unwitting mentors and in her own encounters with sex, birth, and death, Del explores the dark and bright sides of womanhood. All along she remains a wise, witty observer and recorder of truths in small-town life. The result is a powerful, moving, and humorous demonstration of Alice Munro’s unparalleled awareness of the lives of girls and women.", "language": "es", "image": "https://images.isbndb.com/covers/74/90/9780375707490.jpg", "title_long": "Lives of Girls and Women, Something I"ve Been Meaning toTell You, Who Do you think You Are?", "edition": "Reprint", "dimensions": "Weight: 0.45 Pounds", "dimensions_structured": {"weight": {"unit": "pounds", "value": 0.45}}, "pages": 277, "date_published": "2001-02-27", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Coming of Age', 'Short Stories & Anthologies', 'Anthologies', 'Short Stories', 'Women's Fiction', 'Contemporary', 'Literary'], 'authors": ["Unknown'], 'title": "Lives of Girls and Women, Something I"ve Been Meaning toTell You, Who Do you think You Are?", 'isbn13": "9780375707490", "msrp": 16.95, "binding": "Paperback", "related": {"Kindle Edition": "0307814556", "ePub": "0307814556"}, "isbn": "0375707492", "isbn10": "0375707492", "other_isbns": [{'isbn": "9780307814555", "binding": "printisbn"}]}}