{"book": {"publisher": "Random House Audio", "synopsis": "Product Description      The Witching Hour Read by Lindsay CrouseLasher Read by Joe MortonTaltos Read by Tim Curry8 cassettes/ 10 hoursThe Witching HourThe first of the Mayfair Witch triology. This is the complex history of the mysterious Mayfair family through centuries of their tangled existence with a demonic spirit, a spirit that has brought them power and terrible tragedy. At the center of the novel is Rowan Mayfair, the heir to the Mayfair fortune, who must face her family"s mysterious past and her own strange powers.LasherThe sequel to the Witching Hour. It"s the story of Rowan Mayfair, the queen of the Mayfairs, who is held spellbound by the demon Lasher, the same demon who has lured the Mayfair women for centuries, and her escape from his demonic spell with their child. Through her escape and the cast of characters, demon and angel, mortal and immortal, the novel journeys across the globe and across the centuries.TaltosThe last novel in the Mayfair Witch triology. This mesmerizing novel is a journey back through the centuries to a civilization half-human species living among humankind and whose sole survivor is seeking answers about his origin and his peoples" tangled history with the mysterious and powerful Mayfair family.      From Library Journal      From the Mayfair Witches collection, only The Witching Hour seems to provide much of a coherent story, though the other works have considerable information on Rice's world of witchcraft, spirits, and human-like aliens as well as the Mayfair family of witches itself. The three titles are excellently read by Joe Morton, Lindsay Crouse, and Tim Curry, but it's unclear what the producer was trying to accomplish by arranging the set out of chronological order. The action in Lasher logically follows that of The Witching Hour, which ends describing the relationship of Rowan Mayfair with the spirit Lasher. Taltos seems to be a vehicle to redefine Lasher, killed off in the earlier work, as a demon who assumed the identity of Mr. Ash/St. Ashlar, a nonhuman, nonvampire being whose kind live for millennia. There's a lot of pseudomyth touched up with Catholic or voodoo imagery and laced liberally with incestuous or otherwise taboo sex: a Mayfair dynasty no doubt but with no discernible witchcraft and quite a fixation on the female breast. Horrifying, no, though quite horrible. Merrick, on the other hand, provides the listener with an excellent abridgment, read with great feeling and effectiveness by Sir Derek Jacobi. Though Merrick is a Mayfair and a witch, one will not have had to read a majority of other works Rice has written about the Mayfairs to understand what is happening in this story. Also, along with the myth and voodoo allusions, one actually gets some of what the listener would think of as witchcraft. It's decidedly spooky stuff that also explores Rice's visions of possible afterlives, the mortality of witches, and the virtual immortality of vampires. Acquire Mayfair Witches in this abridged set only if circulation patterns indicate you should. Merrick is highly recommended for adult fiction and horror collections. Cliff Glaviano, Bowling Green State Univ. Libs., OH Copyright 2001 Reed Business Information, Inc.      From the Inside Flap      The Witching Hour Read by Lindsay CrouseLasher Read by Joe MortonTaltos Read by Tim Curry8 cassettes/ 10 hoursThe Witching HourThe first of the Mayfair Witch triology. This is the complex history of the mysterious Mayfair family through centuries of their tangled existence with a demonic spirit, a spirit that has brought them power and terrible tragedy. At the center of the novel is Rowan Mayfair, the heir to the Mayfair fortune, who must face her family's mysterious past and her own strange powers.LasherThe sequel to the Witching Hour. It's the story of Rowan Mayfair, the queen of the Mayfairs, who is held spellbound by the demon Lasher, the same demon who has lured the Mayfair women for centuries, and her escape from his demonic', 'language": "en", "image": "https://images.isbndb.com/covers/62/00/9780375416200.jpg", "title_long": "The Anne Rice Collection Mayfair Witches: Lasher / The Witching Hour / Taltos", "edition": "Abridged", "dimensions": "Height: 6.11 Inches, Length: 4.14 Inches, Width: 2.63 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.14}, "width": {"unit": "inches", "value": 2.63}, "height": {"unit": "inches", "value": 6.11}}, "pages": 10, "date_published": "2000", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Horror'], 'authors": ["Anne Rice'], 'title": "The Anne Rice Collection Mayfair Witches: Lasher / The Witching Hour / Taltos", "isbn13": "9780375416200", "msrp": 29.95, 'binding": "Audio Cassette", "isbn": "037541620X", "isbn10": "037541620X"}}