{"book": {"publisher": "Random House Trade Paperbacks", "synopsis": "Thirty years after the smashing success of Zelda, Nancy Milford returns with a stunning second act. Savage Beauty is the portrait of a passionate, fearless woman who obsessed American ever as she tormented herself.<br/><br/>ONE OF ESQUIRE’S 50 BEST BIOGRAPHIES OF ALL TIME<br/><br/>If F. Scott Fitzgerald was the hero of the Jazz Age, Edna St. Vincent Millay, as flamboyant in her love affairs as she was in her art, was its heroine. The first woman ever to win the Pulitzer Prize, Millay was dazzling in the performance of herself. Her voice was likened to an instrument of seduction and her impact on crowds, and on men, was legendary. Yet beneath her studied act, all was not well. Milford calls her book "a family romance"—for the love between the three Millay sisters and their mother was so deep as to be dangerous. As a family, they were like real-life Little Women, with a touch of Mommie Dearest.<br/><br/>Nancy Milford was given exclusive access to Millay\"s papers, and what she found was an extraordinary treasure. Boxes and boxes of letter flew back and forth among the three sisters and their mother—and Millay kept the most intimate diary, one whose ruthless honesty brings to mind Sylvia Plath. Written with passion and flair, Savage Beauty is an iconic portrait of a woman\'s life.', 'language": "en", "image": "https://images.isbndb.com/covers/08/15/9780375760815.jpg", "title_long": "Savage Beauty: The Life of Edna St. Vincent Millay", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.2 Inches, Weight: 1.1 Pounds, Width: 1.3 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 1.3}, "weight": {"unit": "pounds", "value": 1.1}, "height": {"unit": "inches", "value": 8}}, "pages": 608, "date_published": "2002-09-10", "subjects": ["Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Community & Culture', 'Women', 'Literature & Fiction', 'Essays & Correspondence', 'Letters', 'History & Criticism', 'Criticism & Theory', 'Genres & Styles', 'Regional & Cultural', 'Women Authors', 'Politics & Social Sciences', 'Women's Studies', 'Women Writers', 'Self Service', 'Custom Stores'], 'authors": ["Nancy Milford'], 'title": "Savage Beauty: The Life of Edna St. Vincent Millay", "isbn13": "9780375760815", "msrp": 20, 'binding": "Paperback", "isbn": "0375760814", "isbn10": "0375760814"}}