{"book": {"publisher": "Pantheon", "synopsis": "From the best–selling author of Persepolis comes a gloriously entertaining and enlightening look into the sex lives of Iranian women.<br/><br/>“Bold, bewitchingly humorous and politically astute.” —Elle<br/><br/>Embroideries gathers together Marjane’s tough–talking grandmother, stoic mother, glamorous and eccentric aunt and their friends and neighbors for an afternoon of tea drinking and talking. Naturally, the subject turns to love, sex and the vagaries of men.<br/><br/>As the afternoon progresses, these vibrant women share their secrets, their regrets and their often outrageous stories about, among other things, how to fake one’s virginity, how to escape an arranged marriage, how to enjoy the miracles of plastic surgery and how to delight in being a mistress. By turns revealing and hilarious, these are stories about the lengths to which some women will go to find a man, keep a man or, most important, keep up appearances.<br/><br/>Full of surprises, this introduction to the private lives of some fascinating women, whose life stories and lovers will strike us as at once deeply familiar and profoundly different from our own, is sure to bring smiles of recognition to the faces of women everywhere—and to teach us all a thing or two.", "language": "en", "image": "https://images.isbndb.com/covers/46/72/9780375714672.jpg", "title_long": "Embroideries", "edition": "Reprint", "dimensions": "Height: 7.5 inches, Length: 5.46 inches, Weight: 0.375 Pounds, Width: 0.48 inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.46}, "width": {"unit": "inches", "value": 0.48}, "weight": {"unit": "pounds", "value": 0.375}, "height": {"unit": "inches", "value": 7.5}}, "pages": 144, "date_published": "2006-04-18", "subjects": ["Arts & Photography', 'Comics & Graphic Novels', 'Graphic Novels', 'Contemporary Women', 'Literary', 'Biographies & History', 'Historical & Biographical Fiction', 'Manga', 'Science Fiction'], 'authors": ["Marjane Satrapi'], 'title": "Embroideries", "isbn13": "9780375714672", "msrp": 13.95, 'binding": "Paperback", "isbn": "0375714677", "isbn10": "0375714677"}}