{"book": {"publisher": "Vintage", "synopsis": "With his first novel since the internationally acclaimed The English Patient, Booker Prize—winning author Michael Ondaatje gives us a work displaying all the richness of imagery and language and the piercing emotional truth that we have come to know as the hallmarks of his writing.<br/><br/>Anil’s Ghost transports us to Sri Lanka, a country steeped in centuries of tradition, now forced into the late twentieth century by the ravages of civil war. Into this maelstrom steps Anil Tissera, a young woman born in Sri Lanka, educated in England and America, who returns to her homeland as a forensic anthropologist sent by an international human rights group to discover the source of the organized campaigns of murder engulfing the island. What follows is a story about love, about family, about identity, about the unknown enemy, about the quest to unlock the hidden past–a story propelled by a riveting mystery. Unfolding against the deeply evocative background of Sri Lanka’s landscape and ancient civilization, Anil’s Ghost is a literary spellbinder–Michael Ondaatje’s most powerful novel yet.", "language": "en", "image": "https://images.isbndb.com/covers/43/74/9780375724374.jpg", "title_long": "Anil"s Ghost: A Novel", "edition": "Reprint", "dimensions": "Height: 7.97 Inches, Length: 5.2 Inches, Weight: 0.575 Pounds, Width: 0.67 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 0.67}, "weight": {"unit": "pounds", "value": 0.575}, "height": {"unit": "inches", "value": 7.97}}, "pages": 307, "date_published": "2001-04-24", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Political', 'Psychological', 'Contemporary', 'Literary', 'Mystery, Thriller & Suspense', 'Mystery', 'Supernatural', 'Self Service', 'Custom Stores'], 'authors": ["Michael Ondaatje'], 'title": "Anil"s Ghost: A Novel", 'isbn13": "9780375724374", "msrp": 15.95, "binding": "Paperback", "related": {"ePub": "0375412670"}, "isbn": "0375724370", "isbn10": "0375724370", "other_isbns": [{'isbn": "9780375412677", "binding": "print"}]}}