{"book": {"publisher": "Vintage", "synopsis": "Eleven stunning stories that explore the most intimate and transforming moments of existence, from Nobel Prize–winning author Alice Munro, “one of the foremost practitioners of the short story” (Michiko Kakutani, The New York Times).<br/><br/>“Throughout this remarkable collection moments of insight flash from the pages like lightning, not necessarily providing answers—more like showing the way to new questions.”—The Philadelphia Inquirer<br/><br/>A divorced woman returns to her childhood home where she confronts the memory of her parents’ confounding yet deep bond. The accidental near-drowning of a child exposes to the shaken mother the fragility between children and parents. A young man, remembering a terrifying childhood incident, wrestles with the responsibility he has always felt for his hapless younger brother. A man brings his lover on a visit to his ex-wife, only to feel unexpectedly closer to his estranged partner.<br/><br/>In these and other stories, Alice Munro proves once again a sensitive and compassionate chronicler of our times. Drawing us into the most intimate corners of ordinary lives, she reveals much about ourselves, our choices, and our experiences of love.", "language": "en", "image": "https://images.isbndb.com/covers/47/01/9780375724701.jpg", "title_long": "The Progress of Love", "edition": "Reprint", "dimensions": "Height: 7.96 Inches, Length: 5.2 Inches, Weight: 0.6 Pounds, Width: 0.67 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 0.67}, "weight": {"unit": "pounds", "value": 0.6}, "height": {"unit": "inches", "value": 7.96}}, "pages": 320, "date_published": "2000-12-12", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Psychological', 'History & Criticism', 'Criticism & Theory', 'Short Stories & Anthologies', 'Anthologies', 'Short Stories', 'Women's Fiction', 'Domestic Life', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Alice Munro'], 'title": "The Progress of Love", "isbn13": "9780375724701", "msrp": "0.00", "binding": "Paperback", "related": {"Kindle Edition": "0307814564", "ePub": "0307814564"}, "isbn": "0375724702", "isbn10": "0375724702", "other_isbns": [{'isbn": "9780307814562", "binding": "printisbn"}]}}