{"book": {"publisher": "Vintage", "synopsis": ""A biography wholly worthy of the brilliant woman it chronicles. . . . It rediscovers Virginia Woolf afresh." --The Philadelphia Inquirer<br/><br/>While Virginia Woolf--one of our century\"s most brilliant and mercurial writers--has had no shortage of biographers, none has seemed as naturally suited to the task as Hermione Lee. Subscribing to Virginia Woolf\'s own belief in the fluidity and elusiveness of identity, Lee comes at her subject from a multitude of perspectives, producing a richly layered portrait of the writer and the woman that leaves all of her complexities and contradictions intact. Such issues as sexual abuse, mental illness, and suicide are brought into balance with the immensity of her literary achievement, her heroic commitment to her work, her generosity and wit, and her sanity and strength.<br/><br/>It is not often that biography offers the satisfactions of great fiction--but this is clearly what Hermione Lee has achieved. Accessible, intelligent, and deeply pleasurable to read, her Virginia Woolf will undoubtedly take its place as the standard biography for years to come.<br/><br/>'One of the most impressive biographies of the decade: moving, eloquent, powerful as both literary and social history.'<br/>--Financial Times<br/><br/>'The most distinguished study of Woolf yet.' --The New Republic', 'language": "en", "image": "https://images.isbndb.com/covers/13/68/9780375701368.jpg", "title_long": "Virginia Woolf", "edition": "Vintage Books ed.", "dimensions": "Height: 8 Inches, Length: 5.2 Inches, Weight: 1.6875 Pounds, Width: 2 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 2}, "weight": {"unit": "pounds", "value": 1.6875}, "height": {"unit": "inches", "value": 8}}, "pages": 944, "date_published": "1999-10-05", "subjects": ["Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Theatre', 'Community & Culture', 'Women', 'Historical', 'Europe', 'Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Women Authors', 'Politics & Social Sciences', 'Women's Studies', 'Women Writers', 'Self Service', 'Custom Stores'], 'authors": ["Hermione Lee'], 'title": "Virginia Woolf", "isbn13": "9780375701368", "msrp": 15.05, 'binding": "Paperback", "isbn": "0375701362", "isbn10": "0375701362"}}