{"book": {"publisher": "Pantheon", "synopsis": "In her acclaimed Persepolis books and in Embroideries, Marjane Satrapi rendered the events of her life and times in a uniquely captivating and powerful voice and vision. Now she turns that same keen eye and ear to the heartrending story of her great-uncle, a celebrated Iranian musician who gave up his life for music and love.<br/><br/>We are in Tehran in 1958, and Nasser Ali Khan, one of Iran’s most revered tar players, discovers that his beloved instrument is irreparably damaged. Though he tries, he cannot find one to replace it, one whose sound speaks to him with the same power and passion with which his music speaks to others. In despair, he takes to his bed, renouncing the world and all its pleasures, closing the door on the demands and love of his wife and his four children. Over the course of the week that follows, his family and close friends attempt to change his mind, but Nasser Ali slips further and further into his own reveries: flashbacks and flash-forwards (with unexpected appearances by the likes of the Angel of Death and Sophia Loren) from his own childhood through his children’s futures. And as the pieces of his story slowly fall into place, we begin to understand the profundity of his decision to give up life.<br/><br/>Marjane Satrapi brings what has become her signature humor, insight, and generosity to this emotional tale of life and death, and the courage and passion both require of us. The poignant story of one man, it is also a story of stunning universality–and an altogether luminous work.", "language": "en", "image": "https://images.isbndb.com/covers/41/51/9780375424151.jpg", "title_long": "Chicken with Plums", "edition": "First Edition", "dimensions": "Height: 9.55 Inches, Length: 6.68 Inches, Weight: 0.8 Pounds, Width: 0.56 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.68}, "width": {"unit": "inches", "value": 0.56}, "weight": {"unit": "pounds", "value": 0.8}, "height": {"unit": "inches", "value": 9.55}}, "pages": 96, "date_published": "2006-10-03", "subjects": ["Biographies & Memoirs', 'Comics & Graphic Novels', 'Manga', 'Historical Fiction', 'Self Service', 'Custom Stores'], 'authors": ["Marjane Satrapi'], 'title": "Chicken with Plums", "isbn13": "9780375424151", "msrp": 16.95, 'binding": "Hardcover", "isbn": "0375424156", "isbn10": "0375424156"}}