{"book": {"publisher": "Pantheon", "synopsis": "THE NO. 1 LADIES’ DETECTIVE AGENCY - Book 6<br/><br/>Fans around the world adore the bestselling No. 1 Ladies’ Detective Agency series, the basis of the HBO TV show, and its proprietor Precious Ramotswe, Botswana’s premier lady detective. In this charming series, Mma Ramotswe navigates her cases and her personal life with wisdom, and good humor—not to mention help from her loyal assistant, Grace Makutsi, and the occasional cup of tea.<br/><br/>In the newest addition to the universally beloved No. 1 Ladies’ Detective Agency series, the charming and ever-resourceful Precious Ramotswe finds herself overly beset by problems. She is already busier than usual at the detective agency when added to her concerns are a strange intruder in her house on Zebra Drive and the baffling appearance of a pumpkin. And then there is Mma Makutsi, who decides to treat herself to dance lessons, only to be partnered with a man who seems to have two left feet. Nor are things running quite as smoothly as they usually do at Tlokweng Road Speedy Motors. Mma Ramotswe’s husband, the estimable Mr. J.L.B. Matekoni, is overburdened with work even before one of his apprentices runs off with a wealthy woman. But what finally rattles Mma Ramotswe’s normally unshakable composure is a visitor who forces her to confront a secret from her past. . . .<br/><br/>All this unfolds against the sunlit background of Mma Ramotswe’s beloved homeland, Botswana–a land of empty spaces, echoing skies, and an endless supply of soothing bush tea.", "language": "en", "image": "https://images.isbndb.com/covers/27/13/9780375422713.jpg", "title_long": "In the Company of Cheerful Ladies (No. 1 Ladies" Detective Agency, Book 6)", "edition": "1", "dimensions": "Height: 8.4 Inches, Length: 5.6 Inches, Weight: 0.85 Pounds, Width: 0.82 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.6}, "width": {"unit": "inches", "value": 0.82}, "weight": {"unit": "pounds", "value": 0.85}, "height": {"unit": "inches", "value": 8.4}}, "pages": 240, "date_published": "2005-04-19", "subjects": ["Literature & Fiction', 'Women's Fiction', 'Contemporary', 'British & Irish', 'Humor & Satire', 'Humorous', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Self Service', 'Custom Stores'], 'authors": ["Alexander McCall Smith'], 'title": "In the Company of Cheerful Ladies (No. 1 Ladies" Detective Agency, Book 6)", 'isbn13": "9780375422713", "msrp": "0.00", "binding": "Hardcover", "related": {"Paperback": "0375423575", "ePub": "0375423575"}, "isbn": "0375422714", "isbn10": "0375422714", "other_isbns": [{'isbn": "9780375423574", "binding": "printisbn"}]}}