{"book": {"publisher": "Alfred A. Knopf", "synopsis": "Combining the early, straightforward seductions of Norwegian Wood and the complex mysteries of The Wind-Up Bird Chronicle, this new novel—his seventh translated into English—is Haruki Murakami at his most satisfying and representative best.<br/><br/>The scenario is as simple as it is uncomfortable: a college student falls in love (once and for all, despite everything that transpires afterward) with a classmate whose devotion to Kerouac and an untidy writerly life precludes any personal commitments—until she meets a considerably older and far more sophisticated businesswoman. It is through this wormhole that she enters Murakami’s surreal yet humane universe, to which she serves as guide both for us and for her frustrated suitor, now a teacher. In the course of her travels from parochial Japan through Europe and ultimately to an island off the coast of Greece, she disappears without a trace, leaving only lineaments of her fate: computer accounts of bizarre events and stories within stories. The teacher, summoned to assist in the search for her, experiences his own ominous, haunting visions, which lead him nowhere but home to Japan—and there, under the expanse of deep space and the still-orbiting Sputnik, he finally achieves a true understanding of his beloved.<br/>A love story, a missing-person story, a detective story—all enveloped in a philosophical mystery—and, finally, a profound meditation on human longing.", "language": "en", "image": "https://images.isbndb.com/covers/16/94/9780375411694.jpg", "title_long": "Sputnik Sweetheart", "edition": "F First American Edition", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 0.9 Pounds, Width: 0.75 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 0.9}, "height": {"unit": "inches", "value": 9}}, "pages": 210, "date_published": "2001-04-24", "subjects": ["Literature & Fiction', 'Contemporary', 'Literary'], 'authors": ["Haruki Murakami'], 'title": "Sputnik Sweetheart", "isbn13": "9780375411694", "msrp": 23, "binding": "Hardcover", "related": {"ePub": "0375413464"}, "isbn": "0375411690", "isbn10": "0375411690", "other_isbns": [{'isbn": "9780375413469", "binding": "printisbn"}]}}