{"book": {"publisher": "Vintage", "synopsis": "NATIONAL BESTSELLER • From the New York Times bestselling author of American Psycho and Less Than Zero comes a chilling tale that combines reality, memoir, and fantasy to create a fascinating portrait of this most controversial writer but also a deeply moving novel about love and loss, parents and children, and ultimately forgiveness.<br/><br/>“John Cheever writes The Shining.” —Stephen King, Entertainment Weekly<br/><br/>Bret Ellis, the narrator of Lunar Park, is the bestselling writer whose first novel Less Than Zero catapulted him to international stardom while he was still in college. In the years that followed he found himself adrift in a world of wealth, drugs, and fame, as well as dealing with the unexpected death of his abusive father.<br/><br/>After a decade of decadence a chance for salvation arrives; the chance to reconnect with an actress he was once involved with, and their son. But almost immediately his new life is threatened by a freak sequence of events and a bizarre series of murders that all seem to connect to Ellis’s past. His attempts to save his new world from his own demons makes Lunar Park Ellis’s most suspenseful novel.<br/><br/>Look for Bret Easton Ellis’s new novel, The Shards!", "language": "en", "image": "https://images.isbndb.com/covers/72/76/9780375727276.jpg", "title_long": "Lunar Park", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.2 Inches, Weight: 0.67 Pounds, Width: 0.9 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 0.9}, "weight": {"unit": "pounds", "value": 0.67}, "height": {"unit": "inches", "value": 8}}, "pages": 416, "date_published": "2006-08-29", "subjects": ["Humor & Entertainment', 'Humor', 'Self-Help & Psychology', 'Literature & Fiction', 'Dramas & Plays', 'Comedy', 'Genre Fiction', 'Horror', 'Psychological', 'British & Irish', 'Humor & Satire', 'Satire', 'Contemporary', 'Literary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Psychological Thrillers', 'Suspense', 'Teen & Young Adult', 'Self Service', 'Custom Stores'], 'authors": ["Bret Easton Ellis'], 'title": "Lunar Park", "isbn13": "9780375727276", "msrp": 15.38, "binding": "Paperback", "related": {"ePub": "0307264300"}, "isbn": "0375727272", "isbn10": "0375727272", "other_isbns": [{'isbn": "9780307264305", "binding": "print"}]}}