{"book": {"publisher": "Random House", "synopsis": "Charles Frazier’s Thirteen Moons is the story of one man’s remarkable life, spanning a century of relentless change. At the age of twelve, an orphan named Will Cooper is given a horse, a key, and a map and is sent on a journey through the wilderness to the edge of the Cherokee Nation, the uncharted white space on the map. Will is a bound boy, obliged to run a remote Indian trading post. As he fulfills his lonesome duty, Will finds a father in Bear, a Cherokee chief, and is adopted by him and his people, developing relationships that ultimately forge Will’s character. All the while, his love of Claire, the enigmatic and captivating charge of volatile and powerful Featherstone, will forever rule Will’s heart.<br/>In a distinct voice filled with both humor and yearning, Will tells of a lifelong search for home, the hunger for fortune and adventure, the rebuilding of a trampled culture, and above all an enduring pursuit of passion. As he comes to realize, “When all else is lost and gone forever, there is yearning. One of the few welcome lessons age teaches is that only desire trumps time."<br/><br/>Will Cooper, in the hands of Charles Frazier, becomes a classic American soul: a man devoted to a place and its people, a woman, and a way of life, all of which are forever just beyond his reach. Thirteen Moons takes us from the uncharted wilderness of an unspoiled continent, across the South, up and down the Mississippi, and to the urban clamor of a raw Washington City. Throughout, Will is swept along as the wild beauty of the nineteenth century gives way to the telephones, automobiles, and encroaching railways of the twentieth. Steeped in history, rich in insight, and filled with moments of sudden beauty, Thirteen Moons is an unforgettable work of fiction by an American master.<br/><br/>PRAISE FOR THIRTEEN MOONS<br/><br/>“Genius.”<br/>–Time<br/><br/>“Gorgeous…Thirteen Moons calls Cold Mountain to mind in its wonder at the natural world; its pacificist undercurrents; its dismay at the dismantling of what matters, and its convication that one love, no matter how tortured and inexplicable, can be life-defining…fascinating…vivid and alive.”<br/>–Newsweek<br/><br/>“Thirteen Moons is rare in many ways and occupies a literary plane of such height that reviewing it is not really salient….Thirteen Moons has the power to inspire great performances from succeeding generations of writers….For those who simply value the literary experience, Thirteen Moons will provide the immense satisfaction of taking a literary journey of magnitude. Whether on a plane, in an office or curled in a window seat, readers who absorb Will\"s story will find their own lives enriched….Thirteen Moons belongs to the ages.”<br/>–Los Angeles Times<br/><br/>“Thirteen Moons brings this vanished world thrillingly to life…<br/>One of the great Native American, and American stories, and a great gift to all of us, from one of our very best writers.”<br/>« –Kirkus Reviews, starred review «<br/><br/>“There are things so masterful words can’t do them justice. Frazier’s writing falls in that category…With Thirteen Moons, he’s doing important work fillnig in the gaps, helping restore the roots, of our knowledge of our own history.”<br/>–Asheville Citizen-Times<br/><br/>“Fascinating…Reading Thirteen Moons is an intoxicating experience…This is 21st-century literary fiction at its very best.”<br/>–BookPage<br/><br/>“Thirteen Moons is rare in many ways and occupies a literary plane of such height that reviewing it is not really salient….Thirteen Moons has the power to inspire great performances from succeeding generations of writers….For those who simply value the literary experience, Thirteen Moons will provide the immense satisfaction of taking a literary journey of magnitude. Whether on a plane, in an office or curled in a window seat, readers who absorb Will\"s story will find their own lives enriched….Thirteen Moons belongs to the ages.”<br/>–Los Angeles Times<br/><br/>“Once again, we are in the hands of an assured writer who knows how to bring history to life…Gorgeous.”<br/>–New Orleans Times Picayune<br/>', 'language": "en", "image": "https://images.isbndb.com/covers/93/22/9780375509322.jpg", "title_long": "Thirteen Moons: A Novel", "edition": "First Edition", "dimensions": "Height: 9.49 Inches, Length: 6.63 Inches, Weight: 1.5875 Pounds, Width: 1.39 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.63}, "width": {"unit": "inches", "value": 1.39}, "weight": {"unit": "pounds", "value": 1.5875}, "height": {"unit": "inches", "value": 9.49}}, "pages": 422, "date_published": "2006-10-03", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'Coming of Age', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Charles Frazier'], 'title": "Thirteen Moons: A Novel", "isbn13": "9780375509322", "msrp": 26.95, "binding": "Hardcover", "related": {"ePub": "1588365735"}, "isbn": "0375509321", "isbn10": "0375509321", "other_isbns": [{'isbn": "9781588365736", "binding": "printisbn"}]}}