{"book": {"publisher": "Random House", "synopsis": "In The Heart of a Woman Maya Angelou leaves California with her son, Guy, to go to New York. There she enters the society and world of black artists and writers. Not since her childhood has she lived in an almost black environment, and she is surprised at the obsession her new friends have with the white world around them. She stays for a while with John and Grace Killens and begins to read her writing at the Harlem Writers Guild. She continues to sing, most notably at the Apollo Theatre in Harlem, but more and more she begins to take part in the struggle of black Americans for their rightful place in the world. She helps organize a benefit cabaret for the Southern Christian Leadership Conference, and then is appointed Martin Luther Kings Northern Coordinator.<br/><br/>Shortly after that, through her friend Abbey Lincoln, she takes one of the lead parts in Genet"s The Blacks (it was a remarkable cast, including Godfrey Cambridge, Roscoe Lee Brown, James Earl Jones, Cicely Tyson, Raymond St. Jacques, and Lou Gossett), and even writes music for the production.<br/><br/>In the meantime her personal life has taken a tempestuous turn. She has left the New York bail bondsman she was intending to marry and has fallen in love with a South African freedom fighter named Vusumzi Make, who sweeps her off her feet and eventually takes her to London and then to Cairo, where, as her marriage begins to break up, she becomes the first female editor of the English-language magazine.<br/><br/>The Heart of a Woman is filled with unforgettable vignettes of famous people, from Billie Holiday to Malcolm X, but perhaps most important is the story of Maya Angelou"s relationship with her son. Because this book chronicles, finally, the joys and the burdens of a black mother in America and how the son she had cherished so intensely and worked for so devotedly finally grows to be a man.", 'language": "en", "image": "https://images.isbndb.com/covers/07/25/9780375500725.jpg", "title_long": "The Heart of a Woman (Oprah"s Book Club)", 'edition": "First Edition", "dimensions": "Height: 8.55 Inches, Length: 5.75 Inches, Weight: 1 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.75}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 1}, "height": {"unit": "inches", "value": 8.55}}, "pages": 288, "date_published": "1997-05-17", "subjects": ["Biographies & Memoirs', 'Arts & Literature', 'Actors & Entertainers', 'Authors', 'Community & Culture', 'Black & African American', 'Memoirs', 'Humor & Entertainment', 'Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'United States', 'Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies', 'Women's Studies', 'Self Service', 'Custom Stores'], 'authors": ["Maya Angelou'], 'title": "The Heart of a Woman (Oprah"s Book Club)", 'isbn13": "9780375500725", "msrp": 24, 'binding": "Hardcover", "isbn": "0375500723", "isbn10": "0375500723"}}