{"book": {"publisher": "Alfred A. Knopf", "synopsis": "This collection of linked poems from David Levithan, the author of the New York Times bestseller Every Day and the groundbreaking classic Boy Meets Boy and the co-author of Will Grayson, Will Grayson (with John Green), will introduce you to a world of unforgettable and emotionally resonant voices.<br/><br/>Here’s what I know about the realm of possibility—<br/>it is always expanding, it is never what you think<br/>it is. Everything around us was once deemed<br/>impossible. From the airplane overhead to<br/>the phones in our pockets to the choir girl<br/>putting her arm around the metalhead.<br/>As hard as it is for us to see sometimes, we all exist<br/>within the realm of possibility. Most of the limits<br/>are of our own world’s devising. And yet,<br/>every day we each do so many things<br/>that were once impossible to us.<br/><br/>Enter The Realm of Possibility and meet a boy whose girlfriend is in love with Holden Caulfield; a girl who loves the boy who wears all black; a boy with the perfect body; and a girl who writes love songs for a girl she can’t have.<br/><br/>These are just a few of the captivating characters readers will get to know in this intensely heartfelt new novel about those ever-changing moments of love and heartbreak that go hand-in-hand with high school. David Levithan plumbs the depths of teenage emotion to create an amazing array of voices that readers won’t forget. So, enter their lives and prepare to welcome the realm of possibility open to us all. Love, joy, and these stories will linger.<br/><br/>A MARGARET A. EDWARDS AWARD WINNER<br/>AN ALA TOP TEN BEST BOOK FOR YOUNG ADULTS<br/>A NEW YORK PUBLIC LIBRARY BOOK FOR THE TEEN AGE<br/><br/>“Luminous . . . each voice sings with hope, humor and possibility.” —Time Out New York Kids", "language": "en", "image": "https://images.isbndb.com/covers/65/72/9780375836572.jpg", "title_long": "The Realm of Possibility", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.19 Inches, Weight: 0.36155810968 Pounds, Width: 0.46 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.19}, "width": {"unit": "inches", "value": 0.46}, "weight": {"unit": "pounds", "value": 0.36155810968}, "height": {"unit": "inches", "value": 8}}, "pages": 210, "date_published": "2006-05-09", "subjects": ["Children's Books', 'Growing Up & Facts of Life', 'Friendship, Social Skills & School Life', 'Literature & Fiction', 'Short Stories & Anthologies', 'Anthologies', 'Teen & Young Adult', 'Short Stories', 'Social & Family Issues', 'Social Issues', 'Self Service', 'Custom Stores'], 'authors": ["David Levithan'], 'title": "The Realm of Possibility", "isbn13": "9780375836572", "msrp": 9.99, "binding": "Paperback", "related": {"ePub": "0307490033"}, "isbn": "0375836578", "isbn10": "0375836578", "other_isbns": [{'isbn": "9780307490032", "binding": "printisbn"}]}}