{"book": {"publisher": "Random House", "synopsis": "In Mediterranean Winter, Robert D. Kaplan, the bestselling author of Balkan Ghosts and Eastward to Tartary, relives an austere, haunting journey he took as a youth through the off-season Mediterranean. The awnings are rolled up and the other tourists are gone, so the damp, cold weather takes him back to the 1950s and earlier—a golden, intensely personal age of tourism.<br/><br/>Decades ago, Kaplan voyaged from North Africa to Italy, Yugoslavia, and Greece, luxuriating in the radical freedom of youth, unaccountable to time because there was always time to make up for a mistake. He recalls that journey in this Persian miniature of a book, less to look inward into his own past than to look outward in order to dissect the process of learning through travel, in which a succession of new landscapes can lead to books and artwork never before encountered.<br/><br/>Kaplan first imagines Tunis as the glow of gypsum lamps shimmering against lime-washed mosques; the city he actually discovers is even more intoxicating. He takes the reader to the ramparts of a Turkish kasbah where Carthaginian, Roman, and Byzantine forts once stood: “I could see deep into Algeria over a rib-work of hills so gaunt it seemed the wind had torn the flesh off them.” In these austere and aromatic surroundings he discovers Saint Augustine; the courtyards of Tunis lead him to the historical writings of Ibn Khaldun.<br/><br/>Kaplan takes us to the fifth-century Greek temple at Segesta, where he reflects on the ill-fated Athenian invasion of Sicily. At Hadrian’s villa, “Shattered domes revealed clouds moving overhead in countless visions of eternity. It was a place made for silence and for contemplation, where you wanted a book handy. Every corner was a cloister. No view was panoramic: each seemed deliberately composed.”<br/><br/>Kaplan’s bus and train travels, his nighttime boat voyages, and his long walks in one archaeological site after another lead him to subjects as varied as the Berber threat to Carthage; the Roman army’s hunt for the warlord Jugurtha; the legacy of Byzantine art; the medieval Greek philosopher Georgios Gemistos Plethon, who helped kindle the Italian Renaissance; twentieth-century British literary writing about Greece; and the links between Rodin and the Croa-<br/>tian sculptor Ivan Mestrovic. Within these pages are smells, tastes, and the profundity of chance encounters. Mediterranean Winter begins in Rodin’s sculpture garden in Paris, passes through the gritty streets of Marseilles, and ends with a moving epiphany about Greece as the world prepares for the 2004 Summer Olympics in Athens.<br/><br/>Mediterranean Winter is the story of an education. It is filled with memories and history, not the author’s alone, but humanity’s as well.", "language": "en", "image": "https://images.isbndb.com/covers/80/42/9780375508042.jpg", "title_long": "Mediterranean Winter: The Pleasures of History and Landscape in Tunisia, Sicily, Dalmatia, and Greece", "edition": "1", "dimensions": "Height: 8.52 Inches, Length: 5.74 Inches, Weight: 0.86 Pounds, Width: 0.88 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.74}, "width": {"unit": "inches", "value": 0.88}, "weight": {"unit": "pounds", "value": 0.86}, "height": {"unit": "inches", "value": 8.52}}, "pages": 272, "date_published": "2004-02-03", "subjects": ["Biographies & Memoirs', 'Historical', 'Europe', 'Travelers & Explorers', 'History', 'Historical Study & Educational Resources', 'Study & Teaching', 'Travel', 'General', 'Travel Writing'], 'authors": ["Robert D. Kaplan'], 'title": "Mediterranean Winter: The Pleasures of History and Landscape in Tunisia, Sicily, Dalmatia, and Greece", "isbn13": "9780375508042", "msrp": "0.00", "binding": "Hardcover", "isbn": "037550804X", "isbn10": "037550804X", "other_isbns": [{'isbn": "9781588361486", "binding": "printisbn"}]}}