{"book": {"publisher": "Pantheon", "synopsis": "“The best graphic novel of the year” (Time) tells the story of a strange plague devastating the lives of teenagers in mid-1970s suburban Seattle, revealing the horrifying nature of high school alienation—the savagery, the cruelty, the relentless anxiety, and the ennui.<br/><br/>We learn from the outset that a strange plague has descended upon the area’s teenagers, transmitted by sexual contact. The disease is manifested in any number of ways—from the hideously grotesque to the subtle (and concealable)—but once you’ve got it, that’s it. There’s no turning back.<br/><br/>As we inhabit the heads of several key characters—some kids who have it, some who don’t, some who are about to get it—what unfolds isn’t the expected battle to fight the plague, or bring heightened awareness to it , or even to treat it. What we become witness to instead is a fascinating and eerie portrait of the nature of high school alienation itself.<br/><br/>And then the murders start.<br/><br/>As hypnotically beautiful as it is horrifying, Black Hole transcends its genre by deftly exploring a specific American cultural moment in flux and the kids who are caught in it—back when it wasn’t exactly cool to be a hippie anymore, but Bowie was still just a little too weird.<br/><br/>To say nothing of sprouting horns and molting your skin…", "language": "en", "image": "https://images.isbndb.com/covers/38/02/9780375423802.jpg", "title_long": "Black Hole", "dimensions": "Height: 9.59 Inches, Length: 6.87 Inches, Weight: 2.675 Pounds, Width: 1.56 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.87}, "width": {"unit": "inches", "value": 1.56}, "weight": {"unit": "pounds", "value": 2.675}, "height": {"unit": "inches", "value": 9.59}}, "pages": 368, "date_published": "2005-10-18", "subjects": ["Comics & Graphic Novels', 'Graphic Novels', 'Horror', 'Manga', 'Fantasy', 'Mystery, Thriller & Crime', 'Literature & Fiction', 'Genre Fiction', 'Science Fiction & Fantasy', 'Teen & Young Adult', 'Politics & Social Sciences', 'Politics & Government', 'Specific Topics'], 'authors": ['Charles Burns'], 'title": "Black Hole", "isbn13": "9780375423802", "msrp": "0.00", "binding": "Hardcover", "isbn": "037542380X", "isbn10": "037542380X"}}