{"book": {"publisher": "Pantheon", "synopsis": "ISABEL DALHOUSIE - Book 3<br/><br/>Nothing captures the charm of Edinburgh like the bestselling Isabel Dalhousie series of novels featuring the insatiably curious philosopher and woman detective. Whether investigating a case or a problem of philosophy, the indefatigable Isabel Dalhousie, one of fiction’s most richly developed amateur detectives, is always ready to pursue the answers to all of life’s questions, large and small.<br/><br/>When Mimi, Isabel’s cousin from Dallas, arrives in Edinburgh with her husband, Joe, several confounding situations unfurl. First, Mimi and Joe introduce Isabel to Tom Bruce–a bigwig back home in Texas. The roving eye of Tom’s young fiancée leads Isabel to believe that money may be at the root of her love for Tom. But what, Isabel wonders, is at the root of Tom’s interest in Isabel herself? Then there are the feelings that Isabel has for Jamie, which are certainly hard to ignore. And she mustn’t forget about her niece, Cat, who’s busy falling for a man whom Isabel suspects of being an incorrigible mama’s boy.<br/><br/>Of course, Jamie counsels Isabel to stay out of it all, but there are irresistible philosophical issues at stake–when to tell the truth and when to keep one’s mouth shut, to be precise–and philosophical issues are meat and drink to Isabel Dalhousie, editor of the Review of Applied Ethics. In any case, Isabel is certain of the ethical basis for a little sleuthing now and again– especially when the problems involve matters of the heart.", "language": "en", "image": "https://images.isbndb.com/covers/30/00/9780375423000.jpg", "title_long": "The Right Attitude to Rain (Isabel Dalhousie Series)", "dimensions": "Height: 8.4 Inches, Length: 5.7 Inches, Weight: 1 Pounds, Width: 1.1 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.7}, "width": {"unit": "inches", "value": 1.1}, "weight": {"unit": "pounds", "value": 1}, "height": {"unit": "inches", "value": 8.4}}, "pages": 288, "date_published": "2006-09-19", "subjects": ["Literature & Fiction', 'Women's Fiction', 'Mystery, Thriller & Suspense', 'Mystery', 'Traditional Detectives', 'Women Sleuths', 'Self Service', 'Custom Stores'], 'authors": ["Alexander McCall Smith'], 'title": "The Right Attitude to Rain (Isabel Dalhousie Series)", "isbn13": "9780375423000", "msrp": 21.95, "binding": "Hardcover", "related": {"Kindle Edition": "0375424628", "ePub": "0375424628"}, "isbn": "0375423001", "isbn10": "0375423001", "other_isbns": [{'isbn": "9780375424625", "binding": "printisbn"}]}}