{"book": {"publisher": "Vintage", "synopsis": "From the Booker Prize-winning author of The Sea comes a splendidly moving, "hypnotic" exploration (The New York Times) of identity, duplicity, and desire, starring a very old, recently widowed man with secrets and the mysterious young woman destined to either destroy or save him.<br/><br/>One part Nietzsche, one part Humbert Humbert, and a soupcon of Milton’s Lucifer, Axel Vander, the dizzyingly unreliable narrator of John Banville’s masterful new novel, is the bearer of a fearsome reputation as a literary dandy and bully. A product of the Old World, he is also an escapee from its conflagrations, with the wounds to prove it. And everything about him is a lie.<br/><br/>Now those lies have been unraveled by a mysterious young woman whom Vander calls “Miss Nemesis.” They are to meet in Turin, a city best known for its enigmatic shroud. Is her purpose to destroy Vander or to save him—or simply to show him what lies beneath the shroud in which he has wrapped his life?", 'language": "en", "image": "https://images.isbndb.com/covers/53/02/9780375725302.jpg", "title_long": "Shroud", "edition": "Reprint", "dimensions": "Height: 7.93 Inches, Length: 5.24 Inches, Weight: 0.5 Pounds, Width: 0.59 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.24}, "width": {"unit": "inches", "value": 0.59}, "weight": {"unit": "pounds", "value": 0.5}, "height": {"unit": "inches", "value": 7.93}}, "pages": 272, "date_published": "2004-06-08", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Psychological', 'United States', 'Literary', 'Mystery, Thriller & Suspense', 'Mystery', 'Thrillers & Suspense', 'Psychological Thrillers', 'Self Service', 'Custom Stores'], 'authors": ["John Banville'], 'title": "Shroud", "isbn13": "9780375725302", "msrp": 15.38, "binding": "Paperback", "related": {"ePub": "0307427730"}, "isbn": "037572530X", "isbn10": "037572530X", "other_isbns": [{'isbn": "9780307427731", "binding": "printisbn"}]}}