{"book": {"publisher": "Vintage", "synopsis": "They stand as unselfconscious as if the photograph were being taken at a church picnic and not during one of the pitched battles of the civil rights struggle. None of them knows that the image will appear in Life magazineor that it will become an icon of its era. The year is 1962, and these seven white Mississippi lawmen have gathered to stop James Meredith from integrating the University of Mississippi. One of them is swinging a billy club.<br/><br/>More than thirty years later, award-winning journalist and author Paul Hendrickson sets out to discover who these men were, what happened to them after the photograph was taken, and how racist attitudes shaped the way they lived their lives. But his ultimate focus is on their children and grandchildren, and how the prejudice bequeathed by the fathers was transformed, or remained untouched, in the sons. Sons of Mississippi is a scalding yet redemptive work of social history, a book of eloquence and subtlely that tracks the movement of racism across three generations and bears witness to its ravages among both black and white Americans.", "language": "en", "image": "https://images.isbndb.com/covers/42/53/9780375704253.jpg", "title_long": "Sons of Mississippi: A Story of Race and Its Legacy", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.25 Inches, Weight: 0.66359140862 Pounds, Width: 0.8 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.25}, "width": {"unit": "inches", "value": 0.8}, "weight": {"unit": "pounds", "value": 0.66359140862}, "height": {"unit": "inches", "value": 8}}, "pages": 368, "date_published": "2004-01-06", "subjects": ["History', 'Americas', 'United States', 'Historical Study & Educational Resources', 'Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies', 'Sociology', 'Race Relations', 'Politics & Government', 'Specific Topics'], 'authors": ["Paul Hendrickson'], 'title": "Sons of Mississippi: A Story of Race and Its Legacy", "isbn13": "9780375704253", "msrp": 15, "binding": "Paperback", "related": {"ePub": "0804153345"}, "isbn": "0375704256", "isbn10": "0375704256", "other_isbns": [{'isbn": "9780804153348", "binding": "printisbn"}]}}