{"book": {"publisher": "Vintage", "synopsis": "NATIONAL BESTSELLER • The blockbuster debut novel from "a preternaturally gifted" writer (The New York Times) and author of On Beauty and Swing Time—set against London\"s racial and cultural tapestry, reveling in the ecstatic hodgepodge of modern life, flirting with disaster, and embracing the comedy of daily existence.<br/><br/>Zadie Smith’s dazzling debut caught critics grasping for comparisons and deciding on everyone from Charles Dickens to Salman Rushdie to John Irving and Martin Amis. But the truth is that Zadie Smith’s voice is remarkably, fluently, and altogether wonderfully her own.<br/><br/>At the center of this invigorating novel are two unlikely friends, Archie Jones and Samad Iqbal. Hapless veterans of World War II, Archie and Samad and their families become agents of England’s irrevocable transformation. A second marriage to Clara Bowden, a beautiful, albeit tooth-challenged, Jamaican half his age, quite literally gives Archie a second lease on life, and produces Irie, a knowing child whose personality doesn’t quite match her name (Jamaican for “no problem”). Samad’s late-in-life arranged marriage (he had to wait for his bride to be born), produces twin sons whose separate paths confound Iqbal’s every effort to direct them, and a renewed, if selective, submission to his Islamic faith.<br/><br/>“[White Teeth] is, like the London it portrays, a restless hybrid of voices, tones, and textures…with a raucous energy and confidence.” —The New York Times Book Review', 'language": "en", "image": "https://images.isbndb.com/covers/38/67/9780375703867.jpg", "title_long": "White Teeth: A Novel", "dimensions": "Height: 7.94 Inches, Length: 5.12 Inches, Weight: 0.7125 Pounds, Width: 0.94 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.12}, "width": {"unit": "inches", "value": 0.94}, "weight": {"unit": "pounds", "value": 0.7125}, "height": {"unit": "inches", "value": 7.94}}, "pages": 464, "date_published": "2001-06-12", "subjects": ["Humor & Entertainment', 'Humor', 'Self-Help & Psychology', 'Literature & Fiction', 'Genre Fiction', 'Psychological', 'Humor & Satire', 'Satire', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Zadie Smith'], 'title": "White Teeth: A Novel", "isbn13": "9780375703867", "msrp": 11.99, "binding": "Paperback", "related": {"Kindle Edition": "1400075505"}, "isbn": "0375703861", "isbn10": "0375703861", "other_isbns": [{'isbn": "9781400075508", "binding": "print"}]}}