{"book": {"publisher": "William Morrow Paperbacks", "synopsis": "Shortly after Thomas Marlowe"s arrival in Williamsburg, Virginia, all in that newfound capital city are speaking his name. With the bounty from his years as a pirate--a life he intends to renounce and keep forever secret--he purchases a fine plantation from a striking young widow, and soon after kills the favorite son of one of Virginia"s most powerful clans while defending her honor. But it is a daring feat of remarkable cunning that truly sets local tongues wagging: a stunning move that wins Marlowe command of Plymouth Prize, the colony"s decrepit guardship.<br/>But even as the enigmatic Marlowe bravely leads the King's sailors in bloody pitched battle against the cutthroats who infest the waters off Virginia's shores, a threat from his illicit past looms on the horizon that could doom Marlowe and his plans. Jean-Pierre LeRois, captain of the Vengeance--a brigand notorious even among other brigands for his violence and debauchery--plots to seize the colony's wealth, forcing Marlowe to choose between losing all or facing the one man he fears. Only an explosive confrontation on the open sea can determine whether the Chesapeake will be ruled by the crown or the Brethren of the Coast. Shortly after Thomas Marlowe's arrival in Williamsburg, Virginia, all in that newfound capital city are speaking his name. With the bounty from his years as a pirate--a life he intends to renounce and keep forever secret--he purchases a fine plantation from a striking young widow, and soon after kills the favorite son of one of Virginia's most powerful clans while defending her honor. But it is a daring feat of remarkable cunning that truly sets local tongues wagging: a stunning move that wins Marlowe command of Plymouth Prize, the colony's decrepit guardship.<br/>But even as the enigmatic Marlowe bravely leads the King's sailors in bloody pitched battle against the cutthroats who infest the waters off Virginia's shores, a threat from his illicit past looms on the horizon that could doom Marlowe and his plans. Jean-Pierre LeRois, captain of the Vengeance--a brigand notorious even among other brigands for his violence and debauchery--plots to seize the colony's wealth, forcing Marlowe to choose between losing all or facing the one man he fears. Only an explosive confrontation on the open sea can determine whether the Chesapeake will be ruled by the crown or the Brethren of the Coast.', 'language": "en", "image": "https://images.isbndb.com/covers/45/28/9780380804528.jpg", "title_long": "The Guardship (The Brethren of the Coast #1)", "dimensions": "Height: 8 Inches, Length: 5.25 Inches, Weight: 0.220462262 Pounds, Width: 0.872727 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.25}, "width": {"unit": "inches", "value": 0.872727}, "weight": {"unit": "pounds", "value": 0.220462262}, "height": {"unit": "inches", "value": 8}}, "pages": 372, "date_published": "2000", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'Sea Stories', 'War', 'Action & Adventure', 'Sea Adventures', 'War & Military', 'United States', 'Contemporary', 'Science Fiction & Fantasy'], 'authors": ["James L Nelson'], 'title": "The Guardship (The Brethren of the Coast #1)", "isbn13": "9780380804528", "msrp": 15.99, "binding": "Paperback", "related": {"ePub": "0061853178"}, "isbn": "0380804522", "isbn10": "0380804522", "other_isbns": [{'isbn": "9780061853173", "binding": "print"}]}}