{"book": {"publisher": "Avon Books", "synopsis": "Ray Bradbury"s moving recollection of a vanished golden era remains one of his most enchanting novels. Dandelion Wine stands out in the Bradbury literary canon as the author"s most deeply personal work, a semi-autobiographical recollection of a magical small-town summer in 1928.<br/>Twelve-year-old Douglas Spaulding knows Green Town, Illinois, is as vast and deep as the whole wide world that lies beyond the city limits. It is a pair of brand-new tennis shoes, the first harvest of dandelions for Grandfather"s renowned intoxicant, the distant clang of the trolley's bell on a hazy afternoon. It is yesteryear and tomorrow blended into an unforgettable always. But as young Douglas is about to discover, summer can be more than the repetition of established rituals whose mystical power holds time at bay. It can be a best friend moving away, a human time machine who can transport you back to the Civil War, or a sideshow automaton able to glimpse the bittersweet future.<br/>Come and savor Ray Bradbury's priceless distillation of all that is eternal about boyhood and summer.', 'language": "en", "image": "https://images.isbndb.com/covers/72/60/9780380977260.jpg", "title_long": "Dandelion Wine", "edition": "Reprint", "dimensions": "Height: 7 Inches, Length: 5.12 Inches, Weight: 0.79 Pounds, Width: 0.97 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.12}, "width": {"unit": "inches", "value": 0.97}, "weight": {"unit": "pounds", "value": 0.79}, "height": {"unit": "inches", "value": 7}}, "pages": 288, "date_published": "1999-02-01", "subjects": ["Literature & Fiction', 'Classics', 'Action & Adventure', 'Fantasy', 'Literary', 'Science Fiction & Fantasy', 'Historical', 'Coming of Age', 'Myths & Legends', 'Science Fiction'], 'authors": ["Ray Bradbury'], 'title": "Dandelion Wine", "isbn13": "9780380977260", "msrp": "0.00", "binding": "Hardcover", "related": {"Kindle Edition": "006224227X"}, "isbn": "0380977265", "isbn10": "0380977265", "other_isbns": [{'isbn": "9780062242273", "binding": "print"}]}}