{"book": {"publisher": "Dial Press Trade Paperback", "synopsis": "Hailed as “a writer of uncommon clarity” by the New Yorker, National Book Award finalist Allegra Goodman has dazzled readers with her acclaimed works of fiction, including such beloved bestsellers as The Family Markowitz and Kaaterskill Falls. Now she returns with a bracing new novel, at once an intricate mystery and a rich human drama set in the high-stakes atmosphere of a prestigious research institute in Cambridge, Massachusetts.<br/><br/>Sandy Glass, a charismatic publicity-seeking oncologist, and Marion Mendelssohn, a pure, exacting scientist, are codirectors of a lab at the Philpott Institute dedicated to cancer research and desperately in need of a grant. Both mentors and supervisors of their young postdoctoral protégés, Glass and Mendelssohn demand dedication and obedience in a competitive environment where funding is scarce and results elusive. So when the experiments of Cliff Bannaker, a young postdoc in a rut, begin to work, the entire lab becomes giddy with newfound expectations. But Cliff’s rigorous colleague–and girlfriend–Robin Decker suspects the unthinkable: that his findings are fraudulent. As Robin makes her private doubts public and Cliff maintains his innocence, a life-changing controversy engulfs the lab and everyone in it.<br/><br/>With extraordinary insight, Allegra Goodman brilliantly explores the intricate mixture of workplace intrigue, scientific ardor, and the moral consequences of a rush to judgment. She has written an unforgettable novel.", "language": "en", "image": "https://images.isbndb.com/covers/61/09/9780385336109.jpg", "title_long": "Intuition", "edition": "Reprint", "dimensions": "Height: 8.02 Inches, Length: 5.25 Inches, Weight: 0.69 Pounds, Width: 0.92 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.25}, "width": {"unit": "inches", "value": 0.92}, "weight": {"unit": "pounds", "value": 0.69}, "height": {"unit": "inches", "value": 8.02}}, "pages": 400, "date_published": "2007-03-13", "subjects": ["Literature & Fiction', 'Genre Fiction', 'United States', 'Contemporary', 'Literary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense', 'Science Fiction & Fantasy', 'Science Fiction', 'Hard Science Fiction', 'Self Service', 'Custom Stores'], 'authors": ["Allegra Goodman'], 'title": "Intuition", "isbn13": "9780385336109", "msrp": 17, "binding": "Paperback", "isbn": "0385336101", "isbn10": "0385336101", "other_isbns": [{'isbn": "9780440335887", "binding": "print"}]}}