{"book": {"publisher": "Delta", "synopsis": "Chapter One<br/><br/>Where I Want to Be<br/><br/>I was twenty-nine years old when the Arno flooded its banks on Friday 4 November 1966. According to the Sunday New York Times the damage wasn\"t extensive, but by Monday it was clear that Florence was a disaster. Twenty feet of water in the cloisters of Santa Croce, the Cimabue crucifix ruined beyond hope of restoration, panels ripped from the Baptistry doors, the basement of the Biblioteca Nazionale completely underwater, hundreds of thousands of volumes waterlogged, the Archivio di Stato in total disarray. On Tuesday I decided to go to Italy, to offer my services as a humble book conservator, to help in any way I could, to save whatever could be saved, including myself.<br/><br/>The decision wasn\"t a popular one at home. Papa was having money troubles of his own and didn\"t want to pay for a ticket. And my boss at the Newberry Library didn\'t understand either. He already had his ticket, paid for by the library, and needed me to mind the store. There wasn\'t any point in both of us going, was there?<br/><br/>'The why don\'t I go and you can mind the store?'<br/><br/>'Because, because, because . . .'<br/><br/>'Yes?'<br/><br/>Because it just didn\'t make sense. He couldn\'t see his way clear to granting me a leave of absence, not even a leave of absence without pay. He even suggested that the library might have to replace me, in which case . . .<br/><br/>But I decided to go anyway. I had enough money in my savings account for a ticket on Icelandic, and I figured I could live on the cheap once I got there. Besides, I wanted to break the mold in which my life was hardening, and I thought this might be a way to do it. Going to Florence was better than waiting around with nothing coming up.<br/><br/>My English teacher at Kenwood High used to say that we\'re like onions: you can peel off one layer after another and never get to a center, an inner core. You just run out of layers. But I think I\'m like a peach or an apricot or a nectarine. There\'s a pit at the center. I can crack my teeth on it, or I can suck on it like a piece of candy; but it won\'t crumble, and it won\'t dissolve. The pit is an image of myself when I was nineteen. I\'m in Sardegna, and I\'m standing high up on a large rock–a cliff, actually–and I don\'t have any clothes on, and everyone is looking at me, telling me to come down, not to jump, it\'s too high.<br/><br/>It\'s my second time in Italy. I spent a year here with Mama when I was fifteen, and then I came back by myself, after finishing high school at home, to do the last year of the liceo with my former classmates. Now we\'re celebrating the end of our examinations–Silvia (who spent a year with us in Chicago), Claudia, Rossella, Giulio, Fabio, Alessandro. Names like flowers, or bells. And me, Margot Harrington. More friends are coming later. Silvia\'s parents (my host family) have a summer house just outside Terranova, but we\'re camping on the beach, five kilometers down the coast. The coast is safe, they say, though there are bandits in the centro. Wow!<br/><br/>It\'s my birthday–August first–and we\'ve had a supper of bluefish and squid that we caught with a net. The squid taste like rubber bands, the heavy kind that I used to chew on in grade school and that boys sometimes used to snap our bottoms with in junior high. Life is sharp and snappy, too, full of promise, like the sting of those rubber bands: I\'ve passed my examinations with distinction; I\'m going to Harvard in the fall (well, to Radcliffe); I\'ve got an Italian boyfriend named Fabio Fabbriani; and I\'ve just been skinny-dipping in the stinging cold salt sea.<br/><br/>The others have put their clothes on now–I can see them below me, sitting around the remains of the fire in shorts and halter tops and shirts with the sleeves rolled up two turns, talking, glancing up nervously–but I want to savor the taste/thrill of my own nakedness a little longer, unembarrassed in the dwindling light. It\'s the scariest thing I\'ve ever done, except coming to Italy in the first place.<br/><br/>Fabio sits with his back toward me while he ', 'language": "en", "image": "https://images.isbndb.com/covers/46/95/9780385314695.jpg", "title_long": "The Sixteen Pleasures: A Novel", "edition": "1", "dimensions": "Height: 6.98 Inches, Length: 5.15 Inches, Weight: 0.7826410301 Pounds, Width: 0.81 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.15}, "width": {"unit": "inches", "value": 0.81}, "weight": {"unit": "pounds", "value": 0.7826410301}, "height": {"unit": "inches", "value": 6.98}}, "pages": 384, "date_published": "1995-05-01", "subjects": ["Literature & Fiction', 'United States', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Robert Hellenga'], 'title": "The Sixteen Pleasures: A Novel", "isbn13": "9780385314695", "msrp": 12.5, 'binding": "Paperback", "isbn": "0385314698", "isbn10": "0385314698"}}