{"book": {"publisher": "Delacorte Press", "synopsis": "It\"s the perfect gift: Laughter, the best medicine! From beloved author Maeve Binchy.<br/><br/>Maeve Binchy has captured the hearts of millions with her spectacular national bestsellers, from Circle of Friends to Tara Road. Now she applies her signature warmth, wit, and understanding to something new--a wickedly funny book for anyone who\"s checked into the hospital, headed for an operation, or convalesced at home.<br/><br/>Drawing on her own experiences as a patient, Maeve Binchy, together with artist Wendy Shea, has created this wry, deliciously illustrated book of wit and wisdom, a hilarious insider\"s guide to hospital stays and at-home convalescence. Filled with Maeve\'s candid real-life anecdotes and laugh-out-loud advice--plus Wendy Shea\'s irreverent drawings--Aches & Pains is just what the doctor ordered!<br/><br/>Discover:<br/><br/>Ten little jobs you can give to anyone who asks: "How can I help?"<br/><br/>Outrageous ways to take advantage of your weakened state.<br/><br/>Things to say to annoy the patient in the next bed.<br/><br/>Dignified ways to cope with all the indignities of baring your body to strangers.<br/><br/>Great gifts to suggest when someone asks: "What can I bring you?"<br/><br/>Tips on dealing with visitors...and hospital food. Plus recipes, poems, home remedies, and more!<br/><br/>The author\'s royalties for this book will be donated to the Arthritis Foundation.', 'language": "en", "image": "https://images.isbndb.com/covers/51/02/9780385335102.jpg", "title_long": "Aches & Pains", "edition": "First Edition", "dimensions": "Height: 7.75 Inches, Length: 5 Inches, Weight: 0.0625 Pounds, Width: 0.35 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 0.35}, "weight": {"unit": "pounds", "value": 0.0625}, "height": {"unit": "inches", "value": 7.75}}, "pages": 112, "date_published": "2000-06-13", "subjects": ["Humor & Entertainment', 'Humor'], 'authors": ["Maeve Binchy'], 'title": "Aches & Pains", "isbn13": "9780385335102", "msrp": 10, 'binding": "Hardcover", "isbn": "0385335105", "isbn10": "0385335105"}}