{"book": {"publisher": "Anchor", "synopsis": "He was the most social of writers, and at the height of his career, he was the very nexus of the glamorous worlds of the arts, politics and society, a position best exemplified by his still legendary Black and White Ball. Truman truly knew everyone, and now the people who knew him best tell his remarkable story to bestselling author and literary lion, George Plimpton.<br/><br/>Using the oral-biography style that made his Edie (edited with Jean Stein) a bestseller, George Plimpton has blended the voices of Capote\"s friends, lovers, and colleagues into a captivating and narrative. Here we see the entire span of Capote\"s life, from his Southern childhood, to his early days in New York; his first literary success with the publication of Other Voices, Other Rooms; his highly active love life; the groundbreaking excitement of In Cold Blood, the first "nonfiction novel'; his years as a jet-setter; and his final days of flagging inspiration, alcoholism, and isolation. All his famous friends and enemies are here: C.Z. Guest, Katharine Graham, Lauren Bacall, Gore Vidal, Norman Mailer, Joan Didion, John Huston, William F. Buckley, Jr., and dozens of others.<br/><br/>Full of wonderful stories, startlingly intimate and altogether fascinating, this is the most entertaining account of Truman Capote\'s life yet, as only the incomparable George Plimpton could have done it.', 'language": "en", "image": "https://images.isbndb.com/covers/17/30/9780385491730.jpg", "title_long": "Truman Capote: In Which Various Friends, Enemies, Acquaintances and Detractors Recall His Turbulent Career", "edition": "Reprint", "dimensions": "Height: 9.2 Inches, Length: 6.2 Inches, Weight: 1.33 Pounds, Width: 1.2 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.2}, "width": {"unit": "inches", "value": 1.2}, "weight": {"unit": "pounds", "value": 1.33}, "height": {"unit": "inches", "value": 9.2}}, "pages": 544, "date_published": "1998-11-10", "subjects": ["Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Historical', 'United States', 'Literature & Fiction', 'History & Criticism', 'Regional & Cultural', 'Self Service', 'Custom Stores'], 'authors": ["George Plimpton'], 'title": "Truman Capote: In Which Various Friends, Enemies, Acquaintances and Detractors Recall His Turbulent Career", "isbn13": "9780385491730", "msrp": 18, 'binding": "Paperback", "isbn": "0385491735", "isbn10": "0385491735"}}