{"book": {"publisher": "Anchor", "synopsis": "A masterful work of science writing that’s "both a fascinating biography of von Neumann, the Hungarian exile whose mathematical theories were building blocks for the A-bomb and the digital computer, and a brilliant social history of game theory and its role in the Cold War and nuclear arms race" (San Francisco Chronicle).<br/><br/>Should you watch public television without pledging?...Exceed the posted speed limit?...Hop a subway turnstile without paying? These questions illustrate the so-called "prisoner\'s dilemma', a social puzzle that we all face every day. Though the answers may seem simple, their profound implications make the prisoner\'s dilemma one of the great unifying concepts of science. Watching players bluff in a poker game inspired John von Neumann—father of the modern computer and one of the sharpest minds of the century—to construct game theory, a mathematical study of conflict and deception. Game theory was readily embraced at the RAND Corporation, the archetypical think tank charged with formulating military strategy for the atomic age, and in 1950 two RAND scientists made a momentous discovery.<br/><br/>Called the 'prisoner\'s dilemma,' it is a disturbing and mind-bending game where two or more people may betray the common good for individual gain. Introduced shortly after the Soviet Union acquired the atomic bomb, the prisoner\'s dilemma quickly became a popular allegory of the nuclear arms race. Intellectuals such as von Neumann and Bertrand Russell joined military and political leaders in rallying to the 'preventive war' movement, which advocated a nuclear first strike against the Soviet Union. Though the Truman administration rejected preventive war the United States entered into an arms race with the Soviets and game theory developed into a controversial tool of public policy—alternately accused of justifying arms races and touted as the only hope of preventing them.<br/><br/>Prisoner\'s Dilemma is the incisive story of a revolutionary idea that has been hailed as a landmark of twentieth-century thought.', 'language": "en", "image": "https://images.isbndb.com/covers/58/04/9780385415804.jpg", "title_long": "Prisoner"s Dilemma: John von Neumann, Game Theory, and the Puzzle of the Bomb", 'edition": "First Edition Thus", "dimensions": "Height: 8 inches, Length: 5.2 inches, Weight: 0.52470018356 Pounds, Width: 0.7 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 0.7}, "weight": {"unit": "pounds", "value": 0.52470018356}, "height": {"unit": "inches", "value": 8}}, "pages": 294, "date_published": "1993-01-01", "subjects": ["Biographies & Memoirs', 'Professionals & Academics', 'Scientists', 'Science & Math', 'Mathematics', 'Applied', 'Politics & Social Sciences', 'Sociology', 'Social Theory', 'Self Service', 'Custom Stores'], 'authors": ["William Poundstone'], 'title": "Prisoner"s Dilemma: John von Neumann, Game Theory, and the Puzzle of the Bomb", 'isbn13": "9780385415804", "msrp": 17, "binding": "Paperback", "related": {"Kindle Edition": "0307763781", "ePub": "0307763781"}, "isbn": "038541580X", "isbn10": "038541580X", "other_isbns": [{'isbn": "9780307763785", "binding": "printisbn"}]}}