{"book": {"publisher": "Anchor", "synopsis": "For more than four hundred years, the personal essay has been one of the richest and most vibrant of all literary forms. Distinguished from the detached formal essay by its friendly, conversational tone, its loose structure, and its drive toward candor and self-disclosure, the personal essay seizes on the minutiae of daily life-vanities, fashions, foibles, oddballs, seasonal rituals, love and disappointment, the pleasures of solitude, reading, taking a walk -- to offer insight into the human condition and the great social and political issues of the day. The Art of the Personal Essay is the first anthology to celebrate this fertile genre. By presenting more than seventy-five personal essays, including influential forerunners from ancient Greece, Rome, and the Far East, masterpieces from the dawn of the personal essay in the sixteenth century, and a wealth of the finest personal essays from the last four centuries, editor Phillip Lopate, himself an acclaimed essayist, displays the tradition of the personal essay in all its historical grandeur, depth, and diversity.", "language": "en", "image": "https://images.isbndb.com/covers/33/97/9780385423397.jpg", "title_long": "The Art of the Personal Essay: An Anthology from the Classical Era to the Present", "edition": "First Edition", "dimensions": "Height: 9.16 Inches, Length: 6.04 Inches, Weight: 2.3 Pounds, Width: 1.63 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.04}, "width": {"unit": "inches", "value": 1.63}, "weight": {"unit": "pounds", "value": 2.3}, "height": {"unit": "inches", "value": 9.16}}, "pages": 777, "date_published": "1995-01-15", "subjects": ["Literature & Fiction', 'Essays & Correspondence', 'Essays', 'History & Criticism', 'Movements & Periods', 'Comparative Literature', 'Short Stories & Anthologies', 'Anthologies', 'Reference', 'Words, Language & Grammar', 'Rhetoric', 'Self Service', 'Custom Stores'], 'authors": ["Phillip Lopate'], 'title": "The Art of the Personal Essay: An Anthology from the Classical Era to the Present", "isbn13": "9780385423397", "msrp": 15.44, 'binding": "Paperback", "isbn": "038542339X", "isbn10": "038542339X"}}