{"book": {"publisher": "Doubleday", "synopsis": "From the incomparable Jonathan Lethem, a raucous romantic farce that explores the paradoxes of love and art<br/><br/>Lucinda Hoekke spends eight hours a day at the Complaint Line, listening to anonymous callers air their random grievances. Most of the time, the work is excruciatingly tedious. But one frequent caller, who insists on speaking only to Lucinda, captivates her with his off-color ruminations and opaque self-reflections. In blatant defiance of the rules, Lucinda and the Complainer arrange a face-to-face meeting—and fall desperately in love.<br/>Consumed by passion, Lucinda manages only to tear herself away from the Complainer to practice with the alternative band in which she plays bass. The lead singer of the band is Matthew, a confused young man who works at the zoo and has kidnapped a kangaroo to save it from ennui. Denise, the drummer, works at No Shame, a masturbation boutique. The band’s talented lyricist, Bedwin, conflicted about the group’s as-yet-nonexistent fame, is suffering from writer’s block. Hoping to recharge the band’s creative energy, Lucinda “suggests” some of the Complainer’s philosophical musings to Bedwin. When Bedwin transforms them into brilliant songs, the band gets its big break, including an invitation to appear on L.A.’s premiere alternative radio show. The only problem is the Complainer. He insists on joining the band, with disastrous consequences for all.<br/>Brimming with satire and sex, You Don’t Love Me Yet is a funny and affectionate send-up of the alternative band scene, the city of Los Angeles, and the entire genre of romantic comedy, but remains unmistakably the work of the inimitable Jonathan Lethem.", "language": "en", "image": "https://images.isbndb.com/covers/21/83/9780385512183.jpg", "title_long": "You Don"t Love Me Yet: A Novel", "edition": "1", "dimensions": "Height: 8.5 Inches, Length: 6.25 Inches, Weight: 0.85 Pounds, Width: 0.75 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.25}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 0.85}, "height": {"unit": "inches", "value": 8.5}}, "pages": 240, "date_published": "2007-03-13", "subjects": ["Literature & Fiction', 'United States', 'Contemporary', 'Literary'], 'authors": ['Jonathan Lethem'], 'title": "You Don"t Love Me Yet: A Novel", 'isbn13": "9780385512183", "msrp": "0.00", "binding": "Hardcover", "isbn": "038551218X", "isbn10": "038551218X"}}