{"book": {"publisher": "Anchor", "synopsis": "From the Pulitzer Prize-winning author of A Thousand Acres—a luminous novella and short stories that explore the vicissitudes of love, friendship, and marriage. • “A glorious achievement….. Infinitely satisfying….. A triumph.” —The New York Times Book Review<br/><br/>In “The Pleasure of Her Company,” a lonely, single woman befriends the married couple next door, hoping to learn the secret of their happiness. In “Long Distance,” a man finds himself relieved of the obligation to continue an affair that is no longer compelling to him, only to be waylaid by the guilt he feels at his easy escape. And in the incandescently wise and moving title novella, a dentist, aware that his wife has fallen in love with someone else, must comfort her when she is spurned, while maintaining the secret of his own complicated sorrow. Beautifully written, with a wry intelligence and a lively comic touch, The Age of Griefcaptures moments of great intimacy with grace, clarity, and indelible emotional power.", "language": "en", "image": "https://images.isbndb.com/covers/18/75/9780385721875.jpg", "title_long": "The Age of Grief", "edition": "Reprint", "dimensions": "Height: 7.96 Inches, Length: 5.18 Inches, Weight: 0.5 Pounds, Width: 0.5 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.18}, "width": {"unit": "inches", "value": 0.5}, "weight": {"unit": "pounds", "value": 0.5}, "height": {"unit": "inches", "value": 7.96}}, "pages": 224, "date_published": "2002-06-11", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Family Life', 'Short Stories & Anthologies', 'Anthologies', 'Short Stories', 'United States', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors": ["Jane Smiley'], 'title": "The Age of Grief", "isbn13": "9780385721875", "msrp": 15, "binding": "Paperback", "related": {"ePub": "0307787273"}, "isbn": "0385721870", "isbn10": "0385721870", "other_isbns": [{'isbn": "9780307787279", "binding": "printisbn"}]}}