{"book": {"publisher": "Delacorte Press", "synopsis": "With over 13 million copies of her books sold in twenty-two countries, #1 internationally bestselling author Karin Slaughter delivers “crime fiction at its finest.” Now she returns to Grant county, Georgia where the lightning-fast plot, vivid forensic detail, and heart-stopping suspense will thrust readers into the darkest corners of their own imaginations—and push Slaughter to the top of the national bestseller lists.<br/><br/>Sara Linton—resident medical examiner/pediatrician in Grant County, Georgia,—has plenty of hardship to deal with, including defending herself in a heartbreaking malpractice suit. So when her husband, Police chief Jeffery Tolliver, learns that his friend and coworker detective Lena Adams has been arrested for murder and needs Sara’s help, she is not sure she can handle the pressure of it all. But soon Sara an Jeffery are sitting through evidence, peeling back the layers of a mystery that grows darker by the day—until an intricate web of betrayal and vengeance begins to unravel. And suddenly the lives of Sara, Lena, and Jeffery are hanging by the slenderest of threads.", "language": "en", "image": "https://images.isbndb.com/covers/94/76/9780385339476.jpg", "title_long": "Beyond Reach", "edition": "1st", "dimensions": "Height: 9.44 Inches, Length: 6.29 Inches, Weight: 1.04 Pounds, Width: 1.41 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.29}, "width": {"unit": "inches", "value": 1.41}, "weight": {"unit": "pounds", "value": 1.04}, "height": {"unit": "inches", "value": 9.44}}, "pages": 416, "date_published": "2022", "subjects": ["Literature & Fiction', 'United States', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense'], 'authors": ["Karin Slaughter'], 'title": "Beyond Reach", "isbn13": "9780385339476", "msrp": "0.00", "binding": "Hardcover", "isbn": "038533947X", "isbn10": "038533947X", "other_isbns": [{'isbn": "9780440337072", "binding": "printisbn"}]}}