{"book": {"publisher": "Doubleday", "synopsis": "Twelve-thousand feet beneath the Atlantic Ocean . . .<br/>scientists are excavating the most extraordinary undersea discovery ever made. But is it the greatest archaeological find in history—or the most terrifying?<br/><br/>Former naval doctor Peter Crane is urgently summoned to a remote oil platform in the North Atlantic to help diagnose a bizarre medical condition spreading through the rig. But when he arrives, Crane learns that the real trouble lies far below—on “Deep Storm,” a stunningly advanced science research facility built two miles beneath the surface on the ocean floor. The topsecret structure has been designed for one purpose: to excavate a recently discovered undersea site that may hold the answers to a mystery steeped in centuries of myth and speculation.<br/><br/>Sworn to secrecy, Dr. Crane descends to Deep Storm. A year earlier, he is told, routine drilling uncovered the remains of mankind’s most sophisticated ancient civilization: the legendary Atlantis. But now that the site is being excavated, a series of disturbing illnesses has begun to affect the operation. Scientists and technicians are experiencing a bizarre array of symptoms—from simple fatigue to violent psychotic episodes. As Crane is indoctrinated into the strange world of Deep Storm and commences his investigation, he begins to suspect that the covert facility conceals something more complicated than a medical mystery.The discovery of Atlantis might, in fact, be a cover for something far more sinister . . . and deadly.<br/><br/>Like Lincoln Child’s spectacular bestsellers coauthored with Douglas Preston (The Book of the Dead, Relic), Deep Storm melds scientific detail and gripping adventure in a superbly imagined, chillingly real journey into unknown territory. Child is a master of suspense, and Deep Storm is his most ambitious novel to date.", "language": "en", "image": "https://images.isbndb.com/covers/55/04/9780385515504.jpg", "title_long": "Deep Storm: A Novel", "dimensions": "Height: 9.5 Inches, Length: 6.5 Inches, Weight: 1.5 Pounds, Width: 1 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.5}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 1.5}, "height": {"unit": "inches", "value": 9.5}}, "pages": 384, "date_published": "2007-01-30", "subjects": ["Literature & Fiction', 'Contemporary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Technothrillers', 'Historical'], 'authors": ["Lincoln Child'], 'title": "Deep Storm: A Novel", "isbn13": "9780385515504", "msrp": 24.95, 'binding": "Hardcover", "isbn": "0385515502", "isbn10": "0385515502"}}