{"book": {"publisher": "Delta", "synopsis": "In an ancient burial ground on an island off Venice, a young woman’s casket is pried open, an object is wrenched from her hands, and an extraordinary adventure begins.<br/><br/>From the moment he arrives in Venice, Daniel Forster is seduced by the city’s mystery and eroticism. An earnest young academic, Daniel has come for a summer job cataloguing a private collector’s library. But when Daniel’s employer sends him to buy a stolen violin from a petty thief, a chain reaction of violence and deception ignites. Suddenly Daniel is drawn into a police investigation—and a tempest swirling around a beautiful woman, a mysterious palazzo, and a lost musical masterpiece dating back centuries. With each step he takes, Daniel unwittingly retraces a journey that began in 1733, when another young man came to Venice. And when, in this realm of intrigue and beauty, two lovers came face-to-face with a killer—and a mystery was born. Separated by centuries, two tales of passion, betrayal, and danger collide in David Hewson’s dazzling novel. Sweeping us from the intrigue of Vivaldi’s Venice to the gritty world of a modern cop, from the genius of a prodigy to the greed of a killer, Lucifer’s Shadow builds to a shattering crescendo—and one last, breathtaking surprise.", "language": "en", "image": "https://images.isbndb.com/covers/80/59/9780385338059.jpg", "title_long": "Lucifer"s Shadow: A Novel", "edition": "Reprint", "dimensions": "Height: 9.01 Inches, Length: 6.04 Inches, Weight: 0.8 Pounds, Width: 0.85 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.04}, "width": {"unit": "inches", "value": 0.85}, "weight": {"unit": "pounds", "value": 0.8}, "height": {"unit": "inches", "value": 9.01}}, "pages": 384, "date_published": "2005-07-26", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Mystery, Thriller & Suspense', 'Mystery', 'International Mystery & Crime', 'Thrillers & Suspense', 'Suspense', 'Crime', 'Self Service', 'Custom Stores'], 'authors": ["David Hewson'], 'title": "Lucifer"s Shadow: A Novel", 'isbn13": "9780385338059", "msrp": 13.68, "binding": "Paperback", "related": {"Kindle Edition": "0307423158", "ePub": "0307423158"}, "isbn": "0385338058", "isbn10": "0385338058", "other_isbns": [{'isbn": "9780307423153", "binding": "printisbn"}]}}