{"book": {"publisher": "Doubleday", "synopsis": "#1 NEW YORK TIMES BESTSELLER • John Grisham’s first work of nonfiction: a true crime story that will terrify anyone who believes in the presumption of innocence. • LOOK FOR THE NETFLIX ORIGINAL DOCUMENTARY SERIES<br/><br/>“Both an American tragedy and [Grisham’s] strongest legal thriller yet, all the more gripping because it happens to be true.”—Entertainment Weekly<br/><br/>In the town of Ada, Oklahoma, Ron Williamson was going to be the next Mickey Mantle. But on his way to the Big Leagues, Ron stumbled, his dreams broken by drinking, drugs, and women. Then, on a winter night in 1982, not far from Ron’s home, a young cocktail waitress named Debra Sue Carter was savagely murdered. The investigation led nowhere. Until, on the flimsiest evidence, it led to Ron Williamson. The washed-up small-town hero was charged, tried, and sentenced to death—in a trial littered with lying witnesses and tainted evidence that would shatter a man’s already broken life, and let a true killer go free.<br/><br/>Impeccably researched, grippingly told, filled with eleventh-hour drama, The Innocent Man reads like a page-turning legal thriller. It is a book no American can afford to miss.<br/><br/>Don’t miss John Grisham’s new book, THE EXCHANGE: AFTER THE FIRM!", "language": "en", "image": "https://images.isbndb.com/covers/72/32/9780385517232.jpg", "title_long": "The Innocent Man: Murder and Injustice in a Small Town", "edition": "Illustrated", "dimensions": "Height: 9.52 Inches, Length: 6.47 Inches, Weight: 1.48 Pounds, Width: 1.23 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.47}, "width": {"unit": "inches", "value": 1.23}, "weight": {"unit": "pounds", "value": 1.48}, "height": {"unit": "inches", "value": 9.52}}, "pages": 368, "date_published": "2006-10-10", "subjects": ["Biographies & Memoirs', 'True Crime', 'Murder & Mayhem', 'History', 'Americas', 'United States', 'Law', 'Criminal Law', 'Law Enforcement', 'Specialties', 'Legal History', 'Politics & Social Sciences', 'Social Sciences', 'Criminology', 'Politics & Government', 'International & World Politics', 'Specific Topics'], 'authors": ["John Grisham'], 'title": "The Innocent Man: Murder and Injustice in a Small Town", "isbn13": "9780385517232", "msrp": 30, "binding": "Hardcover", "isbn": "0385517238", "isbn10": "0385517238", "other_isbns": [{'isbn": "9780307576019", "binding": "print"}]}}