{"book": {"publisher": "Delacorte Press", "synopsis": "From Atlanta’s wealthiest suburbs to its stark inner-city housing projects, a killer has crossed the boundaries of wealth and race. And the people who are chasing him must cross those boundaries, too. Among them is Michael Ormewood, a veteran detective whose marriage is hanging by a thread—and whose arrogance and explosive temper are threatening his career. And Angie Polaski, a beautiful vice cop who was once Michael’s lover before she became his enemy. But unbeknownst to both of them, another player has entered the game: a loser ex-con who has stumbled upon the killer’s trail in the most coincidental of ways—and who may be the key to breaking the case wide open.<br/><br/>In this gritty, gripping firecracker of a novel, the author of the bestselling Grant County, Georgia, series breaks thrilling new ground, weaving together the threads of a complex, multilayered story with the skill of a master craftsman. Packed with body-bending switchbacks, searing psychological suspense and human emotions, Triptych ratchets up the tension one revelation at a time as it races to a shattering and unforgettable climax.", "language": "en", "image": "https://images.isbndb.com/covers/94/69/9780385339469.jpg", "title_long": "Triptych", "dimensions": "Height: 9 Inches, Length: 6.25 Inches, Weight: 1.45 Pounds, Width: 1.25 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.25}, "width": {"unit": "inches", "value": 1.25}, "weight": {"unit": "pounds", "value": 1.45}, "height": {"unit": "inches", "value": 9}}, "pages": 400, "date_published": "2006-08-16", "subjects": ["Literature & Fiction', 'United States', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense'], 'authors": ["Karin Slaughter'], 'title": "Triptych", "isbn13": "9780385339469", "msrp": 25, "binding": "Hardcover", "related": {"Kindle Edition": "0440336236", "ePub": "0440336236"}, "isbn": "0385339461", "isbn10": "0385339461", "other_isbns": [{'isbn": "9780440336235", "binding": "printisbn"}]}}