{"book": {"publisher": "Dial Press Trade Paperback", "synopsis": "Set against the magnificent backdrop of Alaska in the waning days of World War II, The Cloud Atlas is an enthralling debut novel, a story of adventure and awakening—and of a young soldier who came to Alaska on an extraordinary, top-secret mission…and found a world that would haunt him forever.<br/><br/>Drifting through the night, whisper-quiet, they were the most sublime manifestations of a desperate enemy: Japanese balloon bombs. Made of rice paper, at once ingenious and deadly, they sailed thousands of miles across the Pacific...and once they started landing, the U.S. scrambled teams to find and defuse them, and then keep them secret from an already anxious public. Eighteen-year-old Louis Belk was one of those men. Dispatched to the Alaskan frontier, young Sergeant Belk was better trained in bomb disposal than in keeping secrets. And the mysteries surrounding his mission only increased when he met his superior officer—a brutal veteran OSS spy hunter who knew all too well what the balloons could do—and Lily, a Yup’ik Eskimo woman who claimed she could see the future.<br/><br/>Louis’s superior ushers him into a world of dark secrets; Lily introduces Louis to an equally disorienting world of spirits—and desire. But the world that finally tests them all is Alaska, whose vastness cloaks mysteries that only become more frightening as they unravel. Chasing after the ghostly floating weapons, Louis embarks upon an adventure that will lead him deep into the tundra. There, on the edge of the endless wilderness, he will make a discovery and a choice that will change the course of his life.<br/><br/>At once a heart-quickening mystery and a unique love story, The Cloud Atlas is also a haunting, lyrical rendering of a little-known chapter in history. Brilliantly imagined, beautifully told, this is storytelling at its very best.", "language": "en", "image": "https://images.isbndb.com/covers/69/56/9780385336956.jpg", "title_long": "The Cloud Atlas: A Novel", "edition": "Reprint", "dimensions": "Height: 8.25 Inches, Length: 5.55 Inches, Weight: 0.9 Pounds, Width: 0.8 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.55}, "width": {"unit": "inches", "value": 0.8}, "weight": {"unit": "pounds", "value": 0.9}, "height": {"unit": "inches", "value": 8.25}}, "pages": 368, "date_published": "2004-10-26", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'United States', 'Self Service', 'Custom Stores'], 'authors": ["Liam Callanan'], 'title": "The Cloud Atlas: A Novel", "isbn13": "9780385336956", "msrp": 17, 'binding": "Paperback", "isbn": "0385336950", "isbn10": "0385336950"}}