{"book": {"publisher": "Ember", "synopsis": "For fans of Matt de la Peña and Sandra Cisneros comes a novel about family and identity, where Violet Paz prepares for her quinceañero and learns about her Cuban heritage.<br/><br/>Violet Paz has just turned fifteen, a pivotal birthday in the eyes of her Cuban grandmother. Fifteen is the age when a girl enters womanhood, traditionally celebrating the occasion with a quinceañero.<br/>But while Violet is half Cuban, she’s also half Polish, and more importantly, she feels 100% American. Except for her zany family’s passion for playing dominoes, smoking cigars, and dancing to Latin music, Violet knows little about Cuban culture, nada about quinces, and only tidbits about the history of Cuba.<br/>So when Violet begrudgingly accepts Abuela’s plans for a quinceañero–and as she begins to ask questions about her Cuban roots–cultures and feelings collide. The mere mention of Cuba and Fidel Castro elicits her grandparents’sadness and her father’s anger. Only Violet’s aunt Luz remains open-minded.<br/>With so many divergent views, it’s not easy to know what to believe. All Violet knows is that she’s got to form her own opinions, even if this jolts her family into unwanted confrontations. After all, a quince girl is supposed to embrace responsibility–and to Violet that includes understanding the Cuban heritage that binds her to a homeland she’s never seen.<br/><br/>“Violet’s hilarious cool first-person narrative veers between farce and tenderness, denial and truth.”—Booklist, Starred Review<br/><br/>"This funny and tender chronicle of Violet\"s 15th year...[has] heart and humor."-Kirkus Reviews<br/><br/>“Cuba 15 will make readers laugh, whether or not their families are as loco as Violet’s.”—The Horn Book Magazine<br/><br/>'Osa\'s tale about a warmhearted, fun-loving family, a teenager\'s typical ambivalence about different cultures, the stress of dealing with high school demands and pressures, a budding romance, and how an imaginative, high-spirited young woman handles some thorny issues and does some growing up in the process, rings true and makes for an entertaining story.'-VOYA<br/><br/>'The characters are so charming that while readers are in their company, the experience is interesting and engaging.'-SLJ<br/><br/>A Pura Belpré Honor Book<br/><br/>An ALA Notable Book<br/><br/>An ALA Best Book for Young Adults<br/><br/>A Booklist Top Ten Youth First Novels', 'language": "en", "image": "https://images.isbndb.com/covers/23/38/9780385732338.jpg", "title_long": "Cuba 15 (Random House Reader"s Circle)", 'edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.31 Inches, Weight: 0.54895103238 Pounds, Width: 0.6 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.31}, "width": {"unit": "inches", "value": 0.6}, "weight": {"unit": "pounds", "value": 0.54895103238}, "height": {"unit": "inches", "value": 8}}, "pages": 304, "date_published": "2005-03-08", "subjects": ["Children's Books', 'Teen & Young Adult', 'Literature & Fiction', 'Social & Family Issues', 'Coming of Age', 'Social Issues', 'Self Service', 'Custom Stores'], 'authors": ["Nancy Osa'], 'title": "Cuba 15 (Random House Reader"s Circle)", 'isbn13": "9780385732338", "msrp": 9.99, "binding": "Paperback", "related": {"ePub": "0307433269"}, "isbn": "0385732333", "isbn10": "0385732333", "other_isbns": [{'isbn": "9780307433268", "binding": "printisbn"}]}}