{"book": {"publisher": "Knopf Doubleday Publishing Group", "synopsis": "Few journalists have staked a territory as definitively and passionately as Mikal Gilmore in his twenty-year career writing about rock and roll. Now, for the first time, this collection gathers his cultural criticism, interviews, reviews, and assorted musings. Beginning with Elvis and the birth of rock and roll, Gilmore traces the seismic changes in America as its youth responded to the postwar economic and political climate. He hears in the lyrics of Bob Dylan and Jim Morrison the voices of unrest and fervor, and charts the rise and fall of punk in brilliant essays on Lou Reed, The Sex Pistols, and The Clash. Mikal Gilmore describes Bruce Springsteen"s America and the problem of Michael Jackson. And like no one else, Gilmore listens to the lone voices: Al Green, Marianne Faithfull, Sinead O"Connor, Frank Sinatra.<br/><br/>Four decades of American life are observed through the inimitable lens of rock and roll, and through the provocative and intelligent voice of one of the most committed chroniclers of American music, and its powerful expressions of love, soul, politics, and redemption.", 'language": "en", "image": "https://images.isbndb.com/covers/43/67/9780385484367.jpg", "title_long": "Night Beat: A Shadow of Rock & Roll", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 1.45064168396 Pounds, Width: 1.24 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1.24}, "weight": {"unit": "pounds", "value": 1.45064168396}, "height": {"unit": "inches", "value": 9}}, "pages": 496, "date_published": "1999-02-16", "subjects": ["Literature & Fiction', 'Essays & Correspondence', 'Essays'], 'authors": ["Mikal Gilmore'], 'title": "Night Beat: A Shadow of Rock & Roll", "isbn13": "9780385484367", "msrp": 19, "binding": "Paperback", "related": {"ePub": "0385500297"}, "isbn": "0385484364", "isbn10": "0385484364", "other_isbns": [{'isbn": "9780385500296", "binding": "printisbn"}]}}