{"book": {"publisher": "Doubleday", "synopsis": "The brilliant sequel to Gore Vidal’s acclaimed, bestselling memoir, Palimpsest.<br/><br/>In Point to Point Navigation, the celebrated novelist, essayist, critic, and controversialist Gore Vidal ranges freely over his remarkable life with the signature wit and literary elegance that is uniquely his. The title refers to a form of navigation he resorted to as a first mate in the Navy during World War II. As he says, “As I was writing this account of my life and times since Palimpsest, I felt as if I were again dealing with those capes and rocks in the Bering Sea that we had to navigate so often with a compass made inoperable by weather.” It is a beautifully apt analogy for the hazards (mostly) eluded during his eventful life and for the way this memoir proceeds—far from linear but always on course.<br/><br/>From his desks in Ravello and the Hollywood Hills, Gore Vidal travels in memory through the arenas of literature, television, film, theater, politics and international society where he has cut a broad swath, recounting achievements and defeats, friends and enemies made (and on a number of occasions lost). Among the gathering of notables to be found in these pages, sketched with a draftsman’s ease and evoked with the panache of one of our great raconteurs, are Jack and Jacqueline Kennedy, Tennessee Williams (the “Glorious Bird”), Eleanor Roosevelt, Orson Welles, Johnny Carson, Greta Garbo, Federico Fellini, Rudolph Nureyev, Elia Kazan, and Francis Ford Coppola. Some of the book’s most moving pages are devoted to the illness and death of his partner of five decades, Howard Austen, and indeed the book is, among other things, a meditation on mortality written in the spirit of Montaigne.<br/><br/>Elegiac yet vital and even ornery, Point to Point Navigation is a summing-up of Gore Vidal’s time on the planet that manages to be at once supremely entertaining, endlessly provocative, and thoroughly moving.", "language": "en", "image": "https://images.isbndb.com/covers/72/18/9780385517218.jpg", "title_long": "Point to Point Navigation: A Memoir", "edition": "First Edition", "dimensions": "Height: 9.5 Inches, Length: 6.5 Inches, Weight: 1.2 Pounds, Width: 0.75 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.5}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 1.2}, "height": {"unit": "inches", "value": 9.5}}, "pages": 278, "date_published": "2006-11-07", "subjects": ["Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Memoirs'], 'authors": ["Gore Vidal'], 'title": "Point to Point Navigation: A Memoir", "isbn13": "9780385517218", "msrp": 26, 'binding": "Hardcover", "isbn": "0385517211", "isbn10": "0385517211"}}