{"book": {"publisher": "Anchor", "synopsis": "This fascinating history of a literary and religious masterpiece explores the forces that obstructed and ultimately led to the decision to create an authorized translation, the method of translation and printing, and the central role the King James version of the Bible played in the development of modern English.<br/><br/>In the sixteenth century, to attempt to translate the Bible into a common tongue wasn\"t just difficult, it was dangerous. A Bible in English threatened the power of the monarch and the Church. Early translators like Tyndale, whose work greatly influenced the King James, were hunted down and executed, but the demand for English Bibles continued to grow. Indeed it was the popularity of the Geneva Bible, with its anti-royalist content, that eventually forced James I to sanction his own, pro-monarchy, translation. Errors in early editions--one declared that "thou shalt commit adultery"--and Puritan preferences for the Geneva Bible initially hampered acceptance of the King James, but it went on to become the definitive English-language Bible. McGrath\'s history of the King James Bible’s creation and influence is a worthy tribute to a great work and a joy to read.', 'language": "en", "image": "https://images.isbndb.com/covers/21/62/9780385722162.jpg", "title_long": "In the Beginning: The Story of the King James Bible and How It Changed a Nation, a Language, and a Culture", "edition": "Reprint", "dimensions": "Height: 7.95 Inches, Length: 5.2 Inches, Weight: 0.75 Pounds, Width: 0.85 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 0.85}, "weight": {"unit": "pounds", "value": 0.75}, "height": {"unit": "inches", "value": 7.95}}, "pages": 352, "date_published": "2002-02-19", "subjects": ["Christian Books & Bibles', 'Bibles', 'Churches & Church Leadership', 'Church History', 'Bible Study & Reference', 'Bible Study', 'History & Culture', 'Theology', 'Historical', 'History', 'World', 'Religious', 'Religion & Spirituality', 'Religious Studies'], 'authors": ["Alister McGrath'], 'title": "In the Beginning: The Story of the King James Bible and How It Changed a Nation, a Language, and a Culture", "isbn13": "9780385722162", "msrp": 16.95, "binding": "Paperback", "related": {"ePub": "0307486222"}, "isbn": "0385722168", "isbn10": "0385722168", "other_isbns": [{'isbn": "9780307486226", "binding": "printisbn"}]}}