{"book": {"publisher": "Anchor", "synopsis": "Can you name...Newton"s 3 laws of motion? The 4 horsemen of the Apocalypse? The 5 pillars of Islam? The 6 wives of Henry VIII? The 7 kinds of plane triangles? The 8 Beatitudes? If you"re not sure about the answers to the above, this is the book for you. A compendium of 101 culturally significant particulars from the fields of mythology, religion, literature, history, science, mathematics, art, and music, What Are the 7 Wonders of the World? is a stimulating fusion of facts and fun that makes for an invaluable reference and an entertaining diversion.<br/><br/>Questions are grouped in sections according to the number of items in their answer (all the 3s, all the 4s, all the 5s, etc.), so that the answers are in the form of easily memorized lists. You won"t find Luther's 95 theses, or the 266 Popes, for example, but you will find everything from the 3 sons of Adam and Eve all the way up to the 24 letters of the ancient Greek alphabet.<br/><br/>This clever format lends itself well to quizzing and guessing, which gives it a deliciously sophisticated parlor-game quality. But for those who wish to delve a little deeper, there are thoughtful essays to go with each answer that include fascinating details and place the list in its larger cultural or historical context. Much more than a book of trivia, What Are the 7 Wonders of the World? offers a grand overview of the knowledge needed to appreciate many of the finest things in our cultural and intellectual life.', 'language": "en", "image": "https://images.isbndb.com/covers/06/27/9780385490627.jpg", "title_long": "What are the Seven Wonders of the World? and 100 Other Great Cultural Lists: Fully Explicated", "edition": "Illustrated", "dimensions": "Weight: 1.01 pounds", "dimensions_structured": {"weight": {"unit": "pounds", "value": 1.01}}, "pages": 560, "date_published": "1998", "subjects": ["Humor & Entertainment', 'Trivia & Fun Facts', 'Humor', 'Puzzles & Games', 'Trivia', 'History', 'Historical Study & Educational Resources', 'Reference', 'World', 'Civilization & Culture', 'Encyclopedias & Subject Guides'], 'authors": ["Peter D'Epiro', 'Mary Desmond Pinkowish'], 'title": "What are the Seven Wonders of the World? and 100 Other Great Cultural Lists: Fully Explicated", "isbn13": "9780385490627", "msrp": 14.98, "binding": "Unknown Binding", "related": {"ePub": "0307491072"}, "isbn": "0385490623", "isbn10": "0385490623", "other_isbns": [{'isbn": "9780307491077", "binding": "printisbn"}]}}