{"book": {"publisher": "Delta", "synopsis": "#1 NEW YORK TIMES BEST SELLER • In 1970, Willie Traynor comes to Clanton, Mississippi, in a Triumph Spitfire and a fog of vague ambitions. Within a year, the twenty-three-year-old finds himself the owner of Ford County’s only newspaper, famous for its well-crafted obituaries. While the rest of America is in the grips of turmoil, Clanton lives on the edge of another age—until the brutal murder of a young mother rocks the town and thrusts Willie into the center of a storm.<br/><br/>Daring to report the true horrors of the crime, Willie makes as many friends as enemies in Clanton, and over the next decade he sometimes wonders how he got there in the first place. But he can never escape the crime that shattered his innocence or the criminal whose evil left an indelible stain. Because as the ghosts of the South’s past gather around Willie, as tension swirls around Clanton, men and women who served on a jury nine years ago are starting to die one by one—as a killer exacts the ultimate revenge.<br/><br/>Don’t miss John Grisham’s new book, THE EXCHANGE: AFTER THE FIRM!", "language": "en", "image": "https://images.isbndb.com/covers/96/81/9780385339681.jpg", "title_long": "The Last Juror: A Novel", "edition": "Reprint", "dimensions": "Height: 8 Inches, Length: 5.24 Inches, Weight: 0.67 Pounds, Width: 0.88 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 5.24}, "width": {"unit": "inches", "value": 0.88}, "weight": {"unit": "pounds", "value": 0.67}, "height": {"unit": "inches", "value": 8}}, "pages": 416, "date_published": "2006", "subjects": ["Literature & Fiction', 'United States', 'Contemporary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Legal', 'Spies & Politics', 'Suspense', 'Crime'], 'authors": ["John Grisham'], 'title": "The Last Juror: A Novel", "isbn13": "9780385339681", "msrp": 16, "binding": "Paperback", "related": {"Kindle Edition": "0307576035", "ePub": "0307576035"}, "isbn": "0385339682", "isbn10": "0385339682", "other_isbns": [{'isbn": "9780307576033", "binding": "printisbn"}]}}