{"book": {"publisher": "Anchor Bible", "synopsis": ""The Apocryphal book of I Maccabees (Volume 41 in the acclaimed Anchor Bible series) is an inspirational thriller." With the help of God, the aged priest Mattathias and his sons--Judas Maccabaeus, Jonathan, and Simon--dramatically lead the Jews of Judaea first to victory and then to freedom against the formidable successors of Alexander the Great. Their struggles begin in guerilla warfare, responding to the terrible persecutions decreed by King Antiochus IV, and courageously accomplish their first great triumph--still celebrated in the festival of Hanukkah.<br/><br/>The Introduction to this volume considers not only I Maccabees, but also the parallel accounts found in II Maccabees and shows that the two authors of I & II Maccabees wrote with passionate conviction to teach two sharply opposed points of view. In some cases their convictions blinded them to the truth, but Professor Goldstein renders their teachings accessible to the modern reader and reconstructs what really happened, making valuable contributions to Greek and Roman as well as to Jewish history. Nineteen maps and diagrams set the scene of the dramatic struggle and the troubled times described in I Maccabees.", 'language": "en", "image": "https://images.isbndb.com/covers/53/35/9780385085335.jpg", "title_long": "I Maccabees (The Anchor Bible, Vol. 41)", "edition": "First Edition", "dimensions": "Height: 9.75 Inches, Length: 6.5 Inches, Weight: 2.3 Pounds, Width: 1.75 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.5}, "width": {"unit": "inches", "value": 1.75}, "weight": {"unit": "pounds", "value": 2.3}, "height": {"unit": "inches", "value": 9.75}}, "pages": 624, "date_published": "1976-07-16", "subjects": ["Christian Books & Bibles', 'Bible Study & Reference', 'Commentaries', 'Religion & Spirituality'], 'authors": ["Jonathan A. Goldstein'], 'title": "I Maccabees (The Anchor Bible, Vol. 41)", "isbn13": "9780385085335", "msrp": 42.5, 'binding": "Hardcover", "isbn": "0385085338", "isbn10": "0385085338"}}