{"book": {"publisher": "Doubleday", "synopsis": "“Like most people I didn’t meet Rant Casey until after he was dead. That’s how it works for most celebrities: After they croak, their circle of friends just explodes.…”<br/><br/>Rant is the mind-bending new novel from Chuck Palahniuk, the literary provocateur responsible for such books as the generation-defining classic Fight Club and the pedal-to-the-metal horrorfest Haunted. It takes the form of an oral history of one Buster “Rant” Casey, who may or may not be the most efficient serial killer of our time.<br/><br/>“What ‘Typhoid Mary’ Mallon was to typhoid, what Gaetan Dugas was to AIDS, and Liu Jian-lun was to SARS, Buster Casey would become for rabies.”<br/><br/>A high school rebel who always wins (and a childhood murderer?), Rant Casey escapes from his small hometown of Middleton for the big city. He becomes the leader of an urban demolition derby called Party Crashing. On appointed nights participants recognize one another by such designated car markings as “Just Married” toothpaste graffiti and then stalk and crash into each other. Rant Casey will die a spectacular highway death, after which his friends gather testimony needed to build an oral history of his short, violent life. Their collected anecdotes explore the possibility that his saliva caused a silent urban plague of rabies and that he found a way to escape the prison house of linear time.…<br/><br/>“The future you have, tomorrow, won’t be the same future you had, yesterday.”<br/>—Rant Casey<br/><br/>Expect hilarity, horror, and blazing insight into the desperate and surreal contemporary human condition as only Chuck Palahniuk can deliver it. He"s the postmillennial Jonathan Swift, the visionary to watch to learn what"s —uh-oh—coming next.", 'language": "en", "image": "https://images.isbndb.com/covers/78/74/9780385517874.jpg", "title_long": "Rant: An Oral Biography of Buster Casey", "dimensions": "Height: 8.15 Inches, Length: 5.8 Inches, Weight: 1.05 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.8}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 1.05}, "height": {"unit": "inches", "value": 8.15}}, "pages": 336, "date_published": "2007-05-01", "subjects": ["Humor & Entertainment', 'Humor', 'Self-Help & Psychology', 'Literature & Fiction', 'Genre Fiction', 'Psychological', 'United States', 'Humor & Satire', 'Satire', 'Literary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Psychological Thrillers', 'Historical'], 'authors": ["Chuck Palahniuk'], 'title": "Rant: An Oral Biography of Buster Casey", "isbn13": "9780385517874", "msrp": 24.95, 'binding": "Hardcover", "isbn": "0385517874", "isbn10": "0385517874"}}