{"book": {"publisher": "Doubleday", "synopsis": "Synopsis: \"Who died?\" I said. \"Or is it a secret?\' \'My mother, Vianne Rocher.\' Seeking refuge and anonymity in the cobbled streets of Montmartre, Yanne and her daughters, Rosette and Annie, live peacefully, if not happily, above their little chocolate shop. Nothing unusual marks them out; no red sachets hang by the door. The wind has stopped - at least for a while. Then into their lives blows Zozie de l\'Alba, the lady with the lollipop shoes, and everything begins to change...But this new friendship is not what it seems. Ruthless, devlous and seductive, Zozie de l\'Alba has plans of her own - plans that will shake their world to pieces. And with everything she loves at stake, Yanne must face a difficult choice; to flee, as she has done so many times before, or to confront her most dangerous enemy...Herself. The Lollipop Shoes is a 2007 novel by Joanne Harris—a sequel to her best-selling Chocolat. It was released in the U.S. in 2008 as The Girl with No Shadow). Review: \'Chocolat was a hard act to follow but Harris has managed it in style\' -- DAILY EXPRESS \'Harris is in a class of her own...an absolutely scrumptious read\' -- DAILY MIRROR A delicious urban fairytale, where killer shoes and Aztec myths battle it out with true love and the seductive power of chocolate. -- DAILY MAIL, 4 May 2007 Here is a truly delectable offering... Lush and bewitching, with a dark, mystical heart, this is a novel you can\'t help but devour greedily. -- EASY LIVING MAGAZINE, June 2007 This is Harris\'s best novel to date. -- Financial Times Magazine, 28 April 2007 'About this title' may belong to another edition of this title.', 'language": "en", "image": "https://images.isbndb.com/covers/94/87/9780385609487.jpg", "title_long": "9780385609487", "dimensions": "Weight: 1.61378375784 Pounds", "dimensions_structured": {"weight": {"unit": "pounds", "value": 1.61378375784}}, "pages": 459, "date_published": "2007", "subjects": ["Subjects'], 'authors": ['Joanne Harris'], 'title": "9780385609487", "isbn13": "9780385609487", "msrp": "0.00", "binding": "Hardcover", "isbn": "0385609485", "isbn10": "0385609485"}}