{"book": {"publisher": "W. W. Norton & Company", "synopsis": "In response to the interest of millions of Patrick O"Brian fans, here is the final, partial installment of the Aubrey/Maturin series. Blue at the Mizzen (novel #20) ended with Jack Aubrey getting the news, in Chile, of his elevation to flag rank: Rear Admiral of the Blue Squadron, with orders to sail to the South Africa station. The next novel, unfinished and untitled at the time of the author"s death, would have been the chronicle of that mission, and much else besides. The three chapters left on O"Brian's desk at the time of his death are presented here both in printed version-including his corrections to the typescript-and a facsimile of his manuscript, which goes several pages beyond the end of the typescript to include a duel between Stephen Maturin and an impertinent officer who is courting his fiancée.<br/><br/>Of course we would rather have had the whole story; instead we have this proof that O'Brian's powers of observation, his humor, and his understanding of his characters were undiminished to the end.', 'language": "en", "image": "https://images.isbndb.com/covers/02/56/9780393060256.jpg", "title_long": "21: The Final Unfinished Voyage of Jack Aubrey: Including Facsimile of the Manuscript (Book 21)", "edition": "First Edition", "dimensions": "Height: 10.3 Inches, Length: 7.4 Inches, Weight: 1 Pounds, Width: 0.6 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.4}, "width": {"unit": "inches", "value": 0.6}, "weight": {"unit": "pounds", "value": 1}, "height": {"unit": "inches", "value": 10.3}}, "pages": 144, "date_published": "2004-10-17", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'War', 'Action & Adventure', 'War & Military', 'British & Irish', 'Contemporary'], 'authors": ["Patrick O'Brian'], 'title": "21: The Final Unfinished Voyage of Jack Aubrey: Including Facsimile of the Manuscript (Book 21)", "isbn13": "9780393060256", "msrp": "0.00", "binding": "Hardcover", "isbn": "039306025X", "isbn10": "039306025X", "other_isbns": [{'isbn": "9780393344141", "binding": "print"}]}}