{"book": {"publisher": "W. W. Norton & Company", "synopsis": "For the 75th anniversary, a new edition of the seminal work with an introduction by Pulitzer Prize-winning author Louis Menand. Civilization and Its Discontents may be Sigmund Freud"s best-known work. Originally published in 1930, it seeks to answer ultimate questions: What influences led to the creation of civilization? How did it come to be? What determines its course? In this seminal volume of twentieth-century thought, Freud elucidates the contest between aggression, indeed the death drive, and its adversary eros. He speaks to issues of human creativity and fulfillment, the place of beauty in culture, and the effects of repression.<br/><br/>Louis Menand, author of the Pulitzer Prize-winning The Metaphysical Club, contributor to The New Yorker, and professor of English at Harvard University, reflects on the importance of this work in intellectual thought and why it has become such a landmark book for the history of ideas.<br/><br/>Not available in hardcover for decades, this beautifully rendered anniversary edition will be a welcome addition to readers" shelves.", 'language": "en", "image": "https://images.isbndb.com/covers/99/53/9780393059953.jpg", "title_long": "Civilization and Its Discontents (Complete Psychological Works of Sigmund Freud)", "edition": "The Standard", "dimensions": "Height: 8 Inches, Length: 6.1 Inches, Weight: 0.7 Pounds, Width: 0.8 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.1}, "width": {"unit": "inches", "value": 0.8}, "weight": {"unit": "pounds", "value": 0.7}, "height": {"unit": "inches", "value": 8}}, "pages": 194, "date_published": "2005-01-17", "subjects": ["Health, Fitness & Dieting', 'Psychology & Counseling', 'Pathologies', 'Psychoanalysis', 'Research', 'Sexuality', 'Social Psychology & Interactions', 'History', 'World', 'Civilization & Culture', 'Medical Books', 'Psychology', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Sigmund Freud'], 'title": "Civilization and Its Discontents (Complete Psychological Works of Sigmund Freud)", "isbn13": "9780393059953", "msrp": 42, 'binding": "Hardcover", "isbn": "0393059952", "isbn10": "0393059952"}}