{"book": {"publisher": "W. W. Norton & Company", "synopsis": "The text of this Norton Critical Edition is that of the 1818 first edition, published in three volumes by Lackington, Hughes, Harding, Mavor, and Jones, in which only obvious typographical errors have been corrected. This text represents what Frankenstein"s first readers encountered and is the text favored by scholars. A special critical section, Composition and Revision, includes essays by M. K. Joseph and Anne Mellor that address the issues surrounding teachers" choice of text. Contemporary perspectives of the text are provided in two sections: Contexts helps place the novel in relation to the mind of its creator through writings by Mary Shelley, Percy Bysshe Shelley, Lord Byron, and John William Polidori; Nineteenth-Century Responses collects six reactions to the book from the years 1818 to 1886.<br/><br/>Criticism brings together twelve seminal essays. The emphasis is on range―both critical (psychoanalytic, mythic, new historicist, and feminist essays are included) and chronological (essays span the last thirty years). Christopher Small, George Lebine, Ellen Moers, Sandra M. Gilbert and Susan Gubar, Barbara Johnson, Mary Poovey, Gayatri Chakravorty Spivak, William Veeder, Anne K. Mellor, Susan Winnett, Marilyn Butler, and Lawrence Lipking provide diverse perspectives.<br/><br/>A Chronology and Selected Bibliography are also included.", 'language": "en", "image": "https://images.isbndb.com/covers/45/85/9780393964585.jpg", "title_long": "Frankenstein", "edition": "1", "dimensions": "Height: 8.4 Inches, Length: 5.2 Inches, Weight: 0.73634395508 Pounds, Width: 0.7 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 0.7}, "weight": {"unit": "pounds", "value": 0.73634395508}, "height": {"unit": "inches", "value": 8.4}}, "pages": 339, "date_published": "1995-12-17", "subjects": ["Literature & Fiction', 'Classics', 'History & Criticism', 'Regional & Cultural', 'Literary'], 'authors": ["Mary Wollstonecraft Shelley'], 'title": "Frankenstein", "isbn13": "9780393964585", "msrp": 15.65, 'binding": "Paperback", "isbn": "0393964582", "isbn10": "0393964582"}}