{"book": {"publisher": "W. W. Norton & Company", "synopsis": "Nella Larsen is a central figure in African American, Modernist, and women’s literature. Larsen"s status as a Harlem Renaissance woman writer was rivaled by only Zora Neale Hurston’s. This Norton Critical Edition of her electrifying 1929 novel includes Carla Kaplan’s detailed and thought-provoking introduction, thorough explanatory annotations, and a Note on the Text. An unusually rich “Background and Contexts” section connects the novel to the historical events of the day, most notably the sensational Rhinelander/Jones case of 1925. Fourteen contemporary reviews are reprinted, including those by Alice Dunbar-Nelson, Mary Griffin, and W. E. B. Du Bois. Published accounts from 1911 to 1935―by Langston Hughes, Juanita Ellsworth, and Caleb Johnson, among others―provide a nuanced view of the contemporary cultural dimensions of race and passing, both in America and abroad. Also included are Larsen’s statements on the novel and on passing, as well as a generous selection of her letters and her central writings on “The Tragic Mulatto(a)” in American literature. Additional perspective is provided by related Harlem Renaissance works. “Criticism” provides fifteen diverse critical interpretations, including those by Mary Helen Washington, Cheryl A. Wall, Deborah E. McDowell, David L. Blackmore, Kate Baldwin, and Catherine Rottenberg. A Chronology and Selected Bibliography are also included.", "language": "en", "image": "https://images.isbndb.com/covers/91/69/9780393979169.jpg", "title_long": "Passing: A Norton Critical Edition (Norton Critical Editions)", "edition": "First Edition", "dimensions": "Height: 8.5 Inches, Length: 5.2 Inches, Weight: 1.2 Pounds, Width: 1.3 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.2}, "width": {"unit": "inches", "value": 1.3}, "weight": {"unit": "pounds", "value": 1.2}, "height": {"unit": "inches", "value": 8.5}}, "pages": 584, "date_published": "2007-09-04", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Historical', 'TV, Movie, Video Game Adaptations', 'Urban Life', 'Family Life', 'City Life', 'Friendship', 'Psychological', 'History & Criticism', 'Regional & Cultural', 'Women's Fiction', 'Divorce', 'Domestic Life', 'United States', 'Black & African American', 'Literary'], 'authors": ['Nella Larsen'], 'title": "Passing: A Norton Critical Edition (Norton Critical Editions)", "isbn13": "9780393979169", "msrp": "0.00", "binding": "Paperback", "isbn": "0393979164", "isbn10": "0393979164"}}