{"book": {"publisher": "W. W. Norton & Company", "synopsis": "By the author of the bestselling Moneyball: in football, as in life, the value we place on people changes with the rules of the games they play. The young man at the center of this extraordinary and moving story will one day be among the most highly paid athletes in the National Football League. When we first meet him, he is one of thirteen children by a mother addicted to crack; he does not know his real name, his father, his birthday, or any of the things a child might learn in school such as, say, how to read or write. Nor has he ever touched a football.<br/><br/>What changes? He takes up football, and school, after a rich, Evangelical, Republican family plucks him from the mean streets. Their love is the first great force that alters the world"s perception of the boy, whom they adopt. The second force is the evolution of professional football itself into a game where the quarterback must be protected at any cost. Our protagonist turns out to be the priceless combination of size, speed, and agility necessary to guard the quarterback"s greatest vulnerability: his blind side.", 'language": "en", "image": "https://images.isbndb.com/covers/12/39/9780393061239.jpg", "title_long": "The Blind Side: Evolution of a Game", "dimensions": "Height: 9.6 Inches, Length: 6.5 Inches, Weight: 1.28309036484 Pounds, Width: 1.1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.5}, "width": {"unit": "inches", "value": 1.1}, "weight": {"unit": "pounds", "value": 1.28309036484}, "height": {"unit": "inches", "value": 9.6}}, "pages": 304, "date_published": "2006-09-02", "subjects": ["Self-Help', 'Success', 'Biographies & Memoirs', 'Community & Culture', 'Black & African American', 'Parenting & Relationships', 'Sports & Outdoors', 'Biographies', 'Football (American)'], 'authors": ["Michael Lewis'], 'title": "The Blind Side: Evolution of a Game", "isbn13": "9780393061239", "msrp": "0.00", "binding": "Hardcover", "isbn": "039306123X", "isbn10": "039306123X", "other_isbns": [{'isbn": "9780393066227", "binding": "print"}]}}