{"book": {"publisher": "W. W. Norton & Company", "synopsis": "For both clinicians and their clients there is tremendous value in understanding the psychophysiology of trauma and knowing what to do about its manifestations. This book illuminates that physiology, shining a bright light on the impact of trauma on the body and the phenomenon of somatic memory.<br/><br/>It is now thought that people who have been traumatized hold an implicit memory of traumatic events in their brains and bodies. That memory is often expressed in the symptomatology of posttraumatic stress disorder-nightmares, flashbacks, startle responses, and dissociative behaviors. In essence, the body of the traumatized individual refuses to be ignored.<br/><br/>While reducing the chasm between scientific theory and clinical practice and bridging the gap between talk therapy and body therapy, Rothschild presents principles and non-touch techniques for giving the body its due. With an eye to its relevance for clinicians, she consolidates current knowledge about the psychobiology of the stress response both in normally challenging situations and during extreme and prolonged trauma. This gives clinicians from all disciplines a foundation for speculating about the origins of their clients" symptoms and incorporating regard for the body into their practice. The somatic techniques are chosen with an eye to making trauma therapy safer while increasing mind-body integration.<br/><br/>Packed with engaging case studies, The Body Remembers integrates body and mind in the treatment of posttraumatic stress disorder. It will appeal to clinicians, researchers, students, and general readers.", "language": "en", "image": "https://images.isbndb.com/covers/32/76/9780393703276.jpg", "title_long": "The Body Remembers: The Psychophysiology of Trauma and Trauma Treatment (Norton Professional Book)", "edition": "Illustrated", "dimensions": "Height: 9.6 Inches, Length: 6.4 Inches, Weight: 1.00751253734 Pounds, Width: 0.8 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.4}, "width": {"unit": "inches", "value": 0.8}, "weight": {"unit": "pounds", "value": 1.00751253734}, "height": {"unit": "inches", "value": 9.6}}, "pages": 208, "date_published": "2000-10-17", "subjects": ["Health, Fitness & Dieting', 'Alternative Medicine', 'Healing', 'Mental Health', 'Compulsive Behavior', 'Post-traumatic Stress Disorder', 'Psychology & Counseling', 'Neuropsychology', 'Pathologies', 'Psychotherapy, TA & NLP', 'Medical Books', 'Psychology', 'Clinical Psychology'], 'authors": ["Babette Rothschild'], 'title": "The Body Remembers: The Psychophysiology of Trauma and Trauma Treatment (Norton Professional Book)", "isbn13": "9780393703276", "msrp": 35, "binding": "Hardcover", "related": {"Kindle Edition": "0393068684", "ePub": "0393068684"}, "isbn": "0393703274", "isbn10": "0393703274", "other_isbns": [{'isbn": "9780393068689", "binding": "print"}]}}