{"book": {"publisher": "W. W. Norton & Company", "synopsis": ""So engrossing, clearheaded, and lucid that its arrival is not just welcome but cause for celebration."―Dan Cryer, Newsday Stephen Greenblatt, the charismatic Harvard professor who "knows more about Shakespeare than Ben Jonson or the Dark Lady did' (John Leonard, Harper\'s), has written a biography that enables us to see, hear, and feel how an acutely sensitive and talented boy, surrounded by the rich tapestry of Elizabethan life; full of drama and pageantry, and also cruelty and danger; could have become the world\'s greatest playwright. A young man from the provinces―a man without wealth, connections, or university education―moves to London. In a remarkably short time he becomes the greatest playwright not just of his age but of all time. His works appeal to urban sophisticates and first-time theatergoers; he turns politics into poetry; he recklessly mingles vulgar clowning and philosophical subtlety. How is such an achievement to be explained?<br/><br/>Will in the World interweaves a searching account of Elizabethan England with a vivid narrative of the playwright\'s life. We see Shakespeare learning his craft, starting a family, and forging a career for himself in the wildly competitive London theater world, while at the same time grappling with dangerous religious and political forces that took less-agile figures to the scaffold. Above all, we never lose sight of the great works―A Midsummer Night\'s Dream, Romeo and Juliet, Hamlet, Macbeth, and more―that continue after four hundred years to delight and haunt audiences everywhere. The basic biographical facts of Shakespeare\'s life have been known for over a century, but now Stephen Greenblatt shows how this particular life history gave rise to the world\'s greatest writer. Bringing together little-known historical facts and little-noticed elements of Shakespeare\'s plays, Greenblatt makes inspired connections between the life and the works and deliver 'a dazzling and subtle biography' (Richard Lacayo, Time). Readers will experience Shakespeare\'s vital plays again as if for the first time, but with greater understanding and appreciation of their extraordinary depth and humanity.<br/><br/>A Best Book of the Year: The New York Times 10 Best Books of 2004; Time magazine\'s #1 Best Nonfiction Book; A Washington Post Book World Rave ; An Economist Best Book ; A San Francisco Chronicle Best Book; A Christian Science Monitor Best Book; A Chicago Tribune Best Book; A Pittsburgh Post-Gazette Best Book ; NPR\'s Maureen Corrigan\'s Best. 16 pages of color illustrations', 'language": "en", "image": "https://images.isbndb.com/covers/05/78/9780393050578.jpg", "title_long": "Will in the World: How Shakespeare Became Shakespeare", "edition": "Hardcover Edition", "dimensions": "Height: 9.5 Inches, Length: 6.5 Inches, Weight: 1 Pounds, Width: 1.4 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.5}, "width": {"unit": "inches", "value": 1.4}, "weight": {"unit": "pounds", "value": 1}, "height": {"unit": "inches", "value": 9.5}}, "pages": 386, "date_published": "2004-09-17", "subjects": ["Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Theatre', 'Literature & Fiction', 'Dramas & Plays', 'History & Criticism', 'Movements & Periods'], 'authors": ["Stephen Greenblatt'], 'title": "Will in the World: How Shakespeare Became Shakespeare", "isbn13": "9780393050578", "msrp": 27.95, "binding": "Hardcover", "isbn": "0393050572", "isbn10": "0393050572", "other_isbns": [{'isbn": "9780393079845", "binding": "print"}]}}