{"book": {"publisher": "W. W. Norton & Company", "synopsis": "The text of this Norton Critical Edition is based on Eleanor Marx Aveling’s celebrated translation, revised by Paul de Man. Margaret Cohen’s careful editorial revision modernizes and renews Flaubert’s stylistic masterpiece. In addition, Cohen has added to the Second Edition a new introduction, substantially new annotations, and twenty-one striking images, including photographs and engravings, that inform students’ understanding of middle-class life in nineteenth-century provincial France. In Madame Bovary, Flaubert created a cogent counter discourse that exposed and resisted the dominant intellectual and social ideologies of his age. The novel’s subversion of conventional moral norms inevitably created controversy and eventually led to Flaubert’s prosecution by the French government on charges of offending "public and religious morality." This Norton edition is the only one available that includes the complete manuscript from Flaubert’s 1857 trial. "Criticism' includes sixteen studies regarding the novel’s central themes, twelve of them new to the Second Edition, including essays by Charles Baudelaire, Henry James, Roland Barthes, Jonathan Culler, and Naomi Schor. A Chronology and Selected Bibliography are also included.', 'language": "en", "image": "https://images.isbndb.com/covers/91/76/9780393979176.jpg", "title_long": "Madame Bovary By Flaubert Gustavo Cohen Margaret Aveling Eleanor Marx TRN De Man Paul", "edition": "2nd", "dimensions": "Height: 8.3999832 Inches, Length: 5.1999896 Inches, Weight: 1.2235655541 Pounds, Width: 1.1999976 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.1999896}, "width": {"unit": "inches", "value": 1.1999976}, "weight": {"unit": "pounds", "value": 1.2235655541}, "height": {"unit": "inches", "value": 8.3999832}}, "pages": 576, "date_published": "2004", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Psychological', 'History & Criticism', 'Books & Reading', 'Criticism & Theory', 'Regional & Cultural', 'United States', 'Literary', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Gustave Flaubert'], 'title": "Madame Bovary By Flaubert Gustavo Cohen Margaret Aveling Eleanor Marx TRN De Man Paul", "isbn13": "9780393979176", "msrp": 17.05, 'binding": "Library Binding", "isbn": "0393979172", "isbn10": "0393979172"}}