{"book": {"publisher": "W W Norton & Co Inc", "synopsis": "Lord Henry Wotton watched curiously as Basil Hallward completed a portrait of a remarkably handsome youth. Who was he? Dorian Gray, said the painter, and Lord Henry must never meet him - for his corrupting influence could only lead the innocent boy in a life of terrible Evil... Yet the two do meet, and the consequence is one of the most gripping fantasies in English literature, a story of a picture that ages horribly while its subject - a seducer, a debaucher and a murderer - remains unravaged by Time. The Picture of Dorian Gray (1891) is in part a reflection of Oscar Wilde\"s own tragic life. Five years after its publication, Wilde stood trial for homosexuality, then a serious criminal offence. He was, by his own admission, a dandy who regarded art as a supreme value and spent his energies in search of new sensations, despite the harm done to others. So Dorian Gray seeks pleasure only - until, in reckless abandon, he commits a final, dastardly crime. The dramatic nature of Wilde\"s masterpiece helped make it by far his most popular work of fiction. The story has been staged, filmed, and remains today of lasting interest. This Norton Critical Edition reprints both of the published versions, the Lippencott\"s version of 1890, and the 1891 versions. A varied 'Backgrounds' section inquires into the book\'s pivotal position in Wilde\'s life, the debate over art versus morality provoked by the novel\'s publication, the question of individual freedom raised both in and by the novel, and the reactions of the courts and the public to the book. 'Essays in Criticism' addresses the literary and critical aspects of the novel. Included in this section are essays by Richard Ellmann, Joyce Carol Oates, and Donald L Lawler, among others.', 'language": "en", "image": "https://images.isbndb.com/covers/56/82/9780393955682.jpg", "title_long": "The Picture of Dorian Gray : Authoritative Texts Backgrounds Reviews and Reactions Criticism", "edition": "1st ed", "dimensions": "Height: 8.34644 Inches, Length: 5.1181 Inches, Weight: 1.00751253734 Pounds, Width: 0.98425 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.1181}, "width": {"unit": "inches", "value": 0.98425}, "weight": {"unit": "pounds", "value": 1.00751253734}, "height": {"unit": "inches", "value": 8.34644}}, "pages": 462, "date_published": "1988", "subjects": ["Literature & Fiction', 'Classics', 'Genre Fiction', 'Horror', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ['Oscar Wilde', 'Donald L. Lawler'], 'title": "The Picture of Dorian Gray : Authoritative Texts Backgrounds Reviews and Reactions Criticism", "isbn13": "9780393955682", "msrp": "0.00", "binding": "Paperback", "isbn": "0393955680", "isbn10": "0393955680"}}