{"book": {"publisher": "W. W. Norton & Company", "synopsis": "Einstein\"s cook was lucky. But you, too, can have a scientist in your kitchen: Robert L. Wolke. Do you wish you understood the science of foods, but don\"t want to plow through dry technical books? What Einstein Told His Cook is like having a scientist at your side to answer your questions in plain, nontechnical terms. Chemistry professor and syndicated Washington Post food columnist Robert L. Wolke provides over 100 reliable and witty explanations, while debunking misconceptions and helping you to see through confusing advertising and labeling. In "Sweet Talk' you will learn that your taste buds don\'t behave the way you thought they did, that starch is made of sugar, and that raw sugar isn\'t raw. Did you know that roads have been paved with molasses? Why do cooked foods turn brown? What do we owe to Christopher Columbus\'s mother-in-law? In 'The Salt of the Earth' you will learn about the strange salts in your supermarket. Does sea salt really come from the sea? (Don\'t bet on it.) Why do we salt the water for boiling pasta? And how can you remove excess salt from oversalted soup? (You may be surprised.) In 'The Fat of the Land' you will learn the difference between a fat and a fatty acid, what makes them saturated or unsaturated, and that nonfat cooking sprays are mostly fat. Why don\'t the amounts of fats on food labels add up? Why does European butter taste better than ours? In 'Chemicals in the Kitchen' you will learn what\'s in your tap water, how baking powder and baking soda differ, and what MSG does to food. What Japanese taste sensation is sweeping this country? Is your balsamic vinegar fake? Why do potato chips have green edges? In 'Turf and Surf' you will learn why red meat is red, why ground beef may look as if it came from the Old Gray Mare, and how bones contribute to flavor. Want a juicy turkey with smooth gravy? How does one deal with a live clam, oyster, crab, or lobster? In 'Fire and Ice' you will learn how to buy a range and the difference between charcoal and gas for grilling. Did you know that all the alcohol does not boil off when you cook with wine? How about a surprising way to defrost frozen foods? And yes, hot water can freeze before cold water. In 'Liquid Refreshment' you will learn about the acids and caffeine in coffee, and why 'herb teas' are not teas. Does drinking soda contribute to global warming? Why does champagne foam up? Should you sniff the wine cork? How can you find out how much alcohol there is in your drink? In 'Those Mysterious Microwaves' you will learn what microwaves do―and don\'t do―to your food. What makes a container 'microwave safe'? Why mustn\'t you put metal in a microwave oven? How can you keep microwave-heated water from blowing up in your face? In 'Tools and Technology' you will learn why nothing sticks to nonstick cookware, and what the pressure-cooker manufacturers don\'t tell you. What\'s the latest research on juicing limes? Why are 'instant read' thermometers so slow? Can you cook with magnetism and light? What does irradiation do to our foods?', 'language": "en", "image": "https://images.isbndb.com/covers/18/38/9780393011838.jpg", "title_long": "What Einstein Told His Cook: Kitchen Science Explained", "edition": "1", "dimensions": "Height: 9.5 Inches, Length: 6.5 Inches, Weight: 1.33600130772 Pounds, Width: 1.3 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.5}, "width": {"unit": "inches", "value": 1.3}, "weight": {"unit": "pounds", "value": 1.33600130772}, "height": {"unit": "inches", "value": 9.5}}, "pages": 370, "date_published": "2002-05-17", "subjects": ["Cookbooks, Food & Wine', 'Cooking Methods', 'Cooking Education & Reference', 'Reference', 'Essays', 'History', 'Crafts, Hobbies & Home', 'Home Improvement & Design', 'How-to & Home Improvements', 'Engineering & Transportation', 'Engineering', 'Encyclopedias & Subject Guides', 'Cooking', 'Science & Math', 'Agricultural Sciences', 'Food Science', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Robert L. Wolke'], 'title": "What Einstein Told His Cook: Kitchen Science Explained", "isbn13": "9780393011838", "msrp": 25.95, "binding": "Hardcover", "isbn": "0393011836", "isbn10": "0393011836", "other_isbns": [{'isbn": "9780393339871", "binding": "print"}]}}