{"book": {"publisher": "W. W. Norton & Company", "synopsis": "Without question, The Annotated Christmas Carol is the most authoritative and entertaining edition of Dickens classic ever produced. What would Christmas be without A Christmas Carol? Charles Dickens’s famous ghost story is as much a part of the season as plum pudding and mistletoe, and Michael Patrick Hearn, the celebrated annotator of The Wizard of Oz and The Adventures of Huckleberry Finn, has prepared this sumptuous, thoroughly annotated edition, which has already become the definitive edition of our century. Initially published by Norton in 2004, this is the first edition to combine the original story with Dickens’s Public Reading text, published to coincide with his 1867-68 American tour, which has not been reprinted in nearly a century. Included are rare photographs as well as the original Leech wood engravings and hand-colored etchings, supplemented by other contemporary illustrations by George Cruikshank, Gustave Doré, John Tenniel, and “Phiz.” The Annotated Christmas Carol will be a literary feast for the whole family for generations. 2-color throughout, 100 black-and-white illustrations, and 8 pages of full color", "language": "en", "image": "https://images.isbndb.com/covers/15/82/9780393051582.jpg", "title_long": "The Annotated Christmas Carol: A Christmas Carol in Prose (The Annotated Books)", "edition": "Annotated", "dimensions": "Height: 10.3 Inches, Length: 8.8 Inches, Weight: 2.69625346426 Pounds, Width: 1.3 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 8.8}, "width": {"unit": "inches", "value": 1.3}, "weight": {"unit": "pounds", "value": 2.69625346426}, "height": {"unit": "inches", "value": 10.3}}, "pages": 379, "date_published": "2004-11-17", "subjects": ["Literature & Fiction', 'Classics', 'History & Criticism', 'Regional & Cultural', 'British & Irish', 'Contemporary', 'Literary'], 'authors": ["Charles Dickens'], 'title": "The Annotated Christmas Carol: A Christmas Carol in Prose (The Annotated Books)", "isbn13": "9780393051582", "msrp": 29.95, 'binding": "Hardcover", "isbn": "0393051587", "isbn10": "0393051587"}}