{"book": {"publisher": "W. W. Norton & Company", "synopsis": "The fascinating story behind one of the most highly anticipated movies to come out of Hollywood in recent years. Peter Weir"s astonishing film brings Patrick O"Brian"s world to life, complete with its swashbuckling adventures, brilliantly drawn characterization, romance, and intrigue. It is sure to captivate stalwart enthusiasts of O'Brian's work as well as draw in new fans everywhere. With unique access to the cast and crew, Tom McGregor traces the project, from the actors' boot camp to the filming in the Galapagos Islands and on board a replica ship (in the same studio where Titanic was filmed).<br/><br/>With exclusive photographs and interviews with key members of the cast, including Russell Crowe and Paul Bettany (A Beautiful Mind), and director Peter Weir (Dead Poets' Society, Green Card, The Truman Show), this book records the painstaking work of the crew and stars in making the film as historically accurate as possible, from replicating the uniforms of Nelson's navy to bringing the gun deck of the Surprise incredibly to life. Exclusive behind-the-scenes insight and information on the history of the project are dazzlingly showcased in this unique companion, featuring the same high production standards and imagination as the film itself. 200 color photographs', 'language": "en", "image": "https://images.isbndb.com/covers/55/39/9780393325539.jpg", "title_long": "The Making of Master and Commander: The Far Side of the World", "edition": "First American Edition", "dimensions": "Height: 11 Inches, Length: 8.7 Inches, Weight: 1.85 Pounds, Width: 0.6 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.7}, "width": {"unit": "inches", "value": 0.6}, "weight": {"unit": "pounds", "value": 1.85}, "height": {"unit": "inches", "value": 11}}, "pages": 176, "date_published": "2003-10-17", "subjects": ["Arts & Photography', 'Performing Arts', 'Humor & Entertainment', 'Movies', 'Direction & Production', 'History & Criticism', 'Video'], 'authors": ["Tom McGregor'], 'title": "The Making of Master and Commander: The Far Side of the World", "isbn13": "9780393325539", "msrp": 1.99, 'binding": "Paperback", "isbn": "0393325539", "isbn10": "0393325539"}}