{"book": {"publisher": "W. W. Norton & Company", "synopsis": "DNA evidence not only solves crimes―in Sean Carroll"s hands it will now end the Evolution Wars. DNA is the genetic material that defines us as individuals. Over the last two decades, it has emerged as a powerful tool for solving crimes and determining guilt and innocence. But, very recently, an important new aspect of DNA has been revealed―it contains a detailed record of evolution. That is, DNA is a living chronicle of how the marvelous creatures that inhabit our planet have adapted to its many environments, from the freezing waters of the Antarctic to the lush canopy of the rain forest.<br/><br/>In the pages of this highly readable narrative, Sean Carroll guides the general reader on a tour of the massive DNA record of three billion years of evolution to see how the fittest are made. And what a eye-opening tour it is―one featuring immortal genes, fossil genes, and genes that bear the scars of past battles with horrible diseases. This book clinches the case for evolution, beyond any reasonable doubt. 50 black-and-white illustrations and 8 pages of color", "language": "en", "image": "https://images.isbndb.com/covers/16/35/9780393061635.jpg", "title_long": "The Making of the Fittest: DNA and the Ultimate Forensic Record of Evolution", "edition": "1", "dimensions": "Height: 9.5 Inches, Length: 6.5 Inches, Weight: 1.33159206248 Pounds, Width: 1.1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.5}, "width": {"unit": "inches", "value": 1.1}, "weight": {"unit": "pounds", "value": 1.33159206248}, "height": {"unit": "inches", "value": 9.5}}, "pages": 304, "date_published": "2006-10-17", "subjects": ["Science & Math', 'Biological Sciences', 'Biology', 'Evolution', 'Genetics', 'History & Philosophy'], 'authors": ["Sean B. Carroll'], 'title": "The Making of the Fittest: DNA and the Ultimate Forensic Record of Evolution", "isbn13": "9780393061635", "msrp": "0.00", "binding": "Hardcover", "isbn": "0393061639", "isbn10": "0393061639", "other_isbns": [{'isbn": "9780393069693", "binding": "print"}]}}