{"book": {"publisher": "Vintage", "synopsis": "in this book, an award-winning anthropologist tells the story of the late colonial and early reservation history of the Seneca Indians, and of the prophet Handsome Lake and the revitalization of an American Indian society that he and his followers achieved in the years around 1800.<br/><br/>"Here is a carefully crafted masterpiece of anthropological and historical investigation. It is about both the specific renaissance of the Seneca and the possible renaissance of any people. On its specific subject matter, it will probably remain the definitive study for a long time."—Christian Science Monitor<br/><br/>"Until this volume, there has been no single book written that relates the history and life style of one of the Iroquois peoples with the encompassing depth and breadth of knowledge, clarity, and interest that the subject deserves. Finally, this book does it for the Seneca. It is enthralling history, told in a knowledgeable, highly readable way.'—Alvin M. Joseph Jr., author of The Indian Heritage of America<br/><br/>'This book is at once troubling and richly textured; for it draws skillfully and impartially on the resources of history, ethnology and psychology to chronicle the agony and decline of one of the proudest of American Indian peoples.'—Morris Opler', 'language": "en", "image": "https://images.isbndb.com/covers/69/92/9780394716992.jpg", "title_long": "The Death and Rebirth of the Seneca", "dimensions": "Height: 7.9 Inches, Length: 5.19 Inches, Weight: 0.7495716908 Pounds, Width: 0.91 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.19}, "width": {"unit": "inches", "value": 0.91}, "weight": {"unit": "pounds", "value": 0.7495716908}, "height": {"unit": "inches", "value": 7.9}}, "pages": 416, "date_published": "1972-04-12", "subjects": ["Biographies & Memoirs', 'Community & Culture', 'Indigenous', 'Historical', 'United States', 'History', 'Americas', 'Native American', 'Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies'], 'authors": ["Anthony Wallace'], 'title": "The Death and Rebirth of the Seneca", "isbn13": "9780394716992", "msrp": "0.00", "binding": "Paperback", "related": {"ePub": "0307760561"}, "isbn": "039471699X", "isbn10": "039471699X", "other_isbns": [{'isbn": "9780307760562", "binding": "printisbn"}]}}