{"book": {"publisher": "Vintage", "synopsis": "Represents a selection from Nietzche"s notebooks to find out what he wrote on nihilism, art, morality, religion, and the theory of knowledge, among others.<br/><br/>Nietzsche"s notebooks, kept by him during his most productive years, offer a fascinating glimpse into the workshop and mind of a great thinker, and compare favorably with the notebooks of Gide and Kafka, Camus and Wittgenstein. The Will to Power, compiled from the notebooks, is one of the most famous boooks of the philosophy. Here is the first critical edition in any language.<br/>Down through the Nazi period The Will to Power was often mistakenly considered to be Nietzche"s crowning systematic labor; since World War II it has frequently been denigrated. In fact, it represents a stunning selection from Nietzsche's notebooks, in a a topical arrangement that enables the reader to find what Nietzsche's wrote on a variety of subjects.<br/>Walter Kaufmann, in collaboration with R. J. Holilngdale, brings to this volume his unsurpassed skills as a Nietzsche translator and scholar. Professor Kaufmann has included an approximate date of each note. His running footnote commentary offers information needed to follow Nietzsche's train of thought, and indicates, among other things, which notes were eventually superseded by later formulations. The comprehensive index serves to guide the reader to the extraordinary riches of this book.', 'language": "en", "image": "https://images.isbndb.com/covers/43/71/9780394704371.jpg", "title_long": "The Will to Power", "edition": "Later prt.", "dimensions": "Height: 0.29921259812 Inches, Length: 8.5039369992 Inches, Weight: 0.9038952742 Pounds, Width: 5.4330708606 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.5039369992}, "width": {"unit": "inches", "value": 5.4330708606}, "weight": {"unit": "pounds", "value": 0.9038952742}, "height": {"unit": "inches", "value": 0.29921259812}}, "pages": 608, "date_published": "1968-08-12", "subjects": ["Politics & Social Sciences', 'Philosophy', 'Free Will & Determinism', 'History & Surveys', 'Modern', 'Movements', 'Individual Philosophers'], 'authors": ["Friedrich Nietzsche'], 'title": "The Will to Power", "isbn13": "9780394704371", "msrp": 17.95, "binding": "Paperback", "related": {"Kindle Edition": "0307434745", "ePub": "0307434745"}, "isbn": "0394704371", "isbn10": "0394704371", "other_isbns": [{'isbn": "9780307434746", "binding": "printisbn"}]}}