{"book": {"publisher": "Random House", "synopsis": "No career in modern American letters is at once so brilliant, varied, and controversial as that of Norman Mailer. In a span of more than six decades, Mailer has searched into subjects ranging from World War II to Ancient Egypt, from the march on the Pentagon to Marilyn Monroe, from Henry Miller and Mohammad Ali to Jesus Christ. Now, in The Castle in the Forest, his first major work of fiction in more than a decade, Mailer offers what may be his consummate literary endeavor: He has set out to explore the evil of Adolf Hitler.<br/><br/>The narrator, a mysterious SS man who is later revealed to be an exceptional presence, gives us young Adolf from birth, as well as Hitler’s father and mother, his sisters and brothers, and the intimate details of his childhood and adolescence.<br/><br/>A tapestry of unforgettable characters, The Castle in the Forest delivers its playful twists and surprises with astonishing insight into the nature of the struggle between good and evil that exists in us all. At its core is a hypothesis that propels this novel and makes it a work of stunning originality. Now, on the eve of his eighty-fourth birthday, Norman Mailer may well be saying more than he ever has before.", "language": "en", "image": "https://images.isbndb.com/covers/64/91/9780394536491.jpg", "title_long": "The Castle in the Forest", "edition": "First Edition", "dimensions": "Height: 9.52 Inches, Length: 6.73 Inches, Weight: 1.9 Pounds, Width: 1.54 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.73}, "width": {"unit": "inches", "value": 1.54}, "weight": {"unit": "pounds", "value": 1.9}, "height": {"unit": "inches", "value": 9.52}}, "pages": 477, "date_published": "2007-01-23", "subjects": ["Literature & Fiction', 'Literary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Spies & Politics'], 'authors": ["Norman Mailer'], 'title": "The Castle in the Forest", "isbn13": "9780394536491", "msrp": 27.95, "binding": "Hardcover", "related": {"ePub": "1588365905"}, "isbn": "0394536495", "isbn10": "0394536495", "other_isbns": [{'isbn": "9781588365903", "binding": "printisbn"}]}}