{"book": {"publisher": "Houghton Mifflin", "synopsis": "«Dicevi che è da stupidi compiere un delitto, perché non è possibile muovere gli uomini come figure su una scacchiera. Io allora per contraddirti, ma senza vera convinzione, sostenni che proprio il garbuglio dei rapporti umani ti permette di compiere delitti che non si possono scoprire.»<br/><br/>Esiste il delitto perfetto? Gastmann, "demonio in forma umana", ne è convinto, e per dimostrarlo al commissario Bärlach - e vincere la temeraria scommessa fatta in una bettola sul Bosforo - getta uno sconosciuto dal ponte di Galata. Ormai i due sono incatenati l\"uno all\'altro. Per oltre quarant\'anni il commissario seguirà imperterrito le orme di Gastmann, nel vano tentativo di fornire le prove dei delitti via via più audaci, efferati e sacrileghi che costui ha commesso per capriccio. Finché un giorno l\'assassinio dell\'ispettore Schmied della polizia di Berna - la città dove Bärlach è nato, e che lui chiama il suo 'aureo sepolcro' - lo metterà nuovamente di fronte al suo nemico, e al sinistro viluppo di trame politiche e finanziarie di cui questi tira le fila. A Bärlach non resta molto da vivere: giusto il tempo di regolare i conti una volta per tutte. Ormai ha emesso il suo verdetto - ed è una condanna a morte. Quando Georges Simenon, che di noir se ne intendeva, lesse questo romanzo cupo, implacabile e lacerante, disse semplicemente: "Non so che età abbia l\"autore. Se è alla sua prima prova, credo che farà strada'.', 'language": "en", "image": "https://images.isbndb.com/covers/49/95/9780395044995.jpg", "title_long": "Der Richter und sein Henker (German Edition)", "edition": "1", "dimensions": "Height: 7.75 Inches, Length: 5 Inches, Weight: 0.5 Pounds, Width: 0.25 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 0.25}, "weight": {"unit": "pounds", "value": 0.5}, "height": {"unit": "inches", "value": 7.75}}, "pages": 191, "date_published": "1972-06-23", "subjects": ["Reference', 'Foreign Language Study & Reference', 'Instruction', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Friedrich Durrenmatt'], 'title": "Der Richter und sein Henker (German Edition)", "isbn13": "9780395044995", "msrp": 41.95, 'binding": "Paperback", "isbn": "0395044995", "isbn10": "0395044995"}}