{"book": {"publisher": "G.P. Putnam"s Sons", "synopsis": "A Massachusetts state investigator is called home from Knoxville, Tennessee, where he is completing a course at the National Forensic Academy. His boss, the district attorney, attractive but hard-charging, is planning to run for governor, and as a showcase she\"s planning to use a new crime initiative called At Risk-its motto: "Any crime, any time.' In particular, she\'s been looking for a way to employ cutting-edge DNA technology, and she thinks she\'s found the perfect subject in an unsolved twenty-year-old murder-in Tennessee. If her office solves the case, it ought to make them all look pretty good, right?<br/><br/>Her investigator is not so sure-not sure about anything to do with this woman, really-but before he can open his mouth, a shocking piece of violence intervenes, an act that shakes up not only both their lives but the lives of everyone around them. It\'s not a random event. Is it personal? Is it professional? Whatever it is, the implications are very, very bad indeed . . . and they\'re about to get much worse.<br/><br/>Sparks fly, traps spring, twists abound-this is the master working at the top of her game. View the trailer for 'Patricia Cornwell\'s At Risk', premiering on Lifetime on April 10, 2010.', 'language": "en", "image": "https://images.isbndb.com/covers/36/24/9780399153624.jpg", "title_long": "At Risk (At Risk, 1)", "edition": "First ed; First Printing", "dimensions": "Height: 8.75 Inches, Length: 6 Inches, Weight: 0.8 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 0.8}, "height": {"unit": "inches", "value": 8.75}}, "pages": 212, "date_published": "2006-05-23", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Medical', 'Contemporary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense', 'Self Service', 'Custom Stores'], 'authors": ["Patricia Cornwell'], 'title": "At Risk (At Risk, 1)", "isbn13": "9780399153624", "msrp": 21.95, "binding": "Hardcover", "related": {"Kindle Edition": "1101205784", "ePub": "1101205784"}, "isbn": "0399153624", "isbn10": "0399153624", "other_isbns": [{'isbn": "9781101205785", "binding": "print"}]}}