{"book": {"publisher": "Routledge", "synopsis": "Introduction to Phenomenology is an outstanding and comprehensive guide to phenomenology. Dermot Moran lucidly examines the contributions of phenomenology"s nine seminal thinkers: Brentano, Husserl, Heidegger, Gadamer, Arendt, Levinas, Sartre, Merleau-Ponty and Derrida.<br/>Written in a clear and engaging style, Introduction to Phenomenology charts the course of the phenomenological movement from its origins in Husserl to its transformation by Derrida. It describes the thought of Heidegger and Sartre, phenomonology"s most famous thinkers, and introduces and assesses the distinctive use of phenomonology by some of its lesser known exponents, such as Levinas, Arendt and Gadamer. Throughout the book, the enormous influence of phenomenology on the course of twentieth-century philosophy is thoroughly explored.<br/>This is an indispensible introduction for all unfamiliar with this much talked about but little understood school of thought. Technical terms are explained throughout and jargon is avoided. Introduction to Phenomenology will be of interest to all students seeking a reliable introduction to a key movement in European thought.", 'language": "en", "image": "https://images.isbndb.com/covers/37/34/9780415183734.jpg", "title_long": "Introduction to Phenomenology", "edition": "1", "dimensions": "Height: 9.21 Inches, Length: 6.14 Inches, Weight: 2.425084882 Pounds, Width: 1.34 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6.14}, "width": {"unit": "inches", "value": 1.34}, "weight": {"unit": "pounds", "value": 2.425084882}, "height": {"unit": "inches", "value": 9.21}}, "pages": 592, "date_published": "1999-12-23", "subjects": ["Politics & Social Sciences', 'Philosophy', 'History & Surveys', 'Movements', 'Archaeology', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Dermot Moran'], 'title": "Introduction to Phenomenology", "isbn13": "9780415183734", "msrp": 54.95, "binding": "Paperback", "isbn": "0415183731", "isbn10": "0415183731", "other_isbns": [{'isbn": "9781134671052", "binding": "print"}]}}