{"book": {"publisher": "Routledge", "synopsis": "First published in 2002. Few movies have captured our imagination as deeply and enduringly as those of the "Alien" quartet, which follow the odyssey of Sigourney Weaver"s Flight Lieutenant Ellen Ripley. In this gripping and limpidly written book, Stephen Mulhall shows why these films fascinate us, by showing that they are compelling examples of philosophy in action. Bringing a philosopher's eye to cinema, he argues that the 'Alien' films take us deep into the question of what it is to be human. By developing the sexual significance of the aliens themselves and of Ripley's resistance to them, these films explore the relation of human identity to the body, in the context of a hyper-Darwinian universe which both sharpens and subverts the distinction between the natural and the technological, and which pits the hope of redemption against nihilism. The book also considers the nature of 'sequeldom· in contemporary cinema. What is the relation between each 'Alien· movie's distinctive plot and the overarching narrative of the 'Alien' universe? How does the work of each director who has contributed to the 'Alien· series relate to the themes of their other films, such as Ridley Scott's Bladerunner, James Cameron's Terminator and David Fincher's Se7en? On Film is essential reading for anyone interested in film, philosophy and cultural and visual studies, and in the way philosophy can enrich our understanding of cinema.', 'language": "en", "image": "https://images.isbndb.com/covers/79/62/9780415247962.jpg", "title_long": "On Film (Thinking in Action)", "edition": "1", "dimensions": "Height: 7.5 Inches, Length: 5 Inches, Weight: 0.39903669422 Pounds, Width: 0.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 0.5}, "weight": {"unit": "pounds", "value": 0.39903669422}, "height": {"unit": "inches", "value": 7.5}}, "pages": 152, "date_published": "2001-12-14", "subjects": ["Arts & Photography', 'Performing Arts', 'Humor & Entertainment', 'Movies', 'History & Criticism', 'Politics & Social Sciences', 'Philosophy', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Stephen Mulhall'], 'title": "On Film (Thinking in Action)", "isbn13": "9780415247962", "msrp": 24.95, "binding": "Paperback", "isbn": "0415247969", "isbn10": "0415247969", "other_isbns": [{'isbn": "9781134537983", "binding": "print"}, {"isbn": "9781134537990", "binding": "saleableprint"}]}}