{"book": {"publisher": "Hachette Books", "synopsis": "Bestselling author Jamie Oliver finally devotes an entire book to America\"s favorite cuisine -- Italian!<br/><br/>Italy and its wonderful flavors have always had a major influence on Jamie Oliver\"s food and cooking. In Jamie\"s Italy, he travels this famously gastronomic country paying homage to the classic dishes of each region and searching for new ideas to bring home. The result is a sensational collection of Italian recipes, old and new, that will ensure that Italy\'s influence reaches us all.<br/><br/>Italy has inspired Jamie Oliver throughout his career. His ambition has always been to travel across the country on a quest to capture the very essence of Italian cooking -- and to produce the best and simplest Italian cookbook for everybody anywhere to enjoy.<br/><br/>Jamie\'s Italy is the result of that journey -- and it\'s a land of plenty. As well as providing more than 120 brand-new recipes for everything from risotto to roasts and spaghetti to stews, structured as traditional trattoria menus, Jamie takes you all over Italy to cook with and learn from the real masters of Italian cuisine: the locals. Far from the standard 'lemons and olives' version of Italian cooking, Jamie\'s Italy is a cookbook by the people for the people. From Sicily to Tuscany, it\'s about the local fishermen, family bakers, and, of course, the 'Mamas,' sharing their recipes and the tips that have gone into their cooking for generations. But it\'s not only mouthwatering food that Jamie brings back home: it\'s also the spirit that makes cooking and eating absolutely central to family life, whichever part of Italy you\'re in.<br/><br/>Bursting with the warmth and hospitality of real family life, this is both a superbly accessible cookbook and a unique travelogue and diary, in which you\'ll find the authentic flavor of Italy and the people who live there. If you love quality food prepared with genuine passion -- you\'ll never want to leave Jamie\'s Italy.', 'language": "en", "image": "https://images.isbndb.com/covers/19/58/9781401301958.jpg", "title_long": "Jamie"s Italy", 'edition": "Illustrated", "dimensions": "Height: 10 Inches, Length: 7.75 Inches, Weight: 2.52 Pounds, Width: 1.25 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.75}, "width": {"unit": "inches", "value": 1.25}, "weight": {"unit": "pounds", "value": 2.52}, "height": {"unit": "inches", "value": 10}}, "pages": 320, "date_published": "2006-11-14", "subjects": ["Cookbooks, Food & Wine', 'Cooking Education & Reference', 'Reference', 'Regional & International', 'European', 'Celebrities & TV Shows', 'Encyclopedias & Subject Guides', 'Cooking'], 'authors": ["Jamie Oliver'], 'title": "Jamie"s Italy", 'isbn13": "9781401301958", "msrp": 34.95, 'binding": "Hardcover", "isbn": "1401301959", "isbn10": "1401301959"}}