{"book": {"publisher": "Hyperion", "synopsis": "“The words say "It’s not easy being green," but the song is about knowing who you are. And in it you hear Jim’s message most clearly. He believed that people are good and that they want to do their best and that no matter how or why we might be different from anybody else, we should learn to love who we are and be proud of it.”<br/>—Ray Charles<br/><br/>In the tradition of The World According to Mister Rogers, a timeless collection of wisdom on life, friendship, individuality, creativity, collaboration, and more -- from Jim Henson and Friends<br/><br/>There are few things that evoke such a universal feeling of warmth and humor as the work of Jim Henson. In his own words, as well as those of some of his best-known characters like Kermit the Frog and Ernie, we get a glimpse of the philosophy and humor that was so essential to Jim"s creations. We also get a behind-the-scenes glimpse of the collaborative spirit of this gentle artistic genius from the people Jim knew, loved, and inspired.<br/><br/>This uplifting collection of quotes, stories, anecdotes, songs, and insights gives new life to Jim's magical world. With chapters titled Dynamite Determination; Listen to Your Heart; Together We Can Do It; It Starts When We're Kids; and A Part of Everything and Everyone, It's Not Easy Being Green is by turns entertaining, inspiring, and laugh-out-loud funny, reminding us that every day counts. Readers young and old will cherish this collection.<br/><br/>Culled from The Jim Henson Company archives, program transcripts, personal letters, and interviews, along with some of Jim's never-before-published writings, It's Not Easy Being Green is a testament to the legacy of a man who changed the way we see the world.', 'language": "en", "image": "https://images.isbndb.com/covers/24/29/9781401302429.jpg", "title_long": "It"s Not Easy Being Green: And Other Things to Consider", 'edition": "First Edition", "dimensions": "Height: 6.5 Inches, Length: 5.625 Inches, Weight: 0.6 Pounds, Width: 0 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.625}, "width": {"unit": "inches", "value": 0}, "weight": {"unit": "pounds", "value": 0.6}, "height": {"unit": "inches", "value": 6.5}}, "pages": 208, "date_published": "2005-09-14", "subjects": ["Self-Help', 'Motivational', 'Personal Transformation', 'Arts & Photography', 'Performing Arts', 'Reference', 'Quotations', 'Religion & Spirituality'], 'authors": ["Jim Henson', 'The Muppets and Friends'], 'title": "It"s Not Easy Being Green: And Other Things to Consider", 'isbn13": "9781401302429", "msrp": 16.95, 'binding": "Hardcover", "isbn": "1401302424", "isbn10": "1401302424"}}