{"book": {"publisher": "Union Square Kids", "synopsis": "The illustrations for this series were created by Scott McKowen, who, with his wife Christina Poddubiuk, operates Punch & Judy Inc., a company specializing in design and illustration for theater and performing arts. Their projects often involve research into the visual aspects of historical settings and characters. Christina is a theater set and costume designer and contributed advice on the period clothing for the illustrations.<br/><br/>Scott created these drawings in scratchboard an engraving medium which evokes the look of popular art from the period of these stories. Scratchboard is an illustration board with a specifically prepared surface of hard white chalk. A thin layer of black ink is rolled over the surface, and lines are drawn by hand with a sharp knife by scraping through the ink layer to expose the white surface underneath. The finished drawings are then scanned and the color is added digitally.<br/><br/>The beautiful Meg, artistic tomboy Jo, doomed Beth, and selfish Amy: since the publication of Little Women in 1869, these four sisters have become America’s most beloved literary siblings. Louisa May Alcott’s rich and realistic portrait has inspired three movies and stirred the emotions of countless young girls. Set in New England during the Civil War, the novel follows the adventures of the March sisters as they struggle to pursue their dreams.", "language": "en", "image": "https://images.isbndb.com/covers/45/80/9781402714580.jpg", "title_long": "Little Women (Union Square Kids Unabridged Classics)", "edition": "Unabridged", "dimensions": "Height: 8.25 Inches, Length: 6.5 Inches, Weight: 2.18919026166 Pounds, Width: 2 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.5}, "width": {"unit": "inches", "value": 2}, "weight": {"unit": "pounds", "value": 2.18919026166}, "height": {"unit": "inches", "value": 8.25}}, "pages": 526, "date_published": "2004-10-01", "subjects": ["Literature & Fiction', 'Classics', 'Teen & Young Adult', 'Girls & Women', 'Self Service', 'Custom Stores'], 'authors": ["Louisa May Alcott'], 'title": "Little Women (Union Square Kids Unabridged Classics)", "isbn13": "9781402714580", "msrp": 14.95, "binding": "Hardcover", "isbn": "1402714580", "isbn10": "1402714580", "other_isbns": [{'isbn": "9781402760860", "binding": "printisbncanonical"}]}}