{"book": {"publisher": "Sterling", "synopsis": "The illustrations for this series were created by Scott McKowen, who, with his wife Christina Poddubiuk, operates Punch & Judy Inc., a company specializing in design and illustration for theater and performing arts. Their projects often involve research into the visual aspects of historical settings and characters. Christina is a theater set and costume designer and contributed advice on the period clothing for the illustrations.<br/><br/>Scott created these drawings in scratchboard an engraving medium which evokes the look of popular art from the period of these stories. Scratchboard is an illustration board with a specifically prepared surface of hard white chalk. A thin layer of black ink is rolled over the surface, and lines are drawn by hand with a sharp knife by scraping through the ink layer to expose the white surface underneath. The finished drawings are then scanned and the color is added digitally.<br/><br/>Born in India, the unattractive and willful Mary Lennox has remained in the care of servants for as long as she can remember. But the girl’s life changes when her mother and father die and she travels to Yorkshire to live with her uncle. Dark, dreary Misselthwaite Manor seems full of mysteries, including a very special garden, locked tight for 10 years. With the help of Dickon, a local boy, Mary intends to uncover its secrets.", "language": "ru", "image": "https://images.isbndb.com/covers/45/97/9781402714597.jpg", "title_long": "Secret Garden", "edition": "Unabridged", "dimensions": "Height: 8.25 Inches, Length: 6.5 Inches, Weight: 1.1794731017 Pounds, Width: 1.25 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.5}, "width": {"unit": "inches", "value": 1.25}, "weight": {"unit": "pounds", "value": 1.1794731017}, "height": {"unit": "inches", "value": 8.25}}, "pages": 248, "date_published": "2004", "subjects": ["Literature & Fiction', 'World Literature', 'Russian & Soviet'], 'authors": ["Author'], 'title": "Secret Garden", "isbn13": "9781402714597", "msrp": 9.95, "binding": "Hardcover", "isbn": "1402714599", "isbn10": "1402714599", "other_isbns": [{'isbn": "9781402792717", "binding": "printisbncanonical"}]}}