{"book": {"publisher": "Classic Publishing Corporation", "synopsis": "The illustrations for this series were created by Scott McKowen, who, with his wife Christina Poddubiuk, operates Punch & Judy Inc., a company specializing in design and illustration for theater and performing arts. Their projects often involve research into the visual aspects of historical settings and characters. Christina is a theater set and costume designer and contributed advice on the period clothing for the illustrations.<br/><br/>Scott created these drawings in scratchboard an engraving medium which evokes the look of popular art from the period of these stories. Scratchboard is an illustration board with a specifically prepared surface of hard white chalk. A thin layer of black ink is rolled over the surface, and lines are drawn by hand with a sharp knife by scraping through the ink layer to expose the white surface underneath. The finished drawings are then scanned and the color is added digitally.<br/><br/>Every child loves a story about a horse, and Black Beauty remains one of the finest, most touching ever written. Set in Victorian London, the novel follows the shifting fortunes of a horse as he moves from owner to owner. Narrated by the noble Black Beauty himself, the tale offers an animal’s perspective of the world, and highlights the thoughtless, even cruel treatment animals endured during that period.", "language": "en", "image": "https://images.isbndb.com/covers/45/28/9781402714528.jpg", "title_long": "BLACK BEAUTY HARDCOVER", "edition": "Unknown", "dimensions": "Weight: 0.65 Pounds", "dimensions_structured": {'weight": {"unit": "pounds", "value": 0.65}}, "pages": 208, "date_published": "1970", "subjects": ["Literature & Fiction', 'Classics'], 'authors": ["Anna Sewell'], 'title": "BLACK BEAUTY HARDCOVER", "isbn13": "9781402714528", "msrp": "0.00", "binding": "Hardcover", "isbn": "1402714521", "isbn10": "1402714521", "other_isbns": [{'isbn": "9781402792670", "binding": "printisbncanonical"}]}}