{"book": {"publisher": "Wiley-Blackwell", "synopsis": "This important new book addresses key topics in contemporary conservation biology. Written by an internationally renowned team of authors, Key Topics in Conservation Biology explores cutting-edge issues in modern biodiversity conservation, including controversial subjects such as rarity and prioritization, conflict between people and wildlife, the human aspect of conservation, the relevance of animal welfare, and the role of nongovernment organizations. Key Topics also tackles the management of wildlife diseases, and examines the impact of bushmeat extraction and the role of hunting in the conservationist"s toolbox. Other essays explore basic tools of conservation biology, such as computer modeling, conservation genetics, metapopulation processes, and the ingenious use of hi-tech equipment. Each topic is explored by three top international experts, assembled to bring their cross-cutting knowledge to a penetrating synthesis of the issues from both theoretical and practical perspectives.<br/>The interdisciplinary nature of biodiversity conservation is reflected throughout the book. Each essay examines the fundamental principles of the topic, the methodologies involved and, crucially, the human dimension. In this way, Key Topics in Conservation Biology embraces the issues from cutting-edge ecological science to policy, environmental economics, governance, ethics, and the practical issues of implementation.<br/>Key Topics in Conservation Biology will be a valuable resource in universities and colleges, government departments, and conservation agencies. It is aimed particularly at senior undergraduate and graduate students in conservation biology and wildlife management, and those taking Masters degrees in any field relevant to conservation. Conservation practitioners, policy-makers, and the wider general public eager to understand more about important environmental issues will also find this book invaluable.", "language": "en", "image": "https://images.isbndb.com/covers/24/98/9781405122498.jpg", "title_long": "Key Topics in Conservation Biology", "edition": "1", "dimensions": "Height: 9.799193 Inches, Length: 7.499985 Inches, Weight: 1.4109584768 Pounds, Width: 0.70866 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.499985}, "width": {"unit": "inches", "value": 0.70866}, "weight": {"unit": "pounds", "value": 1.4109584768}, "height": {"unit": "inches", "value": 9.799193}}, "pages": 328, "date_published": "2006-11-17", "subjects": ["Business & Money', 'Economics', 'Science & Math', 'Biological Sciences', 'Biology', 'Ecology', 'Earth Sciences', 'Environmental Science', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": [], "title": "Key Topics in Conservation Biology", "isbn13": "9781405122498", "msrp": 97.95, "binding": "Paperback", "isbn": "1405122498", "isbn10": "1405122498", "other_isbns": [{'isbn": "9781444309065", "binding": "ebook"}]}}