{"book": {"publisher": "Books on Tape", "synopsis": "Combining southern warmth with unabashed emotion and side-splitting hilarity, Fannie Flagg takes readers back to Elmwood Springs, Missouri, where the most unlikely and surprising experiences of a high-spirited octogenarian inspire a town to ponder the age-old Why are we here? Life is the strangest thing. One minute, Mrs. Elner Shimfissle is up in her tree, picking figs, and the next thing she knows, she is off on an adventure she never dreamed of, running into people she never in a million years expected to meet. Meanwhile, back home, Elner’s nervous, high-strung niece Norma faints and winds up in bed with a cold rag on her head; Elner’s neighbor Verbena rushes immediately to the Bible; her truck driver friend, Luther Griggs, runs his eighteen-wheeler into a ditch–and the entire town is thrown for a loop and left wondering, “What is life all about, anyway?” Except for Tot Whooten, who owns Tot’s Tell It Like It Is Beauty Shop. Her main concern is that the end of the world might come before she can collect her social security. In this comedy-mystery, those near and dear to Elner discover something Heaven is actually right here, right now, with people you love, neighbors you help, friendships you keep. Can’t Wait to Get to Heaven is proof once more that Fannie Flagg “was put on this earth to write” (Southern Living), spinning tales as sweet and refreshing as iced tea on a summer day, with a little extra kick thrown in.", "language": "en", "image": "https://images.isbndb.com/covers/06/87/9781415930687.jpg", "title_long": "Cant Wait to Get to Heaven (Can"t Wait until I get to Heaven)", "edition": "Unabridged", "dimensions": "Weight: 0.75 Pounds", "dimensions_structured": {"weight": {"unit": "pounds", "value": 0.75}}, "pages": 384, "date_published": "2006", "subjects": ["Subjects'], 'authors": ['Fannie Flagg'], 'title": "Cant Wait to Get to Heaven (Can"t Wait until I get to Heaven)", 'isbn13": "9781415930687", "msrp": "0.00", "binding": "Audio CD", "isbn": "1415930686", "isbn10": "1415930686"}}