{"book": {"publisher": "Pocket Star", "synopsis": "In New York Times and USA TODAY bestselling author Kresley Cole’s sizzling series, a fierce werewolf and a bewitching vampire become unlikely soul mates whose passion will test the boundaries of life and death.<br/><br/>After enduring years of torture from the vampire horde, Lachlain MacRieve, leader of the Lykae Clan, is enraged to find the predestined mate he’s waited millennia for is a vampire. Or partly one. Emmaline Troy is a small, ethereal half Valkyrie/half vampire, who somehow begins to soothe the fury burning within him.<br/><br/>Sheltered Emmaline finally sets out to uncover the truth about her deceased parents—until a powerful Lykae claims her as his mate and forces her back to his ancestral Scottish castle. There, her fear of the Lykae—and their notorious dark desires—ebbs as he begins a slow, wicked seduction to sate her own dark cravings.<br/><br/>Yet when an ancient evil from her past resurfaces, will their desire deepen into a love that can bring a proud warrior to his knees and turn a gentle beauty into the fighter she was born to be?", "language": "en", "image": "https://images.isbndb.com/covers/98/75/9781416509875.jpg", "title_long": "A Hunger Like No Other (Immortals After Dark, Book 1)", "edition": "Reissue", "dimensions": "Height: 6.75 Inches, Length: 4.1875 Inches, Weight: 0.5 Pounds, Width: 0.8 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 4.1875}, "width": {"unit": "inches", "value": 0.8}, "weight": {"unit": "pounds", "value": 0.5}, "height": {"unit": "inches", "value": 6.75}}, "pages": 384, "date_published": "2006-04-01", "subjects": ["Literature & Fiction', 'United States', 'Erotica', 'Paranormal', 'Romantic', 'Suspense', 'Romance', 'Vampires', 'Fantasy', 'Werewolves & Shifters', 'Self Service', 'Custom Stores'], 'authors": ["Kresley Cole'], 'title": "A Hunger Like No Other (Immortals After Dark, Book 1)", "isbn13": "9781416509875", "msrp": 7.99, "binding": "Mass Market Paperback", "related": {"ePub": "1416523006"}, "isbn": "1416509879", "isbn10": "1416509879", "other_isbns": [{'isbn": "9781416523000", "binding": "print"}]}}