{"book": {"publisher": "Baen", "synopsis": "Great Harry is dead, and England is ruled by a dour Protector for 10-year-old Edward VI多-a Protector intent on keeping total control over the young king and no friend to Lady Elizabeth because of her brother多s fondness for her. In the great lens and the dark pool that hold Visions for the FarSeers of the Bright Court and the Dark, the images change and waver. A pale, thin girl sometimes wears a crown and sometimes has no head; King Edward and his Court grow misty as he changes from boy to stripling. But the fires of Mary多s reign still burn bright as they swallow writhing men, women, and children, and if she ever reigns the red-haired queen brings a burgeoning of art and joy. Elimination of that last possibility for England is Vidal Dhu多s prime purpose, but he has been forbidden by King Oberon to attack Elizabeth. Though he may not attack her directly, still he hatches schemes within schemes. And if his plan to involve the young princess in a scandal that would render her unfit to rule in the opinion of the Proctor and his Council, he has more twisted plans to eliminate Elizabeth once and for all.", "language": "en", "image": "https://images.isbndb.com/covers/10/75/9781416521075.jpg", "title_long": "By Slanderous Tongues (The Doubled Edge, Book 3)", "dimensions": "Height: 9.25 Inches, Length: 6.125 Inches, Weight: 1.59 Pounds, Width: 1.5 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.125}, "width": {"unit": "inches", "value": 1.5}, "weight": {"unit": "pounds", "value": 1.59}, "height": {"unit": "inches", "value": 9.25}}, "pages": 544, "date_published": "2007-02-06", "subjects": ["Literature & Fiction', 'Contemporary', 'Science Fiction & Fantasy', 'Fantasy', 'Epic', 'Paranormal & Urban'], 'authors": ["Mercedes Lackey', 'Roberta Gellis'], 'title": "By Slanderous Tongues (The Doubled Edge, Book 3)", "isbn13": "9781416521075", "msrp": 25, 'binding": "Hardcover", "isbn": "1416521070", "isbn10": "1416521070"}}