{"book": {"publisher": "ASCD", "synopsis": "When the first edition of Teaching with the Brain in Mind was published in 1998, it quickly became an ASCD best-seller, and it has gone on to inspire thousands of educators to apply brain research in their classroom teaching. Now, author Eric Jensen is back with a completely revised and updated edition of his classic work, featuring new research and practical strategies to enhance student comprehension and improve student achievement.<br/>In easy to understand, engaging language, Jensen provides a basic orientation to the brain and its various systems and explains how they affect learning. After discussing what parents and educators can do to get children"s brains in good shape for school, Jensen goes on to explore topics such as motivation, critical thinking skills, optimal educational environments, emotions, and memory. He offers fascinating insights on a number of specific issues, including<br/><br/>* How to tap into the brain"s natural reward system.<br/><br/>* The value of feedback.<br/><br/>* The importance of prior knowledge and mental models.<br/><br/>* The vital link between movement and cognition.<br/><br/>* Why stress impedes learning.<br/><br/>* How social interaction affects the brain.<br/><br/>* How to boost students" ability to encode, maintain, and retrieve learning.<br/><br/>* Ways to connect brain research to curriculum, assessment, and staff development.<br/><br/>Jensen's repeated message to educators is simple: You have far more influence on students' brains than you realize . . . and you have an obligation to take advantage of the incredible revelations that science is providing. The revised and updated edition of Teaching with the Brain in Mind helps you do just that.', 'language": "en", "image": "https://images.isbndb.com/covers/03/05/9781416600305.jpg", "title_long": "Teaching with the Brain in Mind, Revised 2nd Edition", "edition": "Revised 2nd", "dimensions": "Height: 10 Inches, Length: 8 Inches, Weight: 0.76 Pounds, Width: 0.43 inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8}, "width": {"unit": "inches", "value": 0.43}, "weight": {"unit": "pounds", "value": 0.76}, "height": {"unit": "inches", "value": 10}}, "pages": 187, "date_published": "2005-06-15", "subjects": ["Business & Money', 'Education & Reference', 'Reference', 'Education & Teaching', 'Schools & Teaching', 'Education Theory', 'Instruction Methods', 'Certification & Development', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors": ["Eric Jensen'], 'title": "Teaching with the Brain in Mind, Revised 2nd Edition", "isbn13": "9781416600305", "msrp": 29.95, "binding": "Paperback", "related": {"ePub": "1416615008"}, "isbn": "1416600302", "isbn10": "1416600302", "other_isbns": [{'isbn": "9781416615002", "binding": "print"}]}}