{"book": {"publisher": "Gallery Books", "synopsis": "Same Sex in the City is a one-of-a-kind, sassy guide for gay women (and any woman who has ever looked twice at another woman) by gay women.<br/><br/>The journey from sexual curiosity to finally coming out can be confusing without proper guidance and empowering role models. In Same Sex in the City, Lauren Levin and Lauren Blitzer provide women—gay, straight, and bi-curious alike—with firsthand insight into the advantages and challenges of being a lesbian. In prose that is at once honest and uplifting, the Laurens relate their own experiences and those of the women they interview, as well as offer serious advice, titillating anecdotes, and a positive attitude for girls who know they"re gay—and for those who are wondering about their sexuality but are not yet sure whether their Prince Charming is really a Cinderella.<br/><br/>Part confessional, part informational, Same Sex in the City covers the gamut of lesbian life—from dating to heartbreak, and from hooking up with straight chicks to raising a family. It"s the book that millions of women have been searching for—a relationship guide that will help every woman come to terms with and celebrate her sexuality, whatever it may be.", 'language": "en", "image": "https://images.isbndb.com/covers/63/21/9781416916321.jpg", "title_long": "Same Sex in the City: (So Your Prince Charming Is Really a Cinderella)", "dimensions": "Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.64 Pounds, Width: 0.3 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.3}, "weight": {"unit": "pounds", "value": 0.64}, "height": {"unit": "inches", "value": 8.5}}, "pages": 250, "date_published": "2006-06-01", "subjects": ["Self-Help', 'Sex', 'Happiness', 'Health, Fitness & Dieting', 'Psychology & Counseling', 'Sexuality', 'Religion & Spirituality', 'New Age & Spirituality', 'Science & Math', 'Behavioral Sciences', 'Politics & Social Sciences', 'Social Sciences', 'LGBTQ+ Demographic Studies'], 'authors": ["Lauren Levin'], 'title": "Same Sex in the City: (So Your Prince Charming Is Really a Cinderella)", "isbn13": "9781416916321", "msrp": 12.33, "binding": "Paperback", "related": {"ePub": "1416933778"}, "isbn": "1416916326", "isbn10": "1416916326", "other_isbns": [{'isbn": "9781416933779", "binding": "print"}]}}