{"book": {"publisher": "Pocket Classics", "synopsis": "Enriched Classics offer readers accessible editions of great works of literature enhanced by helpful notes and commentary. Each book includes educational tools alongside the text, enabling students and readers alike to gain a deeper and more developed understanding of the writer and their work.<br/><br/>Climb aboard for the swashbuckling adventure of a lifetime. Treasure Island has enthralled (and caused slight seasickness) for decades. The names Long John Silver and Jim Hawkins are destined to remain pieces of folklore for as long as children want to read Robert Louis Stevenson’s most famous book. With its dastardly plot and motley crew of rogues and villains, it seems unlikely that children will ever say no to this timeless classic.<br/><br/>Enriched Classics enhance your engagement by introducing and explaining the historical and cultural significance of the work, the author’s personal history, and what impact this book had on subsequent scholarship. Each book includes discussion questions that help clarify and reinforce major themes and reading recommendations for further research.<br/><br/>Read with confidence.", "language": "en", "image": "https://images.isbndb.com/covers/02/92/9781416500292.jpg", "title_long": "Treasure Island", "edition": "Enriched Classic", "dimensions": "Height: 0.82 Inches, Length: 6.82 Inches, Weight: 0.330693393 Pounds, Width: 4.2 Inches", "dimensions_structured": {'length": {"unit": "inches", "value": 6.82}, "width": {"unit": "inches", "value": 4.2}, "weight": {"unit": "pounds", "value": 0.330693393}, "height": {"unit": "inches", "value": 0.82}}, "pages": 276, "date_published": "2005-06-20", "subjects": ["Literature & Fiction', 'Classics'], 'authors": ["Robert Louis Stevenson'], 'title": "Treasure Island", "isbn13": "9781416500292", "msrp": 4.95, "binding": "Paperback", "related": {"ePub": "1476795843"}, "isbn": "1416500294", "isbn10": "1416500294", "other_isbns": [{'isbn": "9781476795843", "binding": "print"}]}}