{"book": {"publisher": "Pocket Books", "synopsis": "In this first in the MacCarrick Brothers series and “classic romantic adventure that will leave you breathless” (Julia Quinn, New York Times bestselling author), travel through Spain and the Scottish Highlands as a deadly mercenary finds his plans for vengeance disrupted by an exquisite noblewoman.<br/><br/>High in the Pyrenees, a band of mercenaries led by Courtland MacCarrick wages bloody war for General Reynaldo Pascal. But when Court demands his men’s payment, Pascal refuses and orders the highlander killed. Narrowly escaping, Court turns to vengeance by kidnapping Pascal’s beautiful Castilian fiancée.<br/><br/>Lady Annalía Tristán Llorente despises her towering, barbaric captor almost as much as she does Pascal. Her inexplicable attraction to the Highlander only fuels her fury. But she knows she cannot give in to her passion for she must return to Pascal. Otherwise, she signs her brother’s death warrant.<br/><br/>From the moment Court discovers that Anna"s prim façade masks a fiery, brave lass, his heart is spellbound, and he dares to defy the curse that has shadowed his life—to walk with death or walk alone.", "language": "en", "image": "https://images.isbndb.com/covers/35/90/9781416503590.jpg", "title_long": "If You Dare (The MacCarrick Brothers, Book 1) (Bk. 1) by Cole, Kresley (2005) Mass Market Paperback", "dimensions": "Weight: 0.440924524 Pounds", "dimensions_structured": {"weight": {"unit": "pounds", "value": 0.440924524}}, "pages": 384, "date_published": "2005", "subjects": ["Literature & Fiction', 'United States', 'Contemporary', 'Romance', 'Historical', 'Scottish'], 'authors": ["Kresley Cole'], 'title": "If You Dare (The MacCarrick Brothers, Book 1) (Bk. 1) by Cole, Kresley (2005) Mass Market Paperback", "isbn13": "9781416503590", "msrp": 7.99, "binding": "Mass Market Paperback", "related": {"Kindle Edition": "1416526900"}, "isbn": "1416503595", "isbn10": "1416503595", "other_isbns": [{'isbn": "9781416526902", "binding": "print"}]}}