{"book": {"publisher": "Simon & Schuster", "synopsis": "By turns a children"s fantasy and a social satire for adults, Gulliver"s Travels is one of the most popular adventure tales of all time.<br/><br/>Gulliver"s Travels describes the four fantastic voyages of Lemuel Gulliver, a kindly ship's surgeon. Swift portrays him as an observer, a reporter, and a victim of circumstance. His travels take him to Lilliput where he is a giant observing tiny people. In Brobdingnag, the tables are reversed and he is the tiny person in a land of giants where he is exhibited as a curiosity at markets and fairs. The flying island of Laputa is the scene of his next voyage. The people plan and plot as their country lies in ruins. It is a world of illusion and distorted values. The fourth and final voyage takes him to the home of the Houyhnhnms, gentle horses who rule the land. He also encounters Yahoos, filthy bestial creatures who resemble humans.<br/><br/>This edition includes:<br/>-A concise introduction that gives readers important background information<br/>-A chronology of the author's life and work<br/>-A timeline of significant events that provides the book's historical context<br/>-An outline of key themes and plot points to help readers form their own interpretations<br/>-Detailed explanatory notes<br/>-Critical analysis, including contemporary and modern perspectives on the work<br/>-Discussion questions to promote lively classroom and book group interaction<br/>-A list of recommended related books and films to broaden the reader's experience<br/><br/>Enriched Classics offer readers affordable editions of great works of literature enhanced by helpful notes and insightful commentary. The scholarship provided in Enriched Classics enables readers to appreciate, understand, and enjoy the world's finest books to their full potential.', 'language": "en", "image": "https://images.isbndb.com/covers/03/91/9781416500391.jpg", "title_long": "Gulliver"s Travels and A Modest Proposal (Enriched Classics)", 'edition": "Enriched Classic", "dimensions": "Height: 6.75 Inches, Length: 4.1875 Inches, Weight: 0.44 Pounds, Width: 1.1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.1875}, "width": {"unit": "inches", "value": 1.1}, "weight": {"unit": "pounds", "value": 0.44}, "height": {"unit": "inches", "value": 6.75}}, "pages": 416, "date_published": "2005-08-01", "subjects": ["Literature & Fiction', 'Classics', 'Action & Adventure', 'Humor & Satire', 'Satire'], 'authors": ["Jonathan Swift'], 'title": "Gulliver"s Travels and A Modest Proposal (Enriched Classics)", 'isbn13": "9781416500391", "msrp": "0.00", "binding": "Mass Market Paperback", "related": {"Kindle Edition": "1451685742", "ePub": "1451685742"}, "isbn": "1416500391", "isbn10": "1416500391", "other_isbns": [{'isbn": "9781451685749", "binding": "print"}]}}