{"book": {"publisher": "Pocket Books", "synopsis": "Clive Cussler, author of over twenty consecutive New York Times bestsellers, brings back beloved hero Dirk Pitt in this electrifying, edge-of-your-seat thriller.<br/><br/>Japan, 1945: Two US bombers take off with atomic bombs. Only one gets through.<br/><br/>The Pacific, 1993: A Japanese cargo ship bound for the United States is instantly, thunderously vaporized, taking with it a Norwegian vessel. Japanese fanatics have developed a chilling plan to devastate and destroy the Western powers. From the ocean depths to the discovery of cache of lost Nazi loot, Dirk Pitt is untangling a savage conspiracy and igniting a daring counterattack. While Washington bureaucrats scramble, a brutal industrialist commands his blackmail scheme from a secret island control center. And Dirk, the dauntless hero of Sahara and Inca Gold, is taking on death-dealing robots and a human-hunting descendant of samurai warriors. Pitt alone controls the West’s secret ace in the hole: a tidal wave of destruction waiting to be triggered on the ocean floor!", "language": "en", "image": "https://images.isbndb.com/covers/78/09/9781416537809.jpg", "title_long": "Dragon (Dirk Pitt Adventure)", "edition": 1, 'dimensions": "Height: 7.5 Inches, Length: 4.125 Inches, Weight: 0.84 Pounds, Width: 1.3 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 4.125}, "width": {"unit": "inches", "value": 1.3}, "weight": {"unit": "pounds", "value": 0.84}, "height": {"unit": "inches", "value": 7.5}}, "pages": 608, "date_published": "2006-10-31", "subjects": ["Literature & Fiction', 'Genre Fiction', 'Historical', 'Action & Adventure', 'Mystery, Thriller & Suspense', 'Sea Adventures', 'War & Military', 'Thrillers & Suspense', 'Suspense', 'Military', 'Self Service', 'Custom Stores'], 'authors": ["Clive Cussler'], 'title": "Dragon (Dirk Pitt Adventure)", "isbn13": "9781416537809", "msrp": 9.99, 'binding": "Mass Market Paperback", "isbn": "1416537805", "isbn10": "1416537805"}}