{"book": {"publisher": "Simon & Schuster Books for Young Readers", "synopsis": "The Imaginarium Geographica<br/><br/>"What is it?" John asked.<br/><br/>The little man blinked and arched an eyebrow.<br/><br/>"It is the world, my boy,' he said. 'All the world, in ink and blood, vellum and parchment, leather and hide. It is the world, and it is yours to save or lose.'<br/><br/>An unusual murder brings together three strangers, John, Jack, and Charles, on a rainy night in London during the first World War. An eccentric little man called Bert tells them that they are now the caretakers of the Imaginarium Geographica -- an atlas of all the lands that have ever existed in myth and legend, fable and fairy tale. These lands, Bert claims, can be traveled to in his ship the Indigo Dragon, one of only seven vessels that is able to cross the Frontier between worlds into the Archipelago of Dreams.<br/><br/>Pursued by strange and terrifying creatures, the companions flee London aboard the Dragonship. Traveling to the very realm of the imagination itself, they must learn to overcome their fears and trust in one another if they are to defeat the dark forces that threaten the destiny of two worlds. And in the process, they will share a great adventure filled with clues that lead readers to the surprise revelation of the legendary storytellers these men will one day become.<br/><br/>An extraordinary journey of myth, magic, and mystery, Here, There Be Dragons introduces James A. Owen as a formidable new talent.', 'language": "en", "image": "https://images.isbndb.com/covers/22/79/9781416912279.jpg", "title_long": "Here, There Be Dragons (1) (Chronicles of the Imaginarium Geographica, The)", "edition": "Illustrated", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 1.1 Pounds, Width: 1.1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1.1}, "weight": {"unit": "pounds", "value": 1.1}, "height": {"unit": "inches", "value": 9}}, "pages": 336, "date_published": "2006-10-01", "subjects": ["Children's Books', 'Animals', 'Action & Adventure', 'Fairy Tales, Folk Tales & Myths', 'Dragons, Unicorns & Mythical', 'Science Fiction & Fantasy', 'Fantasy & Magic', 'Teen & Young Adult', 'Literature & Fiction', 'Fantasy', 'Science Fiction'], 'authors": ["James A. Owen'], 'title": "Here, There Be Dragons (1) (Chronicles of the Imaginarium Geographica, The)", "isbn13": "9781416912279", "msrp": 21.99, 'binding": "Hardcover", "isbn": "1416912274", "isbn10": "1416912274"}}