{"book": {"publisher": "Scribner", "synopsis": "Alvirah Meehan, the lottery winner turned amateur sleuth; her husband, Willy; recently hitched private detective Regan Reilly and her groom, Jack, head of the NYPD Major Case Squad; and Regan\"s parents, Nora and Luke, are guests on the Royal Mermaid\"s maiden voyage, the Santa Cruise. The cruise is Commodore Randolph Weed\"s gift to a select group of people who in the last year 'made the world a better place.' What he really wants is good publicity that will generate future bookings for his struggling new venture. He also plans to scatter his beloved mother\'s ashes at sea during this four-day odyssey in the Caribbean. What he doesn\'t know is that his ne\'er-do-well nephew, Eric, has smuggled two escaping criminals on board.<br/>Alvirah won the cruise at a charity auction and persuaded the Reillys to accompany her and Willy. Other passengers include members of the Oklahoma Readers and Writers group, who volunteer their time teaching people to read. The group is planning a mystery seminar dedicated to a Ghost of Honor, the late Left Hook Louie, a champion prizefighter turned bestselling author. There are also ten men on board who had donated their time playing Santa Claus during the holiday season as well as assorted other charitable folk, all planning on a restful post-Christmas vacation.<br/>The hoped-for tranquility soon vanishes. A terrified mystery fan swears she has spotted the Ghost of Honor in the ship\'s chapel. Two Santa suits disappear from a locked supply room. A storm develops, and in the infirmary an attempt is made on the life of a seemingly feeble passenger. Back in Miami, a TV reporter is turning the cruise into a public-relations nightmare, thanks to her spies on the ship.<br/>As the Royal Mermaid sails through troubled waters, Alvirah, Regan, and Jack are uncovering the clues that lead them to dangerous criminals who were not on the original guest list.', 'language": "en", "image": "https://images.isbndb.com/covers/55/22/9781416535522.jpg", "title_long": "Santa Cruise: A Holiday Mystery at Sea", "dimensions": "Height: 8 Inches, Length: 6 Inches, Weight: 0.75 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 0.75}, "height": {"unit": "inches", "value": 8}}, "pages": 272, "date_published": "2006-11-14", "subjects": ["Literature & Fiction', 'Contemporary', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths'], 'authors": ['Mary Higgins Clark', 'Carol Higgins Clark'], 'title": "Santa Cruise: A Holiday Mystery at Sea", "isbn13": "9781416535522", "msrp": "0.00", "binding": "Hardcover", "isbn": "1416535527", "isbn10": "1416535527"}}