{"book": {"publisher": "Thomas Nelson", "synopsis": "Based on the book by pastor and best-selling author John MacArthur, this workbook brings you face-to-face with twelve biblical women whom God chose to bring His message of redemption to the world.<br/>A first-time mother, a prostitute, an introverted young woman, sisters with opposite personalities. Who were these women? Ordinary women for sure, but used by God in ways they never could have imagined . . . made extraordinary because of their life-changing faith in God.<br/>In examining the lives of these women, you will discover their struggles and doubts, their fears and failures, their faith and commitment. You\"ll learn how God used these ordinary women in extraordinary ways. And, through their stories, you will discover how God can impact the world through you!<br/>Perfect for group or individual study, this workbook includes: Daily Bible readings Engaging and thought-provoking questions and journaling Fascinating and helpful applications for your daily life "Adding to your Scriptural Vocabulary and Understanding" sections Instructions for facilitating your own small group study', 'language": "en", "image": "https://images.isbndb.com/covers/55/78/9781418505578.jpg", "title_long": "Twelve Extraordinary Women Workbook", "edition": "Workbook", "dimensions": "Height: 11 Inches, Length: 8.5 Inches, Weight: 1.1684499886 Pounds, Width: 0.75 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.5}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 1.1684499886}, "height": {"unit": "inches", "value": 11}}, "pages": 205, "date_published": "2006-03-05", "subjects": ["Christian Books & Bibles', 'Christian Living', 'Bible Study & Reference', 'Bible Study', 'Religion & Spirituality'], 'authors": ["John MacArthur'], 'title": "Twelve Extraordinary Women Workbook", "isbn13": "9781418505578", "msrp": 12.84, "binding": "Paperback", "related": {"ePub": "1418575801"}, "isbn": "1418505579", "isbn10": "1418505579", "other_isbns": [{'isbn": "9781418575809", "binding": "printisbn"}]}}