{"book": {"publisher": "Digireads.com", "synopsis": "Aristophanes, the greatest of comic writers in Greek and in the opinion of many, in any language, is the only one of the Attic comedians any of whose works has survived in complete form He was born in Athens about the middle of the fifth century B C, and had his first comedy produced when he was so young that his name was withheld on account of his youth. He is credited with over forty plays, eleven of which survive, along with the names and fragments of some twenty-six others. His satire deal with political, religious, and literary topics, and with all its humor and fancy is evidently the outcome of profound conviction and a genuine patriotism. The Attic comedy was produced at the festivals of Dionysus, which were marked by great license, and to this, rather than to the individual taste of the poet, must be ascribed the undoubted coarseness of many of the jests. Aristophanes seems, indeed, to have been regarded by his contemporaries as a man of noble character. He died shortly after the production of his "Plutus," in 388 B. C. "The Frogs' was produced the year after the death of Euripides, and laments the decay of Greek tragedy which Aristophanes attributed to that writer. It is an admirable example of the brilliance of his style, and of that mingling of wit and poetry with rollicking humor and keen satirical point which is his chief characteristic. Here, as elsewhere, he stands for tradition against innovation of all kinds, whether in politics, religion, or art. The hostility to Euripides displayed here and in several other plays, like his attacks on Socrates, is a result of this attitude of conservatism. The present play is notable also as a piece of elaborate if not over-serious literary criticism from the pen of a great poet.', 'language": "en", "image": "https://images.isbndb.com/covers/67/12/9781420926712.jpg", "title_long": "The Frogs", "dimensions": "Height: 8 Inches, Length: 5 Inches, Weight: 0.22928075248 Pounds, Width: 0.21 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 0.21}, "weight": {"unit": "pounds", "value": 0.22928075248}, "height": {"unit": "inches", "value": 8}}, "pages": 88, "date_published": "2005-01-01", "subjects": ["Literature & Fiction', 'Dramas & Plays', 'Ancient & Classical'], 'authors": ["Aristophanes'], 'title": "The Frogs", "isbn13": "9781420926712", "msrp": 6.99, 'binding": "Paperback", "isbn": "1420926713", "isbn10": "1420926713"}}