{"book": {"publisher": "VIZ Media LLC", "synopsis": "Shortly after reaping the rewards from his movie Spirited Away, a project that earned him an Academy Award in 2003, director Hayao Miyazaki set his sites on his next film, Howl"s Moving Castle.Based on the novel by British author Diana Wynne Jones, Howl"s Moving Castle gave the internationally renown director an opportunity to bring to life a fantastical time in 19th century Europe when science and magic defined the popular zeitgeist.Veering slightly from its source material, the new Miyazaki movie nonetheless retains all the novel"s principal characters. There's a foppish wizard named Howl, a vain witch from the wastelands, an anthropomorphic chimney fire and a young girl who carries a most unusual curse. And, of course, there's the moving castle…a towering, omnipresent structure that dominates the landscape. Already a smash success in Japan, Howl's Moving Castle finally comes to U.S. theatres this spring. To coincide with its Stateside release, VIZ is proud to present The Art of Howl's Moving Castle, a hardbound, prestige format book which acts as an essential companion to the film. A generous collection of concept sketches, fully rendered character and background drawings, paintings and cell images, The Art of Howl's Moving Castle brings the movie into your library. Along with the stunning visuals, the book also presents interviews and comments with the production staff, including key points directly from the director.There's more than one way to book passage on the moving castle. See the movie, but don't forget to reserve a copy of the book, as well. The Art of Howl's Moving Castle is a great way to preserve the magic of the next great anime classic from Hayao Miyazaki.<br/><br/>Shortly after reaping the rewards from his movie Spirited Away, a project that earned him an Academy Award in 2003, director Hayao Miyazaki set his sites on his next film, Howl's Moving Castle.<br/><br/>Based on the novel by British author Diana Wynne Jones, Howl's Moving Castle gave the internationally renowned director an opportunity to bring to life a fantastical time in 19th century Europe when science and magic defined the popular zeitgeist.<br/><br/>Veering slightly from its source material, the new Miyazaki movie nonetheless retains all the novel's principal characters. There's a foppish wizard named Howl, a vain witch from the wastelands, an anthropomorphic chimney fire and a young girl who carries a most unusual curse. And, of course, there's the moving castle…a towering, omnipresent structure that dominates the landscape.<br/><br/>Already a smash success in Japan, Howl's Moving Castle finally comes to U.S. theatres this spring. To coincide with its Stateside release, VIZ is proud to present The Art of Howl's Moving Castle, a hardbound, prestige format book which acts as an essential companion to the film.<br/><br/>A generous collection of concept sketches, fully rendered character and background drawings, paintings and cell images, The Art of Howl's Moving Castle brings the movie into your library. Along with the stunning visuals, the book also presents interviews and comments with the production staff, including key points directly from the director.<br/><br/>There's more than one way to book passage on the moving castle. See the movie, but don't forget to reserve a copy of the book, as well. The Art of Howl's Moving Castle is a great way to preserve the magic of the next great anime classic from Hayao Miyazaki.', 'language": "en", "image": "https://images.isbndb.com/covers/04/92/9781421500492.jpg", "title_long": "The Art of Howl"s Moving Castle", 'edition": "Original ed.", "dimensions": "Height: 11.75 Inches, Length: 8.25 Inches, Weight: 3.37968647646 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.25}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 3.37968647646}, "height": {"unit": "inches", "value": 11.75}}, "pages": 256, "date_published": "2005-07-05", "subjects": ["Arts & Photography', 'Performing Arts', 'Photography & Video', 'Film & Video Art', 'Graphic Design', 'Animation', 'Comics & Graphic Novels', 'Manga', 'Humor & Entertainment', 'Movies', 'History & Criticism', 'Teen & Young Adult', 'Literature & Fiction'], 'authors": ["Hayao Miyazaki'], 'title": "The Art of Howl"s Moving Castle", 'isbn13": "9781421500492", "msrp": 34.99, 'binding": "Hardcover", "isbn": "1421500493", "isbn10": "1421500493"}}