{"book": {"publisher": "VIZ Media LLC", "synopsis": "Add Howl"s Moving Castle to this list of must-have movie books. Director Hayao Miyazaki is a master storyteller and his films have all become classics of animation. There"s no better way to preserve the magic of Howl and his flying castle than by adding this delightful volume to your home library.<br/><br/>Earlier this year, VIZ Media released The Art of Howl"s Moving Castle, a hardbound, prestige format book which exists as an essential companion to Hayao Miyazaki's latest animated classic.<br/><br/>To further complement the movie-going experience, we are now proud to present the Howl's Moving Castle Picture Book, a companion publication wedding scene-by-scene film footage with character dialogue in one handsome volume.<br/><br/>Based on the young-adult novel by British author Diana Wynne Jones, Howl's Moving Castle reflects on a wondrous time when science and magic captured the spirit of 19th century Europe.<br/><br/>The story of Howl's Moving Castle is the story of a young girl who is magically transformed into a 90-year-old woman. Undaunted by this curse, her continuing adventures introduce her to the vainglorious wizard Howl and his curious castlemates.<br/><br/>Two years ago, VIZ Media released a similar book inspired by Spirited Away, the movie which garnered an Academy Award for director Hayao Miyazaki. Another picture book for My Neighbor Totoro is planned for later this year.<br/><br/>Now, add Howl's Moving Castle to this list of must-have movie books. Director Hayao Miyazaki is a master storyteller and his films have all become classics of animation. There's no better way to preserve the magic of Howl and his flying castle than by adding this delightful volume to your home library.', 'language": "en", "image": "https://images.isbndb.com/covers/09/04/9781421500904.jpg", "title_long": "Howl"s Moving Castle Picture Book", 'edition": "Media tie-in", "dimensions": "Height: 10.125 inches, Length: 8.25 inches, Weight: 1.984160358 Pounds, Width: 0.7 inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.25}, "width": {"unit": "inches", "value": 0.7}, "weight": {"unit": "pounds", "value": 1.984160358}, "height": {"unit": "inches", "value": 10.125}}, "pages": 184, "date_published": "2005-10-11", "subjects": ["Children's Books', 'Arts, Music & Photography', 'Performing Arts', 'Science Fiction & Fantasy', 'Fantasy & Magic', 'Comics & Graphic Novels', 'Manga', 'Fantasy'], 'authors": ["Hayao Miyazaki'], 'title": "Howl"s Moving Castle Picture Book", 'isbn13": "9781421500904", "msrp": 19.99, 'binding": "Hardcover", "isbn": "1421500906", "isbn10": "1421500906"}}