{"book": {"publisher": "Brilliance Audio", "synopsis": "Product Description      Jack Reacher, hailed as "a wonderfully epic hero" by People, confronts Texan hatred and hidden crimes in this superb new thriller. Ex-military cop Jack Reacher returns in this latest in the award-winning series critics call "spectacular' (The Seattle Times), 'relentless' (Denver Post), and 'perfect' (The New York Times Book Review). Reacher is hitching through the heat of West Texas and getting desperate for a ride. The last thing he\'s worried about is exactly who picks him up. She\'s called Carmen. She\'s a good-looking young woman, she has a beautiful little girl . . .and she has married into the wrong family. They\'re called the Greers. They\'re a bitter and miserly clan, and they\'ve made her life a living hell. Worse, her monster of a husband is soon due out of prison. So she needs protection, and she needs it now. Lawyers can\'t help. Cops can\'t be trusted. So Reacher goes home with her to the lonely ranch where nothing is as it seems, and where evil swirls around them like dust in a storm. Within days, Carmen\'s husband is dead - and simmering secrets send Echo, Texas, up in flames.      About the Author      LEE CHILD is the author of ten Jack Reacher thrillers, including the New York Times bestsellers Persuader, the Barry Award Winner The Enemy, and One Shot, which has been optioned for a major motion picture by Paramount Pictures. His debut, Killing Floor, won both the Anthony and the Barry Awards for Best First Mystery. Foreign rights in the Jack Reacher series have sold in thirty-nine territories. Child, a native of England and former television writer, lives in New York City, where he is at work on his eleventh Jack Reacher thriller.', 'language": "en", "image": "https://images.isbndb.com/covers/95/28/9781423319528.jpg", "title_long": "Echo Burning (Jack Reacher Series)", "edition": "Abridged", "dimensions": "Height: 7 Inches, Length: 5 Inches, Weight: 0.3 Pounds, Width: 1.375 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 1.375}, "weight": {"unit": "pounds", "value": 0.3}, "height": {"unit": "inches", "value": 7}}, "pages": 5, "date_published": "2007-02-28", "subjects": ["Literature & Fiction', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense'], 'authors": ['Lee Child'], 'title": "Echo Burning (Jack Reacher Series)", "isbn13": "9781423319528", "msrp": "0.00", "binding": "Audio CD", "isbn": "1423319524", "isbn10": "1423319524"}}