{"book": {"publisher": "Gibbs Smith", "synopsis": "In Surfer\"s Code: 12 Simple Lessons for Riding Through Life, world champion surfer Shaun Tomson shares the life lessons he\"s gathered from decades of surfing-from his boyhood adventures in South Africa to the world tour in the late 1970s to the business world today. For Tomson, surfing is a hobby, a sport, a religion, an obsession and more-it is a way of life. Tomson\"s life lessons have guided his career to the top of both professional competition and the world of business. Now, he shares these powerful lessons, born on the world\'s best swells, with all people-including those who might never step on a surfboard. These lessons are born of the collective wisdom of the surf community and are a powerful source of inspiration in the face of extraordinary challenges of every day life. 'I tell people that I didn\'t develop or create the code. I simply wrote down what was out there all the time in my heart and in the hearts of many surfers, always there but sometimes overlooked. I like to think the code was always there, a part of every surfer\'s life, unspoken maybe, but in our hearts, ever since the ancient Polynesians started surfing so many thousands of years ago.' -Shaun Tomson<br/>Just a few of the lessons shared in Tomson\'s Surfer\'s Code:<br/>I Will Never Turn My Back on the Ocean<br/>I Will Take the Drop with Commitment<br/>I Will Never Fight a Rip Tide<br/>I Will Always Paddle Back Out<br/>I Will Watch Out For Other Surfers<br/>There Will Always Be Another Wave<br/>I Will Catch a Wave Every Day>br> All Surfers Are Connected By One Ocean', 'language": "en", "image": "https://images.isbndb.com/covers/07/63/9781423600763.jpg", "title_long": "Surfer"s Code: 12 Simple Lessons for Riding Through Life", 'edition": "1", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 1.4 Pounds, Width: 0.75 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 0.75}, "weight": {"unit": "pounds", "value": 1.4}, "height": {"unit": "inches", "value": 9}}, "pages": 208, "date_published": "2006-09-13", "subjects": ["Self-Help', 'Personal Transformation', 'History', 'Europe', 'Great Britain', 'Sports & Outdoors', 'Water Sports'], 'authors": ["Shaun Tomson'], 'title": "Surfer"s Code: 12 Simple Lessons for Riding Through Life", 'isbn13": "9781423600763", "msrp": 18.95, 'binding": "Hardcover", "isbn": "1423600762", "isbn10": "1423600762"}}