{"book": {"publisher": "Arsenal Pulp Press", "synopsis": "“A remarkable story.”—Publishers Weekly<br/>Set in the nineteenth century, Isabel Miller’s classic lesbian novel traces the relationship between Patience White, an educated painter, and Sarah Dowling, a cross-dressing farmer, whose romantic bond does not sit well with the puritanical New England farming community in which they live. They choose to live together and love each other freely, even though they know of no precedents for their relationship; they must trust their own instincts and see beyond the disdain of their neighbors. Ultimately, they are forced to make life-changing decisions that depend on their courage and their commitment to one another.<br/>First self-published in 1969 in an edition of one thousand copies, the author hand-sold the book on New York street corners; it garnered increasing attention to the point of receiving the American Library Association’s first Gay Book Award in 1971. McGraw-Hill’s version of the book a year later brought it to mainstream bookstores across the country.<br/>Patience & Sarah is a historical romance whose drama was a touchstone for the burgeoning gay and women’s activism of the late 1960s and early 1970s. It celebrates the joys of an uninhibited love between two strong women with a confident defiance that remains relevant today.<br/>This edition features an appendix of supplementary materials about Patience & Sarah and the author, as well as an introduction by Emma Donoghue, the Irish novelist whose numerous books include the contemporary Dublin novels Stirfry and Hood, the latter of which won the ALA’s Gay and Lesbian Book Award in 1995.<br/>Little Sister’s Classics is an Arsenal Pulp Press imprint dedicated to reviving lost and out-of-print gay and lesbian classic books, both fiction and nonfiction. The series is produced in conjunction with Little Sister’s Books, the heroic gay Vancouver bookstore well-known for its anti-censorship efforts.<br/>Isabel Miller was the author of numerous novels, including two under her real name, Alma Routsong. She died in 1996.", "language": "en", "image": "https://images.isbndb.com/covers/19/16/9781551521916.jpg", "title_long": "Patience & Sarah (Little Sister"s Classics)", "dimensions": "Height: 8 Inches, Length: 5.5 Inches, Weight: 0.69886537054 Pounds, Width: 0.6 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.6}, "weight": {"unit": "pounds", "value": 0.69886537054}, "height": {"unit": "inches", "value": 8}}, "pages": 225, "date_published": "2005-09-01", "subjects": ["LGBTQ+ Books', 'Literature & Fiction', 'Genre Fiction', 'Historical', 'History & Criticism', 'Criticism & Theory', 'Women Authors', 'Contemporary', 'Politics & Social Sciences', 'Women's Studies', 'Women Writers'], 'authors": ["Isabel Miller'], 'title": "Patience & Sarah (Little Sister"s Classics)", 'isbn13": "9781551521916", "msrp": 17.95, "binding": "Paperback", "related": {"ePub": "1551523574"}, "isbn": "1551521911", "isbn10": "1551521911", "other_isbns": [{'isbn": "9781551523576", "binding": "printisbn"}]}}