{"book": {"publisher": "Broadview Press", "synopsis": "First published in 1865, Alice"s Adventures in Wonderland began as a story told to Alice Liddell and her two sisters on a boating trip in July of 1862. The novel follows Alice down a rabbit-hole and into a surreal world of strange and wonderful characters who constantly turn everything upside-down with their mind-boggling logic and word play, and their fantastic parodies. Carroll"s fable illustrates his masterful ability to weave logic with nonsense in a tale that continues to delight all ages. While this great classic is widely available, the Broadview edition is unique. Richard Kelly combines Alice"s Adventures in Wonderland not with the later (and largely distinct) work Through the Looking Glass but rather with Alice's Adventures Under Ground, Lewis Carroll's first version of the story. Readers are thus able to trace the literary revisions, and to compare Caroll's own illustrations in the original with the famous John Tenniel illustrations for Alice's Adventures in Wonderland. Among the many other materials included in the Broadview Literary Texts edition are a substantial selection of early reviews, selections from Carroll's diaries and correspondence, Carroll's early nonsense poems, and the originals of the poems parodied in his text.', 'language": "en", "image": "https://images.isbndb.com/covers/22/37/9781551112237.jpg", "title_long": "Alice"s Adventures in Wonderland", 'edition": "First Edition", "dimensions": "Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.9369646135 Pounds, Width: 0.688 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.688}, "weight": {"unit": "pounds", "value": 0.9369646135}, "height": {"unit": "inches", "value": 8.5}}, "pages": 356, "date_published": "2000-09-13", "subjects": ["Children's Books', 'Classics', 'Literature & Fiction', 'Science Fiction & Fantasy', 'Fantasy', 'History & Criticism'], 'authors": ["Lewis Carroll'], 'title": "Alice"s Adventures in Wonderland", 'isbn13": "9781551112237", "msrp": 14.95, 'binding": "Paperback", "isbn": "155111223X", "isbn10": "155111223X"}}