{"book": {"publisher": "Lawrence Hill Books", "synopsis": "The first book to speak out against the pervasive influence of the American-Israeli Public Affairs Committee (AIPAC) on American politics, policy, and institutions resonates today as never before. With careful documentation and specific case histories, former congressman Paul Findley demonstrates how the Israel lobby helps to shape important aspects of U.S. foreign policy and influences congressional, senatorial, and even presidential elections. Described are the undue influence AIPAC exerts in the Senate and the House and the pressure AIPAC brings to bear on university professors and journalists who seem too sympathetic to Arab and Islamic states and too critical of Israel and its policies. Along with many longtime outspoken critics, new voices speaking out include former President Jimmy Carter, U.S. Representative Cynthia McKinney, Senator Robert Byrd, prominent Arab-American Dr. Ziad Asali, Rabbi Michael Lerner, and journalist Charles Reese. In addition, the lack of open debate among politicians with regard to the U.S. policy in the Middle East is lamented, and AIPAC is blamed in part for this censorship. Connections are drawn between America’s unconditional support of Israel and the raging anti-American passions around the world—and ultimately the tragic events of 9/11. This replaces 1556520735.", "language": "en", "image": "https://images.isbndb.com/covers/48/20/9781556524820.jpg", "title_long": "They Dare to Speak Out: People and Institutions Confront Israel"s Lobby", "edition": "3rd", "dimensions": "Height: 9 inches, Length: 6 inches, Weight: 1.1794731017 Pounds, Width: 0.93 inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 0.93}, "weight": {"unit": "pounds", "value": 1.1794731017}, "height": {"unit": "inches", "value": 9}}, "pages": 416, "date_published": "2003-05-01", "subjects": ["History', 'Americas', 'United States', 'Middle East', 'Israel & Palestine', 'Politics & Social Sciences', 'Politics & Government', 'International & World Politics', 'Political Science'], 'authors": ["Paul Findley'], 'title": "They Dare to Speak Out: People and Institutions Confront Israel"s Lobby", 'isbn13": "9781556524820", "msrp": "0.00", "binding": "Paperback", "related": {"Page Fidelity": "1613746148", "eBook": "1613746148", "ePub": "1613746164"}, "isbn": "155652482X", "isbn10": "155652482X", "other_isbns": [{'isbn": "9781613746141", "binding": "print"}, {"isbn": "9781613746165", "binding": "printisbn"}]}}