{"book": {"publisher": "Copper Canyon Press", "synopsis": "A best-selling volume of Pablo Neruda\"s poetry in an English-Spanish edition.<br/>Pablo Neruda is one of the world\"s most popular poets, and in The Book of Questions, Neruda refuses to be corralled by the rational mind. Composed of 316 unanswerable questions, these poems integrate the wonder of a child with the experiences of an adult. By turns Orphic, comic, surreal, and poignant, Neruda\"s questions lead the reader beyond reason into realms of intuition and pure imagination.<br/>This complete translation of Pablo Neruda\'s El libro de las preguntas (The Book of Questions) features Neruda\'s original Spanish-language poems alongside William O\'Daly\'s English translations. In his introduction O\'Daly, who has translated eight volumes of Pablo Neruda\'s poetry, writes, 'These poems, more so than any of Neruda\'s other work, remind us that living in a state of visionary surrender to the elemental questions, free of the quiet desperation of clinging too tightly to answers, may be our greatest act of faith.'<br/><br/>When Neruda died in 1973, The Book of Questions was one of eight unpublished poetry manuscripts that lay on his desk. In it, Neruda achieves a deeper vulnerability and vision than in his earlier work-and this unique book is a testament to everything that made Neruda an artist.<br/>'Neruda\'s questions evoke pictures that make sense on a visual level before the reader can grasp them on a literal one. The effect is mildly dazzling [and] O\'Daly\'s translations achieve a tone that is both meditative and spontaneous.' --Publishers Weekly<br/>Pablo Neruda, born in southern Chile, led a life charged with poetic and political activity. He was the recipient of the Nobel Prize in Literature, the International Peace Prize, and served as Chile\'s ambassador to several countries, including Burma, France, and Argentina. He died in 1973.<br/>II.<br/>Tell me, is the rose naked<br/>or is that her only dress?<br/>Why do trees conceal<br/>the splendor of their roots?<br/>Who hears the regrets<br/>of the thieving automobile?<br/>Is there anything in the world sadder<br/>than a train standing in the rain?<br/>XIV.<br/>And what did the rubies say<br/>standing before the juice of pomegranates?<br/>Why doesn\'t Thursday talk itself<br/>into coming after Friday?<br/>Who shouted with glee<br/>when the color blue was born?<br/>Why does the earth grieve<br/>when the violets appear?', 'language": "en", "image": "https://images.isbndb.com/covers/16/00/9781556591600.jpg", "title_long": "The Book of Questions", "edition": "2nd", "dimensions": "Height: 7.4 Inches, Length: 5.5 Inches, Weight: 0.24912235606 Pounds, Width: 0.2 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5.5}, "width": {"unit": "inches", "value": 0.2}, "weight": {"unit": "pounds", "value": 0.24912235606}, "height": {"unit": "inches", "value": 7.4}}, "pages": 96, "date_published": "2001-04-01", "subjects": ["Literature & Fiction', 'Poetry', 'Regional & Cultural', 'Themes & Styles'], 'authors": ["Pablo Neruda'], 'title": "The Book of Questions", "isbn13": "9781556591600", "msrp": 14, 'binding": "Paperback", "isbn": "1556591608", "isbn10": "1556591608"}}