{"book": {"publisher": "North Atlantic Books", "synopsis": "With more than 600,000 copies sold, this treasure trove of nutritional wisdom is an indispensable resource for anyone seeking to nurture their body through natural means.<br/><br/>Uncover the power of food as nature\"s ultimate medicine and unlock the healing potentials that rest within your own kitchen.<br/><br/>Embark on a transformative wellness journey with Paul Pitchford\"s bestselling Healing with Whole Foods. This comprehensive handbook goes beyond the simple integration of traditional Chinese Medicine and modern nutritional science: it\"s a beacon of wisdom and insights for individuals committed to healthful living and holistic practitioners alike.<br/><br/>Discover what makes Healing with Whole Foods a timeless bestseller:<br/><br/>Holistic Foundations: The book grounds you in the principles of Qi vitality and Yin-Yang balance, illuminating the path of holistic healing and nutrition. Bridging Ancient and Modern: With masterful proficiency, Pitchford interlaces the wisdom of traditional Chinese medicine with contemporary nutritional science. Explore categories such as 'Oils and Fats,' 'Sweeteners,' 'Green Food Products,' and 'Vitamins and Supplements.' Therapeutic Guide: Delve into a dedicated section devoted to dietary treatments for prevalent health issues. Whether it\'s blood sugar imbalances or degenerative disorders, uncover practical, actionable guidance deeply rooted in the power of natural healing. Informed Eating: The book enlightens you on the deeper nuances of your diet, touching upon elements like food presentation and dietary practices, and their significant impact on wellness. Delicious Healing Recipes: Immerse yourself in Part V, with vegetarian recipes that unite robust flavor with therapeutic benefits. A Lifelong Companion: Pitchford\'s in-depth, reader-friendly approach makes the book a lifetime go-to guide for reliable nutritional insights. Readers return time and again to delve deeper into its vast knowledge base. Transformational Journey: Embarking on the journey with Healing with Whole Foods is a commitment to enhanced physical, mental, and emotional health. It inspires you to personalize your dietary plan, in tune with your unique needs.<br/>Ultimately, Healing with Whole Foods is more than just a book—it\'s an invitation to a healthier way of living. It beautifully illustrates how traditional wisdom and modern science can come together to inform our nutritional choices. This comprehensive guide invites you to embark on a journey of wellness, empowerment, and self-discovery, all facilitated by the power of whole foods.', 'language": "en", "image": "https://images.isbndb.com/covers/43/03/9781556434303.jpg", "title_long": "Healing With Whole Foods: Asian Traditions and Modern Nutrition (3rd Edition)", "edition": "3rd ed.", "dimensions": "Height: 9.95 Inches, Length: 7.76 Inches, Weight: 3.75006307662 Pounds, Width: 1.65 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.76}, "width": {"unit": "inches", "value": 1.65}, "weight": {"unit": "pounds", "value": 3.75006307662}, "height": {"unit": "inches", "value": 9.95}}, "pages": 784, "date_published": "2002-11-05", "subjects": ["Cookbooks, Food & Wine', 'Special Diet', 'Whole Foods', 'Health, Fitness & Dieting', 'Alternative Medicine', 'Chinese Medicine', 'Healing', 'Naturopathy', 'Diets & Weight Loss', 'Other Diets', 'Nutrition', 'Crafts, Hobbies & Home', 'Home Improvement & Design', 'How-to & Home Improvements', 'Medical Books', 'Allied Health Professions', 'Diet Therapy'], 'authors": ["Paul Pitchford'], 'title": "Healing With Whole Foods: Asian Traditions and Modern Nutrition (3rd Edition)", "isbn13": "9781556434303", "msrp": 19.44, 'binding": "Paperback", "isbn": "1556434308", "isbn10": "1556434308"}}