{"book": {"publisher": "Newmarket Press", "synopsis": "The making of the most astonishing adventure in the Universe. The Hitchhiker"s Guide to the Galaxy is one of the biggest and most eagerly anticipated film events of recent years. A much-yearned-for project of Douglas Adams, it has taken twenty-five years to bring the Galaxy to life on screen, and this interpretation of the classic novel is groundbreaking. Starring Sam Rockwell as Zaphod, Mos Def as Ford Prefect, Zooey Deschanel as Trillian, Martin Freeman as Arthur, Bill Nighy as Slartibartfast and John Malkovich as Humma Kuvala, a new character created by Douglas especially for the movie, The Hitchhiker"s Guide to the Galaxy draws on a refreshing mix of CGI technology and state-of-the art puppeteering from Jim Henson"s Creature Workshop. In The Hitchhiker's Guide to the Galaxy: The Filming of the Douglas Adams Classic, Robbie Stamp, Executive Producer and close friend of Douglas Adams, reveals the craft of the making of the film. From the emphasis throughout production on making real sets and real creatures, Robbie Stamp has interviewed many of the people involved in the film's production. Storyboards, sketches, never-before-seen artwork and the making of the Heart of Gold, the Vogons (including what it's like to puppeteer and act inside one), the Guide itself and of course Marvin create a must-have companion to the film. With 400 color and black & white images, plus a wealth of insider jokes and cultural cross-references, this is the book old and new fans of Hitchhiker's have been waiting for. The Hitchhiker's Guide to the GalaxyThe Movie 2005 Touchstone Pictures', 'language": "en", "image": "https://images.isbndb.com/covers/67/65/9781557046765.jpg", "title_long": "Hitchhiker"s Guide To The Galaxy: The Filming of the Doublas Adams classic", 'dimensions": "Height: 11.5 Inches, Length: 9 Inches, Weight: 2.18 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 9}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 2.18}, "height": {"unit": "inches", "value": 11.5}}, "pages": 184, "date_published": "2005-04-22", "subjects": ["Arts & Photography', 'Performing Arts', 'Humor & Entertainment', 'Movies'], 'authors": [], 'title": "Hitchhiker"s Guide To The Galaxy: The Filming of the Doublas Adams classic", 'isbn13": "9781557046765", "msrp": "0.00", "binding": "Hardcover", "isbn": "155704676X", "isbn10": "155704676X"}}