{"book": {"publisher": "Newmarket", "synopsis": "Original essays and glorious photography, stunningly designed in this unique moviebook from the director of Monsoon Wedding and Vanity Fair\x97a Fox Searchlight release.<br/><br/>In her essay "Writing and Film," the Pulitzer Prize-winning novelist Jhumpa Lahiri writes about the experience of seeing her novel "transposed' from paper to film. 'Its essence remains, but it inhabits a different realm and must, like a transposed piece of music, conform to a different set of rules\x85.To have someone as devoted and as gifted as Mira reinvent my novel\x85has been a humbling and thrilling passage.'<br/><br/>Mira Nair\'s essay, 'Photographs as Inspiration,' begins with the provocative comment: "If it weren\"t for photography, I wouldn\'t be a filmmaker.' She explains how photographs help her crystallize the visual style of her films and which particular photos influenced her vision for The Namesake.<br/><br/>These two essays, written exclusively for this Newmarket Pictorial Moviebook, introduce an amazing panoply of images of people and places shot mainly in New York and Calcutta during the making of the movie, accented by excerpts from Lahiri\'s bestselling novel. Six Indian and American photographers\' works are represented.<br/><br/>Brilliantly illuminating the immigrant experience and the tangled ties between generations, The Namesake tells the story of the Ganguli family, whose move from Calcutta to New York evokes a lifelong balancing act to adapt to a new world while remembering the old. The couple\'s firstborn, Gogol, and sister Sonia grow up amid these divided loyalties, struggling to find their own identity without losing their heritage. Kal Penn (Harold & Kumar Go to White Castle, Superman Returns) stars as Gogol.', 'language": "en", "image": "https://images.isbndb.com/covers/74/10/9781557047410.jpg", "title_long": "The Namesake: A Portrait of the Film Based on the Novel by Jhumpa Lahiri (Newmarket Pictorial Moviebooks)", "edition": "First Edition", "dimensions": "Height: 11 Inches, Length: 7.5 Inches, Weight: 0.66 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 7.5}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 0.66}, "height": {"unit": "inches", "value": 11}}, "pages": 144, "date_published": "2006-12-18", "subjects": ["Arts & Photography', 'Performing Arts', 'Humor & Entertainment', 'Movies', 'Screenplays'], 'authors": [], "title": "The Namesake: A Portrait of the Film Based on the Novel by Jhumpa Lahiri (Newmarket Pictorial Moviebooks)", "isbn13": "9781557047410", "msrp": 30, 'binding": "Hardcover", "isbn": "1557047413", "isbn10": "1557047413"}}