{"book": {"publisher": "Health Communications Inc", "synopsis": "When they were first released in the 1980s, Janet Woititz"s groundbreaking works, Adult Children of Alcoholics, Struggle for Intimacy and The Self-Sabotage Syndrome, provided a new message of hope to adult children who had grown up in the shadow of alcoholic parents. Their message today is as profound and timeless as it was two decades ago.<br/><br/>Now, in this complete collection, readers will learn again the insight and healing power of Janet Wotitiz"s words. The Complete ACoA Sourcebook is a compilation of three of Dr. Woititz"s classic books, addressing head-on the symptoms of The Adult Children of Alcoholics syndrome and providing strategies for living a normal life as an adult. Readers will find help for themselves: at home, in intimate relationships and on the job. They will discover the reasons for the way they think, believe and feel about themselves; ACoAs often feel isolated, have difficulty in relationships, in the workplace and in feeling good about themselves.<br/><br/>Readers who are familiar with Woititz's work will find wisdom once again in this classic collection. Those new to ACoA will gain fresh insight into their behavior patterns and find an avenue for self-love and healing. Noted ACoA expert Dr. Robert Ackerman, author of the best-selling Perfect Daughters and Silent Sons, provides a foreword and explains why Janet Woititz's message will continue to help millions of readers for generations to come.', 'language": "en", "image": "https://images.isbndb.com/covers/96/03/9781558749603.jpg", "title_long": "The Complete ACOA Sourcebook: Adult Children of Alcoholics at Home, at Work and in Love", "edition": "1", "dimensions": "Height: 9 Inches, Length: 6 Inches, Weight: 1.19931470528 Pounds, Width: 1 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 6}, "width": {"unit": "inches", "value": 1}, "weight": {"unit": "pounds", "value": 1.19931470528}, "height": {"unit": "inches", "value": 9}}, "pages": 413, "date_published": "2002-03-08", "subjects": ["Self-Help', 'Emotions', 'Health, Fitness & Dieting', 'Mental Health', 'Post-traumatic Stress Disorder', 'Addiction & Recovery', 'Adult Children of Alcoholics', 'Alcoholism'], 'authors": ["Dr. Janet G. Woititz EdD'], 'title": "The Complete ACOA Sourcebook: Adult Children of Alcoholics at Home, at Work and in Love", "isbn13": "9781558749603", "msrp": 16.95, "binding": "Paperback", "related": {"ePub": "0757395414"}, "isbn": "1558749608", "isbn10": "1558749608", "other_isbns": [{'isbn": "9780757395413", "binding": "printisbn"}]}}