{"book": {"publisher": "Theatre Communications Group", "synopsis": "\x93Césaire’s Tempest, in translation by Richard Miller, is a sprightly and song-filled enchantment. The luminous intelligence of Mr. Césaire’s meditation on the absurdities of colonialism shines through the antics of the bewildered characters.” \x96New York Times<br/><br/>\x93The weapon of poetry may be Césaire’s greatest gift to a modern world still searching for freedom. As one of the last truly great \x91universalists’ of the twentieth century, he has had a hand in shaping or critiquing many of the major ideologies and movements of the modern world. In his own words: \x91Poetic knowledge is born in the great silence of scientific knowledge.’” \x96from the Introduction<br/><br/>Césaire’s rich and insightful adaptation of The Tempest draws on contemporary Caribbean society, the African-American experience and African mythology to raise questions about colonialism, racism and their lasting effects.<br/><br/>AIMÉ CÉSAIRE was a world-renowned poet, essayist and dramatist, whose best known works include Notebook of a Return to My Native Land, The Tragedy of King Christophe and A Season in the Congo. He was the founding editor of Tropiques, which was instrumental in establishing the use of surrealism as a political weapon. He co-formulated the concept of \x93negritude,” which urges black Africans to reject assimilation and cultivate consciousness of their racial qualities and heritage. Césaire held a number of government positions in his native Martinique, including that of mayor of Fort-de-France. Césaire died in 2008.<br/><br/>RICHARD MILLER has translated many books, both nonfiction and fiction, including works by Roland Barthes, Brassa? and Albert Camus, as well as poetry, many articles and a number of plays. Among his more recent translations are Scent by Annick Le Guérer and Beethoven’s Ninth by Esteban Buch, which was published in 2002. He lives in Paris.", "language": "en", "image": "https://images.isbndb.com/covers/21/08/9781559362108.jpg", "title_long": "A Tempest: Based on Shakespeare"s "The Tempest;" Adaptation for a Black Theatre', 'edition": "1", "dimensions": "Height: 8 Inches, Length: 5 Inches, Weight: 0.25132697868 Pounds, Width: 0.2 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 5}, "width": {"unit": "inches", "value": 0.2}, "weight": {"unit": "pounds", "value": 0.25132697868}, "height": {"unit": "inches", "value": 8}}, "pages": 69, "date_published": "2002-05-01", "subjects": ["Literature & Fiction', 'Dramas & Plays', 'Regional & Cultural', 'History & Criticism', 'Movements & Periods', 'Reference', 'Politics & Social Sciences', 'Politics & Government', 'International & World Politics', 'Specific Topics'], 'authors": ["Aimé Césaire'], 'title": "A Tempest: Based on Shakespeare"s "The Tempest;' Adaptation for a Black Theatre', 'isbn13": "9781559362108", "msrp": 13.95, 'binding": "Paperback", "isbn": "1559362103", "isbn10": "1559362103"}}