{"book": {"publisher": "Walter Foster Pub", "synopsis": "Product Description<br/><br/><br/>What are mandalas? Amazing designs made with circles! Many cultures throughout the ages have used mandalas (or circle designs) as a way to release creative energy and focus on positive change. This Mandala Sand Art kit offers a unique and modern approach to crafting these traditional designs. Inside this kit, you"ll find all the materials you need to create 8 traditional sand art designs--plus 2 original sand art creations. You"ll also learn about the history and the origins of these amazing patters that stimulate the mind and encourage creativity to flow.<br/>Dr. Toy 2004 Best Vacation Products Winner!<br/><br/><br/>From the Publisher<br/><br/><br/>This kit contains everything you need to explore this timeless art: Mandala Sand Art book, Mandala Coloring Book, white glue, sand art board, 10 sand pens, circle stencils, glitter, 8 sticker sheets with precut designs, 4 double-sided colored pencils, and a drawing pencil.<br/><br/><br/>About the Author<br/><br/><br/><br/><br/>More than 85 years ago, Walter Foster—a well-known artist, instructor, and collector—began producing art instruction books from his home in Laguna Beach, CA.\xa0\xa0 He originally wrote, illustrated, printed, bound, packaged, shipped, and distributed them himself. Although Walter passed away in 1981 at the age of 90, his legacy continues in a growing product line. Walter Foster Publishing now provides how-to books and kits to millions of enthusiastic artists worldwide who enjoy the rewards of learning how to draw and paint. People who have never before picked up a paintbrush or drawing pencil have discovered their artistic talents through his easy-to-follow instruction books.", 'language": "en", "image": "https://images.isbndb.com/covers/76/68/9781560107668.jpg", "title_long": "Mandala Sand Art: A Unique Activity Kit For Creative Self-Expression", "dimensions": "height: 267 mm, length: 248 mm, width: 38 mm, weight: 930 g", "dimensions_structured": {"length": {"unit": "mm", "value": 248}, "width": {"unit": "mm", "value": 38}, "weight": {"unit": "g", "value": 930}, "height": {"unit": "mm", "value": 267}}, "pages": 32, "date_published": "2004", "subjects": ["Arts & Photography', 'Drawing', 'Other Media', 'Conceptual'], 'authors": ["Walter Foster'], 'title": "Mandala Sand Art: A Unique Activity Kit For Creative Self-Expression", "isbn13": "9781560107668", "msrp": 14.95, 'binding": "hardcover", "isbn": "1560107669", "isbn10": "1560107669"}}