{"book": {"publisher": "Running Press", "synopsis": "The fabled 1964 cross-country bus trip of Ken Kesey and the Merry Pranksters - on a psychedelically painted school bus crammed with amplifiers, cameras, costumes, and assorted contraband as cargo and Beat legend Neal Cassady at the wheelmarked the irreversible end of the "Eisenhower Era, " and set an American cultural revolution in motion. On the Bus is a celebration of the unforgettable exploits of the Merry Pranksters, immortalized in Tom Wolfe\"s bestselling book. In this engrossing popular history, the spirit of the era is captured in a remarkable living chronicle, combining analysis and history with colorful additional narrative by Kesey sidekick Ken Babbs. It features over 100 never-before-seen photos by Prankster photographer Ron Bevirt, Allen Ginsberg, and others, alongside candid and insightful interviews with participants and leading countercultural figures.', 'language": "en", "image": "https://images.isbndb.com/covers/11/49/9781560251149.jpg", "title_long": "On the Bus: The Complete Guide to the Legendary Trip of Ken Kesey and the Merry Pranksters and the Birth of Counterculture", "edition": "Subsequent", "dimensions": "Height: 9.75 Inches, Length: 8.75 Inches, Weight: 1.3 Pounds, Width: 0.5 Inches", "dimensions_structured": {"length": {"unit": "inches", "value": 8.75}, "width": {"unit": "inches", "value": 0.5}, "weight": {"unit": "pounds", "value": 1.3}, "height": {"unit": "inches", "value": 9.75}}, "pages": 205, "date_published": "1997-01-07", "subjects": ["Arts & Photography', 'Photography & Video', 'Business & Careers', 'Literature & Fiction', 'Essays & Correspondence', 'Essays', 'Politics & Social Sciences', 'Social Sciences', 'Sociology'], 'authors": ["Paul Perry'], 'title": "On the Bus: The Complete Guide to the Legendary Trip of Ken Kesey and the Merry Pranksters and the Birth of Counterculture", "isbn13": "9781560251149", "msrp": 29.36, 'binding": "Paperback", "isbn": "156025114X", "isbn10": "156025114X"}}