{'book': {'publisher': 'Seix Barral', 'synopsis': 'El centro de La guerra del fin del mundo es un hecho histórico: la insurrección popular, de signo religioso, paradójicamente a la vez revolucionaria y reaccionaria, que se produjo a fines del siglo XIX en las tierras del Nordeste, en el Brasil. El eje de la obra, la espoleta del conflicto es un personaje fanatizado, un enigma eremítico: el Consejero, mostrado siempre en forma alusiva y oblicua, como una especie de cristalización esquinada y adusta del desamparo y el orgullo de unas gentes desheredadas. A la acción del Consejero, que crea, desde mínimos grupúsculos iniciales, una vasta sublevación, se contraponen otros personajes, ya individualizados, ya vistos como vehículos de intereses o ideales contrapuestos: la vieja aristocracia feudal y legitimista, los políticos que entretejen una malla de dobles tramas, la milicia profesional y, en calidad de testigos, dos seres solitarios, un frenólogo idealista adscrito a las ideas libertarias y un periodista que, como intelectual, sólo podrá rescatar su experiencia narrándola algún día por escrito. Construida con tanta precisión y belleza como una pieza musical, segura en el complejísimo trazado de las acciones bélicas, nítida en la limpidez de un estilo bruñido y casi invisible, La guerra del fin del mundo es a un tiempo un apasionante fresco de aventuras, una soberbia reconstrucción histórica y una pieza literaria sabiamente trabada, en la que culmina la excepcional trayectoria de Mario Vargas Llosa.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/04/93/9788432230493.jpg', 'title_long': 'La Guerra del Fin del Mundo', 'dimensions': 'Height: 7.5 Inches, Length: 4.75 Inches, Weight: 1.05 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.75}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.05}, 'height': {'unit': 'inches', 'value': 7.5}}, 'pages': 570, 'date_published': '1987', 'subjects': ['Literature & Fiction'], 'authors': ['Mario Vargas Llosa'], 'title': 'La Guerra del Fin del Mundo', 'isbn13': '9788432230493', 'msrp': 12.95, 'binding': 'Paperback', 'isbn': '8432230499', 'isbn10': '8432230499'}}