{'book': {'publisher': 'Planeta Publishing', 'synopsis': 'Premio Biblioteca Breve 2007.<br/>Tras la muerte de su madre, a Julio le es revelado un secreto familiar oculto durante medio siglo. Obsesionado por este descubrimiento, inicia una pesquisa que lo obligará a desempolvar episodios oscuros de la Segunda Guerra Mundial, en un itinerario por la Francia ocupada, por la España convaleciente de la Guerra Civil y por la Argentina que sirvió de refugio a notorios nazis, siguiendo los pasos de Jules Tillon, un hombre misterioso que como Julio tuvo que bucear en su pasado para poder seguir viviendo.<br/><br/>Jules Tillon es un miembro de la Resistencia francesa conocido como Houdini por su habilidad para sortear peligros; es un héroe. Pero, al finalizar la ocupación de París, Jules sufre amnesia, y su incapacidad para recordar el heroísmo que se le atribuye le tortura e impide construir un futuro junto a la mujer que ama. Sólo descubriendo quién es en realidad podrá enfrentarse a sus fantasmas. Sin embargo, cuando se indaga en los enigmas del pasado se corre el riesgo de descubrir más de lo que se quería averiguar.<br/><br/>Con una prosa envolvente, caracterizada por un gran poder de generar imágenes, Juan Manuel de Prada traza su novela más madura, una historia épica de amor, traición y aventura con el aroma del cine clásico. Galardonada con el Premio Biblioteca Breve 2007, El séptimo velo acoge en su absorbente lectura a un elenco de personajes memorables marcados por las luces y las sombras de una época excepcional y convulsa, y señala el asombroso poder de la memoria, sus leyes y sus trampas.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/23/52/9788432212352.jpg', 'title_long': 'El Septimo Velo/ the Seventh Veil (Spanish Edition)', 'dimensions': 'Height: 9.3 Inches, Length: 6.3 Inches, Weight: 2.12525620568 Pounds, Width: 1.7 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.3}, 'width': {'unit': 'inches', 'value': 1.7}, 'weight': {'unit': 'pounds', 'value': 2.12525620568}, 'height': {'unit': 'inches', 'value': 9.3}}, 'pages': 644, 'date_published': '2007-06-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical'], 'authors': ['Juan Manuel De Prada'], 'title': 'El Septimo Velo/ the Seventh Veil (Spanish Edition)', 'isbn13': '9788432212352', 'msrp': 28.95, 'binding': 'Paperback', 'isbn': '8432212350', 'isbn10': '8432212350'}}