{'book': {'publisher': 'Seix Barral', 'synopsis': 'Premio Biblioteca Breve 2004.<br/>Pablo Riutort viaja desde París a Santiago de Chile para asistir al entierro de su madre. Este regreso es el punto de arranque de dos relatos paralelos. Por una parte, un grupo de adolescentes comienza a militar en la izquierda clandestina en el Santiago de finales de los setenta. Pero ni la resistencia al régimen de Pinochet ni la política tienen que ver con los bellos ideales de los libros de Sartre y de Camus, y la misma realidad que pretenden subvertir se encargará de descubrirles la mentira, la traición y la indiferencia. Como contrapunto a este relato, unos años después, en París, Pablo se enfrenta a Nelson, ex compañero de universidad captado por los esbirros del régimen, y delator. El encuentro entre ambos es el intercambio de confesiones de dos desarraigados que han compartido, en extremos opuestos, el remoto pasado de un país que ya no existe.<br/><br/>Mauricio Electorat ―Premio Biblioteca Breve 2004― da voz a una generación que ha sido escasamente tratada por la literatura actual, la que surge a la vida activa a comienzos de los ochenta, la que hoy en día ejerce el poder en Chile y en muchos otros lugares. Y lo hace con grandes dosis de ironía y sentido del humor no exentos de ternura, construyendo un relato de distintos niveles, que juega con la ficción dentro de la ficción.<br/><br/>El jurado del Premio Biblioteca Breve ha destacado que La burla del tiempo «retoma el tema de la disyuntiva entre regreso y exilio, ambientado en una de las generaciones inmediatamente posteriores a la entronización de la dictadura golpista en Chile, tras la recuperación de una memoria que no es más que el encuentro con su propia infancia. Una arriesgada apuesta formal por la oralidad, con un estilo nítido y preciso, un ritmo trepidante y una mirada irónica que seducen al lector y le impiden dejar la lectura.»', 'language': 'es', 'image': 'https://images.isbndb.com/covers/17/99/9788432211799.jpg', 'title_long': 'La burla del tiempo (Spanish Edition)', 'edition': 'PRIMERA', 'dimensions': 'Height: 9.0551 Inches, Length: 5.23621 Inches, Weight: 1.0141264052 Pounds, Width: 0.9055118101 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.23621}, 'width': {'unit': 'inches', 'value': 0.9055118101}, 'weight': {'unit': 'pounds', 'value': 1.0141264052}, 'height': {'unit': 'inches', 'value': 9.0551}}, 'pages': 304, 'date_published': '2004-02-17', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Short Stories & Anthologies', 'Short Stories'], 'authors': ['Mauricio Electorat'], 'title': 'La burla del tiempo (Spanish Edition)', 'isbn13': '9788432211799', 'msrp': 17.24, 'binding': 'Paperback', 'isbn': '8432211796', 'isbn10': '8432211796'}}