{'book': {'publisher': 'Seix Barral', 'synopsis': 'El 28 enero de 1908, una española de 17 años, sentada a lomos de un elefante lujosamente enjaezado, hace su entrada en una pequeña ciudad del norte de la India. El pueblo entero está en la calle rindiendo un cálido homenaje a la nueva princesa de tez tan blanca como las nieves del Himalaya. Podría parecer un cuento de hadas, pero así fue la boda de la andaluza Anita Delgado con el riquísimo maharajá de Kapurthala. Y así empezó una gran historia de amor —y traición— que se desgranó durante casi dos décadas en el corazón de una India a punto de extinguirse. Tras realizar minuciosas investigaciones en Europa y en la India, Javier Moro —autor de El pie de Jaipur, Las montañas de Buda y coautor de Era medianoche en Bhopal— revela con todo lujo de detalles los secretos de aquella relación que culminó con uno de los mayores escándalos ocurridos en la India inglesa. Y nos traslada al fabuloso mundo de los maharajás, con sus harenes de Las mil y una noches, sus bacanales eróticas, su pasión por las joyas, los palacios, el flamenco, los caballos, los Rolls Royce y las cacerías de tigres. «Si al final he escrito una novela —dice el autor—, no ha sido por deseo de inventar nada, sino al contrario, para reflejar mejor el sabor de una época, así como los olores y colores de la India, las prodigiosas extravagancias de los últimos maharajás y la irresistible personalidad de Anita Delgado, fiel a sus sentimientos hasta que logró conquistar su propia libertad.»', 'language': 'es', 'image': 'https://images.isbndb.com/covers/66/35/9788432296635.jpg', 'title_long': 'Pasión india (edición lujo) (Spanish Edition)', 'edition': 'Special Edition', 'dimensions': 'Height: 9.75 Inches, Length: 6.5 Inches, Weight: 2.1164377152 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 2.1164377152}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 488, 'date_published': '2005-11-04', 'subjects': ['Literature & Fiction', 'Romance'], 'authors': ['Javier Moro'], 'title': 'Pasión india (edición lujo) (Spanish Edition)', 'isbn13': '9788432296635', 'msrp': 26.95, 'binding': 'Hardcover', 'isbn': '8432296635', 'isbn10': '8432296635'}}