{'book': {'publisher': 'Planeta Publishing', 'synopsis': 'Gran novela de Muriel Barbery<br/>En el número 7 de la calle Grenelle, un inmueble burgués de París, nada es lo que parece. Dos de sus habitantes esconden un secreto. Renée, la portera, lleva mucho tiempo fingiendo ser una mujer común. Paloma tiene doce años y oculta una inteligencia extraordinaria. Ambas llevan una vida solitaria, mientras se esfuerzan por sobrevivir y vencer la desesperanza. La llegada de un hombre misterioso al edificio propiciará el encuentro de estas dos almas gemelas.<br/>Juntas, Renée y Paloma descubrirán la belleza de las pequeñas cosas. Invocarán la magia de los placeres efímeros e inventarán un mundo mejor. La elegancia del erizo es un pequeño tesoro que nos revela cómo alcanzar la felicidad gracias a la amistad, el amor y el arte. Mientras pasamos las páginas con una sonrisa, las voces de Renée y Paloma tejen, con un lenguaje melodioso, un cautivador himno a la vida.<br/>Muriel Barbery se ha convertido en la revelación literaria en Francia. Su ternura y originalidad le han valido el Premio de los Libreros, el reconocimiento de la crítica y el cariño del público, que la ha situado en las listas de los libros más vendidos durante un año.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/82/16/9788432228216.jpg', 'title_long': 'La Elegancia del Erizo (Seix Barral Biblioteca Formentor) (Spanish Edition)', 'dimensions': 'Height: 9 Inches, Length: 5.4 Inches, Weight: 1.08467432904 Pounds, Width: 0.9 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.4}, 'width': {'unit': 'inches', 'value': 0.9}, 'weight': {'unit': 'pounds', 'value': 1.08467432904}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 368, 'date_published': '2008-12-30', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Literary'], 'authors': ['Muriel Barbery'], 'title': 'La Elegancia del Erizo (Seix Barral Biblioteca Formentor) (Spanish Edition)', 'isbn13': '9788432228216', 'msrp': 24.95, 'binding': 'Paperback', 'isbn': '8432228214', 'isbn10': '8432228214'}}