{'book': {'publisher': 'Editorial Anagrama', 'synopsis': 'Esta es la historia de un joven adolescente lanzado a las calles de La Habana de los años noventa. Una novela basada en hechos reales, escrita crudamente, sin aderezon ni adornos, en la mejor tradición del realismo sucio. Pedro Juan Gutiérrez continúa aquí su saga sobre la ciudad caribeña y su gente más pobre y marginal: mendigos, prostitutas, travestis, vendedores callejeros, pícaros, borrachos, los habitantes de un edificio abandonado y en ruinas, tipos sin un centavo, con hambre, siempre al borde de la muerte. Una fauna terrible y apocalíptica.<br/>«Esta es la voz de los sin voz», dice el autor acerca de sus personajes. «Los que tienen que arañar la tierra cada día para buscar algo de comer, no tienen tiempo ni energía para nada más. Su objetivo único es sobrevivir. Como sea. De cualquier modo. Ni ellos mismos saben por qué ni para qué. Se empecinan en sobrevivir un día más. Sólo eso.» A pesar de todo, el amor, el sexo y la ternura marcan las vidas de estos seres atormentados.<br/>Tras su deslumbrante debut con Trilogía de La Habana, saludada por la crítica como una de las revelaciones más impactantes de la literatura latinoamericana reciente, con esta novela se confirmaron las muchas esperanzas dipositadas en Pedro Juan Gutiérrez.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/76/71/9788433967671.jpg', 'title_long': 'El rey de La Habana (Spanish Edition)', 'edition': '4', 'dimensions': 'Height: 8.25 Inches, Length: 5.75 Inches, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 0.75}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 224, 'date_published': '2001-04-20', 'subjects': ['Literature & Fiction', 'Dramas & Plays', 'Regional & Cultural', 'Genre Fiction', 'Reference', 'Foreign Language Study & Reference', 'Education & Teaching', 'Schools & Teaching'], 'authors': ['Pedro Juan Gutiérrez'], 'title': 'El rey de La Habana (Spanish Edition)', 'isbn13': '9788433967671', 'msrp': 18.99, 'binding': 'Paperback', 'isbn': '8433967673', 'isbn10': '8433967673', 'other_isbns': [{'isbn': '9788433919977', 'binding': 'ebook'}]}}