{'book': {'publisher': 'Editorial Anagrama S.A.', 'synopsis': 'Product Description      <br/>Un libro heterodoxo, provocador y polemico del mas influyente critico literario de nuestro tiempo. Un canon de la literatura occidental que estudia a fondo la obra de 26 autores clave -de Dante a Beckett, pasando por Shakespeare, Cervantes, Tolstoi, Proust, Virginia Woolf, Borges- y cuestiona las manipuladoras aproximaciones a la literatura desde la llamada Escuela del Resentimiento, que forman lo politicamente correcto, el multiculturalismo, el marxismo, el feminismo, el neohistoricismo. / An unorthodox, provocative and controversial book from the most influential literary critic of our times. A canon of western literature which studies at depth the works of 26 key authors (from Dante to Beckett, stopping at Shakespeare, Cervantes, Tolstoy, Proust, Virginia Woolf and Borges along the way)and questions the manipulative critical approach of what he terms the School of Resentment, which forms what is politically correct, multiculturalism, Marxism, feminism and neohistoricism.<br/>      Review      <br/>Leer bien es algo dificil de hacer y difícil de enseñar. Por eso este libro es importante. --Frank Kermode, London Review of Books<br/>      About the Author      <br/>Harold Bloom (Nueva York, 1930)resulta uno de los criticos literarios mas prestigiosos de estos tiempos. Es profesor de humanidades en la universidad de Yale y de ingles en la universidad de Nueva York. Ganador del McArthur Prize Fellow, entre otros galardones, y miembro de la American Academy. En marzo del 2002 le fue concedido el prestigioso Premio Catalunya.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/52/15/9788433905215.jpg', 'title_long': 'El canon occidental (La escuela y los libros de todas las épocas)', 'edition': '1', 'pages': 592, 'date_published': '1997', 'subjects': ['Literature & Fiction'], 'authors': ['Harold Bloom'], 'title': 'El canon occidental (La escuela y los libros de todas las épocas)', 'isbn13': '9788433905215', 'msrp': 59.15, 'binding': 'Hardcover', 'isbn': '843390521X', 'isbn10': '843390521X'}}