{'book': {'publisher': 'Editorial Anagrama', 'synopsis': 'Madres e hijas: una realidad universal, una relación crucial, y sin embargo, un tema llamativamente ausente de la historia de la literatura. Para que adquiriese carta de ciudadanía, ha habido que esperar a que las mujeres escribieran y a que fueran configurando una tradición propia. Es significativo que una de las más tempranas obras debidas a una mujer sean las cartas de Madame de Sévigné (1626-1696) dirigidas a su hija. Pero es solo en el siglo XX -a medida que las mujeres escritoras van dejando de ser una rareza- cuando el dúo madre-hija comienza a tener una presencia literaria notable. Las primeras obras en darle protagonismo, como Sido de Colette o Una muerte muy dulce de Simone de Beauvoir, fundan un género -la evocación de la madre muerte- que luego se multiplicará, ramificándose, en obras como las de Annie Ernaux, W.A. Mitgutsch, Carla Cerari, Amy Tan, Isabel Allende o Susanna Tamaro hasta convertirse en un lugar común de la narrativa contemporánea, e inspirar a escritores varones que empiezan a su vez a escribir sobre sus padres. Aunque la literatura castellana parece peculiarmente reacia al análisis de sentimientos y, en general, a la esfera íntima ("Nuestra intimidad es esteparia", se lamentaba Gil de Biedma), la realción entre madres e hijas es un tema presente en la obra de muchas escritoras contemporáneas, como lo atestiguan los relatos -anteriormente publicados- de Rosa Chacel, Carmen Laforet, Carmen Martín Gaite y Ana María Matute que hemos seleccionado. A ellos se añaden otros de autoras más jóvenes, escritos expresamente para este libro y, por lo tanto, inéditos. La figura de la madre, de la hija, o la maternidad en sí, suscitan en cada uno de estos textos visiones muy dispares: declaración de amor, lucha a muerte, fantasía entre angelical y terrorífica, crítica radical a los valores de la sociedad en que vivimos, diferenciación entre madres y mamás, o análisis de sentimientos ambiguos en torno a una madre percibida como nudo gordiano en el que se entralazan infancia y madurez, agobio y orfandad, rivalidad y adoración... y cuya muerte parte en dos la vida de la hija.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/02/57/9788433910257.jpg', 'title_long': 'Madres e hijas (Spanish Edition)', 'edition': '1', 'dimensions': 'Height: 8.6614 Inches, Length: 5.5118 Inches, Weight: 0.7 Pounds, Width: 0.86614 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5118}, 'width': {'unit': 'inches', 'value': 0.86614}, 'weight': {'unit': 'pounds', 'value': 0.7}, 'height': {'unit': 'inches', 'value': 8.6614}}, 'pages': 240, 'date_published': '1996-01-01', 'subjects': ['Literature & Fiction', 'Short Stories & Anthologies', 'Anthologies', 'World Literature', 'European'], 'authors': ['Laura Freixas'], 'title': 'Madres e hijas (Spanish Edition)', 'isbn13': '9788433910257', 'msrp': 29.95, 'binding': 'Paperback', 'isbn': '8433910256', 'isbn10': '8433910256', 'other_isbns': [{'isbn': '9788433932143', 'binding': 'ebook'}]}}