{'book': {'publisher': 'Editorial Anagrama', 'synopsis': 'Escritas a lo largo de varios años, las Crónicas perdidas de Alfredo Bryce Echenique permanecieron durante mucho tiempo, por diversos y a veces azarosos motivos, fuera del alcance de muchos lectores. Su rescate y publicación en libro permiten no sólo volver a apreciar el talento literario de su autor, sino la actualidad de sus sorprendentes puntos de vista.<br/>Agudo observador de la escena contemporánea, el autor aborda en estos textos, con inigualable gracia y solvencia, asuntos de política internacional, del mundo de la cultura y del espectáculo, y, cómo no, aquellos que atañen a la literatura y su repercusión en nuestras vidas. Al tomarle el pulso al suceder cotidiano, este observador insobornable pone al descubierto aquello que yace bajo la superficie de los acontecimientos y que no solemos percibir. Y en dichos textos cabría quizá destacar el apartado «Doce cartas a dos amigos» en el que el autor nos brinda espléndidos relatos autobiográficos.<br/>Serias o irónicas, tiernas u objetivas, alegres o nostálgicas, pero -eso sí- siempre divertidas y aleccionadoras, estas Crónicas perdidas, felizmente recuperadas, son una soberbia expresión de la excelsa y personalísima prosa de Alfredo Bryce Echenique.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/49/71/9788433924971.jpg', 'title_long': 'Crónicas perdidas (Narrativas Hispanicas) (Spanish Edition)', 'edition': '1', 'dimensions': 'Height: 9.22 Inches, Length: 4.78 Inches, Weight: 1.4 Pounds, Width: 1.19 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.78}, 'width': {'unit': 'inches', 'value': 1.19}, 'weight': {'unit': 'pounds', 'value': 1.4}, 'height': {'unit': 'inches', 'value': 9.22}}, 'pages': 544, 'date_published': '2002-02-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Short Stories & Anthologies', 'Short Stories', 'World Literature', 'Caribbean & Latin American', 'United States'], 'authors': ['Alfredo Bryce Echenique'], 'title': 'Crónicas perdidas (Narrativas Hispanicas) (Spanish Edition)', 'isbn13': '9788433924971', 'msrp': 35.9, 'binding': 'Paperback', 'isbn': '8433924974', 'isbn10': '8433924974'}}