{'book': {'publisher': 'EDICIONES SM', 'synopsis': 'Product Description      Al leer este libro y responder a los enigmas que plantea, el lector entrará en El Mundo Sutil. y en un palacio con muchas puertas en busca de un tesoro. El lector elige lo que les sucede a sus protagonistas.      Book Description      Libro y también juego donde se plantean preguntas al lector. Según la respuesta que dé el lector irá por un camino u otro.      About the Author      Carlo Frabetti nació en Bolonia (Italia) en 1945. Matemático, miembro de la Academia de Ciencias de Nueva York, ha publicado más de cuarenta títulos sobre temas diversos, varios de ellos de matemática recreativa y acertijos lógicos y muchos de ellos dirigidos a niños y a jóvenes. \xa0 Algunas de sus novelas giran en torno a la resolución de enigmas, como Los jardines cifrados o El gran juego. Ha escrito, creado y dirigido numerosos programas de televisión como La bola de Cristal, El duende del Globo, Ni a tontas ni a locas o Tendencias. También ha estrenado varias obras de teatro y creado y dirigido diversas colecciones de divulgación científica para niños y jóvenes. \xa0 Entre sus libros para adultos destacan La reflexión y el mito, El tablero mágico, Los jardines cifrados, El libro del genio matemático, La ciudad rosa y roja y El Libro del Infierno. \xa0 En 1998 fue distinguido con el Premio Jaén de Literatura Infantil y Juvenil, mientras que en 2007 logró el Premio El Barco de Vapor por la obra Calvina.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/15/12/9788434841512.jpg', 'title_long': 'El Bebe', 'dimensions': 'Height: 7.086614166 Inches, Length: 5.118110231 Inches, Weight: 0.26014546916 Pounds, Width: 0.2755905509 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.118110231}, 'width': {'unit': 'inches', 'value': 0.2755905509}, 'weight': {'unit': 'pounds', 'value': 0.26014546916}, 'height': {'unit': 'inches', 'value': 7.086614166}}, 'pages': 112, 'date_published': '2005-05-27', 'subjects': ["Children's Books", 'Science Fiction & Fantasy', 'Fantasy & Magic'], 'authors': ['Carlo Frabetti'], 'title': 'El Bebe', 'isbn13': '9788434841512', 'msrp': 12.95, 'binding': 'Hardcover', 'isbn': '8434841517', 'isbn10': '8434841517'}}