{'book': {'publisher': 'LITERATURA RANDOM HOUSE', 'synopsis': 'Una novela vertiginosa e hipnotizante en la que el enfant terrible de la literatura norteamericana arremete contra su propia biografia.<br/>Imagine que se convierte en un autor de gran éxito cuando todavía es universitario. Fama y millones de dólares difuminan la muerte inmediata de su insufrible padre. Fiestas glamurosas en Manhattan, sexo y drogas le sumergen en la vorágine de la autodestrucción. Imagine que poco después tiene una segunda oportunidad, como le sucede a Bret Easton Ellis en Lunar Park: una nueva vida junto a su esposa y sus hijos en un idílico barrio residencial. Sin embargo, todo esto puede cambiar...<br/>En una fatídica fiesta de Halloween, Bret Easton Ellis cree ver a uno de sus personajes de ficción más temibles conduciendo un coche como el de su padre, mientras, en la habitación de su hijastra, una muñeca ha cobrado vida. Extrañamente, la casa desprende una atmósfera fantasmal y en el exterior las cosas no parecen ir mejor: se suceden una serie de asesinatos y desapariciones de niños de la misma edad que su hijo. Lunar Park es una obra excepcional en la que se confunden realidad y ficción, y en ella el enfant terrible de la literatura americana arremete contra su propia biografía.<br/>Reseñas:<br/>«He aquí un libro que avanza desde la oscuridad y la banalidad hacia la luz y la epifanía con una fuerza y seguridad sorprendentes.»<br/>Stephen King<br/>«Un libro inquietante y real [...] El primer capítulo es la prueba de que no tiene desperdicio, que es droga dura y que, contra el olvido que le auguraran los detractores del escritor, Easton sigue en forma.»<br/>Nuria Labari, El Mundo<br/>«Adictiva, sublime, exquisita, brillantemente ejecutada [...] Una fantasmagórica fusión de amor y pérdida, de alucinaciones y sabiduría.»<br/>The New York Times<br/>«En Lunar Park, Ellis supera la frontera de la metaficción introduciéndonos en un modelo narrativo que bien pudiéramos denominar como "psycho-ficción". Las evocaciones que sugiere son tan numerosas como heterogéneas.»<br/>José Antonio Gurpegui, El Cultural<br/>«Lunar Park es una novela tremendamente entretenida, propulsada por un humor festivo completamente ausente en la escritura de la generación de escritores americanos que sucedió a Ellis.»<br/>Matt Thorne, The Independent<br/>«Una lectura hipnotizante [...] Verdaderamente aterradora [...] Lunar Park es una historia acerca de ese dolor transcendental que los padres infligen a sus hijos [...] El peor tipo de violencia es aquella que es interna y emocional, y en las bellas páginas finales de esta rica y compleja novela se demuestra que también es el tipo más dañino.»<br/>The Miami Herald', 'language': 'es', 'image': 'https://images.isbndb.com/covers/15/07/9788439701507.jpg', 'title_long': 'Lunar Park (Literatura) (Spanish Edition)', 'edition': '001', 'dimensions': 'Height: 9.40943 Inches, Length: 5.5118 Inches, Weight: 1.30513659104 Pounds, Width: 1.1811 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5118}, 'width': {'unit': 'inches', 'value': 1.1811}, 'weight': {'unit': 'pounds', 'value': 1.30513659104}, 'height': {'unit': 'inches', 'value': 9.40943}}, 'pages': 384, 'date_published': '2006-02-24', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Family Life', 'Psychological', 'World Literature', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Supernatural', 'Thrillers & Suspense', 'Psychological Thrillers', 'Suspense', 'Science Fiction & Fantasy', 'Fantasy'], 'authors': ['Bret Easton Ellis'], 'title': 'Lunar Park (Literatura) (Spanish Edition)', 'isbn13': '9788439701507', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '8439701500', 'isbn10': '8439701500'}}