{'book': {'publisher': 'Editorial Edaf, S.L.', 'synopsis': 'Si Vida después de la vida marcó un punto de inflexión respecto de todos los conceptos que el hombre moderno tenía sobre la muerte -tanto culturales y espirituales como científicos- este nuevo y sorprendente trabajo abre un polémico debate en torno a otro tema "tabú" en nuestra sociedad: LA POSIBILIDAD DE CONTACTO CON PERSONAS FALLECIDAS Después de las sorprendentes investigaciones sobre la posibilidad de contacto con apariciones de personas fallecidas llevadas a cabo por el doctor Moody en su "teatro de la mente", esta obra nos ofrece el fruto de dichos experimentos llevados a cabo por decenas de personas en un entorno de laboratorio y efectuados con la ayuda de espejos con cámaras diseñada específicamente para el desarrollo de la experiencia. El resultado abrirá al lector nuevas perspectivas, planteamientos y reflexiones que, a buen seguro, harán considerar su actitud incluso a los más acépticos. Por tanto, deben superarse prejuicios y condicionamientos previos. El autor es un médico con una sólida conformación humanista, además de psiquiatra y profesor de filosofía, y su trabajo, con una profunda carga antropológica, ofrece una casuística que demuestra el calor terapéutivo y consuelo que estos encuentros con visiones de seres queridos fallecidos aportan a sus pacientes. Un libro imprescindible que no dejará indiferente a ningún lector.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/19/38/9788441401938.jpg', 'title_long': 'Más sobre la vida después de la vida (Spanish Edition)', 'edition': '1', 'dimensions': 'Height: 9 inches, Length: 6.25 inches, Weight: 0.9149183873 Pounds, Width: 1 inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.9149183873}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 304, 'date_published': '1997-01-01', 'subjects': ['Religion & Spirituality', 'New Age & Spirituality'], 'authors': ['Raymond A Moody'], 'title': 'Más sobre la vida después de la vida (Spanish Edition)', 'isbn13': '9788441401938', 'msrp': 18.5, 'binding': 'Paperback', 'isbn': '8441401934', 'isbn10': '8441401934'}}