{'book': {'publisher': 'Editorial Edaf, S.L.', 'synopsis': 'Cómo tocar el piano le enseñará que tocar y conocer este bello instrumento no es tan difícil y complicado como nos han hecho creer, y que, por el contrario, es una labor gratificante. Roger Evans, gracias a su experiencia como profesor de música e instrumentos, le enseñará a hacerlo mediante un método práctico, didáctico y entretenido. Evitando en lo posible el uso excesivo de palabras técnicas, abre la posibilidad al lector con o sin conocimientos previos de interpretar música sencílla con este instrumento, merced a las detalladas instrucciones y útiles consejos para progresar en su aprendizaje posterior. Piezas musicales, melodías conocidas y clásicos populares se alternan con artículos sobre el piano y el modo de tocarlo, junto con explicaciones de cada nueva técnica. Los dibujos, que representan las manos sobre el teclado, ilustran las posiciones correctas... Un libro que, bajo la supervisión técnica de prestigiosos profesores de piano, será de gran valor para los que empiezan a estudiar en la escuela, o en clases privadas, así como para los que han decidido aprenderlo por sí mismos', 'language': 'es', 'image': 'https://images.isbndb.com/covers/48/46/9788441414846.jpg', 'title_long': 'Cómo tocar el piano (Spanish Edition)', 'edition': '1', 'dimensions': 'Height: 9.75 Inches, Length: 7.5 Inches, Weight: 0.4188782978 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.5}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.4188782978}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 112, 'date_published': '2006-09-21', 'subjects': ['Arts & Photography', 'Music', 'Instruments', 'Theory, Composition & Performance', 'Crafts, Hobbies & Home', 'Home Improvement & Design', 'How-to & Home Improvements', 'Education & Teaching', 'Schools & Teaching', 'Instruction Methods'], 'authors': ['Roger Evans'], 'title': 'Cómo tocar el piano (Spanish Edition)', 'isbn13': '9788441414846', 'msrp': 13.99, 'binding': 'Paperback', 'isbn': '844141484X', 'isbn10': '844141484X'}}