{'book': {'publisher': "O'Reilly Media", 'synopsis': 'Windows XP is the latest, most reliable, and best-looking version of the Windows operating system to emerge yet. As the result of the unification of Microsoft\'s corporate series (Windows NT and 200) with the home series (Windows 95, 98, and Me), Windows XP offers much that is pleasing to its users: rock-solid stability and a fresh new look. But power users who want to take command of their operating systems will find the same old frustrations: it\'s never been easy to get under the hood of a Windows system and Windows XP is no exception.<br/>Now power users can rejoice! Windows XP Hacks offers tips, tools, and know-how to bend Windows XP to your will. The book delves into XP topics such as controlling the control panel, changing unchangeable icons, removing uninstallable XP components, stopping pop-up ads, taking a bite out of cookies, speeding up file downloads, protecting yourself with firewalls and proxy servers, and more. Users of both Windows XP Home Edition and Windows XP Pro Edition will find smart, timesaving, fun, and useful hacks for virtually every feature in their operating system. Even if you\'re not a power user yet, this book will have you well on your way.<br/>Each Hack in the book can be read easily in a few minutes, saving countless hours of searching for the right answer. Windows XP Hacks provides direct, hands-on solutions that can be applied to the challenges facing both those meeting Windows XP for the first time as well as long-time users who know what they want from their operating system and just wants tips on how to get it.<br/>Windows XP Hacks is the latest in O\'Reilly\'s new Hacks Series which aims to begin reclaiming the term "hacking" for the good guys. In recent years, the term has come to be associated with those nefarious black hats who break into computers to snoop, steal information or disrupt Internet traffic. But the term originally had a more benign meaning, and you\'ll still hear it used this way whenever developers get together. Our new Hacks books are written in the spirit of the true hackers -- the people who drive innovation.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/65/02/9788441516502.jpg', 'title_long': 'Trucos Windows XP', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Width: 0.99 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.99}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 412, 'date_published': '2004-07-02', 'subjects': ['Computers & Technology', 'Networking & Cloud Computing', 'Networks, Protocols & APIs', 'Operating Systems', 'Windows', 'Internet & Social Media', 'Hacking', 'Security & Encryption', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Preston Gralla'], 'title': 'Trucos Windows XP', 'isbn13': '9788441516502', 'msrp': 24.95, 'binding': 'Paperback', 'isbn': '8441516502', 'isbn10': '8441516502'}}