{'book': {'publisher': 'Editorial Edaf, S.L.', 'synopsis': 'No existe tarea más difícil en el mundo que la de ser padre. ¿Qué significa realmente ser padres? ¿Define ser padre la paternidad o la maternidad? La mayoría de las personas son capaces de expresar con facilidad cuáles son sus expectativas profesionales, enumerar sus planes a largo plazo para la jubilación y conseguir seguridad económica, saber cuantas letras de la casa quedan por pagar... pero quizá serían incapaces de saber cuáles son sus planes para que sus hijos crezcan sanos y felices. No nacemos sabiendo cómo ser padres... es algo que se construye. Ser padre implica acción, tomar decisiones sobre lo que se desea que los hijos sepan de la vida, sobre las relaciones, la honradez, el honor... Ser padre ha de ser el trabajo más importante de nuestra vida. Pero incluso los que tienen claras estas premisas e intenciones en relación con sus hijos, caen en algunas trampas o errores que pueden obstaculizar su sano crecimiento. - No ser firmes. - Jugar a arreglarlo todo. - Imponer una disciplina destructiva. - "Haz lo que yo digo, pero no lo que yo hago." - Descuidar necesidades básicas. - Olvidarse de disfrutar y divertirse. El autor, Kevin Steede, psicólogo y padre, les ayudará a desarrollarse como padres y a comprometerse activamente en las vidas de sus hijos. Usted aprenderá el poder que tiene la disciplina constructiva, la coherencia y la comunicación abierta, y manifestará una actitud positiva. Cualquiera puede ser un gran padre o madre. Se trata simplemente de que sea una prioridad en su vida, y de conocer las estrategias y las habilidades que enseña este libro.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/49/77/9788441404977.jpg', 'title_long': 'Los 10 Errores Mas Comunes de Los Padres Y.', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.5732018812 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.5732018812}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 176, 'date_published': '1999-01-01', 'subjects': ['Parenting & Relationships', 'Parenting', 'Reference', 'Foreign Language Study & Reference'], 'authors': ['Kevin Steede'], 'title': 'Los 10 Errores Mas Comunes de Los Padres Y.', 'isbn13': '9788441404977', 'msrp': 18.99, 'binding': 'Paperback', 'isbn': '8441404976', 'isbn10': '8441404976'}}