{'book': {'publisher': 'Ediciones Paidós', 'synopsis': 'Product Description      «Este libro es un testimonio del compromiso con América Latina que adquirí en París, hace ahora medio siglo, y al que me mantengo fiel. Es cierto que cualquiera que hojee sus páginas se apercibirá de que, en el curso del tiempo, mis opiniones literarias, mis juicios políticos, mis entusiasmos y mis críticas han cambiado muchas veces de objetivo y de contenido, cada vez que lo exigía de mí una realidad cambiante. Pero mi interés, mi curiosidad y también mi pasión por ese mundo complejo, trágico y formidable, de intensa creatividad, de sufrimientos y penas indecibles, donde las formas más refinadas de la civilización se mezclan con las de la pura barbarie, han llegado intactos al día de hoy... A su manera, este diccionario es una mezcolanza plural que aborda todos los temas imaginables –la revolución, la fotografía, ciertos giros del lenguaje popular, el cine, las dictaduras, el paisaje, los escritores, la historia, el humor, el fútbol, los viajes, la pintura― y comprende una gran variedad de géneros –del reportaje periodístico al artículo de fondo, de la evocación a la noticia, de la nota necrológica a la crónica, incluso a la ficción―... En fin, este libro es también como el envés de una autobiografía.» Mario Vargas Llosa      About the Author      Mario Vargas Llosa se licenció en Letras en la Universidad de San Marcos (Lima) y se doctoró por la de Madrid. En 1959 se dio a conocer con un libro de relatos, Los jefes (Premio Leopoldo Alas), pero fue La ciudad y los perros (1963, Premio Biblioteca Breve y Premio de la Crítica) la que le hizo famoso. Novelas posteriores son La Casa Verde (1966, Premio de la Crítica y Premio Internacionl de Literatura Rómulo Gallegos), Conversación en La Catedral (1969), Pantaleón y las visitadoras (1973), La tía Julia y el escribidor (1977), La guerra del fin del mundo (1981), Historia de Mayta (1984), ¿Quién mató a Palomino Molero? (1986), El hablador (1987) y Elogio de la madrastra (1989). Ha publicado también diversas obras teatrales, como La señorita de Tacna, La Chunga y El loco de los balcones; ensayos como García Márquez: historia de un deicidio (1971) y La orgía perpetua: Flaubert y «Madame Bovary» (1975), y las memorias tituladas El pez en el agua (1993), en las que relata su experiencia política como candidato a la presidencia de la República del Perú. Con Lituma en los Andes obtuvo el Premio Planeta 1993, y en 1997 publicó la novela Los cuadernos de don Rigoberto. En 1986 compartió con Rafael Lapesa el Premio Príncipe de Asturias de las Letras y en 1994 se le concedió el Premio Miguel de Cervantes de Literatura. En 2010 ha sido galardonado con el Premio Nobel de Literatura 2010.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/95/01/9788449319501.jpg', 'title_long': 'Diccionario del amante de América Latina (Spanish Edition)', 'dimensions': 'Height: 9.25195 Inches, Length: 6.49605 Inches, Weight: 1.81219979364 Pounds, Width: 1.2598425184 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.49605}, 'width': {'unit': 'inches', 'value': 1.2598425184}, 'weight': {'unit': 'pounds', 'value': 1.81219979364}, 'height': {'unit': 'inches', 'value': 9.25195}}, 'pages': 424, 'date_published': '2006-11-10', 'subjects': ['History', 'Europe', 'Historical Study & Educational Resources'], 'authors': ['Mario Vargas Llosa'], 'title': 'Diccionario del amante de América Latina (Spanish Edition)', 'isbn13': '9788449319501', 'msrp': 46.95, 'binding': 'Hardcover', 'isbn': '8449319501', 'isbn10': '8449319501'}}