{'book': {'publisher': 'Ediciones Paidós', 'synopsis': 'El terapeuta Bill O’Hanlon no nos enseña únicamente a superar una crisis, sino también a avanzar a partir de esa experiencia. Las crisis y los problemas son oportunidades para rectificar a mitad de camino y, de este modo, aprender a crecer. Sin embargo, conseguirlo está en nuestras manos. Si estamos pasando por un momento difícil, este libro nos servirá como mapa para guiarnos a través de los mares hostiles que son las crisis para, finalmente, llegar a buen puerto. En este sentido, aborda los siguientes aspectos: -Los cinco caminos cruciales para aprender a sacar el máximo provecho de las crisis. -Qué hacer para controlar una crisis e impedir que la crisis nos controle a nosotros. -Por qué evitando, negando o minimizando una situación estamos generando una crisis. -De qué modo los viejos traumas pueden verse bajo otra luz. -Cómo transformar las adversidades en oportunidades regenerativas que a su vez nos estimulen y nos ayuden a crecer.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/75/83/9788449317583.jpg', 'title_long': 'Crecer a partir de la crisis: Cómo convertir una situación difícil o traumática en una oportunidad de cambio (Spanish Edition)', 'edition': 'Translation', 'dimensions': 'Height: 8.6614 Inches, Length: 6.10235 Inches, Weight: 0.53351867404 Pounds, Width: 0.6692913379 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.10235}, 'width': {'unit': 'inches', 'value': 0.6692913379}, 'weight': {'unit': 'pounds', 'value': 0.53351867404}, 'height': {'unit': 'inches', 'value': 8.6614}}, 'pages': 240, 'date_published': '2005-06-01', 'subjects': ['Self-Help', 'Relationships', 'Interpersonal Relations', 'Personal Transformation', 'Health, Fitness & Dieting', 'Psychology & Counseling', 'Applied Psychology'], 'authors': ["Bill O'Hanlon"], 'title': 'Crecer a partir de la crisis: Cómo convertir una situación difícil o traumática en una oportunidad de cambio (Spanish Edition)', 'isbn13': '9788449317583', 'msrp': 7.95, 'binding': 'Paperback', 'isbn': '8449317584', 'isbn10': '8449317584'}}