{'book': {'publisher': 'Ediciones Paidós', 'synopsis': 'Dos científicos expertos en el estudio del comportamiento animal, Jane Goodall y Marc Bekoff, nos proponen diez mandamientos que debemos cumplir si verdaderamente estamos preocupados por nuestro planeta. Su punto de partida es una perspectiva espiritual sobre las relaciones entre humanos y animales. Y ello les lleva a defender, de modo apasionado y persuasivo, que, si aplicamos esos mandamientos en nuestra vida cotidiana, la Tierra y todos sus habitantes podrán vivir en completa armonía. El libro desarrolla la idea de que nuestra obligación es vivir en estrecho contacto con los animales –puesto que los humanos formamos parte del reino animal– y nos dice que debemos aprender a conocerlos y entenderlos para poder protegerlos y evitar su extinción. El tema central de los mandamientos es la importancia y el valor que tiene cualquier animal como individuo, con su propia personalidad e idiosincrasia, algo sobre lo que ambos autores vienen escribiendo desde hace años. La conclusión es que se trata de diez mandamientos simples y a la vez profundos, pues, además de ayudarnos a reflexionar sobre nuestra forma de vivir en el planeta y mostrarnos cuáles son nuestras responsabilidades como “gestores” del mundo natural, nos enseñan algo todavía más importante: cómo respetar cualquier forma de vida.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/43/39/9788449314339.jpg', 'title_long': 'Los Diez Mandamientos: Para Compartir el Planeta con los Animales que Amamos (Spanish Edition)', 'dimensions': 'Height: 9.25 Inches, Length: 6 Inches, Weight: 0.7054792384 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.7054792384}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 216, 'date_published': '2003-09-01', 'subjects': ['Reference', 'Encyclopedias & Subject Guides', 'Religion', 'Religion & Spirituality', 'Science & Math', 'Biological Sciences', 'Ecology', 'Experiments, Instruments & Measurement'], 'authors': ['Marc Bekoff', 'Jane Goodall'], 'title': 'Los Diez Mandamientos: Para Compartir el Planeta con los Animales que Amamos (Spanish Edition)', 'isbn13': '9788449314339', 'msrp': 33.95, 'binding': 'Paperback', 'isbn': '844931433X', 'isbn10': '844931433X'}}