{'book': {'publisher': 'Ediciones Paidós', 'synopsis': 'El estudio de la música producida por las culturas americanas precolombinas, dado su carácter de manifestación no accesible ya en su integridad, y pese a su importancia cultural, se ha visto tradicionalmente relegado en la bibliografía frente a los trabajos sobre las artes plásticas. Pero lo cierto es que puede demostrarse que su papel era privilegiado en la ordenación de las sociedades indígenas y que estaba fuertemente relacionada con otras artes, como la poesía y la danza. Cabe trazar de la siguiente forma las fases por las que ha pasado el juicio que la música precolombina ha sugerido a críticos e historiadores: después de una larga etapa de olvido o menosprecio, coincidente a grandes rasgos con el siglo XIX, las respectivas escuelas nacionales iberoamericanas han recuperado esta parte de su historia para los patrimonios culturales propios. Es notorio que faltaba, sin embargo, un texto desde la óptica española que se centrase en este objeto cultural perdido, algo que los estudiosos hispanos han dejado de lado, luego de ser los primeros en ocuparse del tema. Las fuentes españolas antiguas aportan datos valiosísimos sobre las músicas azteca o inca, pero dichos testimonios, que paralelamente tienen mucho de fundacionales de ciencias modernas como la antropología o la etnomusicología, surgen, sin embargo, esporádica o desordenadamente en el marco de escritos más amplios.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/52/51/9788449315251.jpg', 'title_long': 'La música precolombina: Un debate cultural después de 1492 (Spanish Edition)', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 0.9369646135 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.9369646135}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 304, 'date_published': '2004-02-15', 'subjects': ['Arts & Photography', 'Music', 'Songbooks', 'Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies'], 'authors': ['Enrique Martínez Ruiz'], 'title': 'La música precolombina: Un debate cultural después de 1492 (Spanish Edition)', 'isbn13': '9788449315251', 'msrp': 10.95, 'binding': 'Paperback', 'isbn': '8449315255', 'isbn10': '8449315255'}}