{'book': {'publisher': 'Ediciones Paidós', 'synopsis': 'El hecho de que no existan gatos guardianes o gatos lazarillo tiene una clara explicación. Los gatos, como bien saben sus propios «dueños», son animales tan independientes que pueden llegar a resultar intratables, capaces de desafiar cualquier tópico sobre los animales domésticos. En este libro, el conocido autor y científico Stephen Budiansky combina las últimas investigaciones, el saber popular y su afición por los felinos para desvelarnos los misterios de estas fascinantes criaturas. Los gatos son capaces de adaptarse perfectamente a nuestro entorno, pero su mezcla de cariño y crueldad, recelo y gregarismo, dependencia y distanciamiento, los convierten en los animales domésticos menos adecuados para la domesticación. Entonces, se preguntará el lector, ¿por qué hay tanta gente que convive con ellos? Por lo tanto, La naturaleza de los gatos cubre todo el espectro de datos conocidos sobre este tipo de animales con un estilo vivo y atractivo, desde su historia a la superstición que los rodea, sus modelos de caza, las imágenes religiosas que suscitan, su comportamiento sexual o la preferencia por determinados colores. Los gatos no son mascotas, sino compañeros a los que imponemos nuestros deseos y expectativas, y que ocupan un lugar junto a nosotros en el hogar aunque siempre parezcan conservar un pie en la selva. Por fin un libro inteligente, de fácil lectura, que hace justicia a un universo tan complejo como es el de los gatos.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/38/13/9788449313813.jpg', 'title_long': 'La naturaleza de los gatos: Orígenes, inteligencia, comportamiento y astucia del Felis Silvestris Catus (Spanish Edition)', 'dimensions': 'Height: 8.6614 Inches, Length: 5.31495 Inches, Weight: 0.5732018812 Pounds, Width: 0.5511811018 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31495}, 'width': {'unit': 'inches', 'value': 0.5511811018}, 'weight': {'unit': 'pounds', 'value': 0.5732018812}, 'height': {'unit': 'inches', 'value': 8.6614}}, 'pages': 200, 'date_published': '2003-06-01', 'subjects': ['Crafts, Hobbies & Home', 'Pets & Animal Care', 'Cats', 'Science & Math', 'Behavioral Sciences', 'Biological Sciences', 'Zoology'], 'authors': ['Stephen Budiansky'], 'title': 'La naturaleza de los gatos: Orígenes, inteligencia, comportamiento y astucia del Felis Silvestris Catus (Spanish Edition)', 'isbn13': '9788449313813', 'msrp': 25.95, 'binding': 'Paperback', 'isbn': '8449313813', 'isbn10': '8449313813'}}