{'book': {'publisher': 'Ediciones B', 'synopsis': "Caleb Tanner, a British detective on the trail of a French spy, takes a position as a stable groom on the estate of famed courtesan Gabriella Durant, whose protégé and niece, Vermillion, is one of Caleb's prime suspects. Finding herself both captivated and infuriated by this arrogant, attractive man, Vermillion promises herself that she shall not stray from her duty to the line of courtesans in her family. But the passion that each has provoked in the other cannot be ignored, not even by two such masters of the art of deception. Caleb Tanner, un oficial británico que está cazando a un espía francés, consigue empleo como caballerizo en la hacienda de las Durant—donde vive la famosa coqueta Gabriella Durant y su nieta irresistible Vermillion, quien Tanner sospecha de ser la espía que busca. Cautivada y enfurecida por el atractivo y arrogante caballerizo, Vermillion se hace el firme propósito de resistirse a sus encantos, consciente que debe escoger entre la lealtad a su familia y los deseos que Caleb ha despertado en ella. Pero la pasión y la verdad no pueden negarse siempre, ni siquiera en el caso de dos maestros en el arte del ocultamiento.", 'language': 'es', 'image': 'https://images.isbndb.com/covers/41/07/9788466624107.jpg', 'title_long': 'Caminos del corazon (Spanish Edition)', 'edition': '00001', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.992080179 Pounds, Width: 0.88 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.88}, 'weight': {'unit': 'pounds', 'value': 0.992080179}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 352, 'date_published': '2006-09-28', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'World Literature', 'United States', 'Contemporary', 'Romance'], 'authors': ['Kat Martin'], 'title': 'Caminos del corazon (Spanish Edition)', 'isbn13': '9788466624107', 'msrp': 16.95, 'binding': 'Paperback', 'isbn': '8466624104', 'isbn10': '8466624104'}}