{'book': {'publisher': 'Punto de Lectura', 'synopsis': "Los años cincuenta retratados por Richard Yates tienen demasiados parentescos con los tiempos que vivimos. El aislamiento que nace de la comodidad. La pérdida, muchas veces inconsciente, de valores que en algún momento parecían fundamentales. Brillantes, bellos y confundidos, Frank y April Wheeler tratan de sostener sus ideas incluso contra sí mismos y sus debilidades.<br/>«Si se necesita algo más para realizar una obra maestra, no sé de qué se trata.» Tennesse Williams<br/><br/>«Si Vía Revolucionaria no convierte a Yates en un escritor inmortal, la inmortalidad es algo que no vale la pena.» Time<br/>«Una Madame Bovary habitando los pesadillescos suburbios del American Dream. Pocos libros tan tristes hicieron tan felices a sus lectores: obra maestra.» El País<br/><br/>ENGLISH DESCRIPTIONIn the hopeful 1950s, Frank and April Wheeler appear to be a model couple: bright, beautiful, talented, with two young children and a starter home in the suburbs. Perhaps they married too young and started a family too early. Maybe Frank's job is dull. And April never saw herself as a housewife. Yet they have always lived on the assumption that greatness is only just around the corner. But now that certainty is about to crumble.<br/><br/>With heartbreaking compassion and remorseless clarity, Richard Yates shows how Frank and April mortgage their spiritual birthright, betraying not only each other, but their best selves.", 'language': 'es', 'image': 'https://images.isbndb.com/covers/26/21/9788466322621.jpg', 'title_long': 'Via revolucionaria/ Revolutionary Road (Spanish Edition)', 'edition': 'Translation, Media Tie In', 'dimensions': 'Height: 7.4803 Inches, Length: 4.88188 Inches, Weight: 0.56879263596 Pounds, Width: 0.82677 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.88188}, 'width': {'unit': 'inches', 'value': 0.82677}, 'weight': {'unit': 'pounds', 'value': 0.56879263596}, 'height': {'unit': 'inches', 'value': 7.4803}}, 'pages': 272, 'date_published': '2009-01-30', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'TV, Movie, Video Game Adaptations', 'Family Life', 'Psychological', 'Contemporary'], 'authors': ['Richard Yates'], 'title': 'Via revolucionaria/ Revolutionary Road (Spanish Edition)', 'isbn13': '9788466322621', 'msrp': 13.99, 'binding': 'Hardcover', 'isbn': '8466322620', 'isbn10': '8466322620'}}