{'book': {'publisher': 'Punto De Lectura', 'synopsis': 'In the Royal Free of London Hospital, death is an enemy; it is very unusual that somebody be assassinated. When the corpse of nurse Barrymore is discovered in a laundry basket, the police turn a blind eye towards Dr. Kristian Beck\x92s probable guilt, just because he is a foreigner. The commission that directs the hospital orders the case to be investigated. As the investigation advances, everyone will begin to doubt the impartiality of justice.<br/>Description in spanish: En el hospital Royal Free de Londres la muerte es el enemigo diario. Sin embargo, es menos usual que alguien pueda ser asesinado. Cuando descubren el cadáver de la enfermera Prudence Barrymore, una mujer agradable y de buena familia, en un cesto de la lavandería, la policía se obceca en demostrar que el doctor Kristian Beck es el culpable, sólo porque es extranjero.<br/>La comisión que dirige el hospital encarga al detective William Monk que investigue el caso. Monk contará con la colaboración de sus colegas: la enfermera Hester Latterly, que conoció a la mujer asesinada, y el brillante abogado Oliver Rathbone, que actuará por parte de la defensa. A medida que la investigación avance, los tres empezarán a dudar de la imparcialidad de la justicia...', 'language': 'es', 'image': 'https://images.isbndb.com/covers/86/94/9788466308694.jpg', 'title_long': 'Una duda razonable = A Sudden, Fearful Death (Spanish Edition)', 'dimensions': 'Height: 6.75 Inches, Length: 4.25 Inches, Weight: 0.65 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.25}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 0.65}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 537, 'date_published': '2002-10-01', 'subjects': ['Literature & Fiction', 'Short Stories & Anthologies', 'Short Stories'], 'authors': ['Anne Perry'], 'title': 'Una duda razonable = A Sudden, Fearful Death (Spanish Edition)', 'isbn13': '9788466308694', 'msrp': 9.99, 'binding': 'Mass Market Paperback', 'isbn': '8466308695', 'isbn10': '8466308695'}}