{'book': {'publisher': 'Punto de Lectura', 'synopsis': "Product Description      A student's precarious financial state drives him to desperate measures: a not-so-profitable job at Academia Europa. Here, the young student and poet in the making will discover that walls can forever trap those who inhabit them. Lost in a labyrinth of hallways and classrooms he will discover passion in the form of a woman: Ariadna, the wife of the elderly director. But first, he must navigate through numerous obstacles -a ''modern day'' Lolita, the shadow of the Minotaur, and Plato's Allegory of a Cave. Description in Spanish: La precaria situacion economica de un estudiante de filologia clasica lo obliga a buscar trabajo desesperadamente. La Academia Europa, aunque poco rentable, es una solucion provisional. El joven estudiante, poeta en ciernes, descubrira que hay algo entre aquellas paredes que atrapa para siempre a quien las habita. En su interior el mundo se contempla como desde una caverna. Perdido en el laberinto de pasillos y aulas que siempre conducen al mismo sitio, el prota      About the Author      Luis Leante (Caravaca de la Cruz, Murcia, 1963). Licenciado en Filología Clásica. Ha publicado los libros de relatos El último viaje de Efraín (1986) y El criador de canarios (1996), y las novelas Camino del jueves rojo (1983), Paisaje con río y Baracoa de fondo (1997), Al final del trayecto (1997), La Edad de Plata (1998), El canto del zaigú (2000), El vuelo de las termitas (2003), Academia Europa (2003) y La Luna Roja (Alfaguara, 2009). En el año 2007 fue galardonado con el Premio Alfaguara de Novela por la obra Mira si yo te querré. También es autor de literatura juvenil. Cárceles imaginarias (Alfaguara, 2012) es su última novela.", 'language': 'es', 'image': 'https://images.isbndb.com/covers/21/64/9788466322164.jpg', 'title_long': 'Academia Europa/ Europa Academy (Spanish Edition)', 'dimensions': 'Height: 7.4803 Inches, Length: 4.92125 Inches, Weight: 0.36155810968 Pounds, Width: 0.59055 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.92125}, 'width': {'unit': 'inches', 'value': 0.59055}, 'weight': {'unit': 'pounds', 'value': 0.36155810968}, 'height': {'unit': 'inches', 'value': 7.4803}}, 'pages': 320, 'date_published': '2013-08-01', 'subjects': ['Literature & Fiction', 'Contemporary', 'Literary'], 'authors': ['Luis Leante'], 'title': 'Academia Europa/ Europa Academy (Spanish Edition)', 'isbn13': '9788466322164', 'msrp': 9.99, 'binding': 'Hardcover', 'isbn': '8466322167', 'isbn10': '8466322167'}}