{'book': {'publisher': 'Punto De Lectura', 'synopsis': 'Terry Dunn is not an ordinary priest; his parish is in war territories in Rwanda. Before he returns home to Detroit, his mission is to collect money for the orphans. He will do anything to fulfill his goal, even face the mafia of the city. Debbie Dewey, an ex-convict, also has a mission: to take revenge on the man that stole thousands from her. Perhaps working together, father Dunn and Debbie will be able to fulfill their objectives... and have a good time together while doing so.<br/>Description in Spanish: Terry Dunn no es un cura cualquiera. Su parroquia está en los territorios en guerra en Ruanda. Tiene un pasado turbio y un futuro incierto, pues debe volver a su Detroit natal, de donde huyó por problemas con la justicia. Sus intenciones actuales son recaudar dinero para los niños huérfanos de Ruanda. Y está dispuesto a todo por esta causa, incluso a enfrentarse a la mafia más peligrosa de la ciudad.<br/>Tampoco puede decirse que Debbie Dewey sea una chica convencional. Ex convicta y aspirante a artista, también está embarcada en una misión: vengarse del tipo que le timó 67.000 dólares y por cuya culpa acabó en prisión. Quizá trabajando a la par, el padre Terry y Debbie consigan cumplir sus propósitos... y a la vez pasar un buen rato.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/80/45/9788466308045.jpg', 'title_long': 'Almas paganas = Pagan Babies (Spanish Edition)', 'dimensions': 'Height: 6.5 Inches, Length: 4.25 Inches, Weight: 0.45 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.25}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.45}, 'height': {'unit': 'inches', 'value': 6.5}}, 'pages': 352, 'date_published': '2002-09-01', 'subjects': ['Literature & Fiction', 'Short Stories & Anthologies', 'Short Stories', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Supernatural'], 'authors': ['Elmore Leonard'], 'title': 'Almas paganas = Pagan Babies (Spanish Edition)', 'isbn13': '9788466308045', 'msrp': 9.99, 'binding': 'Mass Market Paperback', 'isbn': '8466308040', 'isbn10': '8466308040'}}