{'book': {'publisher': 'Punto De Lectura', 'synopsis': 'The protagonist of each of the stories in this collection is the soul in one of its various guises: a loaf of bread, a parrot, a swarm of bees, and an electric guitar. The stories are a current, simple, ironic, and surprising response to the eternal search for the location of the soul.<br/>Description in Spanish:<br/>¿Puede refugiarse el alma en una barra de pan? ¿O tener la forma de una guitarra eléctrica llamada Sirena en manos de un joven pescador?<br/>Desde la antigüedad, la búsqueda más intensa del ser humano es la del lugar donde habita el alma. He aquí una respuesta actual, sencilla, irónica y sorprendente a ese gran enigma histórico. El resultado de un duro viaje de ida y vuelta a las entrañas.<br/>Ella maldita alma es una obra intimista que acaba abriéndose al mundo como un Big Bang. Libro de relatos o novela polifónica, la escritura va localizando almas. Y sus formas son tan asombrosas como humildes: un enjambre de abejas, el corcho de una botella de alcohólico, un loro anarquista, un muñeco de ventrílocuo que se enamora y habla francés a las campesinas: "Merci dame, la plus belle".<br/>Después de ¿Qué me quieres amor? (Premio Nacional de Narrativa 1996) y de El lápiz del carpintero (Premio de la Crítica 1998), Manuel Rivas vuelve con una obra dura y melancólica, pero donde la vida aletea y emerge como un maravilloso don.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/11/52/9788466301152.jpg', 'title_long': 'Ella, maldita alma (Spanish Edition)', 'dimensions': 'Height: 6.5 Inches, Length: 4.25 Inches, Weight: 0.3 Pounds, Width: 0.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.25}, 'width': {'unit': 'inches', 'value': 0.25}, 'weight': {'unit': 'pounds', 'value': 0.3}, 'height': {'unit': 'inches', 'value': 6.5}}, 'pages': 128, 'date_published': '2002-07-01', 'subjects': ['Literature & Fiction', 'Short Stories & Anthologies', 'Short Stories'], 'authors': ['Manuel Rivas'], 'title': 'Ella, maldita alma (Spanish Edition)', 'isbn13': '9788466301152', 'msrp': 8.99, 'binding': 'Mass Market Paperback', 'isbn': '8466301151', 'isbn10': '8466301151'}}