{'book': {'publisher': 'EDB FICCION', 'synopsis': "Si le preguntas a cualquiera que viva en el lado equivocado de la ley acerca de la regla de los dos minutos, dira que se trata del tiempo que uno tiene para cometer un atraco antes de que la policia aparezca. Romper la regla de los dos minutos supone pasar una temporada en prision. Pero no todo el mundo respeta las reglas del juego. Cuando el estafador Max Holman sale de la carcel, la libertad no le resulta tan dulce como pensaba. Lo unico que tiene en mente es reconciliarse con su hijo, que, ironicamente, es policia. Pero una noticia desgarradora rompe sus planes: su hijo y otros tres oficiales de la policia de Los Angeles han sido abatidos a tiros la noche antes de su puesta en libertad. Cuando el caso es expuesto como un ajuste de cuentas debido a la corrupcion policial, limpiar el buen nombre de su hijo y encontrar a su asesino pasa a ser la ultima voluntad de Holman. / Most reviewers are slaphappy with praise for Robert Crais's 13th novel. While some critics note a preference for his Elvis Cole books, they find that believable, complex characters, the vibrant settings around Los Angelesfrom the dive bars to the straitjacketed Los Angeles riverand heartfelt emotions separate The Two Minute Ruleand Craisfrom the bulk of crime fiction. The sharp note of dissent from the Oregonian only serves to reinforce the impression that middle-of-the road Crais is better than many other writers' best. Bookmarks Magazine", 'language': 'es', 'image': 'https://images.isbndb.com/covers/76/02/9788466637602.jpg', 'title_long': 'DOS MINUTOS (Spanish Edition)', 'edition': '00001', 'dimensions': 'Height: 9.0551 Inches, Length: 5.9055 Inches, Weight: 1.16183612074 Pounds, Width: 1.06299 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.9055}, 'width': {'unit': 'inches', 'value': 1.06299}, 'weight': {'unit': 'pounds', 'value': 1.16183612074}, 'height': {'unit': 'inches', 'value': 9.0551}}, 'pages': 408, 'date_published': '2009-02-04', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'United States', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense'], 'authors': ['Robert Crais'], 'title': 'DOS MINUTOS (Spanish Edition)', 'isbn13': '9788466637602', 'msrp': 23.95, 'binding': 'Paperback', 'isbn': '8466637605', 'isbn10': '8466637605'}}