{'book': {'publisher': 'VERGARA (SELLO)', 'synopsis': 'Product Description      Una joven de noble cuna, dispuesta a hacer cualquier sacrificio por sus amadas Highlands... Aunque pocos escoceses pueden igualarla en su habilidad con la espada, Caledonia debe enfrentar un inesperado desafío cuando se ve ofrecida en matrimonio al infame Lord MacAllister, a quien llaman Sin (pecado). Una excitante novela romántica de ambientación medieval, escrita por Kinley MacGregor, autora de gran talento.A young woman of noble breeding, willing to make any sacrifice for her dear Highlands... Although few Scotsmen can equal her ability with the sword, Caledonia should face an unexpected challenge when she is offered in marriage to the infamous Lord MacAllister, the one who is called Sin. An exciting romantic novel of medieval atmosphere, written by Kinley MacGregor, author of great talent.      About the Author      Su verdadero nombre es Sherrilyn Kenyon. Nació en Columbus, Georgia, y ha vivido toda su vida en el sur. En la actualidad lo hace en las afueras de Nashville, Tennessee, junto a su marido y sus hijos. Siempre le ha gustado contar historias. Bajo su propio nombre escribe novelas de ciencia-fición, fantasía, paranormales, actuales, y libros de no ficción. Publicó su primer libro en 1994, pero no fue hasta 1999 cuando comenzó a publicar como Kinley Macgregor.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/19/53/9788466621953.jpg', 'title_long': 'Nacido en Pecado (Spanish Edition)', 'edition': 'Spanish-language Edition', 'dimensions': 'Height: 9.0551 Inches, Length: 5.9055 Inches, Weight: 1.00530791472 Pounds, Width: 0.98425 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.9055}, 'width': {'unit': 'inches', 'value': 0.98425}, 'weight': {'unit': 'pounds', 'value': 1.00530791472}, 'height': {'unit': 'inches', 'value': 9.0551}}, 'pages': 352, 'date_published': '2005-10-19', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'United States', 'Romance'], 'authors': ['Kinley MacGregor'], 'title': 'Nacido en Pecado (Spanish Edition)', 'isbn13': '9788466621953', 'msrp': 16.95, 'binding': 'Paperback', 'isbn': '8466621954', 'isbn10': '8466621954'}}