{'book': {'publisher': 'B (Ediciones B)', 'synopsis': 'Cuando Lucy descubrio que a su encantador -y mujeriego- marido le quedaba poco tiempo de vida, regreso a casa, cogio el pequeno libro negro de el y decidio que no iba a pasar por todo ello sola. Despues de todo, las otras mujeres de Artie habian compartido con el los momentos buenos. Por que no tendrian que vivir tambien los malos? Lucy decide llamar a las mujeres del libro negro y las invita a hacerle una ultima visita. Lo que menos espera es que alguna de ellas se anime a presentarse. Pero iran apareciendo todas, una por una. La que ahora lo odia. La que el le ha salvado la vida. La que se volvio lesbiana, y la que le enseno a bailar. Y aparecera tambien un visitante inesperado, con la mas extrana de todas las historias: el joven que puede (o no) ser el hijo desconocido de Artie. A medida que comparten secretos y lagrimas, estas mujeres empiezan a descubrir similitudes y afinidades, al punto de que empiezan a parecer una extrana familia... pero Lucy esta segura de que las mayores sorpresas aun estan por llegar. / When Lucy discovered that her husband was dying, she came home, opened up his black book, and decided she wasnt going through this alone. Arties sweethearts were there for the good times; is it fair that Lucy should have to manage the hard times herself? So she dials up the women and invites them for one last visit, never expecting any of them will actually show up. But when they do, its only the first of many surprises in store.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/16/47/9788466641647.jpg', 'title_long': 'Las amantes de mi marido (Spanish Edition)', 'dimensions': 'Height: 5.9055 Inches, Length: 9.0551 Inches, Weight: 0.8928721611 Pounds, Width: 0.66929 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 9.0551}, 'width': {'unit': 'inches', 'value': 0.66929}, 'weight': {'unit': 'pounds', 'value': 0.8928721611}, 'height': {'unit': 'inches', 'value': 5.9055}}, 'pages': 304, 'date_published': '2011-01-12', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'United States', 'Contemporary'], 'authors': ['Bridget Asher'], 'title': 'Las amantes de mi marido (Spanish Edition)', 'isbn13': '9788466641647', 'msrp': 20.95, 'binding': 'Paperback', 'isbn': '8466641645', 'isbn10': '8466641645'}}