{'book': {'publisher': 'VARIOS COL', 'synopsis': 'Intended to serve as a handbook for people with liberal opinions to take back their country from the conservative forces in power, this book skillfully makes use of Michael Moore\'s trademark brand of confrontational, exasperated humor to lambast the concocted threats and lies designed by the conservative right to stay rich and in control. On these pages no one is safe from Moore\'s sharp-tongued critiques: corporate barons who have bilked millions out of their employees\' lifetime savings, legislators who have stripped away our civil liberties in the name of "homeland security," and even the ever-present right-wing brother-in-law who manages, year after year, through his babbling idiocy, to ruin Thanksgiving dinner.<br/><br/>Una sarcástica y despiadada cruzada, este libro tiene una clara misión: acabar de una vez por todas con el mandato de George W. Bush, el hombre que se coló en la Casa Blanca gracias a los compinches de su papá. Moore no deja títere con cabeza a invitar al lector a ponerse manos a la obra para tratar de salvar al mundo de uno de los hombres más poderosos y nocivos del planeta. Llena de su humor característica, nadie escape de sus críticas: ni los negociantes, ni los legisladores, ni el cuñado que maneja a arruinar cada cena de familia con sus opiniones idiotas e conservadoras.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/68/43/9788466616843.jpg', 'title_long': 'QUE HAN HECHO CON MI PAIS, TIO? (Spanish Edition)', 'edition': '00001', 'dimensions': 'Height: 9.0551 Inches, Length: 5.9055 Inches, Weight: 0.97444319804 Pounds, Width: 0.94488 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.9055}, 'width': {'unit': 'inches', 'value': 0.94488}, 'weight': {'unit': 'pounds', 'value': 0.97444319804}, 'height': {'unit': 'inches', 'value': 9.0551}}, 'pages': 272, 'date_published': '2004-03-01', 'subjects': ['Humor & Entertainment', 'Humor', 'Political', 'Literature & Fiction', 'Humor & Satire', 'Satire', 'Politics & Social Sciences', 'Social Sciences', 'Politics & Government', 'Political Science', 'Specific Topics'], 'authors': ['Michael Moore'], 'title': 'QUE HAN HECHO CON MI PAIS, TIO? (Spanish Edition)', 'isbn13': '9788466616843', 'msrp': 3.71, 'binding': 'Paperback', 'isbn': '8466616845', 'isbn10': '8466616845'}}