{'book': {'publisher': 'Ediciones B', 'synopsis': "Soren nace en el bosque de Tyto, un reino tranquilo en el que habitan las lechuzas comunes. Pero el mal está al acecho en el mundo de las lechuzas, un mal que amenaza con hacer pedazos la paz de Tyto y cambiar el curso de la vida de Soren para siempre. Soren es capturado y trasladado a un desfiladero sombrío e inhóspito. Lo llaman un orfanato, pero la joven lechuza cree que es algo mucho peor. Él y su amigo Gylfie saben que la única escapatoria está arriba. Para huir, tendrán que hacer algo que no han hecho nunca: volar. Así comienza un viaje mágico. Por el camino, Soren y Gylfie conocen a Twilight y Digger. Los cuatro se unen para buscar la verdad y proteger el mundo de las lechuzas de un peligro inconcebible. Más de un millón de ejemplares vendidos en EE.UU.<br/><br/>ENGLISH DESCRIPTION<br/><br/>Grade 4-8-At the beginning of this new series, a young Barn Owl named Soren lives peacefully with his family, participating in rituals like the First Meat ceremony, and enjoying legends about the Guardians of Ga'Hoole, knightly owls who would rise each night into the blackness and perform noble deeds. After he falls from his nest, his idyllic world transforms into one of confusion and danger, as he is captured by evil chick-snatching owls and taken to the St. Aegolius Academy for Orphaned Owls. Soren and his new friend Gylfie work to develop strategies for withstanding moon blinking (brainwashing), while secretly striving to learn how to fly. The legends of Ga'Hoole help them to survive, and they are able to escape to find their families and warn the world about the dangers of St. Aegolius. While the owls have human characteristics, such as Soren's determination and Gylfie's creative ideas, their actions and culture reflect Lasky's research into owl behaviors and species. The story's fast pace, menacing bad guys, and flashes of humor make this a good choice for reluctant readers, while the underlying message about the power of legends provides a unifying element and gives strong appeal for fantasy fans.", 'language': 'es', 'image': 'https://images.isbndb.com/covers/88/77/9788466628877.jpg', 'title_long': "La captura / The Capture (Los Guardianes de Ga'Hoole / Guardians of Ga'hoole) (Spanish Edition)", 'edition': '00001', 'dimensions': 'Height: 7.4803 Inches, Length: 4.92125 Inches, Weight: 0.58642961692 Pounds, Width: 0.7874 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.92125}, 'width': {'unit': 'inches', 'value': 0.7874}, 'weight': {'unit': 'pounds', 'value': 0.58642961692}, 'height': {'unit': 'inches', 'value': 7.4803}}, 'pages': 272, 'date_published': '2008-04-01', 'subjects': ["Children's Books", 'Animals', 'Birds', 'Education & Reference', 'Science Fiction & Fantasy', 'Fantasy & Magic'], 'authors': ['Kathryn Lasky'], 'title': "La captura / The Capture (Los Guardianes de Ga'Hoole / Guardians of Ga'hoole) (Spanish Edition)", 'isbn13': '9788466628877', 'msrp': 12.95, 'binding': 'Paperback', 'isbn': '8466628878', 'isbn10': '8466628878'}}