{'book': {'publisher': 'Punto de Lectura S.L.', 'synopsis': 'Will Lomax, a London financier, receives a letter from Thomas, a childhood friend. Thomas is now a multimillionaire who wishes to settle down. He asks Will to find a woman of his liking ;tall, dark, beautiful and arrogant; legally marry her and bring her to the United States. Beatriz Mc Whirter, a distinguished girl, has just been dumped by her fiancé. In order to avoid the scandal, she will agree to marry this stranger. The encounter of these two rebel personalities will forever change the expectations and the lives of both.<br/>Description in Spanish: Will Lomax, acaudalado financiero londinense, recibe una carta de Thomas, su amigo de la infancia con quien compartió el sueño de una vida sin miserias. Él también ha triunfado y es ahora un multimillonario que desea sentar la cabeza. Le pide a su amigo que le encuentre una mujer a su medida, ;morena, alta y arrogante; se case con ella por poderes y se la envíe a América. Beatriz Mc Whirter, una joven y distinguida muchacha, acaba de ser abandonada por su prometido. Para evitar el escándalo accederá a casarse con un extraño. El encuentro de dos temperamentos indómitos revolucionará las expectativas y las vidas de ambos.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/82/50/9788466308250.jpg', 'title_long': 'MI MARIDO ME ESPERA CT CORIN TELLADO (Spanish Edition)', 'dimensions': 'Height: 8 Inches, Length: 5.25 Inches, Weight: 0.31746565728 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.31746565728}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 144, 'date_published': '2002-09-12', 'subjects': ['Literature & Fiction', 'Short Stories & Anthologies', 'Short Stories'], 'authors': ['Corín Tellado'], 'title': 'MI MARIDO ME ESPERA CT CORIN TELLADO (Spanish Edition)', 'isbn13': '9788466308250', 'msrp': 6.99, 'binding': 'Mass Market Paperback', 'isbn': '8466308253', 'isbn10': '8466308253'}}