{'book': {'publisher': 'Punto De Lectura', 'synopsis': 'Ray Atlee, a law professor in Virginia, is summoned to Mississippi by his father, Judge Atlee, who has always had an exemplary reputation in town. Old, ill, and secluded in his old mansion, the Judge feels his death is near. Ray goes to him, but only to find him dead next to a detailed testament and 3 million dollars in cash hidden in a closet, which puts in question the impeccable past of the ex-judge. Ray tries to find out where the money came from while trying to keep it away from an extortionist who seems to know a lot about its origin.<br/>Description in Spanish:<br/>Ray Atlee, profesor de Derecho en la Universidad de Virginia, tiene una relación muy distante con su padre, el juez Atlee, que sigue siendo una figura emblemática en Clanton, Mississippi, después de liderar durante cuarenta años la vida legal y política del condado. Viejo y enfermo, recluido en su decadente mansión, el Juez presidente que su final está cerca y convoca a sus dos hijos. Ray acude a la llamada, pero al llegar se encuentra a su padre ya muerto junto a un conciso testamento y tres millones de dólares en metálico escondidos en un armario. Un dinero que cuestiona la intachable trayectoria profesional del ex magistrado. Y eso no es todo, porque pronto se dará cuenta de que él no es el único que conoce el secreto.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/99/74/9788466309974.jpg', 'title_long': 'La citación (The Summons) (Spanish Edition)', 'dimensions': 'Height: 7 Inches, Length: 4.5 Inches, Weight: 0.5 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.5}, 'height': {'unit': 'inches', 'value': 7}}, 'pages': 448, 'date_published': '2003-03-01', 'subjects': ['Literature & Fiction', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Legal'], 'authors': ['John Grisham'], 'title': 'La citación (The Summons) (Spanish Edition)', 'isbn13': '9788466309974', 'msrp': 9.99, 'binding': 'Mass Market Paperback', 'isbn': '8466309977', 'isbn10': '8466309977'}}