{'book': {'publisher': 'Punto de Lectura S.L.', 'synopsis': 'The Harris\x92 and the Richardson\x92s, two high society families, are celebrating the marriage of their kids. Peter, a Harris, and Rixa, a Richardson, a young, and pure girl in love with her fiancé. However, behind all the happiness lies hatred from Gordon, Rixa\x92s brother, towards Peter, his supposed friend. Gordon fears that Peter, cold and worldly will make Rixa unhappy; or is it envy towards Peter\x92s professional life, or a passionate past between him and Gordon\x92s gorgeous wife that has not yet been extinguished?<br/>Description in Spanish:<br/>Los Harris y los Richarson, dos familias amigas pertenecientes a la alta sociedad de Camden, están de fiesta. El joven arquitecto va a contraer matrimonio con Rixa, la pequeña de los Richarson, una criatura jovencísima, llena de pureza y profundamente enamorada de su prometido.<br/>Pero tras la apariencia de júbilo se esconde un odio insuperable. Gordon Richarson se opone violentamente a la boda de su hermana con su supuesto amigo. Dice temer que el frío, elegante y mundano Peter la convierta en una desgracia. Quizá haya otras razones que expliquen el odio que ambos se profesan, como la envidia profesional o la pasión que consumió a Peter y a Eva, la bellísima esposa de Gordon, años atrás y que puede que aún no se haya extinguido...', 'language': 'es', 'image': 'https://images.isbndb.com/covers/89/91/9788466308991.jpg', 'title_long': 'ME VENCE TU SENSIBILIDAD CT CORIN TELLADO (Punto de Lectura) (Spanish Edition)', 'dimensions': 'Height: 8 Inches, Length: 5.25 Inches, Weight: 0.26014546916 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.26014546916}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 144, 'date_published': '2002', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Movements & Periods', 'Regional & Cultural', 'World Literature', 'United States', 'Classics', 'Romance'], 'authors': ['Mª del Socorro Tellado Lopez'], 'title': 'ME VENCE TU SENSIBILIDAD CT CORIN TELLADO (Punto de Lectura) (Spanish Edition)', 'isbn13': '9788466308991', 'msrp': 6.99, 'binding': 'Paperback', 'isbn': '8466308997', 'isbn10': '8466308997'}}