{'book': {'publisher': 'B', 'synopsis': "Product Description      <br/>Una conmovedora, sensual y emocionante historia.<br/>Lady Emily Stapleford jamás había soñado que la tarea de salvar a su familiar de la ruina financiera recaería sobre sus bellos e ingeniosos hombros.<br/>Dado que solo está dispuesta a casarse por amor y no por dinero, Emily decide que publicar su novela será la mejor manera de conseguir la fortuna que necesita. Pero su manuscrito es rechazado por todos los editores. Al fin y al cabo, ¿a quién se le ocurriría leer un libro cuya heroína es un vampiro?<br/>Pese a todo, Emily no se rinde y organiza una mascarada para atraer la atención sobre los vampiros, cuyas apariciones serán comentadas por todo Londres.<br/>Pero un misterioso americano, Logan Jennsen puede echarlo todo a perder...<br/>El último libro de la serie de la Sociedad Literaria de Damas Londinenses, que al igual que los anteriores se puede leer de forma independiente, hará las delicias de las fans de D'Alessandro y seguramente le ganará nuevas lectoras.<br/>      About the Author      <br/>Jacquie D'Alessandro se crió en Long Island, Estados Unidos, y se enamoró de las novelas románticas a muy temprana edad. Soñaba con ser raptada por un gallardo forajido montado en un fogoso corcel. Cuando por fin apareció su héroe, vestía tejanos y conducía un Volkswagen, pero lo reconoció de todos modos. Se casaron tras graduarse, y ahora viven felices en Atlanta, Georgia, junto con su hijo, un joven inteligente y activo. Sus espléndidas novelas, llenas de intriga y humor, le han ganado millares de admiradoras.", 'language': 'es', 'image': 'https://images.isbndb.com/covers/34/50/9788466643450.jpg', 'title_long': 'Mascarada (Spanish Edition)', 'edition': 'Translation', 'dimensions': 'Height: 9.0551 Inches, Length: 5.9055 Inches, Weight: 1.0582188576 Pounds, Width: 0.98425 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.9055}, 'width': {'unit': 'inches', 'value': 0.98425}, 'weight': {'unit': 'pounds', 'value': 1.0582188576}, 'height': {'unit': 'inches', 'value': 9.0551}}, 'pages': 368, 'date_published': '2010-05-19', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'United States', 'Romance', 'Historical', 'Romantic Suspense'], 'authors': ["Jacquie D'Alessandro"], 'title': 'Mascarada (Spanish Edition)', 'isbn13': '9788466643450', 'msrp': 20.95, 'binding': 'Paperback', 'isbn': '8466643451', 'isbn10': '8466643451'}}