{'book': {'publisher': 'Suma de letras, Punto de Lectura', 'synopsis': 'Lincoln Rhyme, the astute paralyzed criminalist of The Bone Collector, will now have to face the Ghost, a Chinese human smuggler. One of his smuggling boats is intercepted in the coast of New York, and when two families escape, a ferocious hunting begins. In order to prevent the Ghost from murdering them, Rhyme and Officer Sachs will enter the Chinese world, their beliefs, myths and philosophy. This fascinating novel will leave readers astounded by the intelligence of an investigator who borders on brilliant.<br/>Description in Spanish: Licoln Rhyme, el astuto criminalista tetrapléjico de El coleccionista de huesos, deberá enfrentarse en esta ocasión con el Fantasma, un peligroso delincuente chino que se dedica al tráfico humano de sus compatriotas. Gracias a la habilidad del detective uno de los barcos que transportan inmigrantes es interceptado en la costa de Nueva York pero el Fantasma lo hace explosionar, iniciando de inmediato una feroz caza de los supervivientes, que su han refugiado en Chinatown.<br/>Para impedir que sean asesinados, Rhyme deberá adentrarse en el mundo chino, en sus creencias, mitos y filosofía, y dejar que su científico método de trabajo se impregne de una cultura tan ajena como rica.<br/>Una intrepidante novela policiaca en la que el lector quedará nuevamente subyugado por la inteligencia sorprendente de un investigador que roza lo genial.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/76/97/9788466307697.jpg', 'title_long': 'El mono de piedra (The Stone Monkey) (Spanish Edition)', 'dimensions': 'Height: 6.75 Inches, Length: 4.5 Inches, Weight: 0.7 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.5}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 0.7}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 608, 'date_published': '2003-04', 'subjects': ['Mystery, Thriller & Suspense', 'Mystery', 'Education & Teaching', 'Schools & Teaching'], 'authors': ['Jeffery Deaver'], 'title': 'El mono de piedra (The Stone Monkey) (Spanish Edition)', 'isbn13': '9788466307697', 'msrp': 10.99, 'binding': 'Mass Market Paperback', 'isbn': '8466307699', 'isbn10': '8466307699'}}