{'book': {'publisher': 'Nova', 'synopsis': 'La ciudad de Elantris, poderosa y bella capital de Arelon, había sido llamada la "ciudad de los dioses". Antaño famosa sede de inmortales, un lugar repleto de poderosa magia, Elantris ha caído en desgracia. Ahora sólo acoge a los nuevos "muertos en vida", postrados en una insufrible "no-vida" tras una misteriosa y terrible transformación. Un matrimonio de estado destinado a unir los dos reinos de Arelon y Teod se frustra, ya que el novio, Raoden, el príncipe de Arelon, sufre inesperadamente la Transformación y se convierte en un "muerto en vida" obligado a refugiarse en Elantris. Su reciente esposa, la princesa Sarene de Teod, creyéndole muerto, se ve obligada a incorporarse a la vida de Arelon y su nueva capital Kae, a la que aporta un nuevo elemento: la novedad y, tal vez, el caos. Mientras, el embajador y alto sacerdote de otro reino vecino, Fjordell, va a usar su todopoderosa religión y su habilidad política como manipulador de seres humanos para intentar dominar los dos reinos de Arelod y Teod, con el propósito de somerterlos a su emperador y su dios.<br/><br/>ENGLISH DESCRIPTION<br/><br/>There\'s a force in Arelon known as the Dor that randomly chooses people and grants them divine powers. Elantris was once the city of the gods, where anyone who was \'chosen\' went to live. Ten years ago, the Elantrians lost their powers and caught a terrible disease instead. From that point on, Elantris became a quarantine zone for any that caught that disease.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/88/43/9788466658843.jpg', 'title_long': "Elantris / Elantris: Author's Definitive Edition (Spanish Edition)", 'edition': '001', 'dimensions': 'Height: 9.33 Inches, Length: 6.26 Inches, Weight: 2.48681431536 Pounds, Width: 1.86 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.26}, 'width': {'unit': 'inches', 'value': 1.86}, 'weight': {'unit': 'pounds', 'value': 2.48681431536}, 'height': {'unit': 'inches', 'value': 9.33}}, 'pages': 800, 'date_published': '2016-08-31', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Science Fiction & Fantasy', 'Fantasy', 'Epic', 'Coming of Age', 'Romantic', 'Science Fiction', 'Short Stories', 'Dystopian', 'Post-Apocalyptic'], 'authors': ['Brandon Sanderson'], 'title': "Elantris / Elantris: Author's Definitive Edition (Spanish Edition)", 'isbn13': '9788466658843', 'msrp': 32.95, 'binding': 'Hardcover', 'isbn': '846665884X', 'isbn10': '846665884X'}}