{'book': {'publisher': 'Punto De Lectura', 'synopsis': 'Ruby could be any small community. However, there are two things that make it different: the inhabitants\x92 uncommon beauty and their shared distrust of strangers. Just a few miles away, there is a former girl\x92s school nicknamed \x93the Convent\x94. In this feminine world, the men of Ruby sense a horrible threat and decide to take action to eliminate any possible danger to them. Although perhaps what really troubles them is women, who refuse to be humiliated by those monsters who attempt to enslave them. Blurb in Spanish: Ruby podría ser cualquier otra pequeña comunidad de reciente instalación, religiosa, tolerante, trabajadora y generosa. Sólo hay dos cosas que le diferencian: la belleza de todos los miembros que la componen- todos ellos negros- y su desconfianza hacia los forasteros. Esto, unido al esfuerzo por salvaguardar la armonía de la comunidad, es lo que va acrecentando la animadversión de algunos habitantes de Ruby hacia las mujeres que viven en un convento a pocos kilómetros del pueblo. En ese mundo femenino, la ciudad de Ruby intuye una amenaza horrible, y con esta sospecha decide arrancar el peligro de cuajo... pese a que, tal vez, lo que realmente les inquiete sea "la turbulencia de unas mujeres que intentaban domeñar, sin ser pisoteadas, los monstruos que las esclavizaban".', 'language': 'es', 'image': 'https://images.isbndb.com/covers/09/19/9788466300919.jpg', 'title_long': 'Paraiso (Spanish Edition)', 'dimensions': 'Height: 6.75 Inches, Length: 4.5 Inches, Weight: 0.5 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.5}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 0.5}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 448, 'date_published': '2000-07-31', 'subjects': ['Literature & Fiction', "Women's Fiction", 'World Literature', 'United States', 'Black & African American'], 'authors': ['Toni Morrison'], 'title': 'Paraiso (Spanish Edition)', 'isbn13': '9788466300919', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'isbn': '8466300910', 'isbn10': '8466300910'}}