{'book': {'publisher': 'Punto de Lectura', 'synopsis': "Bajo las sombras de la noche, en Caldwell, Nueva York, se libra una mortífera guerra territorial entre los vampiros y sus cazadores. Existe una escalofriante banda secreta, formada por seis hermanos, guerreros vampiros, defensores de su raza...<br/><br/>Dentro de la hermandad, Rhage es el vampiro de más destructivas pulsiones. Es el mejor luchador, el más rápido, el más impulsivo, y el amante más apasionado; porque en su interior arde una feroz maldición impuesta por la Virgen Escribana. Poseído por esa fuerza oscura, Rhage teme el momento en que su dragón interior se desate, convirtiéndolo en un peligro para todos los que están a su alrededor.<br/><br/>Mary Luce, superviviente de muchas penalidades, es arrojada contra su voluntad al mundo de los vampiros y queda bajo la protección de Rhage. Con una maldición propia, que amenaza su vida, Mary no busca amor. Hace años que perdió su fe en los milagros. Pero cuando la intensa atracción animal de Rhage se convierte en una pasión mayor, emocional, él sabe que debe hacer que Mary sea solamente suya. Y mientras sus enemigos se aproximan, Mary lucha desesperadamente por alcanzar la vida eterna junto a su amado ... ENGLISH DESCRIPTION Within the brotherhood, Rhage is the vampire with the strongest appetite. He's the best fighter, the quickest to act on his impulses, and the most voracious lover —for inside him burns a ferocious curse cast by the Scribe Virgin. Rhage fears the times when his inner dragon is unleashed, making him a danger to everyone around him. When Mary Luce is unwittingly thrown into the vampire world, she must rely on Rhage's protection. Knowing that Mary feels the same intense animal attraction, Rhage must make her his alone...", 'language': 'es', 'image': 'https://images.isbndb.com/covers/32/22/9788466323222.jpg', 'title_long': 'Amante eterno /Lover Eternal (La Hermandad De La Daga Negra II/ Black Dagger Brotherhood Series) (Spanish Edition)', 'edition': 'Translation', 'dimensions': 'Height: 7.4803 Inches, Length: 4.92125 Inches, Weight: 0.80027801106 Pounds, Width: 1.25984 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.92125}, 'width': {'unit': 'inches', 'value': 1.25984}, 'weight': {'unit': 'pounds', 'value': 0.80027801106}, 'height': {'unit': 'inches', 'value': 7.4803}}, 'pages': 576, 'date_published': '2009-05-01', 'subjects': ['Romance', 'Paranormal', 'Vampires', 'Fantasy'], 'authors': ['J.R. Ward'], 'title': 'Amante eterno /Lover Eternal (La Hermandad De La Daga Negra II/ Black Dagger Brotherhood Series) (Spanish Edition)', 'isbn13': '9788466323222', 'msrp': 9.99, 'binding': 'Hardcover', 'isbn': '8466323228', 'isbn10': '8466323228'}}