{'book': {'publisher': 'Punto de Lectura S.L.', 'synopsis': 'Ernest is young, audacious, and attractive and has a womanizing past. Although he squandered the family inheritance and has no money left, there is no woman who could resist him or a business deal in which he won\x92t become successful. But he has decided to find the way to never work again: to marry a rich girl. When he finds the perfect girl and finds out that she suffers from an incurable heart problem, Ernest does not realize the changes that his own heart will experience.<br/>Description in spanish:Ernest Nesbitt es joven, audaz, enormemente atractivo y posee un inigualable historia lde seductor. Aunque malgastó la herencia familiar y ha de ganarse la vida, no hay mujer que se le resista ni negocio del que no salga trinufante. Pero ha decidio encontrar la forma de no trbajar más.<br/>Cuando llega a Hastings para visitar a su amigo Frank, un honrado médico y padre de familia, le comunica sin rubor su plan: buscar una muchacha rica y casarse.Ernest no puede dar crédito a su suerte cuando su amigo le presenta a una de sus pacientes, Maud Brooks, quien parece estar hecha a la medida de su ambición: el alegre, apasionada, heredera de una grna fortuna y está condenada a morir por una incurable enfermedad del corazón. Sin embargo, el deshumanizado Ernest no ha calculado los cambios que el suyo propio va a experimentar.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/89/84/9788466308984.jpg', 'title_long': 'NO SE LO DIGAS A ELLA CT CORIN TELLADO (Spanish Edition)', 'dimensions': 'Height: 8 Inches, Length: 5.25 Inches, Weight: 0.2645547144 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.2645547144}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 144, 'date_published': '2002-10-22', 'subjects': ['Romance'], 'authors': ['Mª del Socorro Tellado Lopez'], 'title': 'NO SE LO DIGAS A ELLA CT CORIN TELLADO (Spanish Edition)', 'isbn13': '9788466308984', 'msrp': 6.99, 'binding': 'Paperback', 'isbn': '8466308989', 'isbn10': '8466308989'}}