{'book': {'publisher': 'Suma de Letras, Punto de Lectura', 'synopsis': 'Judy Hammer, head of the Richmond police, and Andy Brazil, her right-hand man, must go after a gang of delinquents and make peace between authorities and the citizens. Brazil\'s anonymously written articles against the leaders also reflect the increasing discontent from the population towards its authorities. This calm place has initiated a revolt against the new norms that the governor wants to enforce. Judy and Andy must mediate between officials and islanders to avoid greater consequences.<br/>Description in Spanish:<br/>Judy Hammer, jefe de policía de Richmond, y Andy Brazil, su mano derecha, se enfrentan a los "piratas de la carretera", una banda criminal que elige a sus victimas al azar para robarles y asesinarlas con sadismo. Además de esta investigación, Brazil, ex periodista, trabaja regularmente y bajo pseudónimo en una página de Internet, desde la que analiza con mordacidad los avatares políticos del estado. El gobernador y su gabinete de prensa, víctimas principales de estos artículos, hace tiempo que intentan averiguar quién es el autor. La crítica ha venido a sumarse al creciente descontento que la población siente por lsa autoridades, siendo los más insatisfechos los habitantes de la isla de Tangier. Este apacible lugar, habitado mayormente por pescadores, ha iniciado una revuelta contra las nuevas normas que el gobernador quiere imponerles. Judy y Andy deberán mediar entre políticos e isleños para evitar que el asunto tenga mayores consecuencias.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/07/65/9788466310765.jpg', 'title_long': 'La isla de los perros (Isle of Dogs, Spanish Edition) (Andy Brazil)', 'edition': 'Spanish', 'dimensions': 'Height: 9.5 Inches, Length: 4.25 Inches, Weight: 0.62 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.62}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 528, 'date_published': '2003-04-01', 'subjects': ['Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths'], 'authors': ['Patricia D. Cornwell'], 'title': 'La isla de los perros (Isle of Dogs, Spanish Edition) (Andy Brazil)', 'isbn13': '9788466310765', 'msrp': 1.99, 'binding': 'Mass Market Paperback', 'isbn': '8466310762', 'isbn10': '8466310762'}}