{'book': {'publisher': 'Punto de Lectura', 'synopsis': 'En esta sexta entrega de Las aventuras del capitán Alatriste, la acción transcurre de las costas de Berbería a las bocas de Constantinopla: desembarcos, saqueos, abordajes, corsarios, piratas y esclavos, cuando el Mediterráneo era un mar español<br/><br/>«Durante casi dos años serví con el capitán Alatriste en las galeras de Nápoles. Por eso hablaré ahora de escaramuzas, corsarios, abordajes, matanzas y saqueos. Así conocerán vuestras mercedes el modo en que el nombre de mi patria era respetado, temido y odiado también en los mares de Levante. Contaré que el diablo no tiene color, ni nación, ni bandera; y cómo, para crear el infierno en el mar o en la tierra, no eran menester más que un español y el filo de una espada. En eso, como en casi todo, mejor nos habría ido haciendo lo que otros, más atentos a la prosperidad que a la reputación, abriéndonos al mundo que habíamos descubierto y ensanchado, en vez de enrocarnos en las sotanas de los confesores reales, los privilegios de sangre, la poca afición al trabajo, la cruz y la espada, mientras se nos pudrían la inteligencia, la patria y el alma. Pero nadie nos permitió elegir. Al menos, para pasmo de la Historia, supimos cobrárselo caro al mundo, acuchillándolo hasta que no quedamos uno en pie. Dirán vuestras mercedes que ése es magro consuelo, y tienen razón. Pero nos limitábamos a hacer nuestro oficio sin entender de gobiernos, filosofías ni teologías. Pardiez. Éramos soldados.»<br/><br/>La crítica ha dicho:<br/><br/>«¿Título menor? Digo esto convencido de la necesidad de zafar a la serie de Alatriste del sambenito de su carácter secundario, menor, y porque se hace preciso celebrar la dificultad inherente a la empresa de dotar a cada situación de su propio sentido léxico, a favor de un significado que lleva la novela histórica a un lugar de exigencia olvidado hoy por casi todos, excepto quizá por Umberto Eco, que igualmente se ha comprometido en recrear con precisión cada época convocada». José María Pozuelo Yvancos, ABC<br/><br/>ENGLISH DESCRIPTION<br/><br/>This 6th installment in the series following the escapades of Captain Diego Alatriste, is a story of skirmishes, boarded ships, killings and sackings in a time where Spain was revered, feared and hated in the easterly seas; where the devil had no color, no name and no flag, and where the only thing needed to summon hell on was a Spaniard and his sword; where men went about their tasks without meddling in government, philosophical or theological affairs—a time where men were soldiers.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/02/14/9788466320214.jpg', 'title_long': 'Corsarios de levante / Privateers from the East (Adventures of Captain Alatriste) (Spanish Edition)', 'dimensions': 'Height: 7.4803 Inches, Length: 4.92125 Inches, Weight: 0.46958461806 Pounds, Width: 0.74803 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.92125}, 'width': {'unit': 'inches', 'value': 0.74803}, 'weight': {'unit': 'pounds', 'value': 0.46958461806}, 'height': {'unit': 'inches', 'value': 7.4803}}, 'pages': 367, 'date_published': '2008-06-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'Action & Adventure'], 'authors': ['Arturo Perez-Reverte'], 'title': 'Corsarios de levante / Privateers from the East (Adventures of Captain Alatriste) (Spanish Edition)', 'isbn13': '9788466320214', 'msrp': 9.99, 'binding': 'Hardcover', 'isbn': '8466320210', 'isbn10': '8466320210'}}