{'book': {'publisher': 'Tusquets Editores S.A.', 'synopsis': 'Antes de que tuviéramos el placer de publicar en 1992 Los Bajos del Temor (Andanzas 170), Vlady Kociancich ya era una escritora consagrada no sólo en Argentina y España, sino también en Europa y Estados Unidos. Nos sentimos, pues, muy honrados de que, tras aquella primera colaboración con nosotros, haya querido permanecer fiel a nuestro catálogo enriqueciéndolo con El templo de las mujeres, obra en la que las peripecias del relato de aventuras y el suspense de una novela policiaca confluyen en una irónica parábola sobre la felicidad.<br/><br/>Mistral, una brillante ilustradora de revistas de moda, desenvuelta y aparentemente muy segura de sí misma y de sus éxitos, se encuentra en un hotel parisiense en el momento en que un incidente inexplicable viene a quebrar su vida despreocupada y feliz. Hasta ese día, Mistral ha viajado de ciudad en ciudad con una sola pasión, el dibujo, y una sola meta: distanciarse de la historia trágica de las mujeres de su familia. Todas han muerto de amor, salvo Dodo, la abuela, que nunca se enamoró y que la crió en la fe del don milagroso de su talento como dibujante, un don que la salvaría siempre de las desdichas de este mundo. Pero irrumpe la fatalidad y, en la precipitación de los acontecimientos que misteriosamente van escapando a su control, Mistral se verá arrastrada a una isla griega de las Cícladas, la antigua Thera, dominada por un templo dedicado a la diosa Afrodita, donde miles de años antes las mujeres tuvieron que elegir entre una inmortalidad sin amor o la muerte con sus hombres.<br/><br/>En la perfecta construcción de la trama, en el humor sutil, en las conmovedoras transcripciones del viaje que cambiará irrevocablemente la placentera existencia de Mistral, en la creación de inolvidables personajes como el enigmático griego Kostas, el excéntrico señor Jones o la adivina Harula, vuelven a manifestarse la excelencia de la escritura de Kociancich y el poder de su imaginación.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/79/26/9788472237926.jpg', 'title_long': 'El templo de las mujeres (Spanish Edition)', 'dimensions': 'Height: 8.2677 Inches, Length: 5.5118 Inches, Weight: 0.67902376696 Pounds, Width: 0.5905511805 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5118}, 'width': {'unit': 'inches', 'value': 0.5905511805}, 'weight': {'unit': 'pounds', 'value': 0.67902376696}, 'height': {'unit': 'inches', 'value': 8.2677}}, 'pages': 224, 'date_published': '1996-09-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Reference', 'Foreign Language Study & Reference', 'Education & Teaching', 'Schools & Teaching'], 'authors': ['Vlady Kociancich'], 'title': 'El templo de las mujeres (Spanish Edition)', 'isbn13': '9788472237926', 'msrp': 20.95, 'binding': 'Paperback', 'isbn': '8472237923', 'isbn10': '8472237923'}}