{'book': {'publisher': 'Maxi-Tusquets', 'synopsis': 'Poco imaginaban los Berry que un oso danzando encima de una motocicleta y su amo, Freud, judío y vienés, iban a ser el origen de toda una saga de hijos y hoteles. Gracias a ellos fundarán el primer Hotel New Hampshire en una ex escuela de señoritas del estado de Maine, donde Franny, la hija mayor, vivirá una experiencia terrible ; John, el narrador, empezará a levantar pesas ; Frank, el primogénito, insistirá en perpetuar la imagen de Patético, el perro, y todo ello mientras Egg balbucea y la pequeña Lilly se encierra en su cuarto para crecer y escribir. Pero las cosas no acaban de funcionar y Freud telegrafía desde Viena y ofrece otro hotel, con oso incluido. Allí irá toda la familia, o lo que de ésta queda, a convivir en el segundo hotel, entre terroristas y prostitutas, y nada sino una bomba -y Lilly saliendo de su habitación con la novela prometida- conseguirá que vuelvan a Estados Unidos y al tercer Hotel New Hampshire, al lugar donde todo había empezado.<br/>Esta novela sirvió de base a la película del mismo título, dirigida por Tony Richardson y protagonizada por Jodie Foster.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/86/64/9788472238664.jpg', 'title_long': 'El Hotel New Hampshire/the Hotel New Hampshire', 'edition': 'Translation', 'dimensions': 'Height: 7.67715 Inches, Length: 4.92125 Inches, Weight: 0.97885244328 Pounds, Width: 0.9448818888 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.92125}, 'width': {'unit': 'inches', 'value': 0.9448818888}, 'weight': {'unit': 'pounds', 'value': 0.97885244328}, 'height': {'unit': 'inches', 'value': 7.67715}}, 'pages': 464, 'date_published': '1986-04-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Family Saga', 'Family Life', 'Psychological', 'United States', 'Literary'], 'authors': ['John Irving'], 'title': 'El Hotel New Hampshire/the Hotel New Hampshire', 'isbn13': '9788472238664', 'msrp': 12.95, 'binding': 'Paperback', 'isbn': '8472238660', 'isbn10': '8472238660'}}