{'book': {'publisher': 'GEDISA', 'synopsis': 'Hombres barbudos lanzando bombas, nihilistas autoindulgentes, subversivos peligrosos: estos clichés contemporáneos que la imaginación popular atribuye a los anarquistas, se reproducen con frecuencia en las películas. En este primer estudio completo sobre el anarquismo en el cine, Richard Porton deconstruye estos estereoripos ofreciendo una visión alternativa de las películas que a lo largo de la historia del cine han presentado a personajes y tratado temas anarquistas. Porton analiza las descripciones cinematográficas del anarquismo, desde el primer cine de Griffith y René Clair hasta las producciones de Godard, Lina Wertmüller, Lizzie Borden y Ken Loach. Sus comentarios y críticas de clásicos tales como Zéro de Conduite, Tout va bien y Love and Anarchy proporcionan una excelente orientación para penetrar en las complejas tradiciones del pensamiento anarquista, desde Bakunin y Kropotkin hasta Enma Goldman y Murray Bookchin. Nos revela así un rico legado histórico que incluye desde la Comuna de París, los mártires de Haymarket y los anarcosindicalistas de la Guerra Civil española, hasta manifestaciones más contemporáneas como los Situacionistas y los enragés del Mayo de 1968. «La erudita y elocuente historia de Richard Porton abre un nuevo camino en los estudios cinematográficos y culturales; no existe nada comparable en lengua inglesa» David E. James, Escuela de cine y televisión, Universidad de California del Sur, y autor de Power Misses: Essays Across (Un) Popular Culture «Los ejemplos contemporáneos del anarquismo que Porton ofrece (...) significan un desafío serio para cualquiera que considere el anarquismo como una especie en extinción» Catherine Saint Louis, New York Book Review.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/79/22/9788474327922.jpg', 'title_long': 'Cine y Anarquismo (Cine &à.) (Spanish Edition)', 'edition': 'First Edition', 'dimensions': 'Height: 9.2519684945 Inches, Length: 6.692913379 Inches, Weight: 1.0802650838 Pounds, Width: 5.905511805 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.692913379}, 'width': {'unit': 'inches', 'value': 5.905511805}, 'weight': {'unit': 'pounds', 'value': 1.0802650838}, 'height': {'unit': 'inches', 'value': 9.2519684945}}, 'pages': 288, 'date_published': '2001', 'subjects': ['Arts & Photography', 'Performing Arts', 'Humor & Entertainment', 'Movies', 'Reference', 'Video'], 'authors': ['Richard Porton'], 'title': 'Cine y Anarquismo (Cine &à.) (Spanish Edition)', 'isbn13': '9788474327922', 'msrp': 28.95, 'binding': 'Paperback', 'isbn': '847432792X', 'isbn10': '847432792X'}}