{'book': {'publisher': 'Juan Granica S A', 'synopsis': '-Est demostrado que brindarles participacin a los empleados ayuda a obtener una ventaja competitiva.<br/>-Pero cmo hacer para brindarles mayor conocimiento y poder sin perder el control de la empresa?<br/>-Adopte el plan de gestin participativa y modele una organizacin innovadora.<br/>Qu porcentaje del xito de la organizacin depende de una eficiente gestin de RR.HH.? La ventaja definitiva -ltima obra de Edward E. Lawler III- ensaya una respuesta completa, innovadora y definitiva.<br/>Fundador y director del Centro de Organizaciones Efectivas de la Universidad de California, el autor descarta el mtodo burocrtico de gestin de calidad total, por considerarlo obsoleto. En cambio propone el de gestin participativa. Qu los diferencia? Este se caracteriza por tener una jerarqua de pocos niveles, rapidez de adaptacin y cambio, relaciones laborales laterales y la responsabilidad de crear trabajos satisfactorios para sus miembros.<br/>Mediante ejemplos, resea los pasos bsicos para reestructurar la organizacin deficiente: detalla el sistema de recompensas, trata sobre la conducta de los directivos y analiza al papel de los sindicatos.<br/>Lawler le propone al lector una frmula del "xito constante": ventajas competitivas a partir de proveer mayor informacin, conocimiento, poder y recompensas a los empleados.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/38/89/9788475773889.jpg', 'title_long': 'LA Ventaja Definitiva (Spanish Edition)', 'dimensions': 'Height: 9.01573 Inches, Length: 5.98424 Inches, Weight: 1.720046568124 Pounds, Width: 1.0783443 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.98424}, 'width': {'unit': 'inches', 'value': 1.0783443}, 'weight': {'unit': 'pounds', 'value': 1.720046568124}, 'height': {'unit': 'inches', 'value': 9.01573}}, 'pages': 484, 'date_published': '1996', 'subjects': ['Business & Money', 'Economics', 'Commercial Policy', 'Management & Leadership', 'Management'], 'authors': ['Edward E. Lawler', 'Carlos Gardini'], 'title': 'LA Ventaja Definitiva (Spanish Edition)', 'isbn13': '9788475773889', 'msrp': 33, 'binding': 'Paperback', 'isbn': '8475773885', 'isbn10': '8475773885'}}