{'book': {'publisher': 'Editorial Edaf, S.L.', 'synopsis': "Howard P. Lovecraft, August Derleth y, ahora, Brian Lumley, entre otros, han creado, fomentado y desarrollado los Mitos de Cthulhu hasta adquirir su actual y amplia popularidad. Los Antiguos existieron antes de la especie humana. Conquistaron mundos, libraron batallas increíbles y dominaron la magia y la ciencia. Pero eran malignos. Y desde aquella época, sin poder ser eliminados, se han visto confinados en lugares ignotos: Cthulhu en la hundida R'lyeh; Hastur en el lago de Hali, en Carcosa, etc. Pero ¿qué sucede con Shudde-M'ell..., prisionero de los laberintos perdidos de la propia Tierra? ¿Cuáles son los límites, si es que existen, de los poderes de Los Antiguos y sus esbirros menores? ¿Quiénes eran los Dioses Mayores que los aprisionaron y cuál su fuente de poder? ¿Podrá la humanidad hacer algo para salvarse de estos horrores? H. P Lovecraft creía que no..., que sólo el capricho del destino podría salvarla. Es medianoche. Antes del alba darn conmigo y me encerraran en una celda negra, donde languidecer interminablemente, mientras insaciables deseos roen mis entraas y consumen mi corazn, hasta ser al fin uno con los muertos que amo.", 'language': 'es', 'image': 'https://images.isbndb.com/covers/75/47/9788476407547.jpg', 'title_long': 'El museo de los horrores', 'edition': 'Translation', 'dimensions': 'Height: 7.75 Inches, Length: 5 Inches, Weight: 1.2786811196 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.2786811196}, 'height': {'unit': 'inches', 'value': 7.75}}, 'pages': 552, 'date_published': '2001', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Horror', 'Science Fiction & Fantasy', 'Science Fiction'], 'authors': ['H. P. Lovecraft', 'H.P. Lovecraft'], 'title': 'El museo de los horrores', 'isbn13': '9788476407547', 'msrp': 23.99, 'binding': 'Paperback', 'isbn': '8476407548', 'isbn10': '8476407548'}}