{'book': {'publisher': 'EDICIONES OBELISCO S.L.', 'synopsis': 'Las palabras pueden ser como hechizos mágicos. Diga las palabras erróneas y su pareja se convertirá en un monstruo encolerizado. Pronuncie las palabras adecuadas y su pareja se convertirá inmediatamente en un príncipe o princesa encantados. La mayoría de los problemas que surgen entre las parejas son el resultado de una mala comunicación. Existen muchos libros sobre comunicación entre las parejas, pero generalmente son demasiado complicados para ser puestos en práctica, especialmente en los momentos difíciles. No sucede lo mismo con los métodos maravillosamente sencillos y poderosamente efectivos de Comuníquese con su Pareja, que le enseñará a: * Ayudarse a sí mismo y a su pareja a sentirse totalmente amados sin importar los heridos o enojados que se sientan. * No volver a discutir nunca jamás. * Conseguir que su pareja le escuche realmente y cambie. * Negociar los problemas y reparar la confianza perdida. Hallar la mejor forma de crear una armonía duradera y mantener vivo el fuego del amor Jonathan Robinson es psicoterapeuta, escritor y conferenciante y profesional en Santa Bárbara, California. Ha participado en numerosos programas de Televisión y sus trabajos han hallado eco en publicaciones del prestigio de USA. Today, New Age Journal o Newsweek. \x93Lea este libro, le guiará a crear su deseada relación amorosa\x94 Dr. Bernie Siegel, autor de Amor, medicina milagrosa.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/67/50/9788477206750.jpg', 'title_long': 'Comuniquese Con Su Pareja', 'edition': '1', 'dimensions': 'Weight: 0.48060773116 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 0.48060773116}}, 'pages': 168, 'date_published': '1999', 'subjects': ['Self-Help', 'Relationships', 'Love & Romance', 'Literature & Fiction', 'Parenting & Relationships', 'Reference', 'Foreign Language Study & Reference', 'Romance'], 'authors': ['Jonathan Robinson'], 'title': 'Comuniquese Con Su Pareja', 'isbn13': '9788477206750', 'msrp': 27.35, 'binding': 'Paperback', 'isbn': '8477206759', 'isbn10': '8477206759'}}