{'book': {'publisher': 'EDICIONES OBELISCO S.L.', 'synopsis': '¿Cómo se atreve Jerry Renault a perturbar el tranquilo y ordenado universo del Trinity? Hasta entonces jamás ningún alumno se había negado a participar en uno de los acontecimientos más esperados del Trinity. La venta de chocolatinas era, sin duda, una buena fuente de ingresos tanto para el colegio como para el hermano León, el actual ayudante (lacayo) del rector. Jerry lo hizo y su beca en el instituto pendía de un finísimo hilo y organizó un lío de enorme magnitud fue como si la escuela entera estallara en mil pedazos. De algún modo Jerry Renault es un héroe pero para los demás se convierte en cabeza de turco de su odio contenido. ¿Y Jerry? Jerry intenta, sencillamente, luchar tozuda y tenazmente por lo que cree. Con todo, tal vez no hay forma de escapar y convertirse en un peón en este juego de control donde los estudiantes están enfrentados los unos a los otros, luchando por su honor o, dadas las circunstancias, quizá luchan incluso por su supervivencia. En 1974, Robert Cormier se atrevió a perturbar nuestro universo con la publicación de este magnífico relato que, desde entonces, ha hecho las delicias de millones de jóvenes y no tan jóvenes.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/86/48/9788477208648.jpg', 'title_long': 'La Guerra del Chocolate / The Chocolate War', 'edition': '1', 'dimensions': 'Height: 8 Inches, Length: 5.25 Inches, Weight: 0.7054792384 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.7054792384}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 256, 'date_published': '2002-09-23', 'subjects': ['Teen & Young Adult', 'Literature & Fiction', 'Social & Family Issues', 'Social Issues', 'Being a Teen'], 'authors': ['ROBERT CORMIER'], 'title': 'La Guerra del Chocolate / The Chocolate War', 'isbn13': '9788477208648', 'msrp': 11.95, 'binding': 'Paperback', 'isbn': '8477208646', 'isbn10': '8477208646'}}