{'book': {'publisher': 'Ediciones Obelisco', 'synopsis': 'Tejiendo el relato de los orígenes de la humanidad a través de la arqueología, la mitología y los textos antiguos, Zecharia Sitchin nos ofrece en este libro pruebas de la implicación extraterrestre en la historia de nuestro planeta. Concentrándose principalmente en la antigua Sumeria, nos propone, con absoluta precisión, una historia completa del sistema solar tal como la contarían los visitantes de otro planeta cuya órbita se acercara a la de la Tierra cada 3.600 años. El Duodécimo Planeta es un libro de referencia crucial sobre el tema de los antiguos astronautas \x96cómo llegaron aquí, cuándo lo hicieron y cómo influyeron en la humanidad con su tecnología y su cultura durante cientos de miles de años. \x93Excitante... creíble... de lo más provocativo y convincente. El Duodécimo Planeta ofrece pruebas documentales para una teoría nueva y radical que, dando respuesta a cuestiones ciertamente antiquísimas, no hace más que agrandar las ondas del estanque. (Tal como dice el autor, \x93Si los nefilim... crearon al Hombre en la Tierra, ¿quién creó a los nefilim?\x94) - Library Journal \x93Uno de los libros más importantes que se haya escrito sobre los orígenes de la Tierra\x94. - East West magazine \x93Sitchin es un infatigable investigador privado de los orígenes del hombre... (hace) una interpretación deslumbrante\x94. - Kirkus Reviews \x93El libro de Sitchin es toda una sensación... Es una obra sobria y erudita, profunda en sus implicaciones y, obviamente, el resultado de una meticulosa y perspicaz investigación de los textos de la antigüedad. Como tal, resulta sincero y convincente\x94. - Worcester Evening News', 'language': 'es', 'image': 'https://images.isbndb.com/covers/86/00/9788477208600.jpg', 'title_long': '12 Planeta', 'edition': '1', 'dimensions': 'Weight: 1.54984970186 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 1.54984970186}}, 'pages': 440, 'date_published': '2006', 'subjects': ['History', 'Ancient Civilizations', 'Religion & Spirituality', 'New Age & Spirituality', 'Astrology', 'Science & Math', 'Astronomy & Space Science', 'Astrophysics & Space Science'], 'authors': ['Zecharia Sitchin'], 'title': '12 Planeta', 'isbn13': '9788477208600', 'msrp': 29.95, 'binding': 'Paperback', 'isbn': '8477208603', 'isbn10': '8477208603'}}