{'book': {'publisher': 'EDICIONES OBELISCO S.L.', 'synopsis': 'El Feng Shui es el arte chino de la ubicación y forma parte de una sabiduría milenaria basada en el profundo conocimiento de la relación entre las fuerzas del cielo y la Tierra. Expresa la posición que ocupamos en el Universo y determina si nuestro campo de energía es compatible con el que nos rodea. Nos enseña a armonizar nuestros elementos y orientaciones individuales con los del entorno para que la energía que fluye de nuestro interior y la que nos envuelve actúen con sinergia armonía y fluidez. Con este libro aprenderás: * Cómo aprovechar las orientaciones más favorables a partir de la fecha de nacimiento. * Cómo distribuir las estancias de nuestro hogar de acuerdo con las direcciones más apropiadas para cada miembro de la familia. * Consejos prácticos para crear ambientes serenos, seguros y positivos. * Cómo disponer el mobiliario. Una organización del espacio que ya utilizan con gran éxito cada vez más arquitectos e interioristas. * Cómo distribuir las distintas áreas de trabajo para que un negocio tenga éxito. El Diccionario del Feng Shui es la obra de referencia, imprescindible tanto para iniciados como para quienes desean realizar pequeños cambios domésticos que mejoren eficazmente su hogar y bienestar. * Es la única obra que permite un acceso rápido y práctico a la información a partir de una consulta concreta. Ofrece varios niveles de lectura: cada término se puede ampliar mediante otras referencias, según las necesidades del lector. * Es la obra más completa, con las definiciones originales de las dos escuelas clásicas y los recientes conceptos occidentales, identificables con claridad. * Es un libro didáctico, de fácil comprensión y con agradables ilustraciones. Una importante fuente de información e inspiración: a través de este libro descubriremos como los principios Feng Shui son aplicables también a nuestro espacio interior. Es entonces cuando empezamos a comprender el profundo poder de esas asociaciones simbólicas.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/69/10/9788477206910.jpg', 'title_long': 'Diccionario de Feng Shui', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.76720867176 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.76720867176}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 200, 'date_published': '1999-01-01', 'subjects': ['Self-Help', 'Stress Management', 'Health, Fitness & Dieting', 'Religion & Spirituality', 'New Age & Spirituality', 'Other Eastern Religions & Sacred Texts', 'Feng Shui'], 'authors': ['Chu Tung Shi', 'Chris Evans'], 'title': 'Diccionario de Feng Shui', 'isbn13': '9788477206910', 'msrp': 20.95, 'binding': 'Paperback', 'isbn': '8477206910', 'isbn10': '8477206910'}}