{'book': {'publisher': 'Salamandra Infantil y Juvenil', 'synopsis': 'Harry Potter y el prisionero de Azkaban es la tercera novela de la ya clásica serie fantástica de la autora británica J.K. Rowling.<br/>«Bienvenido al autobús noctámbulo, transporte de emergencia para el brujo abandonado a su suerte. Levante la varita, suba a bordo y lo llevaremos a donde quiera.»<br/>Cuando el autobús noctámbulo irrumpe en una calle oscura y frena con fuertes chirridos delante de Harry, comienza para él un nuevo curso en Hogwarts, lleno de acontecimientos extraordinarios. Sirius Black, asesino y seguidor de lord Voldemort, se ha fugado, y dicen que va en busca de Harry. En su primera clase de Adivinación, la profesora Trelawney ve un augurio de muerte en las hojas de té de la taza de Harry... Pero quizá lo más aterrador sean los dementores que patrullan por los jardines del colegio, capaces de sorberte el alma con su beso...<br/>Tras su publicación, la crítica dijo...<br/>«Los niños se identifican por completo con las aventuras de Harry y en algunos casos leen los libros sin parar, una y otra vez, atraídos por la magia de la historia y la magia de Harry.»<br/>El País<br/>«La escoba de Potter tiene cuerda para rato. No parece muy arriesgado recurriral tópico para afirmar que los libros de Rowling marcarán un antes y un después en la literatura fantástica europea.»<br/>El Periódico<br/>«Asistimos a una auténtica obra maestra en el género de la literatura juvenil de misterio, pues la intriga y el suspense son sabiamente dosificados con episodios de humor socarrón, donde discurre una galería de personajes que refleja las cualidades y defectos humanos. El resultado es un libro que no debe perderse ningún lector.»<br/>El Cultural<br/>«La historia de Harry Potter destaca por su fuerza para proponer a sus receptores una lectura productiva de los aspectos más convencionales de lavida cotidiana y de universos donde se requiere una disposición creativa para que cobren pleno sentido.»<br/>ABC Cultural', 'language': 'es', 'image': 'https://images.isbndb.com/covers/51/90/9788478885190.jpg', 'title_long': 'Harry Potter y el prisionero de Azkaban (Harry Potter, 3)', 'edition': '059', 'dimensions': 'Height: 8.6614 Inches, Length: 5.47243 Inches, Weight: 1.12876678144 Pounds, Width: 1.06299 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.47243}, 'width': {'unit': 'inches', 'value': 1.06299}, 'weight': {'unit': 'pounds', 'value': 1.12876678144}, 'height': {'unit': 'inches', 'value': 8.6614}}, 'pages': 360, 'date_published': '2000-10-01', 'subjects': ["Children's Books", 'Literature & Fiction', 'Action & Adventure', 'Classics', 'Humor', 'Science Fiction & Fantasy', 'Fantasy & Magic', 'Biographies', 'Education & Teaching', 'Schools & Teaching', 'Self Service', 'Custom Stores'], 'authors': ['J.K. Rowling'], 'title': 'Harry Potter y el prisionero de Azkaban (Harry Potter, 3)', 'isbn13': '9788478885190', 'msrp': 17.99, 'binding': 'Hardcover', 'isbn': '8478885196', 'isbn10': '8478885196'}}