{'book': {'publisher': 'RBA', 'synopsis': 'Después del asesinato de once atletas judíos durante los juegos olímpicos de Múnich, en 1972, el agente del Mossad Avner recibió el encargo de vengar la muerte de los deportistas eliminando a once terroristas palestinos en Europa. Este hecho supuso un gran cambio en la política israelí, puesto que fue la primera vez que el Estado de Israel decidió combatir al terrorismo con más terrosismo. Como si de un thriller se tratase, George Jonas va desgranando las claves de aquella operación secreta, en la que también estuvieron implicados desde la primera ministra israelí Golda Meir hasta el entonces general Ariel Sharon. Cuando el agente Avner decida abandonar la misión, tendrá en su saber la muerte de ocho palestinos, un cúmulo de errores graves que habrán costado la vida a tres de sus colaboradores y el firme convencimiento de que más muertes acentuarán el conflicto palestino-israelí. ENGLISH DESCRIPTION Vengeance is the true account of five ordinary Israelis, selected to hunt down and kill the PLO terrorists responsible for the massacre of eleven Israeli athletes at the Munich Olympics in 1972. This is the story of that secret mission as related by "Avner", handpicked by Golda Mier as the leader of the group \x97the first Mossad agent to come out of "deep cover" and tell the story that was shrouded in silence and speculation for years. Vengeance opens a window onto a secret world, a book that at the same time inspires and horrifies. For its subject is an act of revenge that goes to the very heart of the ancient biblical questions of good and evil.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/51/38/9788478715138.jpg', 'title_long': 'Venganza: El Relato Veridico De Una Mision Contraterrorista Israeli (Spanish Edition)', 'dimensions': 'Height: 9.13384 Inches, Length: 6.10235 Inches, Weight: 1.763698096 Pounds, Width: 0.7874 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.10235}, 'width': {'unit': 'inches', 'value': 0.7874}, 'weight': {'unit': 'pounds', 'value': 1.763698096}, 'height': {'unit': 'inches', 'value': 9.13384}}, 'pages': 272, 'date_published': '2006-01-01', 'subjects': ['Biographies & Memoirs', 'True Crime', 'Literature & Fiction', 'Genre Fiction', 'Historical', 'TV, Movie, Video Game Adaptations', 'Reference', 'Foreign Language Study & Reference'], 'authors': ['George Jonas'], 'title': 'Venganza: El Relato Veridico De Una Mision Contraterrorista Israeli (Spanish Edition)', 'isbn13': '9788478715138', 'msrp': 24.99, 'binding': 'Paperback', 'isbn': '8478715134', 'isbn10': '8478715134'}}