{'book': {'publisher': 'Tendencias', 'synopsis': 'En este libro valiente y teñido de ácido humor, T.D. Allman, uno de los más prestigiosos periodistas estadounidenses actuales, se suma a las voces críticas que, como la de Michael Moore, arremeten contra la política de George Bush. Aquí se describe cómo este presidente dilapidó toda la solidaridad recibida tras los atentados del 11 de septiembre al emprender una cruzada que convierte a Estados Unidos en el país más peligroso del mundo, y a sí mismo en el hombre más peligroso del planeta. Un país que no ratifica acuerdos como el de Kyoto o la moratoria de pruebas nucleares, un país dirigido por hombres con oscuros intereses económicos, un país que se embarca en guerras basadas en mentiras, un país y un presidente, en suma, que parecen estar por encima de la ley. T.D. Allman ha pasado muchos años en primera línea de los acontecimientos que han forjado la historia de Estados Unidos. Quizá por ello tiene motivos para describir la presidencia de Bush como "una comedia para los que saben pensar, pero una tragedia para los que tienen sentimientos".<br/>Desde Babilonia al Pentágono, desde Muamar Gadafi a Ariel Sharon, T D. Allman conoce personalmente la mayoría de lugares y personas que aparecen en este libro. Como corresponsal y colaborador de numerosas publicaciones ha presenciado en primera persona muchos de los acontecimientos narrados en esta historia estremecedora, mordazmente descrita, que describe el arranque de una renovada era de peligro mundial. George W. Bush Jr. es una historia lóbrega y cómica del monumental mal uso del poder que ha tenido lugar en la presidencia de Estados Unidos en un momento en que necesitábamos al mejor; y, en cambio, tuvimos a George W. Bush Jr.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/58/27/9788479535827.jpg', 'title_long': 'El hombre más peligroso del mundo (Spanish Edition)', 'edition': 'Translation', 'dimensions': 'Height: 9.04 Inches, Length: 6.08 Inches, Weight: 0.9369646135 Pounds, Width: 0.65 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.08}, 'width': {'unit': 'inches', 'value': 0.65}, 'weight': {'unit': 'pounds', 'value': 0.9369646135}, 'height': {'unit': 'inches', 'value': 9.04}}, 'pages': 272, 'date_published': '2004-10-11', 'subjects': ['History', 'Europe', 'Military', 'United States', 'Iraq War', 'Politics & Social Sciences', 'Politics & Government', 'International & World Politics'], 'authors': ['T.D. Allman'], 'title': 'El hombre más peligroso del mundo (Spanish Edition)', 'isbn13': '9788479535827', 'msrp': 22.95, 'binding': 'Paperback', 'isbn': '8479535822', 'isbn10': '8479535822'}}