{'book': {'publisher': 'Urano', 'synopsis': 'Cómo ser un padre accesible, involucrado y vinculado afectivamente a tu hijo<br/>Hace cuarenta o cincuenta años, el padre contaba poco en el ámbito doméstico. La madre llevaba a los niños al colegio, los ayudaba con los deberes, los educaba, hacía la compra... Hoy, en cambio, se espera que los padres estén involucrados en la vida doméstica, que expresen sus sentimientos, que concilien trabajo y familia: que sean superpapás. Ellos se esfuerzan más que nunca e intentan compartir la crianza a partes iguales, pero, bien porque no saben cómo desarrollar las habilidades necesarias, bien porque la presión laboral se lo impide, la paternidad a menudo se les resiste. Neil I. Bernstein, con más de treinta años de experiencia en terapia familiar, expone por primera vez los retos a los que se enfrentan los hombres de hoy y propone el primer programa de automejora específico para el sector masculino: tareas concretas para que los padres se comprometan más en la vida de sus hijos y se conviertan en el modelo paterno que siempre han aspirado a ser.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/69/85/9788479536985.jpg', 'title_long': 'Siempre contigo: Cómo ser un padre accesible, involucrado y vinculado afectivamente a tu hijo (Spanish Edition)', 'edition': 'Translation', 'dimensions': 'Height: 8.3 Inches, Length: 5.3 Inches, Weight: 0.77602716224 Pounds, Width: 0.9 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.3}, 'width': {'unit': 'inches', 'value': 0.9}, 'weight': {'unit': 'pounds', 'value': 0.77602716224}, 'height': {'unit': 'inches', 'value': 8.3}}, 'pages': 288, 'date_published': '2009-02-02', 'subjects': ['Self-Help', 'Personal Transformation', 'Emotions', 'Parenting & Relationships', 'Family Relationships', 'Fatherhood'], 'authors': ['Neil I. Bernstein', 'Brooke Lea Foster'], 'title': 'Siempre contigo: Cómo ser un padre accesible, involucrado y vinculado afectivamente a tu hijo (Spanish Edition)', 'isbn13': '9788479536985', 'msrp': 19.95, 'binding': 'Paperback', 'isbn': '8479536985', 'isbn10': '8479536985'}}