{'book': {'publisher': 'Urano', 'synopsis': 'Los recientes descubrimientos revolucionarios en el campo de la neurociencia y la psicología del desarrollo han modificado nuestra comprensión del desarrollo infantil. Todo lo que el bebé experimenta en el útero materno y después, tras el nacimiento, deja una huella indeleble no sólo en su cerebro, sino también en el sistema inmunitario y en todo su organismo.<br/><br/>Todas sus experiencias, desde el momento del parto hasta una tarde en un parque modelan la salud y la personalidad de los niños. El doctor Thomas Verny esboza aquí un mapa de las influencias que intervienen en el desarrollo mental y emocional del niño, desde que es concebido.<br/><br/>Saber que el entorno es fundamental en el desarrollo del niño otorga a los padres mayores responsabilidades y transforma su papel de forma radical. Ya no son sólo los encargados de procurar sustento a su hijo; son sus estimuladores, sus modelos emocionales, sus guías en las artes humanas de la empatía, la paciencia, el sentido del humor... Como afirma el doctor Verny: «La primera escuela es el vientre materno».<br/><br/>Hoy sabemos que el cerebro del futuro bebé está conectado a su entorno, recogiendo estímulos e impresiones. Lo queramos o no, todo lo que hacemos \x96 nuestras palabras, nuestros gestos, la rabia que liberamos o incluso las lágrimas que reprimimos\x96 constituyen para los niños lecciones secretas sobre ellos mismos y sobre nosotros, sus padres.<br/><br/>En opinión de los autores, una paternidad consciente comienza con la aceptación del reto que supone la crianza y el cuidado de un hijo. En este libro, explican a los padres cómo pueden crear el entorno adecuado para que los pequeños desarrollen todas sus capacidades potenciales.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/51/17/9788479535117.jpg', 'title_long': 'El futuro bebé (Spanish Edition)', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 1.212542441 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.212542441}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 432, 'date_published': '2003-02-17', 'subjects': ['Parenting & Relationships', 'Parenting', 'Early Childhood'], 'authors': ['Pamela Weintraub', 'Thomas Verny'], 'title': 'El futuro bebé (Spanish Edition)', 'isbn13': '9788479535117', 'msrp': 20.2, 'binding': 'Paperback', 'isbn': '8479535113', 'isbn10': '8479535113'}}