{'book': {'publisher': 'Urano', 'synopsis': '¿Por qué tantas personas se ven afectadas por la fatiga, la falta de entusiasmo y la depresión? ¿Por qué hay tanta gente que tiene la sensación de que en su vida falta algo fundamental?<br/><br/>David Simon sostiene que estas sensaciones nacen de una falta de conexión personal con lo que de verdad importa. Todo ser humano posee un tesoro interior de energía y creatividad, pero muchos han perdido la llave que lo abre. Es imposible conseguir la felicidad verdadera sin acceder a la reserva de vitalidad propia. Y eso es precisamente lo que se enseña en este libro.<br/><br/>En Potencia tu energía se expone un programa práctico para la nutrición del cuerpo, la mente y el alma, que combina con acierto la sabiduría espiritual y las recomendaciones médicas más concretas. Escrito con un estilo sencillo y a la vez profundo, este libro ofrece un plan de eficacia demostrada para los que experimentan síntomas de fatiga, agotamiento, falta de motivación y de entusiasmo.<br/><br/>A partir de la identificación del lector con uno de los tipos de mente-cuerpo propuestos por el doctor Simon -tierra, fuego, aire, o una combinación de los tres- este puede llegar a comprender mejor su auténtica personalidad y a beneficiarse de una orientación individualizada que pretende lograr, entre otras cosas, la eliminación de las toxinas del organismo, una alimentación sana, el desarrollo de unas emociones positivas y de unos hábitos diarios que estén en armonía con la naturaleza. Se trata, en definitiva, de conseguir el equilibrio entre una actividad laboral responsable y un tiempo de ocio pleno, sin olvidar nunca el respeto por la sagrada magia de la vida.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/48/82/9788479534882.jpg', 'title_long': 'Potencia tu energía (Spanish Edition)', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6.25 Inches, Weight: 1.0471957445 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 1.0471957445}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 304, 'date_published': '2002-03-04', 'subjects': ['Self-Help', 'Relationships', 'Interpersonal Relations', 'Health, Fitness & Dieting', 'Psychology & Counseling', 'Applied Psychology', 'Reference', 'Foreign Language Study & Reference', 'Medical Books', 'Psychology'], 'authors': ['David Simon'], 'title': 'Potencia tu energía (Spanish Edition)', 'isbn13': '9788479534882', 'msrp': 15.95, 'binding': 'Paperback', 'isbn': '8479534885', 'isbn10': '8479534885'}}