{'book': {'publisher': 'Urano', 'synopsis': 'Una guía para afrontar los momentos más difíciles de la vida<br/>Casi todos, en algún momento, hemos atravesado períodos de tristeza, duelo, frustración o fracaso tan duraderos y angustiosos que podrían calificarse de "noches oscuras del alma". Así los denomina el teólogo y psicoterapeuta Thomas Moore, que, sin embargo, a lo largo de años de práctica clínica ha aprendido a extraer los grandes dones que encierran. Con su tono afectuoso y su filosofía accesible, nos guía en esta obra apasionante por las distintas fases del viaje a la oscuridad, a la vez que ofrece herramients para comprender su sentido: esta metafórica "noche oscura" -dice Moore- es una verdadera iniciación espiritual y una oportunidad única de conocer las necesidades más profundas del alma.<br/>Un matrimonio difícil, un niño con problemas, la pérdida de un cónyuge o de un pariente cercano, una traición...; la aflicción forma parte de la vida humana, tanto como la alegría. Sin embargo, en algunos casos, los episodios difíciles pueden sumirnos en un angustioso túnel emocional, que experimentamos como una auténtica ruptura del ser y nos arrebata la alegría misma de vivir. La sociedad tiende a etiquetar estos períodos con términos clínicos, considerándolos un obstáculo a superar cuanto antes. Pero ¿qué sucede cuando decidimos vivirlos con valor y confianza? Entonces nos sumergimos en lo que Thomas Moore denomina "la noche oscura del alma", un misterioso viaje hacia lo desconocido, una iniciación espiritual que nos aportará la más profunda comprensión del sentido de la vida. Con sinceridad e inteligencia, Thomas Moore se brinda a hacernos de guía en esta transición a través de temas como:<br/>-El poder sanador de la melancolía.<br/>-Consuelo en la enfermedad y en la vejez.<br/>-La relación entre la creatividad, la espiritualidad y las crisis emocionales.<br/>-La búsqueda de sentido y belleza en la oscuridad.<br/>Y al final del viaje, quizá el más difícil que hayamos emprendido jamás, nos espera la gran recompensa: la clave para acceder a nuestra esencia, al centro mismo de nuestro ser, donde descubriremos quién somos y quién deseamos ser.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/60/39/9788479536039.jpg', 'title_long': 'Las noches oscuras del alma (Spanish Edition)', 'edition': 'First Edition', 'dimensions': 'Height: 8 Inches, Length: 5.5 Inches, Weight: 1.212542441 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.212542441}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 432, 'date_published': '2005-07-04', 'subjects': ['Self-Help', 'Relationships', 'Interpersonal Relations', 'Religion & Spirituality'], 'authors': ['Thomas Moore'], 'title': 'Las noches oscuras del alma (Spanish Edition)', 'isbn13': '9788479536039', 'msrp': 15.3, 'binding': 'Paperback', 'isbn': '8479536039', 'isbn10': '8479536039'}}