{'book': {'publisher': 'Editorial Trotta, S.A.', 'synopsis': 'De Santayana se ha dicho que carece de sistema y que se contradice escandalosamente. Un análisis atento del conjunto de su obra filosófica arroja sin embargo otro resultado. Ciertamente, no es fácil de clasificar un pensador materialista platónico, nihilista irónico, ateo espiritual y conservador sin compromiso político, pero, si se respeta su lenguaje ?algo imprescindible para interpretar desde dentro cualquier pensamiento?, el paisaje se aclara y deja ver un Santayana sorprendente y poco frecuentado. Siempre atento a las modas filosóficas y científicas de finales del siglo XIX y primera mitad del siglo XX, Santayana, ante los excesos del tardorromanticismo y la barbarie que veía avecinarse, buscó en los griegos la cordura suficiente para afrontar con coraje la desintegración de la Modernidad. Su voz sonó con fuerza en el Harvard de sus años de poeta y profesor, y alcanzó renombre internacional en los difíciles años de la segunda guerra mundial. Su mensaje, con todo, no fue bien recibido entonces. Quizá ahora sea mejor momento para un filósofo que consideraba que lo abierto es también una forma de arquitectura o que el puritanismo no tiene nada que ver con la pureza. A modo de testamento espiritual, dejó escrito: «Cuanto más me limpio a mí mismo de mí mismo, mejor ilumino ese algo en mí que es más mí mismo de lo que soy yo: el espíritu».', 'language': 'es', 'image': 'https://images.isbndb.com/covers/89/80/9788481648980.jpg', 'title_long': 'Santayana filósofo: La filosofía como forma de vida (Spanish Edition)', 'edition': '1', 'dimensions': 'Weight: 0.771617917 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 0.771617917}}, 'pages': 232, 'date_published': '2007-03-01', 'subjects': ['Politics & Social Sciences', 'Philosophy', 'History & Surveys'], 'authors': ['Daniel Moreno'], 'title': 'Santayana filósofo: La filosofía como forma de vida (Spanish Edition)', 'isbn13': '9788481648980', 'msrp': 21, 'binding': 'Paperback', 'isbn': '8481648981', 'isbn10': '8481648981'}}