{'book': {'publisher': 'DEBOLSILLO', 'synopsis': 'Product Description<br/><br/>Querido papá es una novela tierna, que habla de sacrificio y entrega, pero también de la lucha por recuperar la felicidad perdida.<br/>El mundo alrededor de Oliver Watson parece disolverse cuando Sarah, su esposa durante dieciocho años, regresa a Harvard para graduarse. Oliver es abandonado a su suerte, con tres hijos y una libertad que jamás deseó. Cuando la madre de Oliver muere, su padre también ha cambiado: más osado que su hijo y con menos tiempo por vivir, George Watson, a sus setenta y dos años, pronto reencontrará el amor y, eventualmente, un nuevo matrimonio.<br/>Ben, el hijo mayor de Oliver, rechaza a su padre, decidido a forjarse su propia educación. Melissa, la hija mediana, culpa a Oliver por la partida de su madre. Y Sam, el benjamín, se encuentra demasiado afectado como para soportarlo. A partir de ahora, será papá quien deba lidiar con nuevas responsabilidades, nuevas mujeres, nuevas experiencias. Nada es como antes, nada es como ellos creyeron alguna vez que sería. Pero finalmente lo diferente es mejor, lo diferente es más, para cada uno de ellos... Y especialmente para el querido papá.<br/>Reseña:<br/>«Steel demuestra estar en su mejor forma al conducir a Oliver por el nuevo y aterrador mundo de la paternidad en solitario, las mujeres modernas y unas costumbressexuales radicalmente cambiadas, antes de virar a un encomio de la vida familiar y lo romántico.»<br/>Publishers Weekly<br/><br/>About the Author<br/><br/>Danielle Steel es, sin duda, una de las novelistas más populares de todo el mundo. Sus libros se han publicado en sesenta y nueve países, con ventas que superan los mil millones de ejemplares. Cada uno de sus lanzamientos ha encabezado las listas de best sellers de The New York Times, y muchos de ellos se han mantenido en esta posición durante meses.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/73/36/9788483467336.jpg', 'title_long': 'Querido papá (Spanish Edition)', 'edition': '001', 'dimensions': 'Height: 7.4803 Inches, Length: 4.92125 Inches, Weight: 0.61288508836 Pounds, Width: 0.94488 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.92125}, 'width': {'unit': 'inches', 'value': 0.94488}, 'weight': {'unit': 'pounds', 'value': 0.61288508836}, 'height': {'unit': 'inches', 'value': 7.4803}}, 'pages': 400, 'date_published': '2008-09-26', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Family Life', 'Romance', 'Contemporary'], 'authors': ['Danielle Steel'], 'title': 'Querido papá (Spanish Edition)', 'isbn13': '9788483467336', 'msrp': 11.95, 'binding': 'Mass Market Paperback', 'isbn': '848346733X', 'isbn10': '848346733X'}}