{'book': {'publisher': 'Maxi-Tusquets', 'synopsis': 'Como insinúa el propio título, Modelos de mujer, estos siete relatos están todos protagonizados por mujeres que, en distintas edades y circunstancias, se enfrentan todas ellas, en algún momento, a hechos extraordinarios. Todos, menos el que da título al libro, están de un modo u otro ligados a la infancia, a la capacidad de desear como motor de la voluntad, de los actos de voluntad que las protagonistas deberán asumir para impedir que la vida las avasalle. En los tres primeros cuentos -«Los ojos rotos», «Malena, una vida hervida» y «Bárbara contra la muerte»-, los personajes femeninos vencen, cada uno a su manera, a la muerte: la pequeña Miguela, la mujer mongólica que se enamora de un fantasma; Malena, que se pasa la vida haciendo régimen por amor; y Bárbara, que acompaña a su abuelo a pescar. En los cuatro últimos -«El vocabulario de los balcones», «Amor de madre», «Modelos de mujer» y «La buena hija»-, las protagonistas tuercen el destino a su favor recurriendo unas al poder de seducción y otras a la fuerza de la razón, y todas con la voluntad que les otorga el firme deseo de no tolerar que la vida se les escape de las manos.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/52/96/9788483835296.jpg', 'title_long': 'Modelos de mujer (Spanish Edition)', 'edition': 'Literature: history & criticism', 'dimensions': 'Height: 7.4803 Inches, Length: 4.92125 Inches, Weight: 0.42328754304 Pounds, Width: 0.393700787 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.92125}, 'width': {'unit': 'inches', 'value': 0.393700787}, 'weight': {'unit': 'pounds', 'value': 0.42328754304}, 'height': {'unit': 'inches', 'value': 7.4803}}, 'pages': 256, 'date_published': '2009-01-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Short Stories & Anthologies', 'Short Stories', "Women's Fiction", 'Contemporary'], 'authors': ['Almudena Grandes'], 'title': 'Modelos de mujer (Spanish Edition)', 'isbn13': '9788483835296', 'msrp': 1.99, 'binding': 'Mass Market Paperback', 'isbn': '8483835290', 'isbn10': '8483835290'}}