{'book': {'publisher': 'Tusquets Editores S.A.', 'synopsis': 'Una tarde habanera de 1921, el diplomático Miguel Celorio se sentó en el cine Tosca y, antes de que comenzara la película, vio entrar a tres lindas y jovencísimas cubanas acompañadas de una sirvienta: la mayor era bellísima, la menor muy inquieta y la mediana... lo conquistó; tímido por naturaleza, Miguel optó por escribirle una carta: sería la primera de las más de trece mil que le escribió, ya casados, a lo largo de su vida. Esas tres lindas cubanas –la madre y las tías del autor–, Rosita, Virginia y Ana María, sus andanzas e historias, sus ancestros y descendencia, sus exilios y fidelidades, son el eje en torno al que Gonzalo Celorio teje magistralmente una saga familiar llena de personajes apasionantes, de bonanzas y ruinas, de muertes y amores.Paralelamente, los numerosos viajes de Gonzalo Celorio a Cuba desde 1974 nos permiten revivir las sucesivas etapas del siglo xx cubano. Vislumbramos así el día a día de la isla caribeña y sus vaivenes políticos y sociales, gracias a su amor por la ciudad de La Habana y a su admiración hacia escritores cubanos como Lezama Lima, Carpentier o Dulce María Loynaz o hacia los de la actual generación de novelistas.Rosita, Virginia y Ana María, las tres lindas cubanas, título además de un danzón, una exiliada en Miami, otra en la ciudad de México y otra en La Habana, dan pie al autor para sopesar las distintas, a veces contrapuestas, y siempre complejas actitudes hacia Cuba. Tres lindas cubanas, donde se mezclan dos géneros: la memoria novelada y la crónica de viajes, nos adentra en un terreno narrativo nuevo, donde la historia se funde con la novela.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/33/71/9788483103371.jpg', 'title_long': 'Tres Lindas Cubanas (Andanzas) (Spanish Edition)', 'edition': 'First Edition', 'dimensions': 'Height: 8.2677 Inches, Length: 5.5118 Inches, Weight: 1.1243575362 Pounds, Width: 0.8661417314 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5118}, 'width': {'unit': 'inches', 'value': 0.8661417314}, 'weight': {'unit': 'pounds', 'value': 1.1243575362}, 'height': {'unit': 'inches', 'value': 8.2677}}, 'pages': 392, 'date_published': '2006-05-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Literary'], 'authors': ['Gonzalo Celorio'], 'title': 'Tres Lindas Cubanas (Andanzas) (Spanish Edition)', 'isbn13': '9788483103371', 'msrp': 1.99, 'binding': 'Paperback', 'isbn': '8483103370', 'isbn10': '8483103370'}}