{'book': {'publisher': 'Tusquets Editores S.A.', 'synopsis': 'Product Description      Janice nunca fue una belleza, y lo sabe. Pero sí ama las causas justas, y tanto se empeña en ellas que, en el Nueva York de los años treinta y cuarenta, se casa, llena de admiración, con Sam, un hombre políticamente comprometido con la izquierda radical. Pero los avatares de la política en esos años de guerra crean contradicciones ante las que Sam reacciona más como un obediente servidor de su ideología que como el brillante intelectual que ella veía en él. Y Janice deja de admirar a su marido, incluso cuando éste se alista en el ejército aliado, y cae en la cuenta de que, en realidad, Sam entró en su vida porque ella jamás se había valorado a sí misma. Cuando vuelve Sam, la distancia entre los dos parece ya irreparable… ¿Podrá Janice ser feliz algún día? Miller en todo caso sugiere una fórmula: «Tomar lo que se nos ofrece, pedirlo si no se nos ofrece, y nunca lamentar nada».      Book Description      El emocionante relato de una mujer en la América de mediados del siglo XX.      About the Author      Arthur Miller nació en Nueva York en 1915 y falleció en 2005. Clásico incontestable de la escena estadounidense, escribió algunas de las obras maestras del teatro del siglo xx, además de ser autor de una extensa obra narrativa y ensayística. Entre sus numerosos galardones se cuentan el Premio Pulitzer 1949 o el de la crítica teatral neoyorquina en dos ocasiones –una por Todos eran mis hijos–, así como el Premio Príncipe de Asturias de las Letras 2002. Hombre público por su compromiso social –y su vida privada–, nadie como Miller ha sabido reflejar las frustraciones y desengaños de la sociedad estadounidense. Tusquets Editores ha publicado sus grandes piezas teatrales Muerte de un viajante, Las brujas de Salem, Panorama desde el puente y El descenso del monte Morgan, su autobiografía Vueltas al tiempo, el cuento infantil La manta de Jane, el volumen de ensayos Al correr de los años y los libros de relatos Ya no te necesito y Presencia, así como las novelas En el punto de mira y Una chica cualquiera.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/01/27/9788483100127.jpg', 'title_long': 'Una chica cualquiera (Andanzas) (Spanish Edition)', 'dimensions': 'Height: 8.2677 Inches, Length: 5.5118 Inches, Weight: 0.220462262 Pounds, Width: 0.393700787 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5118}, 'width': {'unit': 'inches', 'value': 0.393700787}, 'weight': {'unit': 'pounds', 'value': 0.220462262}, 'height': {'unit': 'inches', 'value': 8.2677}}, 'pages': 96, 'date_published': '1997-02-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Literary'], 'authors': ['Arthur Miller'], 'title': 'Una chica cualquiera (Andanzas) (Spanish Edition)', 'isbn13': '9788483100127', 'msrp': 14.6, 'binding': 'Paperback', 'isbn': '8483100126', 'isbn10': '8483100126'}}