{'book': {'publisher': 'Maxi-Tusquets', 'synopsis': 'Un inquietante caso en el que la investigación sobre el suicidio de una joven y la aparición de un asesino en serie llevará al inspector Wallander hasta las altas esferas de la política.<br/>En Suecia nadie recuerda un verano tan caluroso como el de 1994. Mientras la gente sigue con pasión los partidos finales del Campeonato Mundial de Fútbol, el inspector Kurt Wallander se dispone a iniciar unas cortas vacaciones. Pero la tranquilidad de la provincia de Escania se ve truncada cuando una muchacha, al parecer extranjera, se suicida quemándose a lo bonzo. Wallander y su equipo tratan de averiguar la identidad de la joven y los motivos de esa trágica decisión; pero los sobresaltos no han hecho más que empezar, pues un brutal asesino en serie ha comenzado su macabra actividad. Las primeras víctimas son un antiguo ministro de Justicia, un adinerado tratante de arte y un ladronzuelo de poca monta. Para detener esta carnicería, Wallander se aferra a una pista que le conducirá a las altas esferas de la política y pondrá en peligro su vida y la de sus allegados.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/52/89/9788483835289.jpg', 'title_long': 'La falsa pista (Serie Wallander/ Wallander Series) (Spanish Edition)', 'edition': 'Translation', 'dimensions': 'Height: 7.4803 Inches, Length: 4.92125 Inches, Weight: 0.90830451944 Pounds, Width: 1.181102361 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.92125}, 'width': {'unit': 'inches', 'value': 1.181102361}, 'weight': {'unit': 'pounds', 'value': 0.90830451944}, 'height': {'unit': 'inches', 'value': 7.4803}}, 'pages': 560, 'date_published': '2009-01-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Contemporary', 'Mystery, Thriller & Suspense', 'Mystery', 'Thrillers & Suspense'], 'authors': ['Henning Mankell'], 'title': 'La falsa pista (Serie Wallander/ Wallander Series) (Spanish Edition)', 'isbn13': '9788483835289', 'msrp': 11.95, 'binding': 'Mass Market Paperback', 'isbn': '8483835282', 'isbn10': '8483835282'}}