{'book': {'publisher': 'Tusquets Editores S.A.', 'synopsis': 'Si en sus anteriores libros Richard Leakey y Roger Lewin ofrecían un profundo análisis del pasado de la vida y de los comienzos de la humanidad, en La sexta extinción vuelven su mirada, no sin preocupación, hacia el futuro de la vida, un futuro no tan lejano y que presagia un final.<br/><br/>A lo largo de la historia de la vida en la Tierra han tenido lugar cinco grandes extinciones, la más reciente hace 65 millones de años, cuando los dinosaurios perecieron en un brevísimo lapso de tiempo. Cada una de estas extinciones fue catastrófica : en todas ellas desapareció al menos el 65 por ciento de las especies vivientes. No obstante, si bien la causa de esas extinciones es aún materia de controversia ―¿repentinos cambios climáticos, asteroides, dificultades de evolución ?―, no ocurre así con las consecuencias y las características de estas catástrofes, que parecen seguir todas un mismo modelo.<br/><br/>Aportando pruebas científicas irrefutables, Leakey y Lewin demuestran que la sexta extinción ha empezado ya : cada año, el hombre barre de la faz de la Tierra a trescientas especies vivas. Y esta extinción amenaza al planeta entero, incluida la especie Homo sapiens… Si no empezamos a tomar conciencia de las consecuencias devastadoras de nuestra conducta rapaz y aniquiladora, irremisiblemente la especie humana caerá (tras el mastodonte, el alca gigante, la paloma migradora y sus demás víctimas) en el olvido de la extinción.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/55/11/9788483105511.jpg', 'title_long': 'La sexta extinción (Spanish Edition)', 'dimensions': 'Height: 7.086614166 inches, Length: 0.3149606296 inches, Width: 0.8661417314 inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 0.3149606296}, 'width': {'unit': 'inches', 'value': 0.8661417314}, 'height': {'unit': 'inches', 'value': 7.086614166}}, 'pages': 312, 'date_published': '1997-11-01', 'subjects': ['Literature & Fiction', 'Reference', 'Foreign Language Study & Reference', 'Education & Teaching', 'Schools & Teaching'], 'authors': ['Richard Leakey'], 'title': 'La sexta extinción (Spanish Edition)', 'isbn13': '9788483105511', 'msrp': 35, 'binding': 'Paperback', 'isbn': '8483105519', 'isbn10': '8483105519'}}