{'book': {'publisher': 'Tusquets Editores S.A.', 'synopsis': 'Una historia de amor, y la historia de unos días que pudieron cambiar para siempre el destino de España.<br/>Toulouse, verano de 1939. Carmen de Pedro, responsable en Francia de los diezmados comunistas españoles, se cruza con Jesús Monzón, un cargo menor del partido que, sin ella intuirlo, alberga un ambicioso plan. Unos años después, en 1944, Monzón, convertido en su pareja, ha organizado el grupo más disciplinado de la Resistencia contra la ocupación alemana, prepara la plataforma de la Unión Nacional Española y cuenta con un ejército de hombres dispuestos a invadir España. Entre ellos está Galán, que ha combatido en la Agrupación de Guerrilleros Españoles y que cree, como muchos otros en el otoño de 1944, que tras el desembarco aliado y la retirada de los alemanes, es posible establecer un gobierno republicano en Viella. No muy lejos de allí, Inés vive recluida y vigilada en casa de su hermano, delegado provincial de Falange en Lérida. Ha sufrido todas las calamidades desde que, sola en Madrid, apoyó la causa republicana durante la guerra, pero ahora, cuando oye a escondidas el anuncio de la operación Reconquista de España en Radio Pirenaica, Inés se arma de valor, y de secreta alegría, para dejar atrás los peores años de su vida.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/25/30/9788483832530.jpg', 'title_long': 'Inés y la alegría: El ejército de unión nacional y la invasión del valle de Arán, Pirineo de Lérida, 19-27 de octubre de 1944 (Episodos De Una Guerra Interminable) (Spanish Edition)', 'edition': '1', 'dimensions': 'Height: 8.85825 Inches, Length: 5.9055 Inches, Weight: 1.984160358 Pounds, Width: 1.3385826758 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.9055}, 'width': {'unit': 'inches', 'value': 1.3385826758}, 'weight': {'unit': 'pounds', 'value': 1.984160358}, 'height': {'unit': 'inches', 'value': 8.85825}}, 'pages': 736, 'date_published': '2010-08-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical'], 'authors': ['Almudena Grandes'], 'title': 'Inés y la alegría: El ejército de unión nacional y la invasión del valle de Arán, Pirineo de Lérida, 19-27 de octubre de 1944 (Episodos De Una Guerra Interminable) (Spanish Edition)', 'isbn13': '9788483832530', 'msrp': 27.95, 'binding': 'Paperback', 'isbn': '8483832534', 'isbn10': '8483832534'}}