{'book': {'publisher': 'DEBATE', 'synopsis': 'A partir del éxito que supuso la publicación de Gomorra, Roberto Saviano se vio obligado a vivir con protección.<br/>Así, desde octubre de 2006, ha tenido que vivir oculto y acompañado siempre por varios guardaespaldas, cambiando frecuentemente de lugar de residencia y sin poder disfrutar de la libertad. Sin embargo, su conciencia de escritor se mantiene, y buena prueba de ello son estos dos textos que publicó en 2008 en Italia. En ellos, habla de loque mejor conoce, el sur de Italia y en concreto Nápoles y sus habitantes. El primero, El anillo, sobre el asesinato de dos inocentes en Nápoles, es una reflexión sobre cómo desde fuera se condena a la gente de Nápoles, de modo que hasta las víctimas son vistas como culpables. En el segundo, Lo contrario de la muerte, la historia de una joven viuda de guerra, muestra una sociedad en que el ejército es una de las pocas salidas posibles, y donde «la última guerra» no es la segunda guerra mundial sino el conflicto más reciente donde ha ido una misión de paz italiana.<br/>Dos joyas que defienden el poder de la palabra y el deber de los escritores de seguir contando, y que permiten que la voz de Saviano se siga oyendo pese a quien pese.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/83/66/9788483068366.jpg', 'title_long': 'Lo contrario de la muerte: Dos relatos de Roberto Saviano (Spanish Edition)', 'edition': '001', 'dimensions': 'Height: 8 Inches, Length: 4.5 Inches, Weight: 0.46 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.5}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.46}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 112, 'date_published': '2009-02-02', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Political', 'History & Criticism', 'Movements & Periods', 'Short Stories & Anthologies', 'Short Stories', 'Politics & Social Sciences', 'Social Sciences'], 'authors': ['Roberto Saviano'], 'title': 'Lo contrario de la muerte: Dos relatos de Roberto Saviano (Spanish Edition)', 'isbn13': '9788483068366', 'msrp': 15.95, 'binding': 'Hardcover', 'isbn': '8483068362', 'isbn10': '8483068362'}}