{'book': {'publisher': 'Tusquets Editores S.A.', 'synopsis': 'En los últimos tiempos han surgido algunos procesos y fenómenos con vocación de cambiar nada menos que la vida de la humanidad, de conducirla por vericuetos sin retorno hacia un futuro supuestamente mejor. A esta pauta obedece la celebrada aparición en Estados Unidos de una «economía digital», cuyo lanzamiento urbi et orbi auguraba un cambio trascendental. <br/>\xa0<br/>En efecto, los avances en las Tecnologías de la Información y de las Comunicaciones (TIC) durante la pasada década sentaron las bases para un espectacular periodo de crecimiento. Pero el tiempo parece demostrar que eran exageradas las ambiciosas voces que anunciaban una «nueva economía» basada en las TIC, libre de ciclos y de crecimiento sin fin. Por ello, REBERTO VELASCO ha puesto especial cuidado en no dar rienda suelta al agorero que todo economista lleva dentro y estudia este peculiar fenómeno con el necesario escepticismo. De hecho, hay pocas novedades bajo el sol, y el plato de la «nueva economía», brillantemente cocinado por los analistas financieros, los bancos de inversión y las grandes consultoras internacionales, no revolucionará la gastronomía tradicional. Sin embargo, tampoco será, como revela este sólido e inteligente análisis, una receta más del catálogo de comida rápida.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/85/50/9788483108550.jpg', 'title_long': 'La economía digital (Kriterios) (Spanish Edition)', 'edition': 'First Edition', 'dimensions': 'Height: 8.2677 Inches, Length: 5.5118 Inches, Weight: 1.00089866948 Pounds, Width: 0.8661417314 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5118}, 'width': {'unit': 'inches', 'value': 0.8661417314}, 'weight': {'unit': 'pounds', 'value': 1.00089866948}, 'height': {'unit': 'inches', 'value': 8.2677}}, 'pages': 336, 'date_published': '2003-02-01', 'subjects': ['Business & Money', 'Economics', 'Processes & Infrastructure', 'E-Commerce', 'Politics & Social Sciences'], 'authors': ['Roberto Velasco'], 'title': 'La economía digital (Kriterios) (Spanish Edition)', 'isbn13': '9788483108550', 'msrp': 24.95, 'binding': 'Paperback', 'isbn': '8483108550', 'isbn10': '8483108550'}}