{'book': {'publisher': 'DEBOLSILLO', 'synopsis': 'El espléndido desenlace de la exitosa trilogía de ciencia ficción «Leyendas de Dune».<br/><br/>El último enfrentamiento entre los humanos y las máquinas... El origen de la rivalidad entre las casas Atreides y Harkonnen... Con La batalla de Corrin concluye la trilogía «Leyendas de Dune», el episodio sobre el cual se asientan los pilares del mítico universo creado por Frank Herbert.<br/><br/>Cincuenta y seis años han transcurrido desde los sucesos narrados en Dune. La cruzada de las máquinas. A la muerte de Serena Butler siguieron las décadas más sangrientas de la Yihad, pero, tras años de lucha cruenta, los guerreros humanos empiezan a albergar la esperanza de que el conflicto contra las máquinas vea pronto su fin.<br/><br/>Por desgracia, a Omnius le queda una carta por jugar. En un último intento por destruir a la humanidad, propaga un virus mortífero que diezma a los habitantes de planetas enteros... y la balanza se inclina de nuevo a su favor. Al final, una guerra que ha durado generaciones tendrá que decidirse en la apocalíptica batalla de Corrin.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/73/43/9788483467343.jpg', 'title_long': 'La batalla de Corrin (Leyendas de Dune 3) (Spanish Edition)', 'edition': '005', 'dimensions': 'Height: 7.51967 Inches, Length: 5.03936 Inches, Weight: 1.08908357428 Pounds, Width: 1.49606 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.03936}, 'width': {'unit': 'inches', 'value': 1.49606}, 'weight': {'unit': 'pounds', 'value': 1.08908357428}, 'height': {'unit': 'inches', 'value': 7.51967}}, 'pages': 736, 'date_published': '2021', 'subjects': ['Science Fiction & Fantasy', 'Fantasy', 'Science Fiction', 'Space Opera', 'Genetic Engineering'], 'authors': ['Brian Herbert'], 'title': 'La batalla de Corrin (Leyendas de Dune 3) (Spanish Edition)', 'isbn13': '9788483467343', 'msrp': 16.95, 'binding': 'Mass Market Paperback', 'isbn': '8483467348', 'isbn10': '8483467348'}}