{'book': {'publisher': 'Tusquets Editores S.A.', 'synopsis': 'Los libros de Annie Ernaux, como recordarán los lectores españoles gracias a sus novelas Pura pasión y La vergüenza (Andanzas 182 y 376, Fábula 98), son fruto de la urgencia de escribir, de relatar sus vivencias más íntimas y que más impacto han causado en su vida. Porque, como la propia autora dice en El acontecimiento: «Por encima de todas las razones sociales y psicológicas que pueda encontrar en lo que viví, hay una de la que estoy totalmente segura: esas cosas me ocurrieron para que diera cuenta de ellas».<br/><br/>En octubre de 1963, Annie Ernaux, la protagonista de esta historia, se encuentra en la ciudad de Ruán estudiando filología, cuando descubre que está embarazada. Desde el primer momento no le cabe la menor duda de que no quiere tener esa criatura no deseada. En una sociedad en la que se penaliza el aborto con prisión y multa, Annie Ernaux se encuentra sola; hasta su pareja se desentiende del asunto. Después de pasar por varios médicos que cierran los ojos ante su problema, y de intentar pedir ayuda entre sus conocidos y amigos, consigue que una mujer que ha pasado por la misma situación le dé la dirección de una «abortera» en París e incluso le preste la enorme suma de dinero que necesitará. Annie Ernaux no sólo se encontrará desamparada, sino que llegará a sentirse discriminada frente a una sociedad que le vuelve la espalda, y habrá de luchar sola frente al profundo horror y dolor de un aborto clandestino.<br/><br/>Tal vez sólo una escritora de la talla de Ernaux sea capaz de «dar cuenta» de semejante íntima situación sin caer en el quejumbroso testimonio al que cierta literatura nos tiene acostumbrados. Mediante la fuerza de su escritura, distanciada, sin concesiones, convierte su propia experiencia en un hermoso y escalofriante relato de una realidad universal.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/16/43/9788483101643.jpg', 'title_long': 'El Acontecimiento (Coleccion Andanzas) (Spanish Edition)', 'dimensions': 'Height: 8.2677 Inches, Length: 5.5118 Inches, Width: 0.3149606296 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5118}, 'width': {'unit': 'inches', 'value': 0.3149606296}, 'height': {'unit': 'inches', 'value': 8.2677}}, 'pages': 128, 'date_published': '2001-03-01', 'subjects': ['Biographies & Memoirs', 'Literature & Fiction', 'Genre Fiction', 'Education & Teaching', 'Schools & Teaching'], 'authors': ['Annie Ernaux'], 'title': 'El Acontecimiento (Coleccion Andanzas) (Spanish Edition)', 'isbn13': '9788483101643', 'msrp': 15.95, 'binding': 'Paperback', 'isbn': '8483101645', 'isbn10': '8483101645'}}