{'book': {'publisher': 'DEBATE', 'synopsis': '¿Qué une y qué distingue a los habitantes de la Patagonia de los residentes en las tierras altas de Alaska? ¿Es América un continente con una trayectoria común cuyo rastro pueda seguir analizándose factores como la comida, el clima o las formas políticas dominantes? Este libro presenta, por vez primera, un recorrido histórico por el variado territorio americano tomado como una unidad geográfica, social y cultural, como una totalidad política y cultural. Estudiando la geografía humana y física, el medioambiente o la evolución de la agricultura y la alimentación esta visión del continente permite comprender, desde una perspectiva radicalmente nueva y global, las relaciones entre los países, las razones de los diferentes regímenes políticos dominantes y los nexos culturales y sociales entre los habitantes de este inmenso territorio. Pese a existir claras diferencias entre las naciones americanas según el grado de desarrollo, su evolución política y la presencia económica de EE.UU. como potencia hegemónica en la zona, en los estados y culturas de América se pueden hallar múltiples puntos de conexión que la incisiva mirada del profesor Fernández-Armesto ha conseguido poner de manifiesto en esta documentada y brillante síntesis histórica.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/58/39/9788483065839.jpg', 'title_long': 'Las Américas: Historia de un hemisferio (Breve Historia/ Brief History) (Spanish Edition)', 'edition': '001', 'dimensions': 'Height: 7.874 Inches, Length: 5.1181 Inches, Weight: 0.6062712205 Pounds, Width: 0.70866 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.1181}, 'width': {'unit': 'inches', 'value': 0.70866}, 'weight': {'unit': 'pounds', 'value': 0.6062712205}, 'height': {'unit': 'inches', 'value': 7.874}}, 'pages': 272, 'date_published': '2004-05-07', 'subjects': ['History', 'Americas', 'Europe', 'World'], 'authors': ['FERNANDEZ-ARMESTO,FELIPE'], 'title': 'Las Américas: Historia de un hemisferio (Breve Historia/ Brief History) (Spanish Edition)', 'isbn13': '9788483065839', 'msrp': 19.95, 'binding': 'Hardcover', 'isbn': '8483065835', 'isbn10': '8483065835'}}