{'book': {'publisher': 'Edimat Libros', 'synopsis': "The tumultuous events of 1939\x961945 are presented in this unrivaled account of the time when three-quarters of the world went to war. During World War II military and press photographers, propagandists, camera-wielding soldiers, and civilians took the opportunity to record news worldwide, from the Arctic Circle to the jungles of the South Pacific. Each recorded event is presented in its historical context with commentary that provides a vital record of this period's suffering, heroism, cruelty, and humanitarianism.<br/>Los eventos tumultuosos de los años 1939-1945 están presentado en esta narración de la época cuando tres cuartos del mundo fue a luchar. Durante la segunda guerra mundial los fotógrafos militares y de la prensa, los propagandistas, los soldados con cameras, y los civiles tomaron la oportunidad recordar las noticias mundiales desde el Polar Ártico a las junglas del Pacifico Sur. Cada evento esta presentado en un contexto histórico con comentarios que revelan un recuerdo vital del sufrimiento, heroísmo, crueldad, y humanitarismo.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/47/42/9788484034742.jpg', 'title_long': 'La II Guerra Mundial en imágenes (Grandes obras series)', 'edition': 'Translation', 'dimensions': 'Height: 12 Inches, Length: 8 Inches, Weight: 6.19939880744 Pounds, Width: 1.8 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8}, 'width': {'unit': 'inches', 'value': 1.8}, 'weight': {'unit': 'pounds', 'value': 6.19939880744}, 'height': {'unit': 'inches', 'value': 12}}, 'pages': 600, 'date_published': '2005-04-01', 'subjects': ['Arts & Photography', 'Photography & Video', 'Collections, Catalogues & Exhibitions', 'History', 'Americas', 'United States', 'Europe', 'Military', 'Pictorials', 'World War II'], 'authors': ['David Boyle'], 'title': 'La II Guerra Mundial en imágenes (Grandes obras series)', 'isbn13': '9788484034742', 'msrp': 29.95, 'binding': 'Hardcover', 'isbn': '8484034747', 'isbn10': '8484034747'}}