{'book': {'publisher': 'Editorial Crítica', 'synopsis': 'Product Description      Hace sesenta años el mundo se horrorizó con el descubrimiento de la realidad de Auschwitz, el escenario de la mayor matanza de la historia humana: un millón cien mil seres humanos asesinados, incluidos más de doscientos mil niños. Pero, más allá de las imágenes y de los testimonios de las víctimas, la realidad de lo que Auschwitz fue y significó ha seguido escapando a nuestra percepción. Laurence Rees, que lleva quince años investigando el nazismo, no sólo ha utilizado la documentación aparecida en estos últimos años, sino que se ha valido de más de un centenar de entrevistas a supervivientes del campo y a sus verdugos nazis, que por primera vez hablan de sus experiencias, ahora que no arriesgan nada por dejar testimonio de lo que han vivido. Éste es el primer relato completo de la historia de Auschwitz, que se convirtió en un inmenso taller que trabajaba para la guerra, a la vez que en una fábrica de muerte, donde se acabó arrojando a los niños vivos a las hogueras, al no dar abasto las cámaras de gas. Un lugar singular, con funcionarios corruptos, con médicos sanguinarios como Mengele y hasta con un burdel para estimular a los prisioneros “muy trabajadores”. Pero tal vez lo más terrible resulte saber que cerca del ochenta y cinco por 100 de los miembros de la SS que trabajaron en el campo y sobrevivieron a la guerra han quedado impunes, que ni se arrepienten ni creen necesario excusarse con la obediencia a las órdenes recibidas y que ello no parece escandalizar hoy a sus conciudadanos. Este libro pretende despertar nuestras conciencias para que entre todos impidamos que vuelva a haber otro Auschwitz. «Una contribución fundamental para comprender la segunda guerra mundial… El gran esfuerzo de Rees por comprender la mentalidad de los administradores y guardianes de la SS del campo no está motivada sólo por una curiosidad apasionada, sino también por una honestidad intelectual imprescindible.» Antony Beevor, autor de Stalingrado y Berlín. La caída, 1945 «Una historia de Auschwitz accesible y solvente... Rees no rehúye la dura reflexión sobre el comportamiento humano en situaciones extremas y sus juicios morales impregnan este libro útil y necesario.» Professor David Cesarani, autor de Eichmann: His Life and Crimes «Laurence Rees arroja una nueva luz sobre la creación de Auschwitz, representación del horror absoluto y símbolo perdurable de la inhumanidad nazi. Este libro admirable debe ser leído por todos aquellos que deseen saber qué fue realmente Auschwitz.» Professor Sir Ian Kershaw, autor de Hitler, 1889-1936 y Hitler: 1936-1945      About the Author      LAURENCE REES ha sido productor y director creativo de la BBC, en programas de historia y series documentales. Entre sus libros destacan Nazis: a Warning from History (1997), Auschwitz (Crítica, 2005) y El holocausto asiático (Crítica, 2009), todos ellos llevados también a la pequeña pantalla. Sus obras han recibido varios premios, entre ellos un BAFTA, dos International Documentary, un British Book y dos Emmy. En Crítica ha publicado también Una guerra de exterminio. Hitler contra Stalin (2006), A puerta cerrada. Historia oculta de la segunda guerra mundial (2009), El oscuro carisma de Hitler (2013) y El holocausto (2017).', 'language': 'es', 'image': 'https://images.isbndb.com/covers/60/69/9788484326069.jpg', 'title_long': 'Auschwitz: Los nazis y la «Solución final» (Memoria) (Spanish Edition)', 'dimensions': 'Height: 9.25 Inches, Length: 6.5 Inches, Weight: 1.86511073652 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.86511073652}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 368, 'date_published': '2005-01-14', 'subjects': ['History', 'Europe', 'Germany', 'World', 'Jewish'], 'authors': ['Laurence Rees'], 'title': 'Auschwitz: Los nazis y la «Solución final» (Memoria) (Spanish Edition)', 'isbn13': '9788484326069', 'msrp': 32.95, 'binding': 'Hardcover', 'isbn': '8484326063', 'isbn10': '8484326063'}}