{'book': {'publisher': 'RBA Molino', 'synopsis': "'Nunca podría ser más ahora que ahora mismo'. Esta expresiva frase la pronuncia la pequeña Linnea mientras contempla, ensimismada, el puente japonés de la casa en la que vivió el pintor francés Monet. Linnea ha estado en París, con su amigo el señor Bloom que fue jardinero antes de jubilarse y admira profundamente a Monet. Eso le ayudará a acercarse a la obra de su artista y a comprender mejor el significado del estilo impresionista. También ha visitado el maravilloso jardín y la casa en la que Claude Monet vivió durante gran parte de su vida. Allí se acercará no solo a la vida cotidiana del artista, sino también al mundo de plantas y flores que allí le rodeaban. Este libro, pone en contacto a los niños con el mundo del arte de forma amena y muy natural. En él se incluyen también reproducciones de los cuadros de Monet, así como fotografías de la familia del pintor y del pintor mismo. Compaginadas con ilustraciones del viaje de Linnea y el señor Bloom a París. Linnea en el jardín de Monet es un libro maravilloso para todas las edades. Iilustrado con delicadas acuarelas, preciosas y muy detalladas (además de divertidas). Didáctico y muy bien documentado. Un libro exquisito y lleno de ilusión. Ya se ha convertido en un éxito en todo el mundo.", 'language': 'es', 'image': 'https://images.isbndb.com/covers/13/93/9788488061393.jpg', 'title_long': 'Linnea en el Jardin de Monet', 'edition': 'Spanish Language', 'dimensions': 'Height: 9.66 Inches, Length: 6.7 Inches, Weight: 0.661386786 Pounds, Width: 0.34 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.7}, 'width': {'unit': 'inches', 'value': 0.34}, 'weight': {'unit': 'pounds', 'value': 0.661386786}, 'height': {'unit': 'inches', 'value': 9.66}}, 'pages': 54, 'date_published': '2001', 'subjects': ['Arts & Photography', 'History & Criticism', 'Criticism', "Children's Books", 'Arts, Music & Photography', 'Art', 'Literature & Fiction', 'Education & Reference', 'Biographies', 'Reference', 'Foreign Language Study & Reference'], 'authors': ['Christina Bjork', 'Lena Anderson', 'Christina Bjeork'], 'title': 'Linnea en el Jardin de Monet', 'isbn13': '9788488061393', 'msrp': 18.99, 'binding': 'Hardcover', 'isbn': '8488061390', 'isbn10': '8488061390'}}