{'book': {'publisher': 'Umbriel', 'synopsis': 'Treinta y cinco años y la vida de Amy no ha resultado ser tal como la esperaba. Hasta hace poco, tenía un trabajo que le gustaba, un guapo e interesante novio y una familia con la que mantenía una relación estupenda. Y, en menos de un año, todo eso se ha ido al traste. Primero un despido, después, la cobarde huída de su novio ante la idea de un compromiso más serio y, como colofón a unos meses estupendos, la triste muerte de su madre. Ahora, mientras intenta recuperarse de la dolorosa pérdida y retomar su vida amorosa tras la ruptura, sufre la soledad de un mundo en el que hasta los platos de un menú son para dos. Viajes en pareja, descuentos para enamorados, ... ahora nada de eso es accesible para ella. Los hombres que ella tanto ansía nunca la llaman, y los que lo hacen, acaban siendo un completo fiasco.<br/>Para sobrellevar su nueva situación, Amy tendrá que ser paciente y comprender que el final feliz, para ella, tal vez tarde un poco más de lo planeado. Además, aún le quedan cosas por hacer. Todavía no sabe montar en bicicleta.<br/>Fresca, divertida y sobre todo real, La revolución de las treintañeras es la historia de Amy, y de cómo muchas cosas llegaron tarde para ella. Un libro irresistible, perfecto para las que nunca pierden la esperanza.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/76/47/9788489367647.jpg', 'title_long': 'La revolución de las treintañeras (Spanish Edition)', 'edition': 'Translation', 'dimensions': 'Height: 8.9 Inches, Length: 5.8 Inches, Weight: 0.75839018128 Pounds, Width: 0.7 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.8}, 'width': {'unit': 'inches', 'value': 0.7}, 'weight': {'unit': 'pounds', 'value': 0.75839018128}, 'height': {'unit': 'inches', 'value': 8.9}}, 'pages': 256, 'date_published': '2009-06-01', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Television Performers', 'Memoirs', 'Literature & Fiction', 'Genre Fiction', 'Contemporary', 'Parenting & Relationships'], 'authors': ['Amy Cohen'], 'title': 'La revolución de las treintañeras (Spanish Edition)', 'isbn13': '9788489367647', 'msrp': 18.38, 'binding': 'Paperback', 'isbn': '8489367647', 'isbn10': '8489367647'}}