{'book': {'publisher': 'Umbriel', 'synopsis': 'Product Description      Por primera vez en su vida, la detective Lindsay Boxer se sienta en el banquillo de los acusados. Un tiroteo en el que las cosas salieron mal, unas inoportunas copas de más, una jovencísima delincuente muerta, un muchacho condenado a una silla de ruedas... y la policía más famosa de San Francisco en el ojo del huracán. Acosada por los medios de comunicación, con el único apoyo de su abogada y de sus amigas Cindy y Claire, Lindsay busca descanso en el pequeño pueblecito rural de Half Moon Bay. Pero el crimen parece ir a buscarla allí donde esté. Privada de autoridad y fuera de su jurisdicción, en el peor momento posible, Lindsay se enfrenta a un grupo de asesinos despiadados que pronto la ponen en su punto de mira. James Patterson vuelve a demostrar por qué es uno de los autores de suspense con más éxito del momento, con esta nueva entrega de su serie protagonizada por el Club de las Mujeres contra el Crimen.      About the Author      Maxine Paetro is the author of three novels and two works of nonfiction and the coauthor of numerous books with James Patterson. She lives in New York with her husband.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/70/43/9788489367043.jpg', 'title_long': "El cuatro de julio (The Women's Murder Club) (Spanish Edition)", 'edition': 'Translation', 'dimensions': 'Height: 8.75 Inches, Length: 5.75 Inches, Weight: 0.94357848136 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.94357848136}, 'height': {'unit': 'inches', 'value': 8.75}}, 'pages': 320, 'date_published': '2006-05-15', 'subjects': ['Mystery, Thriller & Suspense', 'Mystery', 'Police Procedurals'], 'authors': ['James Patterson'], 'title': "El cuatro de julio (The Women's Murder Club) (Spanish Edition)", 'isbn13': '9788489367043', 'msrp': 18.38, 'binding': 'Paperback', 'isbn': '8489367043', 'isbn10': '8489367043'}}