{'book': {'publisher': 'Oniro', 'synopsis': 'Es maravilloso jugar con un niño o una niña de 1 a 2 anos, especialmente cuando sabemos que de este modo fomentamos a capacidad de aprender. Como continuacion de juegos para desarrollarla inteligencia del bebe, publicado dentro de esta coleccion, Jackie Silberg presenta ahora, con el mismo rigor y espiritu creativo, nuevas y atractivas propuestas para jugar con nuestros pequeños. Los juegos y actividades recogidos en este libro estimulan la creatividad, la coordinacion y la sociabilidad del niño o la niña, y al mismo tiempo pueden ayudarle a aprender a contar, a resolver problemas, a escuchar con atencion o a seguir instrucciones. A partir de su dilatada experiencia en el asesoramiento a padres y madres con ninos, la autora presenta desde juegos artisticos y musicales hasta actividades al aire libre, pasando por aquellos juegos que permiten disfrutar en el coche, en la cocina o a la hora de vestirse y desvestirse. Jackie Silberg es autora de numerosos libros sobre el desarrollo infantil y colabora regularmente en la revista Instructor, destinada a los maestros. Ademas, es profesora de ensenanza preescolar en la universidad norteamericana de Emporia (Kansas) y ha creado su propio programa de television. Con sus libros y su musica ha enseñando a miles de padres y maestros a hacer del aprendizaje una experiencia divertida.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/02/24/9788489920224.jpg', 'title_long': 'Juegos para desarrollar la inteligencia del niño de 1 a 2 años', 'dimensions': 'Height: 8.75 Inches, Length: 5.75 Inches, Weight: 1.05 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.05}, 'height': {'unit': 'inches', 'value': 8.75}}, 'pages': 284, 'date_published': '1998', 'subjects': ['Parenting & Relationships', 'Family Relationships', 'Motherhood', 'Parenting', 'Early Childhood', 'Reference', 'Foreign Language Study & Reference', 'Politics & Social Sciences', "Women's Studies"], 'authors': ['Jackie Silberg'], 'title': 'Juegos para desarrollar la inteligencia del niño de 1 a 2 años', 'isbn13': '9788489920224', 'msrp': 37.95, 'binding': 'Paperback', 'isbn': '8489920222', 'isbn10': '8489920222'}}