{'book': {'publisher': 'Books4pocket', 'synopsis': 'Las circunstancias vitales de Amaro Vieira le llevan a ordenarse sacerdote, mas como una solucion para escapar del hambre que por vocacion. Interiormente resentido por tratarse de su unica alternativa, pronto observa que los miembros de la Iglesia no practican lo que predican, y aprende como sacarle mayor provecho a su posicion. Este magistral relato carga contra la hipocresia y el cinismo de la Iglesia y la asfixiante sociedad provinciana del Portugal de finales del siglo XIX. / Eça de Queiros\'s novel, The Crime of Father Amaro is a lurid satire of clerical corruption in a town in Portugal (Leira) during the period before and after the 1871 Paris Commune. At the start, a priest physically explodes after a fish supper while guests at a birthday celebration are ""wildly dancing a polka."" Young Father Amaro (whose name means ""bitter"" in Portuguese) arrives in Leira and soon lusts afterand is lusted after bybudding Amelia, dewy-lipped, devout daughter of São Joaneira who has taken in Father Amaro as a lodger. What ensues is a secret love affair amidst a host of compelling minor characters: Canon Dias, glutton and São Joaneira\'s lover; Dona Maria da Assunção, a wealthy widow with a roomful of religious images, agog at any hint of sex; João Eduardo, repressed atheist, free-thinker and suitor to Amelia; Father Brito, ""the strongest and most stupid priest in the diocese;"" the administrator of the municipal council who spies at a neighbor\'s wife through binoculars for hours every day. Eça\'s incisive critique flies like a shattering mirror, jabbing everything from the hypocrisy of a rich and powerful Church, to the provincialism of men and women in Portuguese society of the time, to the ineptness of politics or science as antidotes to the town\'s ills. What lurks within Eça\'s narrative is a religion of tolerance, wisdom, and equality nearly forgotten. Margaret Jull Costa has rendered an exquisite translation and provides an informative introduction to a story that truly spans all ages.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/61/55/9788492516155.jpg', 'title_long': 'El crimen del padre Amaro (Spanish Edition)', 'edition': '1', 'dimensions': 'Height: 7.4 Inches, Length: 4.9 Inches, Weight: 0.9 Pounds, Width: 1.2 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.9}, 'width': {'unit': 'inches', 'value': 1.2}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 7.4}}, 'pages': 576, 'date_published': '2008-09-15', 'subjects': ['Literature & Fiction', 'Religion & Spirituality'], 'authors': ['Eça de Queirós'], 'title': 'El crimen del padre Amaro (Spanish Edition)', 'isbn13': '9788492516155', 'msrp': 15.95, 'binding': 'Paperback', 'isbn': '8492516151', 'isbn10': '8492516151'}}