{'book': {'publisher': 'Planeta Publishing', 'synopsis': 'Todos sentimos miedo cuando nos enfrentamos a un cambio o a determinadas situaciones laborales. Sin embargo, su sola mención en las empresas se considera tabú.<br/><br/>Aunque sólo los mensajes atractivos tienen cabida en los discursos empresariales, entre bastidores está la cruda realidad: presión por los resultados, luchas de poder, riesgo de despidos y, por supuesto, el miedo. Si este término le produce una cierta «urticaria intelectual», tal vez prefiera pensar en temor, ansiedad o estrés. Todas estas emociones tienen en común que se activan cuando percibimos amenazas y que nos hacen pagar un alto precio, en nuestra vida y en nuestro trabajo. NoMiedo nos propone dos desafíos. El primero consiste en liberarnos de la gran cadena del miedo: desarrollar todo nuestro potencial, a menudo encorsetado por nuestras propias inseguridades. El segundo, evitar la gestión basada en el miedo y optar por otra alternativa mucho más rentable: la basada en el talento, el cambio y la innovación.<br/><br/>El miedo ha sido el modelo clásico de gestión, sin embargo los éxitos del pasado no garantizan los del futuro. El futuro pertenece a quien sea capaz de crearlo, ya sea una empresa o una persona, siempre y cuando se atreva a romper las reglas de juego y a crecer sobre sí misma. Esta fantástica obra es un viaje por el NoMiedo que ayudará al lector a identificar y conquistar esta emoción tanto en su empresa como en su vida.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/59/00/9788493485900.jpg', 'title_long': 'No Miedo/ No Fear: En la empresa y en la vida/No fear at Work or in Life (Spanish Edition)', 'dimensions': 'Height: 8.4 Inches, Length: 5.5 Inches, Weight: 0.5952481074 Pounds, Width: 0.4 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.4}, 'weight': {'unit': 'pounds', 'value': 0.5952481074}, 'height': {'unit': 'inches', 'value': 8.4}}, 'pages': 168, 'date_published': '2006-03-30', 'subjects': ['Self-Help', 'Motivational', 'Business & Money', 'Economics', 'Commercial Policy', 'Management & Leadership'], 'authors': ['Pilar Jerico'], 'title': 'No Miedo/ No Fear: En la empresa y en la vida/No fear at Work or in Life (Spanish Edition)', 'isbn13': '9788493485900', 'msrp': 14.95, 'binding': 'Paperback', 'isbn': '849348590X', 'isbn10': '849348590X'}}