{'book': {'publisher': 'Plata', 'synopsis': 'Hollis Henry, ex cantante pop, ahora trabaja de periodista. Una revista poco común llamada Node le encarga a Hollis que localice a Bobby Chombo, un artista multimedia creador de un fascinante artilugio mezcla de GPS y generador de hologramas. El problema es que Bobby también hace algunos trabajos para los militares. Y por eso, nunca duerme dos veces en el mismo lugar. Y no quiere conocer a nadie. Mucho menos a Hollis.<br/>Tito, un cubano de raíces chinas, se dedica a delicadas y complejas operaciones de espionaje y transferencia de información. Ahora acaba de recibir una nueva misión, tan peligrosa que tendrá que dejar su casa, empezar una nueva vida en otra parte y posiblemente no volver a ver a su familia nunca más.<br/>Milgrim es un adicto a las drogas de diseño. Además, es un gran conocedor del idioma ruso. Milgrim está en manos de Brown, un hombre misterioso que lo tiene secuestrado y lo utiliza para sus propios fines; Milgrim no sabe cuáles son esos fines, pero sospecha que detrás hay intrincadas redes de espionaje militar.<br/>William Gibson, el padre del cyberpunk, conecta a todos estos personajes en una trama adictiva que es tanto el más fascinante de los tecno-thrillers como un revelador alegato sobre la vida en el vertiginoso, caótico e inquietante mundo de hoy.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/60/47/9788493696047.jpg', 'title_long': 'País de espías (Plata Negra) (Spanish Edition)', 'edition': 'Translation', 'dimensions': 'Height: 8.9 Inches, Length: 5.9 Inches, Weight: 1.11112980048 Pounds, Width: 1.1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.9}, 'width': {'unit': 'inches', 'value': 1.1}, 'weight': {'unit': 'pounds', 'value': 1.11112980048}, 'height': {'unit': 'inches', 'value': 8.9}}, 'pages': 384, 'date_published': '2009-10-26', 'subjects': ['Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Science Fiction & Fantasy', 'Science Fiction', 'Hard Science Fiction'], 'authors': ['William Gibson'], 'title': 'País de espías (Plata Negra) (Spanish Edition)', 'isbn13': '9788493696047', 'msrp': 22.95, 'binding': 'Paperback', 'isbn': '8493696048', 'isbn10': '8493696048'}}