{'book': {'publisher': 'Plata', 'synopsis': 'En este thriller hipnótico y perturbador, Thomas H. Cook recupera una de sus grandes obsesiones: los lazos de sangre como una maldición de la que resulta imposible escapar. Es precisamente el caso de David Sears, un abogado que aspira a llevar una vida normal para ahuyentar el recuerdo de su padre, enfermo de esquizofrenia. No obstante, todo se tuerce con el fallecimiento de su sobrino, que padecía el mismo mal. Y es que la hermana de David, Diana, no cree que se haya tratado de un accidente y culpa de la muerte a su ex marido.<br/>Lentamente, Diana se deja seducir por el mundo de la espiritualidad y del culto a Gaia, voces del pasado en las que cree encontrar la clave del caso. David, en cambio, sospecha que podría haber caído víctima del estigma de los Sears. Y muy pronto deberá tomar una terrible decisión: apoyar a su hermana o enfrentarse a ella para salvar su matrimonio y la salud mental de su propia hija.<br/>"Una novela sobrecogedora, inquietante, hermosamente escrita y llena de suspense." Joyce Carol Oates<br/>"Un ejercicio de virtuosismo." Publishers Weekly<br/>"Un thriller absorbente." New York Daily News', 'language': 'es', 'image': 'https://images.isbndb.com/covers/60/61/9788493696061.jpg', 'title_long': 'La nube del no saber (Plata Negra) (Spanish Edition)', 'edition': 'Translation, Reprint', 'dimensions': 'Height: 8.9 Inches, Length: 5.7 Inches, Weight: 0.84657508608 Pounds, Width: 0.9 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.7}, 'width': {'unit': 'inches', 'value': 0.9}, 'weight': {'unit': 'pounds', 'value': 0.84657508608}, 'height': {'unit': 'inches', 'value': 8.9}}, 'pages': 288, 'date_published': '2010-01-11', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'United States', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense'], 'authors': ['Thomas Cook'], 'title': 'La nube del no saber (Plata Negra) (Spanish Edition)', 'isbn13': '9788493696061', 'msrp': 24.88, 'binding': 'Paperback', 'isbn': '8493696064', 'isbn10': '8493696064'}}