{'book': {'publisher': 'Titania', 'synopsis': 'Cawdor es una pequeña y apartada comunidad rural, donde no tienen simpatía por los forasteros. Sobre todo si llegan como Jaye, una joven y atractiva publicista de Boston, haciendo preguntas incómodas y removiendo secretos que llevan treinta años dormidos. Historias de adolescentes muertas, de bebés vendidos y comprados como mercancía, de cadáveres incinerados en las profundidades del bosque, de silencios, de mentiras y de miedo. Para descubrir la verdad sobre su familia y para salvar la vida de su hermano enfermo, Jaye está dispuesta a enfrentarse a todos. Para ello cuenta con un inesperado aliado, el abogado Turner Gibson. La atracción entre ellos crece al mismo tiempo que el peligro que les rodea, pero ¿puede Jay fiarse de este hombre en un lugar en el que nadie es lo que parece?REMOVER EL PASADO ES MUY PELIGROSO...El mundo de Jaye parece derrumbarse en un instante cuando su madre le cuenta la verdad sobre su origen: tanto ella como su hermano Patrick fueron adoptados ilegalmente, comprados a sus jóvenes madres nada más nacer. Decidida a salvar la vida de Patrick, enfermo de leucemia, Jaye comienza una carrera contra reloj para descubrir quienes son sus verdaderas familias biológicas y encontrar un donante. Hay gente dispuesta a todo para evitar que aquel turbio asunto del pasado salga a la luz, pero Jaye no está sola: encuentra un hombre decidido y valiente con el que pronto compartirá riesgos, aventuras... y algo más.PORQUE NADIE ESTÁ LIBRE DE SECRETO...Turner Gibson es un abogado brillante, un experto en conseguir lo que quiere en un mundo donde se precisa tener muy pocos escrúpulos. Pero lo que empieza como un encargo más, encontrar al hijo perdido de un cliente, se transforma totalmente cuando forma equipo con Jaye, una joven que está realizando su propia y desesperada búsqueda. Cada día que pasa junto a ella, avanzando en una investigación llena de peligros, Turner se va sintiendo más y más atraído hacia esa mujer tenaz, valerosa e inteligente. Sería la compañera ideal para él, si tan sólo pudiera contarle toda la verdad...', 'language': 'es', 'image': 'https://images.isbndb.com/covers/24/51/9788495752451.jpg', 'title_long': 'Silencios y mentiras (Spanish Edition)', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.1464037624 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.1464037624}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 400, 'date_published': '2003-09-29', 'subjects': ['Literature & Fiction', 'Romance', 'Contemporary'], 'authors': ['Bethany Campbell'], 'title': 'Silencios y mentiras (Spanish Edition)', 'isbn13': '9788495752451', 'msrp': 19.95, 'binding': 'Paperback', 'isbn': '849575245X', 'isbn10': '849575245X'}}