{'book': {'publisher': 'Oniro', 'synopsis': 'Quinto volumen de la serie “experimentos sencillos”, dentro de la colección “El juego de la ciencia”. Con materiales de uso corriente puedes realizar sencillos y divertidos experimentos que te ayudarán a comprender mejor qué es el tiempo y cómo se mide. Aprenderás a fabricar un reloj de sol, de agua o de arena. Comprenderás el calendario y su relación con el Sol y la Luna. Incluso podrás construir un sencillo motor eléctrico a pilas que te revelará el funcionamiento de los relojes electrónicos. Estos experimentos sobre el tiempo no entrañan ningún peligro y no requieren el uso de sustancias ni materiales especiales. Son fáciles de realizar y están dirigidos a los niños que ya han alcanzado un nivel aceptable de lectura comprensiva, a partir de los 10 años. Dentro de esta nueva colección, de divulgación científica para niños, el quinto volumen, Experimentos sencillos sobre el tiempo, enseña a los niños la cronología de diversos calendarios, de los días nublados, de los relojes de sol, los mecánicos y los superrelojes, cómo se puede conocer la hora mediante las estrellas, qué son los husos horarios y la Línea Internacional de Cambio de Fecha, en qué consiste el efecto piezoeléctrico...', 'language': 'es', 'image': 'https://images.isbndb.com/covers/67/86/9788495456786.jpg', 'title_long': 'Experimentos sencillos sobre el tiempo / Simple Experiments on Time (Spanish Edition)', 'edition': 'First Edition', 'dimensions': 'Height: 8 Inches, Length: 5 Inches, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5}, 'width': {'unit': 'inches', 'value': 0.5}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 123, 'date_published': '2002', 'subjects': ["Children's Books"], 'authors': ['Muriel Mandell'], 'title': 'Experimentos sencillos sobre el tiempo / Simple Experiments on Time (Spanish Edition)', 'isbn13': '9788495456786', 'msrp': 3.95, 'binding': 'Paperback', 'isbn': '8495456788', 'isbn10': '8495456788'}}