{'book': {'publisher': 'Empresa Activa', 'synopsis': 'Pese a los cuantiosos recursos invertidos en investigación de mercado, casi un 80% de los nuevos productos fracasan. ¿Por qué? ¿Acaso los consumidores no saben lo que quieren?<br/>Gerald Zaltman investiga este rompecabezas y llega a la conclusión de que las herramientas de las que abusa el marketing -encuestas, entrevistas y dinámicas de grupo- y sus planteamientos tradicionales no consiguen profundizar lo suficiente para ayudar a los consumidores a descubrir y expresar lo que realmente quieren.<br/>En este libro, Zaltman argumenta que un 95% de lo que pensamos se sitúa en el inconsciente. Por lo tanto, sacar a la luz los deseos de nuestros clientes nos exige que comprendamos la "mente del mercado".<br/>Apoyándose en las investigaciones de disciplinas tan diversas como la neurología, la sociología, el análisis literario y la ciencia cognitiva, Zaltman señalan cómo interactúan la mente, el cerebro, el cuerpo y la sociedad cuando los consumidores analizan sus necesidades y evalúan los productos.<br/>El autor demuestra cómo las empresas líderes "explotan la mina del inconsciente" con resultados extraordinarios y presenta herramientas y técnicas innovadoras que ayudan a los profesionales a:<br/>- Formularse preguntas que apelen a la parte inconsciente del cerebro.<br/>- Medir las reacciones del consumidor a los estímulos de marketing y corregir sus estrategias.<br/>- Comprender cómo funciona su propia mente, y cómo pueden llegar a pensar de manera más creativa.<br/>La mente del mercado está esperando a que la exploren. Asegúrese de que sus competidores no lleguen antes.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/74/53/9788495787453.jpg', 'title_long': 'Cómo piensan los consumidores (Spanish Edition)', 'dimensions': 'Height: 9.25 Inches, Length: 6.5 Inches, Weight: 1.543235834 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.543235834}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 400, 'date_published': '2004-03-15', 'subjects': ['Business & Money', 'Economics', 'Commercial Policy', 'Marketing & Sales', 'Marketing', 'Reference', 'Catalogs & Directories', 'Writing, Research & Publishing Guides', 'Publishing & Books'], 'authors': ['Gerald Zaltman'], 'title': 'Cómo piensan los consumidores (Spanish Edition)', 'isbn13': '9788495787453', 'msrp': 21.95, 'binding': 'Hardcover', 'isbn': '8495787458', 'isbn10': '8495787458'}}