{'book': {'publisher': 'Porcia Pub Corp', 'synopsis': '¿Cómo es el cielo? El alma de un ser que acaba de fallecer nos cuenta desde el cielo sus impresionantes experiencias en el otro lado. El autor invisible explica cuál es el verdadero propósito de la vida y nos recomiendo que obtengamos el máximo provecho de nuestra estancia en la Tierra. El reino etérico está formado por ciudades celestiales que no sufren de limitaciones de tiempo ni de espacio como ocurre en la Tierra. Los que residimos en el reino etérico tenemos que llevar a cabo ciertas tareas, con frecuencia a favor del planeta Tierra o de otros sistemas donde hay vida. Asistimos a clases y tenemos lecciones que aprender. Disponemos de música, bibliotecas, salas de reuniones, lugares de oración y otras cosas. El reino etérico bulle de actividad Cuanto más tiempo paso en el retiro de Saint Germain, más difícil me resulta expresar con palabras su increíble talla espiritual. La preocupación que tiene por su rebaño rebasa con mucho cuanto uno pueda imaginar sobre la compasión o el amor de padre. Este libro completará la tarea que se me encomendó por orden y con el permiso de los maestros ascendidos. Esta historia real de la vida de un alma después de la muerte cambiará tu manera de mirar la vida… y la muerte.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/33/04/9788495513304.jpg', 'title_long': 'Mensajes Desde El Retiro De Saint Germain/messages from the Retirement of Saint Germain (Spanish Edition)', 'dimensions': 'Height: 7 Inches, Length: 4.5 Inches, Weight: 0.35 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.5}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.35}, 'height': {'unit': 'inches', 'value': 7}}, 'pages': 288, 'date_published': '2006', 'subjects': ['Religion & Spirituality', 'New Age & Spirituality', 'Politics & Social Sciences', 'Philosophy', 'Metaphysics'], 'authors': ['Patricia Kirmond'], 'title': 'Mensajes Desde El Retiro De Saint Germain/messages from the Retirement of Saint Germain (Spanish Edition)', 'isbn13': '9788495513304', 'msrp': 8.95, 'binding': 'Paperback', 'isbn': '8495513307', 'isbn10': '8495513307'}}