{'book': {'publisher': 'Punto De Lectura', 'synopsis': 'Pantaleón Pantoja, a recently promoted army captain, is entrusted with a top-secret mission to establish a prostitution service for the Armed Forces of Peru. As a faithful soldier, Pantaleón transfers to Iquitos in the middle of the jungle, to carry out his mission. His enthusiasm, however, endangers the very scheme he has put in motion. Thus begins this classic in Latin American literature, which was published in 1973 and later made into a film.<br/>Description in Spanish:<br/>Pantaleón Pantoja, un capitán del ejército recientemente ascendido, recibe la misión de establecer un servicio de prostitución para las Fuerzas Armadas del Perú en el más absoluto secreto militar. Estricto cumplidor del deber que le ha sido asignado, Pantaleón se traslada a Iquitos, en plena selva, para llevar a cabo su cometido, pero se entrega a esta misión con tal obcecación que termina por poner en peligro el engranaje que él mismo ha puesto en movimiento. Así arranca esta novela, publicada en 1973 y llevada posteriormente al cine. Mario Vargas Llosa utiliza esta anécdota para subrayar la hipocresía de las instituciones que se llaman ejemplares y del oficio más viejo del mundo. El eterno debate entre verdad y mentira, entre necesidad y virtud, y las perniciosas consecuencias que depara a veces la observancia rigurosa del deber son valores fundamentales de esta extraordinaria novela.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/10/28/9788495501028.jpg', 'title_long': 'Pantaleon y las Visitadoras (Spanish Edition)', 'dimensions': 'Height: 7 Inches, Length: 4.25 Inches, Weight: 0.75 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.75}, 'height': {'unit': 'inches', 'value': 7}}, 'pages': 400, 'date_published': '2002-12-01', 'subjects': ['Literature & Fiction', 'Short Stories & Anthologies', 'Short Stories'], 'authors': ['Mario Vargas Llosa'], 'title': 'Pantaleon y las Visitadoras (Spanish Edition)', 'isbn13': '9788495501028', 'msrp': 10.99, 'binding': 'Mass Market Paperback', 'isbn': '8495501023', 'isbn10': '8495501023'}}