{'book': {'publisher': 'Umbriel', 'synopsis': 'A los 28 años, Cannie Shapiro cree que su vida ha sido razonablemente feliz. Es una periodista de reconocido talento, a quien sus amigos consideran divertida e independiente. Quizá demasiado agobiada por "sus eternos problemas de peso" y los constantes conflictos con los hombres, está siempre dispuesta a ver el lado cómico de las cosas y es capaz de reaccionar con ironía frente a las situaciones más difíciles.<br/>Ese sentido del humor le permite aceptar con filosofía la separación temporal que, después de tres años de relación, le propone su novio Bruce.<br/><br/>Pero cuando ojea la revista femenina de moda y descubre un texto firmado por su anterior pareja, se siente destrozada por un artículo que considera una humillación pública.<br/>En su artículo, Bruce no solamente describe con todo detalle aspectos muy íntimos de su vida sexual, también se refiere claramente a las inseguridades de Cannie y a su constante batalla contra la báscula.<br/><br/>Herida y con la autoestima por los suelos, buscará consuelo en la ginebra y refugio en el afecto inquebrantable de su perro Nifkin.<br/>Pero Niflkin sólo puede ladrar para consolarle y las consecuencias de la ginebra no son lo que se dice muy recomendables. Así que Cannie decidirá que ha llegado el momento de dar un giro a su vida. ¿Hacia dónde?<br/><br/>Cuando una chica como Cannie se propone cambiar, las consecuencias son siempre imprevisibles.<br/>" Una historia original, ágil y divertida. Una lectura obligada para las mujeres que están preocupadas por conseguir la silueta ideal o conocen a alguien que lo está."<br/>Publishers Weekly', 'language': 'es', 'image': 'https://images.isbndb.com/covers/86/34/9788495618634.jpg', 'title_long': 'Bueno en la cama (Spanish and English Edition)', 'dimensions': 'Height: 8.75 Inches, Length: 5.75 Inches, Weight: 1.2235655541 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.2235655541}, 'height': {'unit': 'inches', 'value': 8.75}}, 'pages': 416, 'date_published': '2003-11-03', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Short Stories & Anthologies', 'Short Stories', "Women's Fiction", 'Contemporary', 'Romance'], 'authors': ['Jennifer Weiner'], 'title': 'Bueno en la cama (Spanish and English Edition)', 'isbn13': '9788495618634', 'msrp': 20.95, 'binding': 'Paperback', 'isbn': '849561863X', 'isbn10': '849561863X'}}