{'book': {'publisher': 'Umbriel', 'synopsis': 'En los hielos eternos del Ártico duerme el más fascinante descubrimiento de la historia de la humanidad... y también un intrigante juego de mentiras y engaños. Descubrir la verdad puede exigir un precio demasiado alto.<br/>La analista de inteligencia Rachel Sexton y el oceanógrafo Michael Tolland forman parte del equipo de expertos enviados por la Casa Blanca a un remoto lugar del Ártico, con la misión de autentificar el fabuloso hallazgo que ha realizado la NASA. Un descubrimiento que cambiará el curso de la historia y, de paso, asegurará al presidente su reelección. Sin embargo, una vez allí descubren indicios de que se enfrentan a un fraude científico de proporciones gigantescas. Aislados en el entorno más hostil del planeta, perseguidos por unos implacables asesinos equipados con los últimos adelantos tecnológicos, lucharán por salvar la vida y averiguar la verdad. Mientras tanto, en los pasillos de Washington se libra otra oscura batalla, un juego de traiciones y mentiras donde nadie es lo que parece.<br/>Dan Brown, autor de El Código da Vinci, combina de nuevo la acción trepidante con la más apasionante investigación, en una aventura llena de acción y enigmas científicos.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/88/25/9788495618825.jpg', 'title_long': 'La conspiración (Spanish Edition)', 'edition': 'Translation', 'dimensions': 'Height: 8.75 Inches, Length: 5.75 Inches, Weight: 1.9180216794 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 1.9180216794}, 'height': {'unit': 'inches', 'value': 8.75}}, 'pages': 608, 'date_published': '2005-05-13', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Political', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Thrillers & Suspense', 'Suspense', 'Supernatural'], 'authors': ['Dan Brown'], 'title': 'La conspiración (Spanish Edition)', 'isbn13': '9788495618825', 'msrp': 22.95, 'binding': 'Paperback', 'isbn': '8495618826', 'isbn10': '8495618826'}}