{'book': {'publisher': 'Oniro', 'synopsis': 'Este comprensible libro da respuesta a las preguntas más comunes que los padres suelen hacerse sobre la salud de sus hijos. Basado en investigaciones científicas y escrito por un equipo de prestigiosos pediatras, El de la salud de tu hijo ayudará a los padres en su difícil tarea de criar a los hijos. Con tablas y gráficos detallados, este libro esencial ofrece a los padres la información que necesitan en un lenguaje muy accesible. Los temas que se tratan incluyen: - información sobre el parto. - cómo elegir bien al médico del niño. - cómo enfrentarse a un bebé que no deja de llorar. - información sobre lactancia y alimentación infantil. - pautas para solucionar problemas de conducta y aprendizaje. - cómo tratar los resfriados y las fiebres. - cómo prevenir quemaduras y otros accidentes domésticos. El libro se completa con un extenso índice e información sobre primeros auxilios, por lo que constituye una herramienta básica en la biblioteca doméstica.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/60/45/9788495456045.jpg', 'title_long': "El De LA Salud De Tu Hijo : Todo Lo Que Los Padres Necesitan Saber Acerca De LA Salud De Sus Hijos / The 's Of Your Children's Health", 'dimensions': 'Height: 8.75 Inches, Length: 7.25 Inches, Weight: 1.2 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.2}, 'height': {'unit': 'inches', 'value': 8.75}}, 'pages': 263, 'date_published': '2000', 'subjects': ['Parenting & Relationships', 'Family Relationships', 'Motherhood', 'Parenting', 'Politics & Social Sciences', "Women's Studies"], 'authors': ['William Feldman'], 'title': "El De LA Salud De Tu Hijo : Todo Lo Que Los Padres Necesitan Saber Acerca De LA Salud De Sus Hijos / The 's Of Your Children's Health", 'isbn13': '9788495456045', 'msrp': 11.95, 'binding': 'Paperback', 'isbn': '8495456044', 'isbn10': '8495456044'}}