{'book': {'publisher': 'Titania', 'synopsis': 'Harrison Payne, La Sombra Oscura, está acostumbrado a correr riesgos, no en vano es el ladrón más famoso de Londres. Lo que no podía esperar es que aquella joven que le sorprendió en plena tarea apropiándose de las joyas de Lady Chadwick no sólo no se asustaría, sino que le ayudaría a escapar arriesgando su propia vida. Pronto descubre que Charlotte no es una muchacha cualquiera, sino una seductora mujer que guarda tantos secretos en su pasado como él mismo. Su breve encuentro ha servido para despertar en ambos una poderosa atracción, pero cuando vuelven a verse, Charlotte no tiene más opción que chantajear al ladrón como único medio de alejar el terrible peligro que se cierne sobre ella y su familia. Atrapados entre el deseo y el temor a confiar el uno en el otro, ambos se entregan a un peligroso juego...<br/>QUIEN ROBA A UN LADRÓN...<br/>Charlotte ha conocido el lado más cruel de la vida. Quizás por eso ahora dedica toda su energía a ayudar a los necesitados, los desheredados de las calles de Londres, a los que acoge en su casa de refugio para mujeres y niños. Ahora, uno de los fantasmas más negros de su pasado ha regresado y pone en peligro todo por lo que ha luchado. Pero el destino también ha puesto en su camino al único hombre que puede ayudarla: el ladrón más buscado de Londres. Para salvar a los suyos, está dispuesta a chantajearle con revelar su identidad secreta y obligarle a robar para ella, pero las cosas se complican cuando los sentimientos entran en juego.<br/>...PUEDE PERDER EL CORAZÓN<br/>Harrison piensa que se está haciendo demasiado viejo para saltar por los tejados en sus incursiones nocturnas como La Sombra Oscura. Sin embargo, todo había ido bien hasta esa desastrosa noche, cuando casi es capturado, le acusan injustamente de asesinato y le hieren gravemente. El único resultado positivo parece ser la providencial aparición de aquella belleza, una mujer singular en nada parecida a las superficiales jovencitas de la alta sociedad. Pero es precisamente ella la le pone en un peligro mortal cuando le amenaza con revelar su identidad secreta. Harrison no puede permitir que nadie saque a la luz su doble vida, ni las verdaderas razones que empujan a un aristócrata a convertirse en ladrón por las noches. Pero, al mismo tiempo, no puede evitar el deseo de convertir a aquella excepcional mujer en su botín más preciado.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/27/72/9788495752772.jpg', 'title_long': 'Mi ladrón favorito (Spanish Edition)', 'edition': 'Translation', 'dimensions': 'Height: 8.75 Inches, Length: 5.75 Inches, Weight: 0.9369646135 pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.9369646135}, 'height': {'unit': 'inches', 'value': 8.75}}, 'pages': 320, 'date_published': '2005-09-12', 'subjects': ['Romance', 'Contemporary', 'Historical'], 'authors': ['Karyn Monk'], 'title': 'Mi ladrón favorito (Spanish Edition)', 'isbn13': '9788495752772', 'msrp': 18.95, 'binding': 'Paperback', 'isbn': '8495752778', 'isbn10': '8495752778'}}