{'book': {'publisher': 'Roca Editorial', 'synopsis': 'Product Description      En esta recopilación de historias los narradores y el arte de la narración tienen el papel protagonista. Los meses, convertirod en personajes que hablan y se relacionan, intercambian opiniones en su reunión anual; un hombre medio devorado nos habla de cómo se hizo amigo de su querido caníbal; incluso Sherezade, la mayor contadora de historias de todos los tiempos recibe un homenaje. Además, otras historias nos sorprenden y cautivan: un misterioso circo que aterroriza al público con su asombrosa actuación antes de desaparecer en mitad de la noche y llevarse a una espectadora con ellos; en una Inglaterra victoriana un tanto extraña, Sherlock Holmes y su inseparable ayudante deben resolver el asesinato de un miembro de la familia real; los miembros de un exclusivo clup epicúreo, hastiados ya de haber probado todo lo imaginable, se van a Egipto para degustar el mítico pájaro del Sol, sin imaginar siquiera las consecuencias que traerá tamaño atrevimiento... Estos relato -varios de ellos merecedores de premio Hugo y Locus- conforman este extraordinario libro que nos sumerge en el universo particular de Neil Gaiman: tierno, gótico, infantil, fantástico, cargado de un oscuro sentido del humor y, sobre todo, de una imaginación fuera de lo común y un talento que lo convierten en un escritor excepcional.      Book Description      Neil Gaiman nos transporta a su universo a ratos terrorífico, a ratros tremendamente bello, y nos regala un nuevo punto de vista sobre el mundo, uno que sólo puede salir de la pluma de un creador único y original como él.      About the Author      Neil Gaiman nació en 1960 en Portchester (Reino Unido). Es escritor de ciencia ficción y fantasía, y guionista. Es conocido especialmente por la exitosa serie de novela gráfica The Sandman. Entre sus sus novelas están Los hijos de Anansi y Stardust.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/18/55/9788496791855.jpg', 'title_long': 'Objetos frágiles (Spanish Edition)', 'edition': 'Translation', 'dimensions': 'Height: 9.75 Inches, Length: 6.5 Inches, Weight: 1.7 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 1.7}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 448, 'date_published': '2008', 'subjects': ['Literature & Fiction', 'Short Stories & Anthologies', 'Anthologies', 'Short Stories', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense', 'Science Fiction & Fantasy', 'Fantasy'], 'authors': ['Neil Gaiman'], 'title': 'Objetos frágiles (Spanish Edition)', 'isbn13': '9788496791855', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '8496791858', 'isbn10': '8496791858'}}