{'book': {'publisher': 'Roca', 'synopsis': "Eragon y su dragona, Saphira, acaban de impedir que las poderosas fuerzas del rey Galbatorix, cruel regente del Imperio, destruyan para siempre al ejercito rebelde de los vardenos en Farthen Dur, la ciudad de la montana de los enanos. Pocos dias despues de la sangrienta batalla contra los urgalos, Eragon y Aspira tienen que viajar a Ellemera, el pais de los elfos para continuar con su formacion en la magia y en la lucha con la espada, las dos habilidades esenciales de los Jinetes del Dragon, para poder enfrentarse al malvado Rey. Los acompanara Arya, la elfa, y Orik, el enano, en un viaje plagado de descubrimientos y aventuras, con parajes fabulosos y nuevas amistades. Pero el caos y la traicion los acecharan sin descanso, y Eragon no sabra en quien confiar. Entre tanto, los sones inconfundibles de la guerra tienen en vilo el reino de Alagaesia. Las espadas se afilan y las nubes de oscuridad presagian terror y muerte. A Carcahall, cerca de las montanas Vertebradas, tambien llega el miedo: dos Razac han aparecido acompanados de un destacamento para capturar a Roran, el primo de Eragon. Roran tendra que huir, pero pronto se dara cuanta de que no es posible escapar siempre. Ademas, el deseo de vengar la muerte de su padre a manos de los Razac lo llevara a tomar una decision sin posibilidad de marcha atras. Podra la sombra oscura y poderosa del rey aplastar a la resistencia? Eragon no puede huir para siempre. / The land of Alagaesia is suffering under the Empire of the wicked Galbatorix, and Eragon and his dragon Saphira, last of the Riders, are the only hope. But Eragon is young and has much to learn, and so he is sent off to the elven forest city of Ellesmera, where he and Saphira are tutored in magic, battle skills, and the ancient language by the wise former Rider Oromis and his elderly dragon Glaedr. Meanwhile, back at Carvahall, Eragon's home, his cousin Roran is the target of a siege by the hideous Ra'zac, and he must lead the villagers on a desperate escape over the mountains. The two narratives move toward a massive battle with the forces of Galbatorix, where Eragon learns a shocking secret about his parentage and commits himself to saving his people.", 'language': 'es', 'image': 'https://images.isbndb.com/covers/40/79/9788496544079.jpg', 'title_long': 'Eldest (Spanish Edition)', 'edition': 'Translation', 'dimensions': 'Height: 8.5 Inches, Length: 5.5 Inches, Weight: 2.15 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 2.15}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 832, 'date_published': '2006-01-17', 'subjects': ['Literature & Fiction', 'Teen & Young Adult', 'Action & Adventure', 'Science Fiction & Fantasy', 'Fantasy', 'Science Fiction'], 'authors': ['Christopher Paolini'], 'title': 'Eldest (Spanish Edition)', 'isbn13': '9788496544079', 'msrp': 26.95, 'binding': 'Paperback', 'isbn': '8496544079', 'isbn10': '8496544079'}}