{'book': {'publisher': 'Roca', 'synopsis': 'A Gil Baleares -ex policía judicial mexicano e investigador privado de poca monta- lo único que le interesa es poder hacerse con un coche nuevo, un precioso modelo japonés, y librarse así definitivamente del viejo cacharro que se ve obligado a conducir. Por esta razón, acepta resolver el secuestro de Alicia del Moral, la joven hija del dueño de una fábrica de dulces. Los secuestradores que la retienen exigen a los padres una cantidad exorbitante de dinero y eso, sumado a la crueldad de las imágenes que han hecho llegar a la familia, no hace presagiar un final feliz. Sin embargo, Gil sigue tirando del hilo y descubriendo indicios hasta que toda la investigación se ve puesta en peligro por la intervención de la policía: por un lado están los corruptos, implicados en el secuestro y que intentan obstaculizar la labor de Gil; por otro, Marcial Oviedo de la policía judicial, quien quiere aprovecharse de Gil y llevarse la gloria de la resolución del caso. Y en medio de este cuadro, está el padre de Baleares, Ángel El Perro Baleares, ex policía judicial, leyenda mítica del turbio mundillo de la corrupción policíaca de los años setenta en el DF, y ahora enfermo de alzheimer, un personaje disparatado a la vez que extrañamente cuerdo. Gil se verá, en más de una ocasión, cruzando el camino donde la justicia y la corrupción pierden fronteras, y poniendo en peligro su integridad física, amenazada por la aterradora ley garrote.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/49/56/9788496544956.jpg', 'title_long': 'LEY GARROTE (Spanish Edition)', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 207, 'date_published': '2007', 'subjects': ['Literature & Fiction', 'Mystery, Thriller & Suspense', 'Mystery', 'Police Procedurals', 'Thrillers & Suspense', 'Supernatural'], 'authors': ['joaquin Guerrero Casasola'], 'title': 'LEY GARROTE (Spanish Edition)', 'isbn13': '9788496544956', 'msrp': 20.95, 'binding': 'Hardcover', 'isbn': '8496544958', 'isbn10': '8496544958'}}