{'book': {'publisher': 'Terciopelo', 'synopsis': 'El viene a ella mas muerto que vivo, una torre de velos negros revestida de pliegues, acribillado a balazos y perdiendo rapidamente la sangre. Mientras ella lucha para salvarlo, Tess Culver veterinaria- no tiene conocimiento de que el hombre llamando Dante no es humano, sino uno de la Raza de vampiros guerreros que participan en una desesperada batalla. En un solo momento cargado de erotismo Tess esta sumida en su mundo -un desplazamiento cambiante de sombras donde las bandas de vampiros Rogue acechan la noche, cortando una faja de terror. Atormentado por visiones de un futuro oscuro, Dante vive y lucha como si no hubiese un dia despues. Tess es una complicacion que no el no necesita -pero ahora, con sus hermanos bajo ataque, debera Tess escudo de una amenaza cada vez mayor que incluye el propio Dante. Para con un temerario, irresistible beso, ella se ha convertido en una parte inextricable de su reino subterraneo y su toque despierte a sus dones ocultos, deseos, ansias que ella nunca supo que poseia. Unidos por la sangre, Dante y Tess deben trabajar juntos para frustrar mortales enemigos, aun cuando descubren una pasion que trasciende los limites de la propia vida / He comes to her more dead than alive, a towering black-clad stranger riddled with bullets and rapidly losing blood. As she struggles to save him, veterinarian Tess Culver is unaware that the man calling himself Dante is no man at all, but one of the Breed, vampire warriors engaged in a desperate battle. In a single erotically charged moment Tess is plunged into his worlda shifting, shadowed place where bands of Rogue vampires stalk the night, cutting a swath of terror. Haunted by visions of a dark future, Dante lives and fights like there is no tomorrow. Tess is a complication he does not needbut now, with his brethren under attack, he must shield Tess from a growing threat that includes Dante himself. For with one reckless, irresistible kiss, she has become an inextricable part of his underworld realmand his touch awakens her to hidden gifts, desires, and hungers she never knew she possessed. Bonded by blood, Dante and Tess must work together to thwart deadly enemies, even as they discover a passion that transcends the boundaries of life itself', 'language': 'es', 'image': 'https://images.isbndb.com/covers/59/50/9788496575950.jpg', 'title_long': 'El beso carmesí (Raza De Medianoche, 2) (Spanish Edition)', 'edition': 'Tra', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.48 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.48}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 336, 'date_published': '2008-10-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Gothic', 'United States', 'Romance', 'Fantasy'], 'authors': ['Lara Adrian'], 'title': 'El beso carmesí (Raza De Medianoche, 2) (Spanish Edition)', 'isbn13': '9788496575950', 'msrp': 19.35, 'binding': 'Paperback', 'isbn': '8496575950', 'isbn10': '8496575950'}}