{'book': {'publisher': 'ZETA BOLSILLO', 'synopsis': 'Basándose en una historia real, John Grisham se adentra en la vida de un hombre condenado injustamente a la pena de muerte: Ronald Keith Williamson, acusado del asesinato de una mujer. Tras doce años de prisión, sus abogados lograron demostrar su inocencia cinco días antes de la fecha en que debía ser ajusticiado. / In the town of Ada, Oklahoma, Ron Williamson was going to be the next Mickey Mantle. But on his way to the Big Leagues, Ron stumbled, his dreams broken by drinking, drugs, and women. Then, on a winter night in 1982, not far from Rons home, a young cocktail waitress named Debra Sue Carter was savagely murdered. The investigation led nowhere. Until, on the flimsiest evidence, it led to Ron Williamson. The washed-up small-town hero was charged, tried, and sentenced to deathin a trial littered with lying witnesses and tainted evidence that would shatter a mans already broken lifeand let a true killer go free. Impeccably researched, grippingly told, filled with eleventh-hour drama, John Grishams first work of nonfiction reads like a page-turning legal thriller. It is a book that will terrify anyone who believes in the presumption of innocencea book no American can afford to miss.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/82/14/9788496778214.jpg', 'title_long': 'EL PROYECTO WILLIAMSON (Spanish Edition)', 'edition': '00001', 'dimensions': 'Height: 7.874 Inches, Length: 4.92125 Inches, Weight: 0.71429772888 Pounds, Width: 0.94488 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.92125}, 'width': {'unit': 'inches', 'value': 0.94488}, 'weight': {'unit': 'pounds', 'value': 0.71429772888}, 'height': {'unit': 'inches', 'value': 7.874}}, 'pages': 416, 'date_published': '2008-10-15', 'subjects': ['Biographies & Memoirs', 'True Crime', 'Murder & Mayhem', 'Literature & Fiction', 'Genre Fiction', 'Politics & Social Sciences', 'Social Sciences', 'Criminology'], 'authors': ['John Grisham'], 'title': 'EL PROYECTO WILLIAMSON (Spanish Edition)', 'isbn13': '9788496778214', 'msrp': 13.95, 'binding': 'Paperback', 'isbn': '8496778215', 'isbn10': '8496778215'}}