{'book': {'publisher': 'Thule Ediciones', 'synopsis': "The situation at Little Bear's house is tough: his father doesn't have a job and there is no money left to buy Christmas presents. But Little Bear doesn't stop believing in Santa Claus and, sure enough, on Christmas day there is a present under the tree for each member of the family. Inside each gift, they discover a cherished item they thought was lost, but then they find suspicious clues around the tree. Readers can track and follow the clues in the detailed illustrations along with Little Bear's family to solve the mystery.<br/><br/>La situación en casa de Osito es difícil: su padre no tiene trabajo y no queda dinero para comprar los regalos de Navidad. Pero Osito no deja de confiar en Papá Noel y cuando llega el día de Navidad hay un paquete para cada miembro de la familia bajo el árbol. Al abrirlo cada uno descubrirá un viejo y querido objeto que había perdido. Alrededor del árbol hay unas pisadas sospechosas: Los lectores, dejándose guiar por las pistas que el autor ha dejado en las ilustraciones detalladas, descubren el misterio al mismo tiempo que la familia de Osito.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/35/08/9788496473508.jpg', 'title_long': 'La mejor Navidad', 'edition': 'Translation', 'dimensions': 'Height: 9 Inches, Length: 7.5 Inches, Weight: 0.7826410301 Pounds, Width: 0.43 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.5}, 'width': {'unit': 'inches', 'value': 0.43}, 'weight': {'unit': 'pounds', 'value': 0.7826410301}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 36, 'date_published': '2007-10-01', 'subjects': ["Children's Books", 'Animals', 'Bears', 'Literature & Fiction', 'Holidays & Celebrations', 'Christmas', 'Geography & Cultures', 'Reference', 'Foreign Language Study & Reference'], 'authors': ['Chih-Yuan Chen'], 'title': 'La mejor Navidad', 'isbn13': '9788496473508', 'msrp': 14.95, 'binding': 'Hardcover', 'isbn': '8496473503', 'isbn10': '8496473503'}}