{'book': {'publisher': 'Roca Editorial', 'synopsis': "Eragon i la seva dragona, Saphira, acaben d'impedir que les poderoses forces del rei Galbatorix, el cruel regent de l'Imperi, destrueixin per sempre l'exèrcit rebel dels vardens a Farthen Dûr, la ciutat muntanya dels nans. Pocs dies després de la cruel batalla amb els urgals, Eragon i Saphira hauran de viatjar fins a Ellesméra, al país dels elfs, per continuar la seva formació en la màgia i en la lluita amb espases, les habilitats especials dels Genets de Drac, per poder-se enfrontar al malvat rei. Els acompanyaran Arya, l'elfa, i Orik, el nan. Serà un viatge ple de descobertes i d'aventures, amb paratges fabulosos i noves coneixences. Però el caos i la traïció el sotjaran tothora, i Eragon no sabrà en qui confiar. Mentrestant, els sons inconfusibles de la guerra somouen tot el regne d'Alagaësia. Les espases s'afilen i els núvols de foscor presagien terror i mort. A Carvahall, prop de les muntanyes Vertebrades, també arriba la por: dos Ra'zac han aparegut amb un destacament per capturar Roran, el cosí d'Eragon. Roran haurà de fugir, però aviat s'adonarà que no podrà escapar-se sempre. A més, el desig de venjar la mort del seu pare a mans dels Ra'zac el durà a prendre una decisió que no tindrà marxa enrere. Podrà l'ombra fosca i poderosa del rei esclafar la resistència? Eragon no podrà fugir sempre...", 'language': 'es', 'image': 'https://images.isbndb.com/covers/49/68/9788496284968.jpg', 'title_long': 'Eldest (The Inheritance Cycle, 2) (Spanish Edition)', 'edition': 'Translation', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 2.4 Pounds, Width: 1.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.75}, 'weight': {'unit': 'pounds', 'value': 2.4}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 831, 'date_published': '2010-10-04', 'subjects': ['Literature & Fiction', 'Teen & Young Adult', 'Action & Adventure', 'Science Fiction & Fantasy', 'Fantasy', 'Science Fiction'], 'authors': ['Christopher Paolini'], 'title': 'Eldest (The Inheritance Cycle, 2) (Spanish Edition)', 'isbn13': '9788496284968', 'msrp': 22.95, 'binding': 'Hardcover', 'isbn': '8496284964', 'isbn10': '8496284964'}}