{'book': {'publisher': 'Editorial Sirpus', 'synopsis': 'Esta es la historia de Guidxa, un joven que vivía en un pueblo del istmo de Tehuantepec. Era el más pequeño de la familia y, entre otras cualidades que tenía, destacaba por su sencillez y nobleza, tanta que todos se reían de él. El día que su padre decide confiar en el mayor de sus tres hijos para que repartiera la herencia, los hermanos de Guidxa deciden engañarlo y despojarlo de todo, salvo de una vieja y flaca vaca. Con el poco dinero que tenía y llevando consigo la piel del viejo animal, decide empezar un viaje para recorrer mundo. Mientras viajaba por diversos pueblos, encontró un caballo muerto dentro del cual picoteaban los zopilotes y tuvo la idea de tapar el hueco del animal con la piel de vaca. Así fue como, al sentirse encerrados, los pájaros levantaron vuelo elevando al caballo con el muchacho montado en él. Todo el pueblo admiró su cabalgadura voladora y un rico hacendado se la compró. Los envidiosos hermanos mataron a sus vacas para vender la piel, pero volvieron arruinados. Guidxa los ayudó y siguió andando por los caminos, visitando lugares y conociendo personas, ya que para él lo único importante era su libertad. El cuento de Guidxa es una historia llena de fantasía que acostumbraban a contar los abuelos originarios de Chicapa de Castro, un pequeño pueblo de la región del istmo de Tehuantepec. Aunque no es muy conocida, la fuerza de esta historia ha llegado a varias generaciones. De la tradición oral los autores la han pasado al lenguaje escrito y al gráfico. Las ilustraciones están llenas de matices, de trazo firme, con rostros de hombres y mujeres con experiencia, de esa que se adquiere con el tiempo. La autora escuchó éste y otros cuentos de boca de su padre a la luz de la luna y las estrellas, hace más de veinticinco años y Guidxa era el que más le gustaba, tal vez porque se refería a su gente, a su lengua zapoteca, a su cultura, o bien simplemente porque el personaje era admirable.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/31/70/9788496483170.jpg', 'title_long': 'GUIDXA (Inglés-Español): Un cuento del istmo de Tehuantepec (Spanish and English Edition)', 'edition': '1', 'dimensions': 'Height: 8.2677 Inches, Length: 10.6299 Inches, Weight: 0.8157103694 Pounds, Width: 0.3937 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 10.6299}, 'width': {'unit': 'inches', 'value': 0.3937}, 'weight': {'unit': 'pounds', 'value': 0.8157103694}, 'height': {'unit': 'inches', 'value': 8.2677}}, 'pages': 48, 'date_published': '2006-11-15', 'subjects': ["Children's Books", 'Education & Reference', 'Activities, Crafts & Games', 'Interactive Adventures'], 'authors': ['Liliana Aquino'], 'title': 'GUIDXA (Inglés-Español): Un cuento del istmo de Tehuantepec (Spanish and English Edition)', 'isbn13': '9788496483170', 'msrp': 13.99, 'binding': 'Hardcover', 'isbn': '8496483177', 'isbn10': '8496483177'}}