{'book': {'publisher': 'Ediciones Nowtilus', 'synopsis': 'About the Author      Juan Andrés Galán Calles nació en Guadramiro, Salamanca. Después de terminar sus estudios marchó a Roma, Italia, donde estudió dirección cinematográfica, para posteriormente trasladarse a Hollywood donde trabaja como guionista y director de diferentes series de televisión, documentales y films. Es autor de otras novelas como Skywatch, Memorias de un Extraterrestre, Bienvenido Señor Cura, Exstinctione y La habitación del Segundo Piso. Normalmente suele compartir su tiempo entre California, USA y Palencia, España. Lugar donde le encanta vivir en compañía de sus familiares y amigos.      Product Description      Las aguas del Caribe serán el escenario de una sangrienta batalla entre el pirata español Tiburón Rojo que, para escapar de la horca, debe vencer a cinco naves británicas.Tiburón rojo narra el enfrentamiento del pirata del mismo nombre con Drook, el terrible corsario al servicio de la corona inglesa. La isla de Auruga y la hegemonía imperial española en el Caribe se ve amenazada por Drook, que al mando de cinco naves y ciento ochenta hombres pretende hacerse con el control marítimo e insular. El Gobernador de Auruga sólo tiene una salida, capturar a Tiburón rojo, el terrible pirata español y darle dos opciones: enfrentarse a los ingleses o enfrentarse a la horca. Lo que el Gobernador no podía prever es que en esta contienda él se jugaría mucho más que su isla.Con estos elementos teje Juan Andrés Galán una historia de aventuras, batallas navales, galeones, corsarios y piratas en la línea de Stevenson, donde además el amor, la amistad y la traición jugarán también un papel fundamental y llevará a los personajes de un lado a otro como las velas de un galeón al viento. Una auténtica epopeya naval, en donde la intriga y el lenguaje, atraparán al lector.Razones para comprar la obra:- El argumento de la novela mezcla batallas navales con una historia de amor y aventuras y también con valiosos datos sobre el Caribe de la época.- La novela relata, de primera mano, usando el recurso del diario encontrado, las aventuras de un pirata español que vence a los barcos ingleses, cuando tradicionalmente se nos ha dicho lo contrario.- La acción es trepidante y en cada página el escritor nos lleva a desear pasar a la siguiente, además, el tamaño y la concreción de los capítulos se ajustan a cualquier tipo de lectura.- El lenguaje es sencillo y la obra está escrita de un modo completamente cinematográfico por lo que el lector puede sentir como las imágenes cobran vida ante él.El exotismo de la Isla de la Iguana, de Juncosa o de la Isla del Diablo enmarcan el relato de una batalla en la que arderán velas y navío y las cálidas aguas del Caribe se teñirán, nuevamente, de sangre.?El libro es ameno, bien escrito y la historia engancha, que en un par de días tienes que terminarlo para conocer como acaba.? (Blog ue leo hoy)?Así, partiendo de un entorno real, el autor crea una serie de personajes de ficción para ilustrar una etapa especialmente conflictiva en el Caribe, cuando los barcos españoles, cargados de riquezas del Nuevo Mundo, eran asaltados por los corsarios ingleses.? (Web Anika entre libros)      From the Back Cover      In November of 1577, the famous and feared Spanish pirate, Red Shark, is captured by soldiers of the Spanish Crown and taken along with his men to the prison on the island of Auruga. The governor of the island offers him two options. The first: hanging. The second: save his life and that of his men by agreeing to face the Captain Williams Drook, who has been sent by Queen Elizabeth I of England to sail towards the Caribbean in order to assault as many Spanish ships and ports in his path as he can', 'language': 'es', 'image': 'https://images.isbndb.com/covers/52/95/9788497635295.jpg', 'title_long': 'Tiburón Rojo (Spanish Edition)', 'edition': '1', 'dimensions': 'Height: 10 Inches, Length: 6.5 Inches, Weight: 1.7196056436 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.7196056436}, 'height': {'unit': 'inches', 'value': 10}}, 'pages': 352, 'date_published': '2008-06-01', 'subjects': ['Literature & Fiction', 'Action & Adventure', 'Mystery, Thriller & Suspense', 'Short Stories', 'Mystery'], 'authors': ['Juan Andrés Galán Calles'], 'title': 'Tiburón Rojo (Spanish Edition)', 'isbn13': '9788497635295', 'msrp': 17.95, 'binding': 'Paperback', 'isbn': '8497635299', 'isbn10': '8497635299'}}