{'book': {'publisher': 'Debolsillo', 'synopsis': 'Esta es la historia de Saleem Sinai, nacido en Bombay al filo de la medianoche del 15 de agosto de 1947, en el momento mismo en que la India, entre fuegos artificiales y multitudes, alcanza su independencia.<br/><br/>El destino de Saleem queda inexorablemente unido al de su país, y sus peripecias personales reflejarán siempre la evolución política de la India o serán reflejadas por ella. Hijos de la medianoche es una asombrosa novela que combina magistralmente magia y humor, compromiso político, fantasía y humanidad.<br/><br/>La crítica ha dicho...<br/><br/>Una de las grandes novelas del siglo. -ABC<br/><br/>Salman Rushdie se ha ganado el derecho de ser designado uno de nuestros mayores narradores. -The Observer<br/><br/>Hijos de la medianoche vuelve a trazar el mapa literario de la India. Suena como un país encontrando su voz propia. -The New York Times<br/><br/>ENGLISH DESCRIPTION<br/><br/>Selected by the Modern Library as one of the 100 best novels of all time<br/><br/>Winner of the Booker of Bookers<br/><br/>Saleem Sinai is born at the stroke of midnight on August 15, 1947, the very moment of India\'s independence. Greeted by fireworks displays, cheering crowds, and Prime Minister Nehru himself, Saleem grows up to learn the ominous consequences of this coincidence. His every act is mirrored and magnified in events that sway the course of national affairs; his health and well-being are inextricably bound to those of his nation; his life is inseparable, at times indistinguishable, from the history of his country. Perhaps most remarkable are the telepathic powers linking him with India\'s 1,000 other "midnight\'s children," all born in that initial hour and endowed with magical gifts.<br/><br/>This novel is at once a fascinating family saga and an astonishing evocation of a vast land and its people–a brilliant incarnation of the universal human comedy. Twenty-five years after its publication, Midnight\' s Children stands apart as both an epochal work of fiction and a brilliant performance by one of the great literary voices of our time.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/43/29/9788497934329.jpg', 'title_long': "Hijos de la medianoche / Midnight's Children (Spanish Edition)", 'edition': '005', 'dimensions': 'Height: 7.5 Inches, Length: 4.9 Inches, Weight: 1.30954583628 Pounds, Width: 1.4 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.9}, 'width': {'unit': 'inches', 'value': 1.4}, 'weight': {'unit': 'pounds', 'value': 1.30954583628}, 'height': {'unit': 'inches', 'value': 7.5}}, 'pages': 800, 'date_published': '2016-08-30', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'History & Criticism', 'Criticism & Theory', 'United States', 'Contemporary', 'Literary'], 'authors': ['Salman Rushdie'], 'title': "Hijos de la medianoche / Midnight's Children (Spanish Edition)", 'isbn13': '9788497934329', 'msrp': 13.95, 'binding': 'Mass Market Paperback', 'isbn': '8497934326', 'isbn10': '8497934326'}}