{'book': {'publisher': 'Amat', 'synopsis': 'Durante mucho tiempo un tema tabú, la mera mención de la palabra próstata es suficiente para que los hombres se encojan de miedo. ¿Se debe ello a que la próstata puede ocasionar más angustia, más deterioro emocional, más amargura y rabia que cualquier otra parte de su anatomía? ¿Es miedo, vergüenza, ignorancia referida a una glándula del tamaño de una nuez? Cualquiera que sea la razón, algunos individuos están más inclinados a ignorar los problemas potenciales de la próstata que a buscar la recomendación del médico. En La Próstata, el eminente urólogo Yosh Taguchi aborda los problemas, tratamientos, y preguntas más frecuentes sobre la próstata en un lenguaje claro y sincero. Los varones y sus parejas aprenderán sobre: La anatomía y función de la próstata. La hiperplasia benigna de próstata (HBP), la prostatitis y el cáncer. Las alternativas de tipo quirúrgico, incluyendo la prostatectomía radical que conserva el vigor sexual. Las alternativas de tipo médico, incluyendo de los medicamentos y las dosis aconsejables. La terapia térmica y la crioterapia. Las medidas de tipo preventivo. El control del dolor. Con su planteamiento exhaustivo y de gran sensibilidad, La Próstata debería ser de lectura obligatoria para cualquier individuo preocupado por su salud. Yosh Taguchi, ejerce como urólogo en el Royal Victoria Hospital de Montreal, y fue Director del Programa de Urología en la Universidad de McGill.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/09/21/9788497350921.jpg', 'title_long': 'La próstata: Síntomas, diagnóstico, tratamientos y prevención (Spanish Edition)', 'edition': '3', 'dimensions': 'Height: 9.25 Inches, Length: 6.5 Inches, Weight: 0.7936641432 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.7936641432}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 224, 'date_published': '2003-06-13', 'subjects': ['Health, Fitness & Dieting', 'Diseases & Physical Ailments', 'Cancer', 'Aging', "Men's Health", 'Science & Math', 'Biological Sciences', 'Anatomy'], 'authors': ['Yosh Taguchi'], 'title': 'La próstata: Síntomas, diagnóstico, tratamientos y prevención (Spanish Edition)', 'isbn13': '9788497350921', 'msrp': 29.12, 'binding': 'Paperback', 'isbn': '8497350928', 'isbn10': '8497350928'}}