{'book': {'publisher': 'Amat', 'synopsis': 'Las discusiones sobre el dinero son el primer motivo de divorcio. David Bach, asesor financiero de gran prestigio, sabe que no hay que seguir este camino. Ha asesorado a millones de personas sobre sus finanzas a través de seminarios, libros, programas de televisión, y ha ayudado a miles de parejas a superar sus problemas económicos. Con este libro quiere acercar sus consejos a todas las personas que quieran navegar por las aguas complicadas de las finanzas familiares. Para ello, ayuda a las parejas a trabajar conjuntamente en sus finanzas como un equipo. Sus herramientas y consejos fáciles de aplicar incluyen: Acabar con los mitos sobre las parejas y el dinero Cómo conseguir lo mejor de los bancos y las compañías de seguros Hacer realidad los objetivos y los sueños de las familias Cómo evitar las discusiones sobre temas económicos Cómo ahorrar e invertir adecuadamente Este libro, es un salvavidas financiero que ayudará a las parejas de cualquier edad y en cualquier situación económica a comunicarse sobre el dinero con comodidad y a empezar a crearse un futuro financiero estable conjuntamente.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/00/99/9788497350099.jpg', 'title_long': 'Finanzas familiares: Cómo conseguir seguridad financiera y alcanzar sus sueños. (Spanish Edition)', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6.5 Inches, Weight: 0.81130112416 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.81130112416}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 252, 'date_published': '2002-01-22', 'subjects': ['Business & Money', 'Personal Finance', 'Budgeting & Money Management'], 'authors': ['David Bach'], 'title': 'Finanzas familiares: Cómo conseguir seguridad financiera y alcanzar sus sueños. (Spanish Edition)', 'isbn13': '9788497350099', 'msrp': 22.95, 'binding': 'Paperback', 'isbn': '849735009X', 'isbn10': '849735009X'}}