{'book': {'publisher': 'DEBOLSILLO', 'synopsis': 'La alocada Rachel protagoniza esta segunda novela de la saga de la inolvidable «Familia Walsh».<br/>Rachel es una entusiasta consumidora de drogas «recreativas». Según ella, no por adicción sino por pasatiempo. Al fin y al cabo, hoy día, ¿quién no toma de vez en cuando un ácido, una raya o unas pocas pastillas? ¿Qué mejor para olvidar las tensiones del trabajo y disfrutar un rato de la vida?<br/>Pero, en una de esas, se le va la mano, y tras una noche de excesos se atiborra de tranquilizantes para dormir a pierna suelta y empezar fresca una nueva jornada laboral. Para su sorpresa, a la mañana siguiente no despierta en su habitación sino en la cama de un hospital, después de un lavado de estómago y a punto para ingresar una temporada en una peculiar clínica de rehabilitación...<br/>Los lectores han dicho...<br/>«En este libro Marian Keyes, nos ofrece una visión de la adicción, cruel y realista, con su dosis amarga de humor y de reírse de si misma»<br/>«De esos libros que, cuando terminan, los dejas con pena, queriendo más»<br/>«Lo recomiendo si te gustan las historias de gente normal y corriente que puede llegar a hacer cosas extraordinarias»<br/>«Marian Keyes nos ofrece un relato de superación personal cargado de diversión, sexo, sarcasmo, momentos para el recuerdo y un final precioso que hacen de Rachel se va de viaje una lectura original, amena y muy recomendable»', 'language': 'es', 'image': 'https://images.isbndb.com/covers/91/77/9788497599177.jpg', 'title_long': 'Rachel se va de viaje (Hermanas Walsh 2) (Best Seller) (Spanish Edition)', 'edition': '001', 'dimensions': 'Height: 7.4803 Inches, Length: 4.92125 Inches, Weight: 0.93255536826 Pounds, Width: 1.41732 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.92125}, 'width': {'unit': 'inches', 'value': 1.41732}, 'weight': {'unit': 'pounds', 'value': 0.93255536826}, 'height': {'unit': 'inches', 'value': 7.4803}}, 'pages': 608, 'date_published': '2003-09-29', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Urban Life', 'Family Life', 'Feel-Good', 'World Literature', 'European', 'Humor & Satire', 'Humorous', 'Romance', 'Contemporary', 'Romantic Comedy'], 'authors': ['Marian Keyes'], 'title': 'Rachel se va de viaje (Hermanas Walsh 2) (Best Seller) (Spanish Edition)', 'isbn13': '9788497599177', 'msrp': 12.95, 'binding': 'Mass Market Paperback', 'isbn': '8497599179', 'isbn10': '8497599179'}}