{'book': {'publisher': 'Oniro', 'synopsis': 'El presente libro se hace eco de un principio existente y de eficacia probada desde hace miles de años en las tradiciones religiosas y éticas de la humanidad: lo que no quieras que te hagan a ti, no se lo hagas tú a nadie. O dicho en términos positivos: obra con los demás como quisieras que obrasen contigo. Ésa debería ser la norma para todos los ámbitos de la vida, para la familia y para todos los colectivos, para las razas, las naciones y las religiones. Los adultos querríamos que los niños emprendieran su peripecia vital bien equipados, habiendo aprendido de nosotros, entre otras muchas cosas, lo que realmente cuenta en la vida, es decir, valores como la sinceridad, el pacifismo o la tolerancia. Para que esta educación no se quede únicamente en buenas intenciones, hay que integrarla en la vida cotidiana, de una manera concreta. Un punto ha destacado especialmente a lo largo de la práctica profesional de la autora: no se enseña hablando, sino a través del propio ejemplo y de las propias acciones. Las propuestas de este libro versan sobre los cinco valores fundamentales: la verdad, el amor, las buenas acciones, la paz y la no violencia. La autora nos demuestra que los niños pueden irlos adquiriendo de manera natural, si los encuentran constantemente en su vida cotidiana.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/14/66/9788497541466.jpg', 'title_long': "Descubrir valores a los ninos/Discovering children's values (Spanish Edition)", 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 0.9 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 256, 'date_published': '2014', 'subjects': ['Parenting & Relationships', 'Parenting', 'Early Childhood'], 'authors': ['Susanne Stocklin-Meier'], 'title': "Descubrir valores a los ninos/Discovering children's values (Spanish Edition)", 'isbn13': '9788497541466', 'msrp': 8.95, 'binding': 'Paperback', 'isbn': '8497541464', 'isbn10': '8497541464'}}