{'book': {'publisher': 'Ediciones Nowtilus', 'synopsis': "Product Description      ?Las causas del dolor de cabeza pueden ser muy distintas: el estrés, las emociones o una mala alimentación. El doctor Berkowitz ofrece un conocimiento exhaustivo sobre estos orígenes y los diferentes tipos de dolor de cabeza, como la migraña o la cefalea en racimo.?(Web Librofilia)Combatir los síntomas de las cefaleas, jaquecas y migrañas y poder hacerlo de un modo natural y sano es una ayuda importante para miles de personas.Es un lugar común en nuestra sociedad que cuando alguien sufre una leve cefalea, un dolor de cabeza, se le dé un analgésico, la mayoría de la gente lleva encima analgésicos para los dolores de cabeza, esto puede suponer, a largo plazo, problemas gástricos por abusar de los medicamentos químicos, esos medicamentos son, además, inútiles a la hora de solucionar los dolores crónicos o prolongados de cabeza. Dolores de cabeza y migrañas analiza las causas de los dolores de cabeza, tanto los ocasionales como los crónicos, y nos ofrece un rico catálogo de remedios naturales y sin efectos secundarios ni a corto ni a largo plazo.Jonathan M. Berkowitz comenzará la obra determinando las causas de los dolores de cabeza que pueden ser muchas, desde las emociones y el estrés hasta la mala alimentación e incluye un completo catálogo de hierbas medicinales, vitaminas y minerales con los que, añadidos a una alimentación sana, cualquier persona puede reducir los síntomas de jaquecas y migrañas. Nos descubrirá cómo el magnesio nos puede ayudar a controlar las migrañas o cómo las vitaminas B2 y B12 se pueden convertir en un aliado contra las cefaleas. Pero además de estos elementos naturales nos da un listado de terapias eficaces contra los dolores de cabeza, como la acupuntura y la estimulación eléctrica percutánea nerviosa.Razones para comprar la obra:- Cualquier lector que se aproxime a la obra, debido a su estilo sencillo, puede comprender la obra y le ayudará a combatir el dolor de cabeza.- La obra no se centra en el dolor de cabeza ocasional, sino que también nos habla de los dolores crónicos como las jaquecas o las migrañas.- Paliar los síntomas del dolor de cabeza, o incluso conseguir que este desaparezca, es una ayuda que ofrece este libro a miles de personas.- El autor es un experto en combatir los síntomas de las cefaleas y es, además, un gran conocedor de vitaminas, minerales y terapias alternativas.Un libro que te ofrece todas las alternativas que existen actualmente para luchar contra los dolores de cabeza, contra las migrañas, contra la cefalea en racimo e incluso contra el dolor de cabeza postraumático.      From the Back Cover      The causes of headaches may range from stress or emotions to nutritional deficiencies. Dr. Berkowitz offers detailed information about the causes and the different types of headaches ?like cluster headache? and migraines. Most importantly, he shows the different treatments to cure them, such as natural methods like medicinal herbs or nutritional supplements ?Vitamin B or magnesium for migraines? and even alternative methods such as acupuncture.      About the Author      Jonathan M. Berkowitz, autor de Asthma: Relax-You're not going to die, licenciado en el Jefferson Medical College de Filadelfia, completo su formación en centros médicos de Nueva York. Publica con frecuencia en diferentes revistas académicas.", 'language': 'es', 'image': 'https://images.isbndb.com/covers/44/89/9788497634489.jpg', 'title_long': 'Dolores de cabeza y migrañas (Spanish Edition)', 'edition': '1', 'dimensions': 'Height: 8.25 Inches, Length: 5.25 Inches, Weight: 0.5291094288 Pounds, Width: 0.5 inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.5291094288}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 176, 'date_published': '2008-03-01', 'subjects': ['Health, Fitness & Dieting', 'Alternative Medicine'], 'authors': ['Block Melissa'], 'title': 'Dolores de cabeza y migrañas (Spanish Edition)', 'isbn13': '9788497634489', 'msrp': 14.95, 'binding': 'Paperback', 'isbn': '8497634489', 'isbn10': '8497634489'}}