{'book': {'publisher': 'EDICIONES OBELISCO S.L.', 'synopsis': 'Un libro claro que ayudará a los familiares, amigos, cuidadores y profesionales a comunicarse de modo eficaz y afectuoso con la persona que sufre de Alzheimer y que percibe cómo, gradualmente, pierde su capacidad cognitiva. Cómo hablar con un enfermo de Alzheimer pone el énfasis en dos cuestiones esenciales: la dignidad de la persona que sufre esta enfermedad y la posibilidad real de mantener con ella una relación afectiva mutuamente satisfactoria. «Es un libro de carácter general escrito con claridad y que cubre todas aquellas cuestiones, comunes y no comunes, que se plantean al cuidar de una persona que sufre de Alzheimer. Es práctico y nada condescendiente. Se lo recomiendo fervientemente a todo aquel que tenga un ser querido con demencia.» DR. PETER V. RABINS, profesor de psiquiatría en The Johns Hopkins University School of Medicine y autor de Treinta y seis horas al día. CLAUDIA J. H. STRAUSS es una educadora y consultora de comunicación muy premiada. Profesora adjunta de inglés en el Albright College de Reading (Pensilvania), dirige una empresa de comunicación estratégica e imparte clases a adultos que sufren por déficit de atención y otros trastornos de aprendizaje. Inspirada por los muchos enfermos de Alzheimer que ha llegado a conocer durante sus frecuentes visitas a la sección de demencias de un hospital, Claudia Strauss se ha sentido impulsada a compartir sus ideas acerca de cómo comunicarse con ellos de una forma más PLENA Y PROFUNDA, INCLUSO A MEDIDA QUE LA ENFERMEDAD AVANZA', 'language': 'es', 'image': 'https://images.isbndb.com/covers/15/97/9788497771597.jpg', 'title_long': 'Como Hablar con un Enfermo de Alzheimer', 'edition': '1', 'dimensions': 'Height: 8.3 Inches, Length: 5.3 Inches, Weight: 0.52029093832 Pounds, Width: 0.6 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.3}, 'width': {'unit': 'inches', 'value': 0.6}, 'weight': {'unit': 'pounds', 'value': 0.52029093832}, 'height': {'unit': 'inches', 'value': 8.3}}, 'pages': 192, 'date_published': '2005-01-27', 'subjects': ['Health, Fitness & Dieting', 'Diseases & Physical Ailments', 'Mental Health', 'Emotions', 'Medical Books', 'Medicine', 'Internal Medicine'], 'authors': ['CLAUDIA J. STRAUSS'], 'title': 'Como Hablar con un Enfermo de Alzheimer', 'isbn13': '9788497771597', 'msrp': 18.95, 'binding': 'Paperback', 'isbn': '8497771591', 'isbn10': '8497771591'}}