{'book': {'publisher': 'DEBOLSILLO', 'synopsis': 'La reina del suspense nos brinda un excelente thriller en torno a la muerte del carismático dueño de una empresa de investigación médica.<br/>Nicholas Spencer es propietario de Genstone, importante empresa dedicada al desarrollo de una vacuna contra el cáncer. Los resultados son muy prometedores, mucha gente está invirtiendo sus ahorros en el proyecto. Pero Nicholas desaparece en un extraño accidente de aviación y poco después se descubre que las pruebas de la vacuna habían sido un fracaso y que, además, Nicholas era sospechoso de un enorme desfalco.<br/>La periodista Marcia DeCarlo, hermanastra de la viuda de Spencer, se lanza a la investigación del complejo asunto que forman el escándalo financiero, la agitación de los inversionistas y la oscura desaparición del empresario. Marcia no acaba de creer en la culpabilidad de Spencer, cuya integridad moral admiraba, pero todas las pruebas están en contra de él. Descubrir la verdad podría ser muy peligroso...<br/>Reseña:<br/>«Escribir un best seller puede parecer fácil, pero ser la escritora que más vende es algo solo reservado para la reina del suspense: Mary Higgins Clark.»<br/>Woman', 'language': 'es', 'image': 'https://images.isbndb.com/covers/54/56/9788497935456.jpg', 'title_long': 'La fuerza del engaño', 'edition': '001', 'dimensions': 'Height: 7.44093 Inches, Length: 4.88188 Inches, Weight: 0.65697754076 Pounds, Width: 0.62992 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.88188}, 'width': {'unit': 'inches', 'value': 0.62992}, 'weight': {'unit': 'pounds', 'value': 0.65697754076}, 'height': {'unit': 'inches', 'value': 7.44093}}, 'pages': 304, 'date_published': '2005-02-04', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Mystery, Thriller & Suspense', 'Mystery', 'Thrillers & Suspense', 'Supernatural'], 'authors': ['Mary Higgins Clark'], 'title': 'La fuerza del engaño', 'isbn13': '9788497935456', 'msrp': 13.95, 'binding': 'Mass Market Paperback', 'isbn': '8497935454', 'isbn10': '8497935454'}}