{'book': {'publisher': 'Debolsillo', 'synopsis': 'La novela emblemática de Umberto Eco. Una trama apasionante. Una admirable reconstrucción del conflictivo siglo XIV<br/><br/>«Umberto Eco cambió nuestra mirada sobre los libros: imprescindibles, pequeños, frágiles, a veces criminales, casi siempre salvadores. Un maestro que nos enseñó a entrelazar la sabiduría y el juego con su estilo sagaz y lúdico, con su asombrosa inventiva y certera lucidez.» Irene Vallejo<br/><br/>UNO DE LOS 100 TÍTULOS FUNDAMENTALES DEL SIGLO XX SEGÚN LE MONDE<br/><br/>Valiéndose de las características de la novela gótica, la crónica medieval y la novela policíaca, El nombre de la rosa narra las investigaciones detectivescas que realiza el fraile franciscano Guillermo de Baskerville para esclarecer los crímenes cometidos en una abadía benedictina en el año 1327. Le ayudará en su labor el novicio Adso, un joven que se enfrenta por primera vez a las realidades de la vida situadas más allá de las puertas del convento. En esta primera y brillante incursión de Umberto Eco en el mundo de la narrativa, que dio lugar a una manera de concebir la novela histórica, el lector disfrutará de una trama apasionante y una admirable reconstrucción de una época especialmente conflictiva de la historia de Occidente.<br/><br/>ENGLISH DESCRIPTION<br/><br/>Umberto Eco’s iconic novel. A gripping plot. An admirable reconstruction ofthe turbulent fourteen century.<br/><br/>“Umberto Eco changed the way we see books: crucial, small, fragile, sometimes criminal, almost always saviors. A master who taught us how to intertwine wisdom and games in his acute and playful way, with his astounding ingenuity and accurate insights.” —Irene Vallejo<br/><br/>ONE OF THE 100 ESSENTIAL BOKS OF THE TWENTIETH CENTURY, ACCORDING TO LE MONDE.<br/><br/>Drawing on the nature of gothic novels, medieval chronicles, and detective fiction, The Name of the Rose follows the inquiries and detective work of Franciscan Friar William of Baskerville to clarify a series of crimes perpetrated in a Benedictine abbey, in the year 1327.He is assisted by Adso, a novice who faces the realities of life outside the convent walls for the first time. In his first and brilliant incursion into the narrative world, in which Umberto Eco introduced a new way of conceiving historical fiction, the reader will enjoy a thrilling plot and a magnificent reconstruction of a particularly chaotic time in the history of the Western world.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/25/81/9788497592581.jpg', 'title_long': 'El nombre de la rosa / The Name of the Rose (Spanish Edition)', 'edition': '009', 'dimensions': 'Height: 7.47 Inches, Length: 4.9 Inches, Weight: 1.10892517786 Pounds, Width: 1.19 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.9}, 'width': {'unit': 'inches', 'value': 1.19}, 'weight': {'unit': 'pounds', 'value': 1.10892517786}, 'height': {'unit': 'inches', 'value': 7.47}}, 'pages': 784, 'date_published': '2021-10-19', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'Contemporary', 'Literary', 'Mystery, Thriller & Suspense', 'Mystery'], 'authors': ['Umberto Eco'], 'title': 'El nombre de la rosa / The Name of the Rose (Spanish Edition)', 'isbn13': '9788497592581', 'msrp': 14.95, 'binding': 'Mass Market Paperback', 'isbn': '8497592581', 'isbn10': '8497592581'}}