{'book': {'publisher': 'Oniro', 'synopsis': 'En palabras de Fred Rogers, experto en temas de paternidad con largos años de práctica en ayudar a los padres a hacer frente a los altibajos de la vida familiar, no existen ni padres ni hijos perfectos, sino padres e hijos humanos. A ellos dedica este profundo estudio del desarrollo infantil, que constituye el resultado de largos años de comunicación con los niños y tiene como meta resolver los problemas que todos los padres deben afrontar. El libro de la paternidad responsable, de lectura fácil y agradable, aborda una amplia gama de situaciones de paternidad, desde preocupaciones presentes a diario en cualquier hogar, como las horas de las comidas, hasta primeras experiencias, por ejemplo, qué cuidados prodigar a un recién nacido, y situaciones especialmente conflictivas, como la separación y el divorcio. Cada capítulo se centra en una situación concreta, entre las que cabe destacar: · Reglas y límites cotidianos · El recién nacido · La hora de la comida · La televisión y los niños · La visita al médico o al dentista · Mudanzas · La hora de acostarse', 'language': 'es', 'image': 'https://images.isbndb.com/covers/08/10/9788497540810.jpg', 'title_long': 'El libro de la paternidad responsable / the Book of Responsible Parenthood: Consejos para resolver situaciones conflictivas de la vida familiar (Spanish Edition)', 'dimensions': 'Height: 10 Inches, Length: 8 Inches, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8}, 'width': {'unit': 'inches', 'value': 0.5}, 'height': {'unit': 'inches', 'value': 10}}, 'pages': 120, 'date_published': '2003', 'subjects': ['Parenting & Relationships', 'Parenting'], 'authors': ['Fred Rogers'], 'title': 'El libro de la paternidad responsable / the Book of Responsible Parenthood: Consejos para resolver situaciones conflictivas de la vida familiar (Spanish Edition)', 'isbn13': '9788497540810', 'msrp': 17.95, 'binding': 'Paperback', 'isbn': '8497540816', 'isbn10': '8497540816'}}