{'book': {'publisher': 'Ediciones Nowtilus', 'synopsis': '?El libro es muy interesante, por lo que cuenta y por cómo lo cuenta. Los protagonistas de aquel suceso histórico rozaron cambiar la historia y por milímetros se quedaron sin nada. En su historia hay valor, traiciones, intrigas, suerte y personajes fascinantes. Además el autor da los datos precisos, esquematiza claramente los momentos más confusos y nos pone sobre aviso en los momentos poco esclarecidos históricamente sobre cuáles son las versiones existentes.?<br/>(Web Comentarios de libros)<br/>?Jesús Hernández tiene el don de sumergirme en la historia como si me estuviera contando un cuento. Su estilo claro, directo y sencillo hacen que me imagine las situaciones con absoluta nitidez, y en esta ocasión ha vuelto a conseguirlo. Muchos fueron los intentos de matar a Hitler y algunos estuvieron relativamente cerca, también el autor les dedica unas páginas en esta obra. Pero el que casi logró su objetivo es el centro de la historia.?<br/>(Web Anika entre libros)<br/>El 20 de Julio de 1944, un complot entre oficiales alemanes planeó asesinar a Hitler, Goering y Himmler,<br/>detener la guerra y cambiar el terrible destino de la humanidad.<br/>En medio de las grandes historias de la Segunda Guerra Mundial que tuvieron absoluta trascendencia en el conflicto, como la resistencia de Stalingrado o el ataque de Pearl Harbor, existen pequeños relatos que pudieron cambiar el curso de la historia: esta es una de ellas. Es falso la creencia de que toda Alemania cerraba filas de un modo incondicional alrededor del Führer, dentro de las propias tropas nazis aún quedaban hombres que se rebelaban contra el horror y la ignominia que la guerra y el exterminio estaban provocando en su propia patria. Operación Valkiria nos detalla todo el proceso de unos de los intentos de asesinar a Hitler que más cerca estuvo de conseguirlo.<br/>Jesús Hernández muestra en esta obra un equilibrio perfecto entre narrativa y rigor histórico aunando los datos exactos con los diálogos en estilo directo en algunas partes de la obra, tan escasos en los libros históricos. Nos presenta no sólo el recorrido de cómo se fraguó el plan, de cómo se llevó a cabo y de cómo terminó, sino que además se detiene a analizar los motivos del fracaso de la conspiración. La mala suerte, las traiciones en el propio seno de la conspiración y la falta de apoyo de algunos hombres clave impidió que se asesinara a los líderes nazis, que se desarticularan las SS y que se acabara la Segunda Guerra Mundial.<br/>Razones para comprar la obra:<br/>- El libro muestra un episodio fundamental en la Segunda Guerra Mundial que además está narrado con la intención de que los datos no interrumpan el ritmo narrativo.<br/>- El tema de la conspiración contra Hitler y el carisma de su protagonista son un aliciente importante en el relato de esta capítulo del régimen nazi.<br/>- El libro intercala numerosas fotografías de los actores implicados en la trama además de importantes anexos como una lista de los rebeldes represaliados o una descripción de los escenarios más importantes.<br/>- El autor es un prestigioso divulgador de la Segunda Guerra Mundial que esta vez pone su atención en esta trascendental conjura.<br/>El relato ameno, vibrante y lleno de datos históricos precisos de uno de los múltiples intentos de asesinar a Hitler. Una apasionante obra con los elementos de la mejor novela puestos, en este caso, al servicio de la historia. Un bestseller que va ya por su tercera edición en libro impreso.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/52/02/9788497635202.jpg', 'title_long': 'Operación Valkiria (Historia incognita / Unknown History) (Spanish Edition)', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 7 Inches, Weight: 1.4109584768 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.4109584768}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 352, 'date_published': '2008-09-01', 'subjects': ['History', 'Europe', 'Germany', 'Military', 'World War II'], 'authors': ['Jesús Hernández Martínez'], 'title': 'Operación Valkiria (Historia incognita / Unknown History) (Spanish Edition)', 'isbn13': '9788497635202', 'msrp': 7.29, 'binding': 'Paperback', 'isbn': '8497635205', 'isbn10': '8497635205'}}