{'book': {'publisher': 'EDICIONES OBELISCO S.L.', 'synopsis': 'Existe un gran número de creencias y desinformación en torno a la medicina y la salud. Algunas son sencillamente disparatadas, mientras que otras son realmente peligrosas. El intrépido reportero del New York Times, Anahad O\x92 Connor, ha investigado acerca de lo que hay de verdad, de ficción, y, a veces, de ofuscación en los remedios tradicionales y otros misterios médicos. Este columnista nos revela todas las respuestas de los especialistas: desde qué malos hábitos podemos permitirnos (sentarse demasiado cerca de la televisión no daña la vista) a qué alimentos dejar de consumir desde este momento. Compendio de respuestas a cuestiones preocupantes y curiosas sobre temas de salud, este libro proporciona orientación y diversión a todo aquel que se haya preguntado alguna vez si realmente los mosquitos le pican a él más que a nadie (sí, lo hacen). \x95 ¿Son más viriles los calvos? Véase capítulo 2 \x95 ¿Es la luz artificial peligrosa para la salud? Véase capítulo 5 \x95 ¿Es el caldo de pollo bueno para el catarro? Véase capítulo 7 \x95 ¿Tienen los gemelos las mismas huellas dactilares? Véase capítulo 1 \x95 ¿Hay peligro de electrocutarse si uno se ducha durante una tormenta eléctrica? Véase capítulo 9 ¡Conoce la verdad sobre aquellas «leyendas urbanas mediante un análisis riguroso y divertido!', 'language': 'es', 'image': 'https://images.isbndb.com/covers/55/88/9788497775588.jpg', 'title_long': 'Nunca se duche durante una tormenta eléctrica (Spanish Edition)', 'edition': '1', 'dimensions': 'Height: 8.2 Inches, Length: 5.3 Inches, Weight: 0.7495716908 Pounds, Width: 0.8 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.3}, 'width': {'unit': 'inches', 'value': 0.8}, 'weight': {'unit': 'pounds', 'value': 0.7495716908}, 'height': {'unit': 'inches', 'value': 8.2}}, 'pages': 280, 'date_published': '2009-05-29', 'subjects': ['Health, Fitness & Dieting'], 'authors': ["ANAHAD O'CONNOR"], 'title': 'Nunca se duche durante una tormenta eléctrica (Spanish Edition)', 'isbn13': '9788497775588', 'msrp': 19.95, 'binding': 'Paperback', 'isbn': '8497775589', 'isbn10': '8497775589'}}