{'book': {'publisher': 'EDICIONES OBELISCO S.L.', 'synopsis': 'La idea de que en el Tarot están contenidos los secretos de los Templarios no es nueva, pero sí difícil de demostrar. Desde sus inciertos orígenes, el Tarot ha sufrido numerosas metamorfosis, adaptándose discretamente a los diversos usos que se han hecho de sus Arcanos. Para el autor del presente ensayo estos misteriosos naipes han servido de soporte para vehicular enseñanzas de tipo oculto relacionadas con la Cábala y con la Alquimia. Pero su verdadero secreto no es distinto del que se llevaron a la tumba los caballeros Templarios. Analizando el simbolismo de los naipes, utilizando la numerología y apoyándose en las enseñanzas de los cabalistas, Julio Peradejordi indica las numerosas coincidencias entre el Tarot tradicional y las enseñanzas iniciáticas occidentales que rodean al Santo Grial. Julio Peradejordi es autor de diversos libros relacionados con el simbolismo y el esoterismo entre los que se cuentan El cuerpo humano (simbolismo), La Cábala, y El tarot esotérico. También es autor de varios libros de cuentos como 56 cuentos para buscar a Dios, Las cinco claves, Las babuchas de Abu Kassim, Los siete sueños de Adán, y Cuentos de Reyes, magos, princesas y luciérnagas.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/08/66/9788497770866.jpg', 'title_long': 'Los Templarios y el Tarot', 'edition': '1', 'dimensions': 'Height: 8 Inches, Length: 5.25 Inches, Weight: 0.3417165061 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.3417165061}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 208, 'date_published': '2004-03-03', 'subjects': ['Humor & Entertainment', 'Puzzles & Games', 'Card Games', 'Religion & Spirituality', 'New Age & Spirituality', 'Divination'], 'authors': ['JULI PERADEJORDI'], 'title': 'Los Templarios y el Tarot', 'isbn13': '9788497770866', 'msrp': 14.95, 'binding': 'Paperback', 'isbn': '8497770862', 'isbn10': '8497770862'}}