{'book': {'publisher': 'EDICIONES OBELISCO S.L.', 'synopsis': 'En El poder de la atracción, el reconocido autor, pionero en marketing de Internet, y guía espiritual, Joe Vitale, muestra que el éxito no depende de lo que estás haciendo, ¡sino de lo que eres! Continuando con el espectacular éxito de su e-book Mercadotecnia espiritual \x96que ha conseguido ser el número uno en ventas en Amazon en varias ocasiones\x96 Joe combina las prácticas populares del autodescubrimiento personal con principios comprobados de marketing en un manual extraordinario para vivir feliz dentro y fuera de los negocios. JOE VITALE, internacionalmente conocido como «el Buda de Internet», es presidente de Hypnotic marketing, Inc., una empresa de asesoría en marketing. Para más información sobre el autor y solicitar su newsletter gratuita, consulta su web:www.mrfire.com «Todos los que lean este libro recibirán una llave, una llave que sólo necesitan girar y las puertas comenzarán a abrirse suavemente, misteriosamente, mágicamente. Hace un par de meses quería conseguir unos cuantos miles de dólares. Cuatro días después, en una llamada de teléfono aparentemente sin relación, se me ofreció un trato que me trajo la cantidad exacta de dinero que yo solicitaba. Ahora, este tipo de cosas suceden constantemente, gracias a El poder de la atracción.» CHARLES BURKE, autor, How to Prime Your Cosmic Cash Pump.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/37/82/9788497773782.jpg', 'title_long': 'El poder de la atracción (Spanish Edition)', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.70106999316 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.70106999316}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 256, 'date_published': '2007-06-07', 'subjects': ['Self-Help', 'Success', 'Business & Money', 'Personal Finance', 'Health, Fitness & Dieting'], 'authors': ['JOE VITALE'], 'title': 'El poder de la atracción (Spanish Edition)', 'isbn13': '9788497773782', 'msrp': 18.95, 'binding': 'Paperback', 'isbn': '8497773780', 'isbn10': '8497773780'}}