{'book': {'publisher': 'SALAMANDRA', 'synopsis': 'La publicación de La historia del amor, segunda novela de Nicole Krauss, supuso la confirmación del extraordinario talento de esta joven escritora norteamericana, suscitando el elogio entusiasta de críticos y escritores, entre ellos el Premio Nobel de Literatura J.M. Coetzee. Con una sabia mezcla de humor y ternura, Nicole Krauss ha escrito una hermosa aproximación al insondable tema del amor, la pérdida y la memoria, además de un homenaje a la literatura y a la forma en que los libros pueden cambiar la vida de las personas. Leo Gursky, cerrajero polaco jubilado en Nueva York, cuya obsesión es «no morirme un día en que nadie me haya visto», recibe misteriosamente el manuscrito de un texto que creía perdido, acompañado de una enigmática carta. Instalado en el ocaso de su vida, esta sorpresa lo lleva a bucear en los recuerdos de su lejana juventud, recuperando emociones que suponía enterradas. No muy lejos de allí, la quinceañera Alma Singer padece los dilemas y conflictos de su edad. Hace ya ocho años que su padre murió de cáncer y ella ha decidido que es hora de que su madre deje de estar triste, o sea, se dispone a encontrarle un nuevo marido. Cuando en su camino aparece La historia del amor, una novela rara, escrita en yidis, publicada en español y comprada por su padre en una librería de Buenos Aires, los interrogantes se suceden. ¿Por qué su padre se la regaló a su madre muy poco después de conocerla? ¿Quién era su autor? ¿Y quién es el misterioso hombre que ha encargado a su madre que traduzca el libro al inglés? Como en una afinada composición musical, la intensidad de la historia va aumentando progresivamente hasta que los pasos del anciano que busca reconciliarse con su pasado y la adolescente que quiere poner remedio a la soledad de su madre se entrecruzan mediante una ingeniosa y compleja trama cuyos hilos convergen en un final inolvidable. Con un tono intimista y envolvente, la autora ha logrado lo más difícil, contar una verdadera historia de amor en el sentido más amplio y profundo de la palabra, una historia llena de pasión y melancolía que conmoverá a todo tipo de lectores.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/00/26/9788498380026.jpg', 'title_long': 'La historia del amor (Spanish Edition)', 'edition': 'Tra', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.95460159446 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.95460159446}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 288, 'date_published': '2006-03-30', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Psychological', 'Short Stories & Anthologies', 'Short Stories', 'World Literature', 'United States', 'Anthologies', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Psychological Thrillers'], 'authors': ['Nicole Krauss'], 'title': 'La historia del amor (Spanish Edition)', 'isbn13': '9788498380026', 'msrp': 9, 'binding': 'Paperback', 'isbn': '8498380022', 'isbn10': '8498380022'}}