{'book': {'publisher': 'ZETA BOLSILLO', 'synopsis': "Tras la muerte de sus padres, Adeline fue criada por su tia. Ahora tiene veinte años y aunque es una dedicada enfermera, es una joven demasiado moderna para los patrones de Sunrise, Texas, en 1930. Su tia esta muy enferma, y la joven tendra que enfrentar el futuro sin contar con ningun apoyo. Addie tiene un sueño, en el que un misterioso desconocido la visita para amarla apasionadamente. Addie siente que, sea quien sea ese desconocido, se pertenecen el uno al otro. Cuando conoce a Ben Hunter, se siente atraida por el inmediatamente. Es un hombre muy diferente de los que ha conocido, y el tambien se da cuenta de que Addie no es otra de esas mujeres sumisas y recatadas. Pero el tiene sus secretos, y Addie descubrira que ella tambien debera enfrentarse a los suyos... / After the death of his parents, Adeline was raised by his aunt. It now has twenty years and although it is a dedicated nurse, is too young to modern patterns of Sunrise, Texas, in 1930. His aunt is very ill, and the young will have to face the future without any support. Addie has a dream in which a mysterious unknown love passionately for the visit. Addie feels that, whoever the unknown, it belonged to one another. It's over Ben Hunter, feels attracted to him immediately. He is a man very different from those who had known him, and he also realizes that Addie is not another one of those women submissive and demure. But he has his secrets, and Addie will discover that she too must face up to theirs ...", 'language': 'es', 'image': 'https://images.isbndb.com/covers/13/31/9788498721331.jpg', 'title_long': 'DAME ESTA NOCHE (Spanish Edition)', 'edition': '00001', 'dimensions': 'Height: 7.874 Inches, Length: 4.92125 Inches, Weight: 0.7275254646 Pounds, Width: 0.98425 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.92125}, 'width': {'unit': 'inches', 'value': 0.98425}, 'weight': {'unit': 'pounds', 'value': 0.7275254646}, 'height': {'unit': 'inches', 'value': 7.874}}, 'pages': 416, 'date_published': '2008-11-05', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'United States', 'Romance', 'Historical'], 'authors': ['Lisa Kleypas'], 'title': 'DAME ESTA NOCHE (Spanish Edition)', 'isbn13': '9788498721331', 'msrp': 13.95, 'binding': 'Paperback', 'isbn': '8498721334', 'isbn10': '8498721334'}}