{'book': {'publisher': 'Salamandra', 'synopsis': 'Una antología que concentra todo el potencial fantasioso y onírico de Gaiman: historias de terror y de fantasmas, ficción especulativa y cuentos de hadas, fábulas perversas y versos sorprendentes.<br/>Con una enorme legión de fieles lectores en todo el mundo, Neil Gaiman está considerado uno de los escritores de imaginación más fértil y perturbadora de la actualidad.<br/>Como es característico en él, el mundo sensible no es más que un mero velo o una ilusión tras la cual se despliega un sinfín de realidades paralelas y mundos alternativos, casi siempre amenazantes y ominosos. En la mente creativa de Gaiman, todo es posible: laberintos lunares, amigos imaginarios de carne y hueso, iglús fabricados con libros, piratas muy peculiares, caseras asesinas, objetos hechizados, tarjetas de felicitación que alteran el espacio-tiempo... Un muestrario de circunstancias singulares que confieren a los protagonistas un abanico de experiencias capaces de revelarles conocimiento de sí mismos y emociones que ni siquiera sospechaban poseer.<br/>Así pues, al lector le aguarda un viaje literario en el que frotarse los ojos y padecer escalofríos, maravillarse y quedar noqueado por el genio de un escritor sofisticado que nos embelesa con sus hechizos y nos traslada a lo más profundo de un país inexplorado donde lo fantástico se hace realidad y lo cotidiano es incandescente.<br/>Material sensible incluye un relato inédito de American Gods -«Black Dog»-, otro escrito para conmemorar el cincuenta aniversario de Doctor Who -«Las nada en punto»- y una ingeniosísima vuelta de tuerca al universo de Sherlock Holmes, «El caso de la muerte y la miel».<br/>La crítica ha dicho...<br/>«Material sensible sirve en bandeja a los fans de Gaiman todo aquello que adoran. Por sus páginas discurren todo tipo de brujas, monstruos y criaturas de la noche. Una colección de relatos que satisfará a sus fieles seguidores y que le granjeará nuevos acólitos, si es queda a quien por convencer.»<br/>Kirkus Reviews<br/>«Material sensible pone de manifiesto la amplitud y profundidaddel talento de Gaiman, así como esa importante calidez que aporta al género fantástico. Jamás decepciona.»<br/>Financial Times<br/>«Cada uno de los relatos está narrado con la seguridad y la maestría de alguien capazde contentar a quienes echan de menos la posibilidad de hallar un nuevo título de Ray Bradbury en las librerías.»<br/>Newsday<br/>«Gaiman se confirma como una de las voces más genuinas del universo fantástico actual.»<br/>Locus narrativa 6<br/>«Su mente es un océano oscuro e insondable. Cada vez que me sumerjo en él, este mundo desaparecepara ser reemplazado por otro mucho más terrible y bello en el que gustosamente me ahogaría.»<br/>New York Times Book Review', 'language': 'es', 'image': 'https://images.isbndb.com/covers/73/60/9788498387360.jpg', 'title_long': 'Material sensible (Spanish Edition)', 'edition': '001', 'dimensions': 'Height: 8.62203 Inches, Length: 5.31495 Inches, Weight: 1.0802650838 Pounds, Width: 0.98425 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31495}, 'width': {'unit': 'inches', 'value': 0.98425}, 'weight': {'unit': 'pounds', 'value': 1.0802650838}, 'height': {'unit': 'inches', 'value': 8.62203}}, 'pages': 400, 'date_published': '2016-06-02', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Horror', 'Short Stories & Anthologies', 'Anthologies', 'Short Stories', 'Science Fiction & Fantasy', 'Science Fiction'], 'authors': ['Neil Gaiman'], 'title': 'Material sensible (Spanish Edition)', 'isbn13': '9788498387360', 'msrp': 22.95, 'binding': 'Paperback', 'isbn': '8498387361', 'isbn10': '8498387361'}}