{'book': {'publisher': 'RBA', 'synopsis': 'Enero de 1946: Londres emerge de las sombras de la segunda guerra mundial. La escritora Juliet Ashton está buscando el argumento para su próximo libro. ¿Quién podría imaginarse que lo encontraría en la carta de un desconocido, un nativo de la isla de Guernsey, a cuyas manos ha llegado un libro de Charles Lamb que perteneció a Juliet? A medida que Juliet y el desconocido intercambian cartas, ella se queda atrapada en un mundo maravillosamente excéntrico. La sociedad literaria del pastel de piel de patata de Guernsey -nacida como una coartada espontánea cuando sus miembros fueron descubiertos rompiendo el toque de queda de los alemanes – contiene una galería de personajes profundamente humanos, divertidos, encantadores, desde granjeros a frenólogos, todos amantes de la literatura, que sobrellevaron la ocupación nazi organizando reuniones de lectura sobre novelas clásicas, siempre alrededor de un pastel de patata. Juliet empieza una importante correspondencia con los miembros de la sociedad, pequeñas joyas que hablan de libros y del placer de la lectura, de la amistad, de la vida cotidiana y del impacto reciente que la ocupación alemana ha tenido en sus vidas. Cautivada por sus historias, decide visitarles, y lo que encuentra le cambiará para siempre. ENGLISH DESCRIPTION “ I wonder how the book got to Guernsey? Perhaps there is some sort of secret homing instinct in books that brings them to their perfect readers.” January 1946: London is emerging from the shadow of the Second World War, and writer Juliet Ashton is looking for her next book subject. Who could imagine that she would find it in a letter from a man she’s never met, a native of the island of Guernsey, who has come across her name written inside a book by Charles Lamb…. As Juliet and her new correspondent exchange letters, Juliet is drawn into the world of this man and his friends—and what a wonderfully eccentric world it is. The Guernsey Literary and Potato Peel Pie Society—born as a spur-of-the-moment alibi when its members were discovered breaking curfew by the Germans occupying their island—boasts a charming, funny, deeply human cast of characters, from pig farmers to phrenologists, literature lovers all. Juliet begins a remarkable correspondence with the society’s members, learning about their island, their taste in books, and the impact the recent German occupation has had on their lives. Captivated by their stories, she sets sail for Guernsey, and what she finds will change her forever. Written with warmth and humor as a series of letters, this novel is a celebration of the written word in all its guises, and of finding connection in the most surprising ways.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/46/99/9788498674699.jpg', 'title_long': 'La sociedad literaria y del pastel de cáscara de papa de Guernsey (Spanish Edition)', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.88 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.88}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 32, 'date_published': '2008-03-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'Contemporary'], 'authors': ['Mary Ann Shaffer'], 'title': 'La sociedad literaria y del pastel de cáscara de papa de Guernsey (Spanish Edition)', 'isbn13': '9788498674699', 'msrp': 19.99, 'binding': 'Paperback', 'isbn': '8498674697', 'isbn10': '8498674697'}}