{'book': {'publisher': 'Aarhus University Press', 'synopsis': "Raised to honour Maussolos, a Persian satrap of the 4th century BCE, the Maussolleion in Halikarnassos was renowned throughout the ancient world as one of its Seven Wonders. Pliny the Elder provided a useful description of it several centuries later, but another fourteen passed before the invention of moveable type made his observations available to a wider public. By that time, the monument was probably ruined beyond recognition, and by 1522 the remaining stones had been completely torn down and reused to fortify a nearby castle. Little else was known of the ancient monument until 1857, when C.T. Newton rediscovered the Maussolleion site. He removed what he could find of its sculptures - the source of the monument's original fame - to the British Museum, but while he answered some basic questions of structure, many were left unresolved, and his excavations jumbled much of the remaining materials. The third major contribution to our understanding of the great mausoleum comes from the Danish excavations led by Kristian Jeppesen from 1966 to 1977. The results of these digs are analysed in The Maussolleion at Halikarnassos, of which three volumes form the long-awaited conclusion. Volume 6 details Jan Zahle's investigations of subterranean structures close to the Maussolleion. Successive spoliations - including Newton's - have greatly muddled the archaeological record, and the Danish excavations uncovered evidence of another complication: plans for the site appear to have changed during construction, so that what was originally intended as a modest extension of existing structures evolved into a huge tomb on an immense terrace. His thorough sifting of evidence resolves many contradictions, though uncertainties remain.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/51/62/9788788415162.jpg', 'title_long': 'The Maussolleion at Halikarnassos. Reports of the Danish Archaeological Expedition to Bodrum: 6 Subterranean and pre-Maussollan structures on the site ... (Jutland Archaeological Society Publications)', 'edition': 'ILLUSTRATE', 'dimensions': 'Height: 11.7 Inches, Length: 8.3 Inches, Weight: 2.9 Pounds, Width: 0.8 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.3}, 'width': {'unit': 'inches', 'value': 0.8}, 'weight': {'unit': 'pounds', 'value': 2.9}, 'height': {'unit': 'inches', 'value': 11.7}}, 'pages': 251, 'date_published': '2005-12-01', 'subjects': ['Politics & Social Sciences', 'Archaeology'], 'authors': ['Jan Zahle'], 'title': 'The Maussolleion at Halikarnassos. Reports of the Danish Archaeological Expedition to Bodrum: 6 Subterranean and pre-Maussollan structures on the site ... (Jutland Archaeological Society Publications)', 'isbn13': '9788788415162', 'msrp': 41.66, 'binding': 'Hardcover', 'isbn': '8788415163', 'isbn10': '8788415163'}}