{'book': {'publisher': 'White Star', 'synopsis': 'Behind most myths of the sea, behind most people\'s sense of fear and respect for the ocean, lurks the shark\x97the uncontested lord of the deep. Each year scientists try to counter the bad publicity that sharks receive during beach season, and now there is a growing general sense that these fish lead interesting lives beyond what their monstrous reputations would suggest. This guidebook is both a portable encyclopedia and a visually rich tribute to the shark. Complete with color photographs, drawings, graphics, and a series of species data cards, this volume presents the shark\'s history and biology in a thorough and un-intimidating way.<br/><br/>Represented by over 350 known species and by others yet to be discovered, sharks are the result of an evolutionary process that began about 250 million years ago. This guide helps us to appreciate them as highly specialized ocean predators that combine primitive character traits with behavior typical of superior vertebrates. Covering everything from the legends surrounding sharks, to their fascinating evolution, to their anatomy and variety, to their different types of behavior, Sharks will be enjoyed by anyone wishing to understand more about this "favorite fish to fear."', 'language': 'en', 'image': 'https://images.isbndb.com/covers/05/42/9788854400542.jpg', 'title_long': 'Sharks (White Star Guides)', 'dimensions': 'Height: 10 Inches, Length: 7 Inches, Weight: 1.35 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 1.35}, 'height': {'unit': 'inches', 'value': 10}}, 'pages': 168, 'date_published': '2005', 'subjects': ['Science & Math', 'Nature & Ecology', 'Oceans & Seas', 'Sports & Outdoors', 'Water Sports', 'Scuba'], 'authors': ['Angelo Mojetta'], 'title': 'Sharks (White Star Guides)', 'isbn13': '9788854400542', 'msrp': 18.38, 'binding': 'Paperback', 'isbn': '8854400548', 'isbn10': '8854400548'}}