{'book': {'publisher': 'White Star Publishers', 'synopsis': 'Product Description      If a traveler were to create a postcard collection of America\'s most rustic and picturesque region, it would most likely resemble this book. New England brings together superb, luminous photographs of scenes we all associate with the northeastern United States: white wooden churches among groves of brilliantly colored maple trees, snow-covered barns, the quaint row houses of once-industrial cities, elegant harbors, fishing villages along rocky coasts, bushes laden with blueberries, pumpkins ripening in the sun, clear blue lakes. Yet this book goes beyond the traditional images to capture the mindset of a people whose history is rooted in the concepts of hard work, liberty, and revolution, and who look to the future.Aerial photography, vintage maps, and paintings help illustrate both New England\'s history and landscape, which seem to be linked. It was here that America\'s Founding Fathers recognized the Promised Land: a fertile paradise of peace and quiet, offering up its fruits to anyone who desired to gather them. And yet it was here that the "shot heard around the world" was fired, and the American Revolution began. From the first Thanksgiving through the days of the early republic, from industrial times to the information and technology age, this book beautifully documents the images and history of America\'s cradle of democracy.      About the Author      Alessandro Gandolfi, who formerly worked for the daily newspaper La Repubblica, is now a freelance journalist and photographer for several Italian newspapers and photographic agencies.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/05/35/9788854400535.jpg', 'title_long': 'New England (Illustrated History And Landmarks)', 'dimensions': 'Height: 12.25 Inches, Length: 9.75 Inches, Weight: 2.3 Pounds, Width: 0.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 9.75}, 'width': {'unit': 'inches', 'value': 0.25}, 'weight': {'unit': 'pounds', 'value': 2.3}, 'height': {'unit': 'inches', 'value': 12.25}}, 'pages': 136, 'date_published': '2010-09-07', 'subjects': ['Arts & Photography', 'Photography & Video', 'Travel', 'Pictorial'], 'authors': ['Alessandro Gandolfi'], 'title': 'New England (Illustrated History And Landmarks)', 'isbn13': '9788854400535', 'msrp': 1.99, 'binding': 'Hardcover', 'isbn': '885440053X', 'isbn10': '885440053X'}}