{'book': {'publisher': 'Contrasto', 'synopsis': '"Images of energy and inertia, progress and peril. American Youthis more than 100 pages of paradox."--Washington Post<br/><br/>American Youth examines through vivid photographs the newest generation of 18 to 24-year-olds in detail, observing young couples and Mormon missionaries, debutante balls and drunken tailgate stupors, war widows and B-boys, street kids and lobstermen. How are they different, and how are they exactly the same as the generations that came before? On these pages are Christian rock fans, lesbian gangstas and Obama volunteers. There are would-be pop stars waiting for a shot on American Idol, organic farmers living the hippie dream and tattooed Cobra gang members brooding in the Navajo Reservation’s Window Rock jail. Another series of photographs asks young New Yorkers to think big: If you had the chance, what question would you ask God?<br/><br/>These remarkably candid images of youth are introduced with a text by Steve Appleford and have been realized by the photographers of Redux Pictures: Marc Asnin, Ben Baker, Nina Berman, David Butow, Peter Frank Edwards, Danny Wilcox Frazier, Eros Hoagland, John Keatley, Andy Kropa, Erika Larsen, Gina LeVay, Joshua Lutz, Preston Mack, Kevin J. Miyazaki, Darcy Padilla, Mark Peterson, Michael Rubenstein, Greg Ruffing, Q. Sakamaki, Erin Siegal, Angie Smith, Ben Stechschulte, Brad Swonetz, Nathaniel Welch and David Yellen.<br/><br/>Redux, founded in 2003 by Marcel Saba, is an independent photo agency based in New York City that specializes in high-quality editorial and commercial photography.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/15/71/9788869651571.jpg', 'title_long': 'American Youth', 'dimensions': 'Height: 10.2 Inches, Length: 7.9 Inches, Weight: 2.3809924296 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.9}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 2.3809924296}, 'height': {'unit': 'inches', 'value': 10.2}}, 'pages': 240, 'date_published': '2009-06-01', 'subjects': ['Arts & Photography', 'Photography & Video', 'Equipment, Techniques & Reference', 'Photojournalism & Essays', 'Teen & Young Adult'], 'authors': ['Redux Pictures'], 'title': 'American Youth', 'isbn13': '9788869651571', 'msrp': 39.95, 'binding': 'Hardcover', 'isbn': '8869651576', 'isbn10': '8869651576'}}