{'book': {'publisher': 'Slow Food Editore', 'synopsis': 'This new guidebook combines for the first time in a single volume--and in English--two of the most popular Slow Food travel guides to Italy: Osterie d\'Italia and Locande d\'Italia.<br/>In the seventeen editions of the Osterie d\'Italia guide that have been published to date, the book has done much to promote Italian regional cooking and has contributed to the revival of eating places that particularly reflect local flavor and character: restaurants, osterias, trattorias, and wine shops--all of which serve foods known for their quality, value, and faithfulness to tradition. The ambience and cuisine of each establishment is described in each brief review, with special emphasis on the most significant dishes of the relevant local tradition. The distinctive Slow Food symbol--the snail--is awarded to those places that best represent the ideals and philosophy of the international Slow Food movement. The guide also dedicates special sections to theme itineraries: from the ombre, or wine bars, of Venice to the street food stalls of Naples and the tripe sellers of Florence.<br/>Added to this classic culinary guide for the first time are entries from Locande d\'Italia, which features the best lodging establishments in Italy: B&Bs, small hotels, holiday or "agriturismo" farms, guest houses, and hostels. All the places profiled provide good, old-fashioned hospitality and reflect the unique character of Italy\'s diverse regions and landscape. Each entry discusses the history, local context, personnel, and amenities offered.<br/>With more than 2,100 entries, this new guide offers the most comprehensive resource available to dining and lodging in Italy. It is sure to prove an indispensable companion for tourists planning a trip to this country, with its rich, varied, and deeply rooted history and traditions. In addition, this first English edition of the book will be supplemented by a gastronomic glossary in which clear, concise definitions will help the reader find his or her way among the myriad dishes of Italian regional cuisine.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/11/40/9788884991140.jpg', 'title_long': "Osterie & Locande d'Italia: A Guide to Traditional Places to Eat and Stay in Italy", 'dimensions': 'Height: 8.5 Inches, Length: 5.25 Inches, Weight: 1.5 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.5}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 1150, 'date_published': '2007-04-04', 'subjects': ['Travel', 'Europe', 'Italy'], 'authors': ['Slow Food Editore'], 'title': "Osterie & Locande d'Italia: A Guide to Traditional Places to Eat and Stay in Italy", 'isbn13': '9788884991140', 'msrp': 29, 'binding': 'Turtleback', 'isbn': '8884991145', 'isbn10': '8884991145'}}