{'book': {'publisher': 'JR*Comics', 'synopsis': "Monkey King is a twenty-volume comics series based on the legendary Chinese novel The Journey to the West. It is a magisterial work that took seventy people over six years to complete. The Journey to the West is at once a comedy, a drama, a satire, a meditation on faith and discipline, and a fantastical dramatization of China's history. Its creation covers many centuries and several dynasties. Begun during the Song Dynasty (10th~13th century), Journey is set against the backdrop of the 7th century Tang Dynasty, and tells the story of a priest named San Zang, who introduces China to the Mahayana Buddhist scriptures of India, and his trio of disciples: the monkey king Sun Wu Kong, the gluttonous pig Zhu Bajie, and the quiet but noble sea monster Sha Wu Jing. The San Zang who appears in Journey to the West is a specialist in Tripitaka, and is based on a real priest, named Xuan Zang. Xuan Zang lived from 602 to 664, and have traveled the western lands and traded with other countries along the western border from 627 or 629 to 645. More than three hundred years later, a story based on Xuan Zang's adventures, first appeared. The Journey to the West originated from this story. The Song Dynasty was founded in 960, yet because the only known author of Journey to the West, Wu Cheng en, died in 1582, during the Ming Dynasty, the story is considered the result of collective creation spanning five hundred years. The story also traveled through several countries and includes at least four different timelines. The events of Journey to the West, which include epic battles and threatened palaces and imperiled kings, could resonate with readers during almost any age, but the story focuses on portraying a peaceful society where deviance is ultimately trumped by enlightenment, violence defeated by benevolence. It is this balance, between depicting familiar events of conquest and telling a story about the search for truth, that makes The Journey to the West so beloved today. The author, Mr. Wei Dong Chen, is a highly acclaimed and beloved Chinese artist and an influential leader in the New Chinese Cartoon trend. His company, Creator World in Tianjin, is the largest comics studio in China. He has published hundreds of cartoons, which have been recognized for their strong literary value throughout the world. In 2005, he undertook the monumental effort of translating four classic Chinese novels into serialized comic form. After six years of great and enthusiastic work, he completed his dream, which now consists of 12,800 pages of beautiful drawings and epic storytelling. Monkey King is one of the four novels. Monkey King is a new landmark of comic artistry in China, and is a bold and exhilarating treatment of one of the definitive works of Chinese literature.<br/><br/>Vol. 15 Fanning the Flames<br/>San Zang and his disciples are getting closer to their destination when they arrive at the treacherous and impassible Mount Flame. In order to get past the fiery mountain and complete the journey, they will need the help a precious treasure. But to gain possession of the treasure, Sun Wu Kong will have to answer for past choices and confront former allies.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/86/02/9788994208602.jpg', 'title_long': 'Monkey King # Volume 15 : Fanning the Flames', 'edition': 'First Edition', 'dimensions': 'Height: 7.25 Inches, Length: 5 Inches, Weight: 0.5291094288 Pounds, Width: 0.3 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5}, 'width': {'unit': 'inches', 'value': 0.3}, 'weight': {'unit': 'pounds', 'value': 0.5291094288}, 'height': {'unit': 'inches', 'value': 7.25}}, 'pages': 176, 'date_published': '2012-01-01', 'subjects': ["Children's Books", 'Fairy Tales, Folk Tales & Myths', 'Comics & Graphic Novels', 'Geography & Cultures', 'Explore the World'], 'authors': ['Wei Dong Chen'], 'title': 'Monkey King # Volume 15 : Fanning the Flames', 'isbn13': '9788994208602', 'msrp': 9.99, 'binding': 'Paperback', 'isbn': '8994208607', 'isbn10': '8994208607'}}