{'book': {'publisher': 'Springer', 'synopsis': "The function of philosophy may be circumscribed as consisting in ma king a keen analysis of the peculiar nature of the crisis-situation, as it has existed among men throughout the centuries of human history, and as it manifested itself in definite ways at the various stages of this his tory. That is to say, philosophy may be regarded as the discipline which, again and again, will have to determine the authenticity of man's ex istence in the light of the changing conditions of life, i. e. , man's chang ing needs and interests. Fundamentally, these needs may be regarded as being of a material, an intellectual, an aesthetical and a spiritual kind. On the grounds of the crisis, which inevitably exists among men on ac count of the controversial nature of their various truth-perspectives, as they are postulated on a personal level, in the sciences, in history, in the fine arts and in theology, man creates and re-creates the goods of civilization and the cultural values. The task of philosophy consists then in making an ever new assessment of man's changing needs, in terests and aspirations on the basis of the specific conflicts and prob lems with which man wrestles at a certain historical stage. It is in this way that the important philosophical systems were constructed, which we still admire to-day.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/01/77/9789024750177.jpg', 'title_long': 'Contemporary Philosophical Alternatives and the Crisis of Truth: A Critical Study of Positivism, Existentialism and Marxism', 'edition': '1970', 'dimensions': 'Height: 9.25 Inches, Length: 6.1 Inches, Weight: 1.212542441 Pounds, Width: 0.39 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.1}, 'width': {'unit': 'inches', 'value': 0.39}, 'weight': {'unit': 'pounds', 'value': 1.212542441}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 168, 'date_published': '1971-07-31', 'subjects': ['Crafts, Hobbies & Home', 'Gardening & Landscape Design', 'Politics & Social Sciences', 'Philosophy', 'Ethics & Morality', 'Metaphysics', 'Modern', 'Movements', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['G.A. Rauche'], 'title': 'Contemporary Philosophical Alternatives and the Crisis of Truth: A Critical Study of Positivism, Existentialism and Marxism', 'isbn13': '9789024750177', 'msrp': 109, 'binding': 'Paperback', 'isbn': '9024750172', 'isbn10': '9024750172'}}