{'book': {'publisher': 'Martinus Nijhoff', 'synopsis': "The Character of Seventeenth-Century French Protestantism and the Place of the Huguenot Refuge following the Revocation of the Edict of Nantes Thirty-seven years ago the late Emile-G. Leonard regretted that there were so few historical studies of seventeenth-century French Protestantism and no general 1 historical synthesis for the period as a whole. At the time Leonard's observation was accurate. Seventeenth-century French Protestantism traditionally remained a questionable and problematical subject for historians. All too frequently historians neglected it in favor of emphasizing its origins in the second-half of the sixteenth century and its renascence since the French Revolution. When the rare historian broke his silence and considered French Protestantism in the seventeenth-century, was meager and generally ambivalent or negative. The historiographer his treatment of seventeenth-century French Protestantism could only cite the outstanding works of Jean Pannier and Orentin Douen, which taken together emphasized the new pre eminence of Parisian Protestantism in the seventeenth century, and the genuine works of synthesis by John Vienot and Matthieu Lelievre, which again had to be placed side by side in order to complete coverage of the whole of the seventeenth 2 century. The only true intellectual history of seventeenth-century French Protestantism was the study by Albert Monod, which, however, dealt with the second-half of the century and, then, only in the broad context of both Protestant 3 and Catholic thought responding to the challenge of modern rationalism.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/15/03/9789024731503.jpg', 'title_long': 'Theology, Politics and Letters at the Crossroads of European Civilization: Jacques Basnage and the Baylean Huguenot Refugees in the Dutch Republic (International Archives of the History of Ideas, 107)', 'edition': 'First Edition', 'dimensions': 'Height: 9.21 Inches, Length: 6.14 Inches, Weight: 3.3951188348 Pounds, Width: 0.88 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.14}, 'width': {'unit': 'inches', 'value': 0.88}, 'weight': {'unit': 'pounds', 'value': 3.3951188348}, 'height': {'unit': 'inches', 'value': 9.21}}, 'pages': 354, 'date_published': '1987-03-31', 'subjects': ['Christian Books & Bibles', 'Protestantism', 'Arts & Photography', 'History', 'Europe', 'Netherlands', 'Historical Study & Educational Resources', 'World', 'Religious', 'Crafts, Hobbies & Home', 'Gardening & Landscape Design', 'Religion & Spirituality', 'Politics & Social Sciences', 'Philosophy', 'Modern', 'Movements', 'Social Sciences', 'Reference', 'Politics & Government', 'International & World Politics', 'Political Science', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Gerald Cerny'], 'title': 'Theology, Politics and Letters at the Crossroads of European Civilization: Jacques Basnage and the Baylean Huguenot Refugees in the Dutch Republic (International Archives of the History of Ideas, 107)', 'isbn13': '9789024731503', 'msrp': 277.44, 'binding': 'Hardcover', 'isbn': '902473150X', 'isbn10': '902473150X'}}