{'book': {'publisher': 'Springer', 'synopsis': "This book contains some of the material which originally appeared in my Ph. D. thesis Lexical Phonology, submitted at the Massachusetts Institute of Technology, but it can hardly be called a revised version of the thesis. The theory that I propose here is in many ways radically different from the one that I proposed in the thesis, and there is a great deal of new data and analyses from English and Malayalam. Chapter VI is so new that I haven't even had the time to try it out on my friends. As everyone knows, research is a collective enterprise, even though an individual's name appears on the first page of the book or article. I would think of this book as a joint project involving dozens of people, in which I acted as the project coordinator, collecting suggestions from a wide variety of sources. Four major influences on what the book contains were Morris Halle, Paul Kiparsky, Mark Liberman, and Joan Bresnan. I learned the ropes of doing research on phonology, phonetics, and morphology from them, and almost everything that I discuss in this book owes its shape ultimately to one of them. Among the others who contributed generously to this book are: Jay Keyser, James Harris, Douglas Pulleyblank, Diana Archangeli, Donca Steriade, Elizabeth Selkirk, Francois Dell, Noam Chomsky, Philip Lesourd, Mohammed Guerssel, Michel Kenstovicz, Raj Singh, Will Leben, Joe Perkell, Victor Zue, Paroo Nihalani. P. Madhavan, and Stephanie Shattuck-Hafnagel.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/22/70/9789027722270.jpg', 'title_long': 'The Theory of Lexical Phonology (Studies in Natural Language and Linguistic Theory, 6)', 'edition': '1986', 'dimensions': 'Height: 9.25 Inches, Length: 6.1 Inches, Weight: 0.739 Pounds, Width: 0.53 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.1}, 'width': {'unit': 'inches', 'value': 0.53}, 'weight': {'unit': 'pounds', 'value': 0.739}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 231, 'date_published': '1987-01-31', 'subjects': ['Crafts, Hobbies & Home', 'Gardening & Landscape Design', 'Reference', 'Words, Language & Grammar', 'Phonetics & Phonics', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['K.P. Mohanan'], 'title': 'The Theory of Lexical Phonology (Studies in Natural Language and Linguistic Theory, 6)', 'isbn13': '9789027722270', 'msrp': 33, 'binding': 'Paperback', 'isbn': '9027722277', 'isbn10': '9027722277'}}