{'book': {'publisher': 'Kluwer Law Intl', 'synopsis': "The purpose of the present volume is to provide advanced students of European intregration and all those working with European Union law in practice with a compact collection of the most important primary and secondary sources of this law, a quick reference guide, and a desk-copy for rapid and frequent consultation. This collection has a number of advantages over previously available ones. First of all, it includes many documents relating to the institutions of the EU and their decision-making processes. Sources of law, such as the Rules of Procedure of Parliament, Council and Commission, are useful not only to the student who is trying to understand the work of these institutions but also to the practitioner who wants to check the formal legality of an act of one of these institutions. Barristers will appreciate the Statutes of the Court of Justice, the Rules of Procedure of both Courts of the EU, as well as additional documents, such as the official advice for lawyers preparing written pleadings for the Court of First Instance, and the Ombudsman Decision. Secondly, all regulations and directives, as well as most other documents, are reproduced with their preambles. In particular the preambles of the secondary sources provide useful information, since it is here that the institutions dispose of their duty of motivating their legislative activity. These passages are thus important for the interpretation of the operative parts of the legal rules. Thirdly, all documents are printed with article headlines. Since Community law is not exactly user-friendly in this respect, most headlines have been added by the editors. Those additions, as well as all other modifications of the official wording of the legal rules, are indicated by [brackets] and intended for the better understanding of the texts. Ease of access to the law is further enhanced in this volume by carefully designed tables of contents, one general and several specific for the longer documents, as well as a professional index to key words and expressions. The documents themselves were generally obtained directly from the institutions in electronic format, namely by downloading from the official web site of the EU, and in one case of the Council of Europe. Where documents have been amended subsequent to their adoption, these amendments have been incorporated into the text. All documents are thus `consolidated'. Wherever possible, the law has been updated to 30th June 1999. Subsequent amendments and important new legislation will be incorporated in new editions of this volume.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/30/23/9789041113023.jpg', 'title_long': 'European Union Law - Documents', 'edition': '1', 'dimensions': 'Height: 9.75 Inches, Length: 6.5 Inches, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1.5}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 688, 'date_published': '1999', 'authors': ['Frank Emmert (Editor)'], 'title': 'European Union Law - Documents', 'isbn13': '9789041113023', 'msrp': 49.5, 'binding': 'Paperback', 'isbn': '9041113029', 'isbn10': '9041113029'}}