{'book': {'publisher': 'Brill Academic Pub', 'synopsis': 'This book aims at offering a broad survey of the encounter between word and image studies and anthropology and to demonstrate the mutual benefits of this dialogue for both disciplines in the three fields of the image (Marin), the social history of writing (Petrucci), and memory (Yates). The themes discussed by the contributors to this volume, all specialists in their field, highlight each in their specific field one or more aspects of the agency of both text and image. Bridging the gap between the Anglo-Saxon and the Latin research traditions, this bilingual volume focuses on three major questions: What do we do with texts and images? How do texts and images become active cultural agents? And what do texts and images help us do? Contributions cover a wide range of topics and disciplines (from visual poetry to garden theory and from ekphrasis to new media art), and represent therefore the best possible overview of what cutting-edge analysis in word and image studies stands for today.', 'language': 'fr', 'image': 'https://images.isbndb.com/covers/37/40/9789042033740.jpg', 'title_long': 'Efficacité / Efficacy: How to Do Things With Words and Images? (Word and Image Interactions, 7) (French and English Edition)', 'edition': 'Bilingual', 'dimensions': 'Height: 9 Inches, Length: 6.25 Inches, Weight: 1.15963149812 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 1.15963149812}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 320, 'date_published': '2011-01-01', 'subjects': ['Arts & Photography', 'History & Criticism', 'Criticism', 'Politics & Social Sciences', 'Philosophy', 'Aesthetics', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Rodopi'], 'title': 'Efficacité / Efficacy: How to Do Things With Words and Images? (Word and Image Interactions, 7) (French and English Edition)', 'isbn13': '9789042033740', 'msrp': 110, 'binding': 'Paperback', 'isbn': '9042033746', 'isbn10': '9042033746'}}