{'book': {'publisher': 'Snoeck Publishers, Ghent/R union des Mus es Nationaux, Paris', 'synopsis': "A simple mission lies at the heart of Rubens: to give the most complete picture of the great Flemish master as possible. No fewer than 163 paintings, sketches, and drawings by the artist, plus nine tapestries, are put to this worthy task. A faithful, objective understanding of Rubens arises, from his beginnings under the influence of his master Otto Venius and Italian art, right through to the end of his career, when he basked in a major Spanish commission. Rubens is at home in all genres, and all are represented here: from landscapes to portraits, from altarpieces to genre scenes, and historical paintings too, of course. Even the talents of the decorator are revealed in his painted sketches, drawings, and tapestries. For this publication, the master's oeuvre is divided into five groupings: Rubens' Beginnings, Rubens and Italy, The Middle-Class Patron, Official Commissions, and Secular Subject Matter. Through the inclusion of tapestries, particular attention is paid to the genesis of his art. Works such as Descent from the Cross, Laying in the Sepulchre, The Stoning of Saint Stephen, and three altarpieces created for the city of Lille's churches and convents are included. From this impressive homage to Rubens, the general reader, connoisseur, and historian will all hopefully come to know Rubens better, and also be stimulated by the juxtaposition of works never presented in this way before.<br/><br/>Published on the occasion of Rubens, an exhibition at the Palais des Beaux Arts in Lille, France.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/50/01/9789053495001.jpg', 'title_long': 'Rubens', 'dimensions': 'Height: 11.5 Inches, Length: 8.5 Inches, Weight: 3.41055119314 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 3.41055119314}, 'height': {'unit': 'inches', 'value': 11.5}}, 'pages': 320, 'date_published': '2004-08-02', 'subjects': ['Arts & Photography', 'Individual Artists', 'Drawing', 'Painting'], 'authors': ['Barbara Brejon De Lavergnee', 'Hans Devisscher', 'Alexis Donetzkoff', 'Jacques Foucart', 'Barbara Gaehtgens', 'Natalia Gritsao', 'Alexis Merle du Bourg', 'Jean Vittet', 'Hans Vlieghe'], 'title': 'Rubens', 'isbn13': '9789053495001', 'msrp': 15.7, 'binding': 'Hardcover', 'isbn': '9053495002', 'isbn10': '9053495002'}}