{'book': {'publisher': 'Pepin Pr', 'synopsis': "This book contains stunning images for use as a graphic resource, or inspiration. All the illustrations are stored in high-resolution format on the enclosed free CD-ROM and are ready to use for professional quality printed media and web page design. The pictures can also be used to produce postcards, or to decorate your letters, flyers, etc. They can be imported directly from the CD into most design, image- manipulation, illustration, word-processing and e-mail programs; no installation is required. For most applications, single images can be used free of charge. Please consult the introduction to this book, or visit our website for conditions. Symbolism has always played an fundamental role in the pursuit of the occult. As the occult largely deals with that which is secret, not revealed and hidden, the mysterious and in particular the supernatural, knowledge of it could only be shared through 'intuitive understanding' rather than quantifiable scientific method. The extensive use of symbolic images proved an excellent manner of recording and relating this obscure and enigmatic lore while at the same time shielding it from the skeptical perception of the uninitiated. Over the ages a wealth of occult images has emerged, largely originating from arcane volumes of ancient hermetic doctrine. Most of the illustrations in this book have been taken from an armorial of this category, Les Devises Heroiques by Claude Paradin, published in 1556. If the use of these pictures was not intentionally occult, its origins for the larger part were so indeed.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/02/36/9789057680236.jpg', 'title_long': 'Occult Images (Agile Rabbit Editions)', 'edition': 'First Edition', 'dimensions': 'Height: 6.5 Inches, Length: 6 Inches, Weight: 0 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 0}, 'height': {'unit': 'inches', 'value': 6.5}}, 'pages': 272, 'date_published': '2002', 'subjects': ['Religion & Spirituality', 'Occult & Paranormal', 'Occultism'], 'authors': ['Rabbit Editions Agile'], 'title': 'Occult Images (Agile Rabbit Editions)', 'isbn13': '9789057680236', 'msrp': 19.99, 'binding': 'Paperback', 'isbn': '9057680238', 'isbn10': '9057680238'}}