{'book': {'publisher': 'Princeton Architectural Press', 'synopsis': "The left-field arts journal whose very name promises more to come delivers three issues this season. There aren't too many places to find intelligent, passionate, and semi-serious writing about the past, present, and future of visual culture and beyond. Dot Dot Dot, the brilliant journal edited by Stuart Bailey and Peter Bilak, is one of the few we've found.<br/>Issues 12 and 13 of this acclaimed graphic design journal are united by a thematic preoccupation with issues of distribution and dispersion. Exploring a variety of themes, including networks, schools, libraries, and the U.S. Postal Service, issue 12 collects pieces on and around these subjects, while issue 13 demonstrates them and doubles as a school magazine for the abandoned Manifesta 6 School on the island of Cyprus. Contributors to issues 12 and 13 include David Reinfurt, Ian Svenonius, Katherine Gillieson, Alex Waterman, Ryan Gander, Alice Fisher, Stuart Baile, Louis Lthi, David Greene, Samantha Hardingham, John Morgan, Studio, Steve Rushton, Ryan Holmberg, Mark Owens, Seth Price, Dieter Roelstraete, Chris Evans, Rob Giampietro, Dmitri Siegel, Radim Pesko, and Will Holder. Issue 14pursues the various lines of pedagogy, cupid, and psyche. In short, each issue swallows its predecessor.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/00/69/9789077620069.jpg', 'title_long': "Dot Dot Dot 12: Maybe It's Time It's Maybe", 'edition': '1', 'dimensions': 'Height: 9.3 Inches, Length: 6.6 Inches, Weight: 0.65918216338 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.6}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.65918216338}, 'height': {'unit': 'inches', 'value': 9.3}}, 'pages': 104, 'date_published': '2007-02-08', 'subjects': ['Arts & Photography', 'Graphic Design', 'Techniques'], 'authors': [], 'title': "Dot Dot Dot 12: Maybe It's Time It's Maybe", 'isbn13': '9789077620069', 'msrp': 119.45, 'binding': 'Paperback', 'isbn': '9077620060', 'isbn10': '9077620060'}}