{'book': {'publisher': 'International Labor Office', 'synopsis': "Workplace violence is one of today's most serious occupational hazards. This practical guide offers valuable information on how to systematically design and develop workplace prevention programs and policies. The book approaches the issue from two fronts. First, it demonstrates how workplace violence can be prevented by examining how organizations and groups are handling the problem. It reviews an array of existing guidelines and policies developed by governments, trade unions, special study groups, workplace violence experts, employers' groups, and specific industries and generates a useful survey of best practice strategies. Second, the guide outlines in detail a reliable and effective methodology for developing workplace violence prevention programs which includes: assessing and describing risk; designing, implementing, and monitoring preventive and reactive measures; and reviewing the risk management process. Every worker deserves a safe and secure environment and violence should not be accepted as part of any job. This book presents concrete guidance for combating violence in the workplace while also providing a wider understanding of the factors and conditions that contribute to it.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/37/42/9789221133742.jpg', 'title_long': 'Preventing and Responding to Violence at Work', 'dimensions': 'Height: 9.5 Inches, Length: 5.98 Inches, Weight: 0.03086471668 Pounds, Width: 0.49 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.98}, 'width': {'unit': 'inches', 'value': 0.49}, 'weight': {'unit': 'pounds', 'value': 0.03086471668}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 150, 'date_published': '2003-10-22', 'subjects': ['Business & Money', 'Business Culture', 'Workplace Culture', 'Economics', 'Labor & Industrial Relations', 'Human Resources', 'Human Resources & Personnel Management', 'Politics & Social Sciences', 'Social Sciences', 'Violence in Society', 'Politics & Government', 'Specific Topics', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Kimberly Ann Rogers', 'Duncan Chappell'], 'title': 'Preventing and Responding to Violence at Work', 'isbn13': '9789221133742', 'msrp': 14.54, 'binding': 'Paperback', 'isbn': '9221133745', 'isbn10': '9221133745'}}