{'book': {'publisher': 'OECD Publishing', 'synopsis': 'The implementation of biodiversity policies will often benefit different groups to a greater or lesser degree. At times, some groups in society lose out under certain policies. The source of these "distributive effects" lies in the policies\' objectives and the choice and implementation of policy instruments. Distributive effects impact the viability of biodiversity policies. Significant negative effects on specific groups can lead to policies being derailed, even if they help a large number of people. With sufficient planning, however, potential problems can be identified and their effect assessed; strategies can be developed to manage the distribution of impacts and ensure buy-in from negatively affected groups. Combining analysis and a wealth of case studies, this book offers concepts and tools for addressing distributive issues within a biodiversity policy context. It will help policymakers put together strategies for anticipating distributive impacts across different groups. The book will also aid in selecting processes and instruments that manage distributive impacts without compromising conservation objectives.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/43/10/9789264034310.jpg', 'title_long': 'People and Biodiversity Policies: Impacts, Issues and Strategies for Policy Action', 'dimensions': 'Height: 9.06 Inches, Length: 6.3 Inches, Weight: 0.792 Pounds, Width: 0.57 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.3}, 'width': {'unit': 'inches', 'value': 0.57}, 'weight': {'unit': 'pounds', 'value': 0.792}, 'height': {'unit': 'inches', 'value': 9.06}}, 'pages': 250, 'date_published': '2008-05-21', 'subjects': ['Business & Money', 'Economics', 'Environmental Economics', 'Sustainable Development', 'Science & Math', 'Biological Sciences', 'Animals', 'Nature & Ecology', 'Conservation', 'Politics & Social Sciences', 'Politics & Government', 'Public Affairs & Policy', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Timo Goeschl'], 'title': 'People and Biodiversity Policies: Impacts, Issues and Strategies for Policy Action', 'isbn13': '9789264034310', 'msrp': 53.78, 'binding': 'Paperback', 'isbn': '9264034315', 'isbn10': '9264034315'}}