{'book': {'publisher': 'OECD Publishing', 'synopsis': 'A comprehensive reference book on current developments in oil supply and demand. The first part provides data on world production, trade, prices and consumption of major oil product groups, with time series back to the early 1970s. The second part gives a more detailed and comprehensive picture of oil supply, demand, trade, production and consumption by end-user for each OECD country individually and for the OECD regions. Trade data are reported extensively by origin and destination.<br/>Oil Information is one of a series of annual IEA statistical publications on major energy sources; other reports are Coal Information, Electricity Information, Natural Gas Information and Renewables Information.<br/><br/>Table of Content :<br/><br/>PART I: SOURCES AND DEFINITIONS<br/>1. Introduction<br/>2. Recent data revisions<br/>3. General definitions<br/>4. Sources and notes<br/>5. Country notes<br/>6. Geographical coverage<br/>7. Abbreviations and conversion factors<br/>PART II: WORLD OIL DEVELOPMENTS<br/>-OECD energy consumption, oil demand and economic indicators<br/>-OECD CO2 emissions<br/>-World oil demand by country<br/>-World demand by main product groups<br/>-World demand by main product groups (kb/d)<br/>-OECD consumption of fuel oil according to sulphur content<br/>OECD use of biogasoline/biodiesel<br/>-World crude oil and NGL production<br/>-World refinery output<br/>-World trade of crude and products<br/>-IEA Crude import costs and oil products prices<br/>-Graphs<br/>PART III: DETAILED OECD OIL DATA<br/>-OECD Total<br/>-OECD Americas<br/>-OECD Asia Oceania<br/>-OECD Europe<br/>-IEA Total<br/>-Australia<br/>-Austria<br/>-Belgium<br/>-Canada<br/>-Chile<br/>-Czech Republic<br/>-Denmark<br/>-Estonia<br/>-Finland<br/>-France<br/>-Germany<br/>-Greece<br/>-Hungary<br/>-Iceland<br/>-Ireland<br/>-Israel<br/>-Italy<br/>-Japan<br/>-Korea<br/>-Luxembourg<br/>-Mexico<br/>-Netherlands<br/>-New Zealand<br/>-Norway<br/>-Poland<br/>-Portugal<br/>-Slovak Republic<br/>-Slovenia<br/>-Spain<br/>-Sweden<br/>-Switzerland<br/>-Turkey<br/>-United Kingdom<br/>-United States<br/>PART IV: OECD HISTORICAL SERIES<br/>-Production<br/>-Net imports<br/>-Refinery input<br/>-Gross refinery output<br/>-Gross consumption by product<br/>-Transformation<br/>-Energy industry own use<br/>-Final consumption<br/>-Transport<br/>-Industry<br/>-Other', 'language': 'en', 'image': 'https://images.isbndb.com/covers/47/23/9789264104723.jpg', 'title_long': 'Oil Information 2011', 'dimensions': 'Height: 11 Inches, Length: 8.25 Inches, Weight: 3.64 Pounds, Width: 1.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.25}, 'width': {'unit': 'inches', 'value': 1.75}, 'weight': {'unit': 'pounds', 'value': 3.64}, 'height': {'unit': 'inches', 'value': 11}}, 'pages': 744, 'date_published': '2011-08-16', 'subjects': ['Business & Money', 'Industries', 'Energy & Mining', 'Engineering & Transportation', 'Engineering', 'Energy Production & Extraction', 'Reference', 'Almanacs & Yearbooks', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['OECD Organisation for Economic Co-operation and Development'], 'title': 'Oil Information 2011', 'isbn13': '9789264104723', 'msrp': 231, 'binding': 'Paperback', 'isbn': '9264104720', 'isbn10': '9264104720'}}