{'book': {'publisher': 'Pan American Health Organization', 'synopsis': 'En los últimos años las zoonosis y las enfermedades transmisibles comunes al hombre y a los animales han venido siendo objeto de una creciente atención en todo el mundo. Las enfermedades humanas que tienen sus orígenes en animales infectados, como el SIDA o la enfermedad de Creutzfeldt-Jakob, han puesto de relieve la necesidad de lograr una mejor comprensión acerca de las enfermedades de los animales. La facilidad y la velocidad de los viajes modernos contribuyen a la propagación de enfermedades antes limitadas a zonas geográficas específicas, como ocurrió recientemente con la muy publicitada epidemia de síndrome respiratorio agudo grave (SARS, por su sigla en ingés). Las migraciones y el comercio de animales plantean una amenaza similar, según quedó demostrado en los Estados Unidos con los brotes de la fiebre del Nilo occidental y, últimamente, de la viruela de los monos, dos enfermedades anteriormente desconocidas en el continente americano. Cada uno de esos ejemplos pone de relieve la necesidad de contar con información exacta y actualizada, como la presentada en la última edición de Zoonosis y enfermedades transmisibles comunes al hombre y a los animales.<br/><br/>Esta nueva edición, la tercera, se presenta por primera vez en tres volúmenes:<br/><br/>IBacteriosis y micosis<br/>IIClamidiosis, rickettsiosis y virosis<br/>IIIParasitosis<br/>Esta obra presenta un panorama detallado de las enfermedades zoonóticas históricas y emergentes más importantes, como enfermedad de Ébola, fiebre aftosa, influenza, giardiasis, encefalitis japonesa, shigelosis y encefalopatías espongiformes, con información que abarca desde su primera aparición y sus brotes más importantes hasta los conocimientos científicos más recientes acerca de dichas enfermedades y sus agentes causales.<br/><br/>Los capítulos proporcionan la siguiente información clave sobre cada enfermedad:<br/>etiología<br/>distribución geográfica<br/>síntomas y presentación en el hombre y los animales<br/>fuente de infección y modo de transmisión<br/>papel de los animales en la epidemiología<br/>técnicas de diagnóstico<br/>medidas de prevención y control<br/><br/>El texto está complementado con numerosos cuadros y figuras que ilustran los modos de transmisión.<br/><br/>El libro constituye una herramienta esencial para biólogos, parasitólogos, virólogos, veterinarios, médicos, epidemiólogos y trabajadores de instituciones de salud pública y sanidad animal, al igual que para profesores, investigadores y estudiantes en estos campos. Todos ellos encontrarán en la tercera edición de Zoonosis y enfermedades transmisibles comunes al hombre y a los animales un valioso material para enriquecer su colección de obras de consulta.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/99/25/9789275319925.jpg', 'title_long': 'Zoonosis y enfermedades transmisibles comunes al hombre y a los animales (DEFAULT_SET) (Spanish Edition)', 'edition': '3', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.38 Pounds, Width: 0 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0}, 'weight': {'unit': 'pounds', 'value': 1.38}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 480, 'date_published': '2003-12-12', 'subjects': ['Medical Books', 'Administration & Medicine Economics', 'Public Health', 'Medicine', 'Internal Medicine'], 'authors': ['Pan American Health Organization'], 'title': 'Zoonosis y enfermedades transmisibles comunes al hombre y a los animales (DEFAULT_SET) (Spanish Edition)', 'isbn13': '9789275319925', 'msrp': 36, 'binding': 'Paperback', 'isbn': '9275319928', 'isbn10': '9275319928'}}