{'book': {'publisher': 'United Nations University Press', 'synopsis': 'While many consider the World Trade Organization to be a major contributor to growth in world income, others\x97including many environmentalists\x97view it with suspicion and even animosity. With the failure to launch a new round of WTO negotiations in Seattle, dealing with the principal issues in the trade and environment debate will preoccupy negotiators at the next meeting of Trade Ministers in late 2001 in Qatar, and well into the millennium. This book provides an overview of the key issues for negotiation at the Qatar meeting and well beyond. The authors are world authorities in their respective areas. Their contributions to the first edition of Trade, Environment and the Millennium have been broadened and deepened in the light of the experience of the failed negotiations in Seattle, and other relevant developments in the WTO over the past two years. Gary P. Sampson is currently on leave from the WTO. He holds the posts of professor of International Economic Governance at the Institute of Advanced Studies at the United Nations University and visiting academic at the London School of Economics. W. Bradnee Chambers is an associate fellow and coordinator of the Environment, Multilateralism and Governance Programme of the Institute of Advanced studies, United Nations University, Tokyo.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/06/46/9789280810646.jpg', 'title_long': 'Trade, Environment, and the Millennium', 'edition': 'Second', 'dimensions': 'Height: 9.09 Inches, Length: 6.1 Inches, Weight: 1.48 Pounds, Width: 1.02 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.1}, 'width': {'unit': 'inches', 'value': 1.02}, 'weight': {'unit': 'pounds', 'value': 1.48}, 'height': {'unit': 'inches', 'value': 9.09}}, 'pages': 464, 'date_published': '2002-05-01', 'subjects': ['Business & Money', 'Economics', 'Environmental Economics', 'Sustainable Development', 'International', 'Science & Math', 'Nature & Ecology', 'Conservation', 'Environment', 'Environmentalism', 'Politics & Social Sciences', 'Politics & Government', 'International & World Politics', 'Public Affairs & Policy'], 'authors': [], 'title': 'Trade, Environment, and the Millennium', 'isbn13': '9789280810646', 'msrp': 1.99, 'binding': 'Paperback', 'isbn': '9280810642', 'isbn10': '9280810642'}}