{'book': {'publisher': 'United Nations University Press', 'synopsis': 'This book recognizes that any attempt to reduce hunger requires a sound understanding of which people are affected. It differentiates between food shortage (regional food scarcity), food poverty (inadequate household food supplies), and food deprivation (individual malnutrition) in order to identify the causes of hunger and recommend ways to effectively target interventions. It also focuses on a critical second question--how do we know who the hungry are? The authors explain commonly-used means of measuring hunger, the assumptions embedded in these measures, and what can and cannot be concluded from the evidence. They examine how rules for food distribution operate under normal versus crisis conditions. The shortage/poverty/deprivation framework is designed to call attention to hunger even when food is abundant, as well as to learn how hunger is avoided even when food is scarce. With many tools in place for combating hunger, the book draws attention to the policies that are working and to the individuals, households, and communities that are underserved. The book refines common thinking about the underlying causes of hunger by examining who are most affected.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/98/55/9789280809855.jpg', 'title_long': "Who's Hungry? And How Do We Know?: Food Shortage, Poverty, and Deprivation", 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.73413933246 Pounds, Width: 0.49 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.49}, 'weight': {'unit': 'pounds', 'value': 0.73413933246}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 216, 'date_published': '1998-03-01', 'subjects': ['Science & Math', 'Agricultural Sciences', 'Food Science', 'Medical Books', 'Administration & Medicine Economics', 'Health Policy', 'Politics & Social Sciences', 'Social Sciences', 'Demography', 'Politics & Government', 'International & World Politics', 'Public Affairs & Policy'], 'authors': ['Laurie Fields DeRose', 'Ellen Messer', 'Sara Millman'], 'title': "Who's Hungry? And How Do We Know?: Food Shortage, Poverty, and Deprivation", 'isbn13': '9789280809855', 'msrp': 19.95, 'binding': 'Paperback', 'isbn': '9280809857', 'isbn10': '9280809857'}}