{'book': {'publisher': 'United Nations University Press', 'synopsis': "Recent armed conflicts have drawn fresh attention to age-old questions concerning when war can be justified and what methods and targets are permissible during war. Over more than two millennia, the world's leading religious traditions\x97Hinduism, Judaism, Buddhism, Christianity, and Islam\x97have provided guidance in these contested domains. This volume examines how the religions have responded to pressing moral challenges such as offensive and defensive war, the protection of noncombatants, asymmetric tactics, terrorism, and weapons of mass destruction.<br/>Written by an international team of distinguished specialists in their respective traditions, World Religions and Norms of War takes the reader on a journey through the evolution of attitudes and teachings related to the ethics of war. It systematically explores the historical roots and interpretations of norms within these traditions, linking them to the challenges of modern warfare. This combination of deep historical analysis and application to contemporary issues provides valuable insight and even prompts us to rethink our understanding of the role and influence of religion in the state and politics.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/16/36/9789280811636.jpg', 'title_long': 'World Religions and Norms of War', 'dimensions': 'Height: 9.37 Inches, Length: 6.34 Inches, Weight: 1.1 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.34}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 1.1}, 'height': {'unit': 'inches', 'value': 9.37}}, 'pages': 372, 'date_published': '2009-02', 'subjects': ['Christian Books & Bibles', 'Christian Living', 'Business & Professional Growth', 'Business & Money', 'Education & Reference', 'Reference', 'Encyclopedias & Subject Guides', 'Business', 'Religion & Spirituality', 'Religious Studies', 'Ethics'], 'authors': [], 'title': 'World Religions and Norms of War', 'isbn13': '9789280811636', 'msrp': 36, 'binding': 'Paperback', 'isbn': '9280811630', 'isbn10': '9280811630'}}