{'book': {'publisher': 'World Health Organization', 'synopsis': "A basic textbook addressed to medical and public health students, clinicians, health professionals, and all others seeking to understand the principles and methods used in cancer epidemiology. Written by a prominent epidemiologist and experienced teacher at the London School of Hygiene and Tropical Medicine, the text aims to help readers become competent in the use of basic epidemiological tools and capable of exercising critical judgment when assessing results reported by others. Throughout the text, a lively writing style and numerous illustrative examples, often using real research data, facilitate an easy understanding of basic concepts and methods. Information ranges from an entertaining account of the origins of epidemiology, through advice on how to overcome some of the limitations of survival analysis, to a checklist of questions to ask when considering sources of bias. Although statistical concepts and formulae are presented, the emphasis is consistently on the interpretation of the data rather than on the actual calculations. The text has 18 chapters. The first six introduce the basic principles of epidemiology and statistics. Chapters 7-13 deal in more depth with each of the study designs and interpretation of their findings. Two chapters, concerned with the problems of confounding and study size, cover more complex statistical concepts and are included for advanced study. A chapter on methodological issues in cancer prevention gives examples of epidemiology's contribution to primary prevention, screening and other activities for early detection, and tertiary prevention. The concluding chapters review the role of cancer registries and discuss practical considerations that should be taken into account in the design, planning, and conduct of any type of epidemiological research.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/40/53/9789283204053.jpg', 'title_long': 'Cancer Epidemiology: Principles and Methods', 'edition': '2Rev Ed', 'dimensions': 'Height: 10 Inches, Length: 8 Inches, Weight: 2.22225960096 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 2.22225960096}, 'height': {'unit': 'inches', 'value': 10}}, 'pages': 452, 'date_published': '1999-12', 'subjects': ['Science & Math', 'Medical Books', 'Medicine', 'Internal Medicine', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['I. dos santos Silva'], 'title': 'Cancer Epidemiology: Principles and Methods', 'isbn13': '9789283204053', 'msrp': 45, 'binding': 'Paperback', 'isbn': '9283204050', 'isbn10': '9283204050'}}