{'book': {'publisher': 'Tara Books', 'synopsis': '"Both evocative and factually rich...Older teens, in addition to adults, will find this to be a standout both as a distinctive graphic narrative that combines two world storytelling traditions and as an examination of King’s life and its enduring legacy across the globe." -Booklist Starred Review<br/>"What excites me most here is how this approach can be used to reconnect the graphic novel to its many amazing antecedent narrative forms from around the world and reconfirms comics as a vast, unending human activity."\x97Paul Gravett, author of Graphic Novels: Stories To Change Your Life<br/><br/>"This YA crossover shows King’s life expressed through Chitrakar’s rich Patua art and Flowers’s poetic text."\x97Library Journal<br/><br/>I See the Promised Land traverses the milestones of Martin Luther King Jr.\'s short life, ministry, and journey. This graphic narrative brings together two diverse yet dramatic traditions of storytelling. Renowned African American writer and griot Arthur Flowers tells a tale\x97replete with destiny and the human condition to Manu Chitrakar\'s extraordinarily vivid and eloquent art of the Patua folk style of West Bengal, India.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/00/43/9789380340043.jpg', 'title_long': 'I See the Promised Land: A Life of Martin Luther King, Jr.', 'edition': '1', 'dimensions': 'Height: 9.5 Inches, Length: 6.5 Inches, Weight: 1.06042348022 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 1.06042348022}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 142, 'date_published': '2010-11-30', 'subjects': ['Biographies & Memoirs', 'Community & Culture', 'Black & African American', "Children's Books", 'Comics & Graphic Novels', 'Graphic Novels', 'Superheroes', 'Historical & Biographical Fiction'], 'authors': ['Arthur Flowers'], 'title': 'I See the Promised Land: A Life of Martin Luther King, Jr.', 'isbn13': '9789380340043', 'msrp': 16.95, 'binding': 'Hardcover', 'isbn': '9380340044', 'isbn10': '9380340044'}}