{'book': {'publisher': 'Lectorum Pubns', 'synopsis': "<p>Nora Roberts -la maestra del suspenso romantico con mas de treinta y cinco millones de ejemplares vendidos de sus libros- presenta su historia mas apasionante hasta la fecha: el misterio de una bella estatuilla renacentista.La doctora Miranda Jones, experta mundial en arte del Renacimiento, acude a Italia para verificar la autenticidad de un bronce que representa a una cortesana de la epoca de los Medicis, y que se conoce como La dama oscura. Pero, en lugar de cimentar la posicion de Miranda como especialista lider en el area, el trabajo casi destruye su prestigio cuando se cuestiona su juicio profesional. Alejada emocionalmente de su madre, con un hermano inmerso en sus propios problemas, Miranda no tiene a quien recurrir excepto a Ryan Boldari, coleccionista y dueno de varias galerias de arte, pero tambien un seductor ladron cuyo proyecto personal los fuerza a una alianza con reservas.La dama oscura puede albergar tantos secretos como su hermosa fuente de inspiracion los tuvo en el pasado. Para Miranda, obligada a confiar solo en si misma y en un socio que le ofrece a la vez sospechas desconcertantes y una pasion que la ahoga, el unico camino a seguir implica traicion y peligro.'No hay ningun misterio en por que Roberts es una exitosa autora de novelas de suspenso romantico: ofrece al lector una historia con desenvoltura e ingenio'Publishers Weekly.</p>", 'language': 'en', 'image': 'https://images.isbndb.com/covers/15/44/9789500821544.jpg', 'title_long': 'La dama del faro', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.01 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.01}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 372, 'date_published': '1999', 'subjects': ['Romance'], 'authors': ['Nora Roberts'], 'title': 'La dama del faro', 'isbn13': '9789500821544', 'msrp': 17.95, 'binding': 'Paperback', 'isbn': '9500821540', 'isbn10': '9500821540'}}