{'book': {'publisher': 'Planeta Pub Corp', 'synopsis': 'Product Description      Greta, who changed her name from Julia to distance herself from the rumor that she is the illegitimate daughter of Fidel Castro, follows an Argentine boyfriend back to Buenos Aires only to find herself alone and undocumented in a fascinating but foreign city.      From Publishers Weekly      A journalist, poet, and short-story writer, Terri Morell is a Cuban expatriate living in Argentina. In this, her first novel, Julia, who believes that she is the illigitimate daughter of Fidel Castro, the result of a fling in a foxhole during the Bay of Pigs in 1961, sets out on a risky journey to adulthood. After changing her name to Greta (as in Garbo) as an act of rebellion against her parents, she leaves Cuba to follow her boyfriend to Argentina, a place she finds fascinating and strange. The narrative is built on her meandering life, as recorded on a cassette player. Unfortunately, the resulting novel lacks a definite plot, and the secondary characters a motley crew of expatriate Cubans living in Argentina are never developed. Julia/Greta is not a likable or well-delineated character; she whines about everything, uses foul language, and is obsessed with sex. Her only motivation seems to be anger, especially toward her dysfunctional family and her boyfriend. Despite these failings, there is a certain vulnerability to her character that induces the reader to embrace her in her search for someone who will truly love her. General readers with a taste for the unusual narrative might appreciate this yarn. Recommended to large libraries and bookstores. Sandra Martin Arnold, Los Angeles Copyright 2001 Reed Business Information, Inc.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/42/12/9789504904212.jpg', 'title_long': 'Cubana Confesion (Spanish Edition)', 'dimensions': 'Height: 9.25 Inches, Length: 6 Inches, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.5}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 210, 'date_published': '2000', 'subjects': ['History', 'Americas', 'Caribbean & West Indies', 'Europe', 'Literature & Fiction', 'Reference', 'Foreign Language Study & Reference'], 'authors': ['Claribel Terre Morrell'], 'title': 'Cubana Confesion (Spanish Edition)', 'isbn13': '9789504904212', 'msrp': 21.95, 'binding': 'Paperback', 'isbn': '9504904211', 'isbn10': '9504904211'}}