{'book': {'publisher': 'Amorrortu Editores España SL', 'synopsis': 'Este libro es en lo esencial un intento de echar luz sobre la situación actual de la antropología social y cultural, momento «experimental» en que cada proyecto de investigación y escritura etnográficas es potencialmente un experimento que quiere cumplir su parte en la reconstrucción del edificio de la teoría antropológica, momento que es siempre un período de eclecticismo, ruptura de paradigmas, fragmentación, pero también aguda conciencia de las limitaciones de las teorías tradicionales para explicar la sociedad, la cultura y la naturaleza de la realidad. En ese marco la etnografía puede jugar un papel crucial en la reconceptualización teórica y la reconstrucción de la teoría social. Por eso los autores califican esta época como «momento etnográfico de las ciencias humanas». En tiempos en que el mundo se encamina aparentemente hacia una homogeneización creciente, la misión de esa disciplina consiste en redescubrir y revelarnos la diversidad, la presencia del «otro exótico», el «otro cultural», ese individuo de costumbres extravagantes que ya no mora exclusivamente en los territorios remotos y extraños, sino entre nosotros, en nuestra propia sociedad y aun en nuestras actitudes y construcciones imaginarias.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/65/32/9789505186532.jpg', 'title_long': 'La antropología como crítica cultural (Comunicación, cultura y medios) (Spanish Edition)', 'edition': '1', 'dimensions': 'Height: 0.52 Inches, Length: 8.78 Inches, Width: 5.2 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.78}, 'width': {'unit': 'inches', 'value': 5.2}, 'height': {'unit': 'inches', 'value': 0.52}}, 'pages': 272, 'date_published': '2000-05-01', 'subjects': ['Reference', 'Foreign Language Study & Reference', 'Politics & Social Sciences', 'Archaeology'], 'authors': ['George E. Marcus'], 'title': 'La antropología como crítica cultural (Comunicación, cultura y medios) (Spanish Edition)', 'isbn13': '9789505186532', 'msrp': 37.6, 'binding': 'Paperback', 'isbn': '9505186533', 'isbn10': '9505186533'}}