{'book': {'publisher': 'World Health Organization', 'synopsis': "The present book's inception was an initiative of the World Health Organization in Geneva. The initiative reflected the fact that WHO has responsibility for public health on a global basis, which implies a special responsibility for developing societies. The question which the WHO staff found themselves facing was what could be said in the context of developing societies about rates, patterns and trends in drinking and in alcohol-related problems, and about evidence on the effects of different alcohol policies and prevention programs? Reflecting the available literature, the analyses and arguments in Alcohol Policy and the Public Good had been based almost entirely on material from developed societies.<br/><br/>The original idea of this book was to prepare a volume in the tradition of Alcohol Policy and the Public Good, but drawing on material from developing societies, and directed at audiences in those societies.<br/><br/>The primary audience for which this book was written is those involved in dealing with alcohol problems in developing societies. This includes not only public health workers, and those involved in work in health, social work, law enforcement and public administration, but also policymakers and concerned citizens but also, an audience of students and scholars in developing societies. Besides these primary audiences it is hoped that scholars, public health workers, policymakers and others from developed societies, will also find that a sustained look at alcohol issues in the context of developing societies sheds new light and opens interesting perspectives on major issues in the field.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/26/35/9789519192635.jpg', 'title_long': 'Alcohol in Developing Societies: A Public Health Approach', 'dimensions': '276 p. : ill. ; 25 cm.', 'dimensions_structured': {'weight': {'unit': 'g', 'value': 553}}, 'pages': 263, 'date_published': '2002-01-01', 'subjects': ['Medical Books', 'Administration & Medicine Economics', 'Public Health', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['World Health Organization'], 'title': 'Alcohol in Developing Societies: A Public Health Approach', 'isbn13': '9789519192635', 'msrp': 23, 'binding': 'Paperback', 'isbn': '9519192638', 'isbn10': '9519192638'}}