{'book': {'publisher': 'Alfaguara', 'synopsis': 'The say good times don t last forever. During the first three decades of the twentieth century, the north embodied this truth. The golden age of saltpeter was in its final death throes. Places that once shone with the brilliance of gemstones threatened to become ghost towns. In the hamlet of Yungay, desolation was encroaching at the speed of light. This small town saw the birth of a woman who should have been named Malvarrosa but, because of a typographical error, was registered as Malarrosa and thus given an identity that would seal of her destiny. Description in Spanish: Dicen que todo lo bueno, tarde o temprano termina. Asi sucedio en el norte, durante su primer tercio del siglo XX. La edad de oro del salitre daba sus ultimos estertores, sitios que alguna vez brillaron como joyas amenazaban convertirse en pueblos fantasmas. Uno de ellos es Yungay, un caserio que corria veloz hacia su desaparicion. Alli nacio y crecio Malarrosa, quien debio llamarse Malvarrosa pero que por un error de inscripcion fue nombrada con una identidad que acabaria siendo sello de su destino. Con la matanza de obreros de San Gregorio como telon de fondo, Malarrosa despierta en un mundo de contrastes, amores no correspondidos y figuras paternales ahogadas en los vicios de un territorio moribundo.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/58/23/9789562395823.jpg', 'title_long': 'Mi nombre es Malarrosa/ My Name is Malarrosa (Spanish Edition)', 'dimensions': 'Height: 9.5 Inches, Length: 6 Inches, Weight: 0.9 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 256, 'date_published': '2009-01-20', 'subjects': ['Literature & Fiction', 'United States'], 'authors': ['Hernan Rivera Letelier'], 'title': 'Mi nombre es Malarrosa/ My Name is Malarrosa (Spanish Edition)', 'isbn13': '9789562395823', 'msrp': 19.99, 'binding': 'Paperback', 'isbn': '9562395820', 'isbn10': '9562395820'}}