{'book': {'publisher': 'BN Publishing', 'synopsis': 'Dale Carnegie\'s Radio Program: How to Win Friends and Influence People -<br/>Lesson 1:<br/>Gain insight into handling difficult people; Discover the keys to popularity; How young people can look for a job; & What employers want in their employees.<br/>COLGATE SHAVE CREAMS PRESENT DALE CARNEGIE, the man who can answer your problem! Millions of readers profit by reading Dale Carnegie\'s daily column of helpful advice in more than one hundred of America\'s leading newspapers; and his famous book, "HOW TO WIN FRIENDS AND INFLUENCE PEOPLE" has sold more copies during its first eighteen months of publication than any other non-fiction book in all history. Now Colgate brings Dale Carnegie\'s inspiring advice to you, on the radio, so everyone can take advantage of his proven rules for winning happiness and success.<br/>Gain insight into handling difficult people<br/>"Tune in" to Dale Carnegie\'s live radio broadcast in a particularly amusing edition of "How to Win Friends and Influence People". Gain insight into handling difficult people through the personal exploits of Dale Carnegie\'s guests, and benefit from learning Carnegie\'s "How to Win Rule" of the week on the futility of letting ourselves get upset by trivialities.<br/>Discover the keys to popularity<br/>Discover the keys to popularity and find out what makes people like or dislike you, in this insightful edition of Dale Carnegie\'s live radio show, "How to Win Friends and Influence People". Follow live interviews with five secretaries who share what they dislike about their bosses, and benefit from Dale Carnegie\'s five rules that will help you gain favor not only with your secretary, but with your wife, your children, your sweetheart, and everyone else.<br/>How young people can look for a job<br/>In yet another inspiring edition of Dale Carnegie\'s live radio broadcasts on "How to Win Friends and Influence People", Dale Carnegie tackles the problem of "the future" faced by twenty-one million American boys and girls between the ages of sixteen and twenty-four -and tries to find the solution. Don\'t miss Carnegie\'s tips on free youth services, and his advice on how young people can go about more intelligently looking for a job, and how they can get an education with little or no money.<br/>&<br/>What employers want in their employees.<br/>In this last broadcast featuring Dale Carnegie and his "How To Win Rules", Dale Carnegie explores what employers want in their employees. Find out the three main points he brings out that you can use immediately to help you get a job, help you win recognition in your job, and help you deal with people more effectually in both in business and in your home.<br/>And you won\'t to miss Dale Carnegie\'s GRAND SUMMARY of all of his rules on "How to Win Friends and Influence People" included in this special, final broadcast.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/35/60/9789562913560.jpg', 'title_long': "Dale Carnegie's Radio Program: How to Win Friends and Influence People - Lesson 1: Gain insight into handling difficult people; Discover the keys to ... ... & What employers want in their employees", 'dimensions': 'Height: 8 Inches, Length: 5 Inches, Weight: 0.53 Pounds, Width: 0.28 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5}, 'width': {'unit': 'inches', 'value': 0.28}, 'weight': {'unit': 'pounds', 'value': 0.53}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 116, 'date_published': '2006-12-10', 'subjects': ['Self-Help', 'Motivational', 'Success'], 'authors': ['Dale Carnegie'], 'title': "Dale Carnegie's Radio Program: How to Win Friends and Influence People - Lesson 1: Gain insight into handling difficult people; Discover the keys to ... ... & What employers want in their employees", 'isbn13': '9789562913560', 'msrp': 9.99, 'binding': 'Paperback', 'isbn': '9562913562', 'isbn10': '9562913562'}}