{'book': {'publisher': 'Norma S A Editorial', 'synopsis': '¿Se pone nervioso cuando sus amigos lo invitan a uno de los conciertos de temporada de la Sinfónica porque usted no distingue entre Beethoven y Bach? ¿Se siente incapaz de escoger la música apropiada para la cena de esta noche? ¿Le encantan los sonidos de la música clásica pero no sabe la diferencia entre un violín y una viola?<br/>Música clásica para dummies es una guía fácil que le ayudará a disfrutar la música clásica desde el principio. Si está interesado en ir a conciertos, comprar discos de obras maestras, o simplemente quiere ser capaz de hablar del tema de manera inteligente, ¡éste es el libro para usted!<br/>Con la ayuda de esta obra usted podrá:<br/>--Distinguir entre los diferentes estilos y géneros de música clásica del mundo occidental.<br/>--Utilizar el disco compacto que viene con el libro para identificar, entender y disfrutar obras maestras clásicas.<br/>--Ir debidamente preparado a un concierto: saber escoger los puestos más convenientes; entender el programa; identificar los diferentes instrumentos, y mucho más.<br/>--Leer y entender partituras.<br/>--Apreciar los sonidos de la orquesta - desde violines y violonchelos hasta trombones.<br/>--Coleccionar una maravillosa discoteca de música clásica enteramente a su gusto.<br/>--Localizar en Internet sensacionales sitios Web y grupos de conversación sobre música clásica.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/20/28/9789580442028.jpg', 'title_long': 'Música clásica para Dummies', 'dimensions': 'Height: 9.25 Inches, Length: 7 Inches, Weight: 1.5 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.5}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 348, 'date_published': '1997-01-01', 'subjects': ['Arts & Photography', 'Music', 'History & Criticism', 'Musical Genres', 'Computers & Technology'], 'authors': ['David Pogue', 'Scott Speck'], 'title': 'Música clásica para Dummies', 'isbn13': '9789580442028', 'msrp': 19.99, 'binding': 'Paperback', 'isbn': '9580442029', 'isbn10': '9580442029'}}