{'book': {'publisher': 'UNSPECIFIED VENDOR', 'synopsis': 'Después de toda la atención que concentró sobre las niñas el libro de Mary Pipher sobre qué pasa con las niñas de hoy, Reviviendo a Ofelia, los ojos de muchos estudiosos de la psicología y el comportamiento se voltearon hacia los niños y los riesgos y conflictos particulares que enfrentan en el mundo de hoy. Como resultado de esta nueva atención sobre los varones, se han realizado numerosos estudios que analizan en detalle el mundo privado de los niños y las singularidades de su educación. William Pollack es uno de estos expertos en la psicología de los niños y recoge en este trabajo no sólo su propia experiencia como terapeuta e investigador, sino los resultados de muchos de los más recientes e importantes estudios en este campo. La idea central de su trabajo es que la sociedad actual, a través de los mensajes contradictorios que les envía permanentemente a los hombres, obliga a los niños a colocarse desde una edad muy temprana lo que él llama la "camisa de fuerza del género", compuesta por todas las ideas anticuadas que tenemos sobre lo que es un hombre. Y en el proceso de imponerles este modelo, muchos niños salen lastimados en su fuero interno, y a veces también en el externo, pues se ven obligados a esconder sus verdaderos sentimientos y emociones. Esto ha causado que muchos niños enfrenten hoy conflictos que no siempre la sociedad reconoce y por eso muchos sufren, a veces silenciosamente, de una especie de abandono y aislamiento emocional que puede conducirlos a problemas como la baja autoestima, la soledad, el abuso del alcohol y las drogas, la depresión, el suicidio, el uso indiscriminado de la violencia y muchos otros. El propósito final del doctor Pollack es que, a través de la comprensión de los verdaderos sentimientos y emociones de los niños, aprendamos a verlos con nuevos ojos y comencemos a liberarlos de los estereotipos que los reprimen actualmente. ¿Qué deben hacer los padres? Pueden empezar por escuchar los consejos de Pollack en cuanto a la educación de los niños de hoy, el análisis de las causas centrales de muchos de los problemas de comportamiento masculinos y sus recomendaciones para evitar los errores más comunes.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/32/39/9789580453239.jpg', 'title_long': 'Qué pasa con los muchachos de hoy', 'dimensions': 'weight: 612 g', 'dimensions_structured': {'weight': {'unit': 'g', 'value': 612}}, 'pages': 488, 'date_published': '1999', 'subjects': ['Parenting & Relationships', 'Family Relationships', 'Motherhood', 'Reference', 'Foreign Language Study & Reference', 'Politics & Social Sciences', "Women's Studies"], 'authors': ['William Pollack'], 'title': 'Qué pasa con los muchachos de hoy', 'isbn13': '9789580453239', 'msrp': 21.1, 'binding': 'Paperback', 'isbn': '9580453233', 'isbn10': '9580453233'}}