{'book': {'publisher': 'Villegas Editores', 'synopsis': "Latino Book Award 2006 - Mejor Novela Romántica (Best Romance Novel) Fundación Libros y Letras de Colombia - Mejor Libro Colombiano de Ficción 2005 Premio Azorín Novela 2005 - España Fifty years ago, the beaches of Cannes set the stage for Joan and Soledad's first love. Half a century after having gone their separate ways, the two are reunited in an uncanny but romantic way—their corpses are found together, dressed up in nuptial attire. The novel develops as the departed's children search for the missing pieces to the puzzle of their parents' lives, and in their quest they find that their parents' death has a lot to show them about their own lives. Hace 50 años, las playas de Cannes se convirtieron en el escenario perfecto para que Joan y Soledad vivieran la historia de su primer amor. Sin embargo, medio siglo más tarde y tras haber forjado vidas aparentemente separadas, sus cadáveres son encontrados juntos y vestidos con trajes nupciales. A partir de este punto, sus respectivos hijos deberán armar el misterioso rompecabezas de las vidas de sus padres, en donde la muerte no sólo puede sellar un destino sino revelar el destino de los hijos.", 'language': 'es', 'image': 'https://images.isbndb.com/covers/08/94/9789588160894.jpg', 'title_long': 'El penultimo sueno (Spanish Edition)', 'edition': '1', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 1.4 Pounds, Width: 1.4 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.4}, 'weight': {'unit': 'pounds', 'value': 1.4}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 592, 'date_published': '2006-08-01', 'subjects': ['Literature & Fiction', 'World Literature', 'United States', 'Contemporary', 'Mystery, Thriller & Suspense', 'Mystery', 'Romance', 'Romantic Suspense'], 'authors': ['Angela Becerra'], 'title': 'El penultimo sueno (Spanish Edition)', 'isbn13': '9789588160894', 'msrp': 15.95, 'binding': 'Paperback', 'isbn': '9588160898', 'isbn10': '9588160898'}}