{'book': {'publisher': 'Odyssey Books & Maps', 'synopsis': "Home to one-quarter of the world's population and heir to the richest civilization in history, China exerts a magnetic attraction on visitors. Archeological treasures, architectural masterpieces, stunning natural beauty, and the inexhaustible variety of its people make any visit to China an unforgettable experience. China also has so many diverse regions that visitors often have difficulty in knowing where to begin. This guide helps narrow the options―with detailed descriptions of the major cities and their environs, popular tourist sites, suggested expeditions for more adventure, and the 31 World Heritage sites in China.<br/><br/>• The concise introduction to China 'then' and China 'now'<br/>• Now featuring World Heritage sites: China's thirty-one top cultural and scenic treasures<br/>• Coverage on select remote regions as well as the most visited cities and sites<br/>• Top museums<br/>• Beautifully illustrated<br/>• Resident writers and researchers<br/>• Comprehensive list of websites for up-to-date practicalities and further research and reading 130 color photos and 16 maps", 'language': 'en', 'image': 'https://images.isbndb.com/covers/79/49/9789622177949.jpg', 'title_long': 'China: Renaissance of the Middle Kingdom (Odyssey Illustrated Guides)', 'edition': 'Ninth Edition, Ninth edition', 'dimensions': 'Height: 8 Inches, Length: 5.6 Inches, Weight: 1.5 Pounds, Width: 1.1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.6}, 'width': {'unit': 'inches', 'value': 1.1}, 'weight': {'unit': 'pounds', 'value': 1.5}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 424, 'date_published': '2008-07-01', 'subjects': ['Travel', 'Asia', 'China'], 'authors': ['Charis Chan', 'Neil Art', 'Paul Mooney'], 'title': 'China: Renaissance of the Middle Kingdom (Odyssey Illustrated Guides)', 'isbn13': '9789622177949', 'msrp': 19.95, 'binding': 'Paperback', 'isbn': '9622177948', 'isbn10': '9622177948'}}