{'book': {'publisher': 'Odyssey', 'synopsis': "Home to one-quarter of the world's people and heir to the richest civilization in history, China continues to exert a magnetic attraction on visitors. Archaeological treasures, architectural masterpieces, stunning natural beauty and the inexhaustible variety of its people make any visit to China an unforgettable experience. China has so many diverse regions that visitors often have difficulty in knowing where to begin. This guide helps narrow the options. As well as detailed descriptions of the major cities and their environs, a selection of suggested expeditions for the more adventurous includes all the major tourist sites, the more remote provinces and several climbable mountains. Special sections examine such topics as Chinese opera, calligraphy and painting and opportunities for seeing unique wildlife. * Vital information on the practicalities of travel in China * Special chapter on the country's diverse cuisines * Suggested expeditions away from the beaten track * Literary excerpts give different perspectives on China * An overview of the Chinese economy * Particular focus on Chinese opera, calligraphy and painting * Detailed accounts of the major cities * Key to pronouncing Chinese", 'language': 'en', 'image': 'https://images.isbndb.com/covers/65/53/9789622176553.jpg', 'title_long': 'China: Sixth Edition (Odyssey Illustrated Guides)', 'edition': '6th', 'dimensions': 'Height: 7.75 Inches, Length: 1 Inches, Weight: 1.3 Pounds, Width: 5.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 1}, 'width': {'unit': 'inches', 'value': 5.5}, 'weight': {'unit': 'pounds', 'value': 1.3}, 'height': {'unit': 'inches', 'value': 7.75}}, 'pages': 350, 'date_published': '2000', 'subjects': ['Travel', 'Asia', 'General'], 'authors': ['charis-chan'], 'title': 'China: Sixth Edition (Odyssey Illustrated Guides)', 'isbn13': '9789622176553', 'msrp': 22.95, 'binding': 'Hardcover', 'isbn': '9622176550', 'isbn10': '9622176550'}}