{'book': {'publisher': 'Airphoto International Ltd.', 'synopsis': "To the modern reader, the Silk Road conjures up images of fabled cities and exotic lands, of long-gone empires and great conquerors. Place names such as Samarkand, Bukhara, Khotan and Chang'an continue to fascinate with the richness of their past. In this authoritative book, Luce Boulnois explores the encounter between East and West across the vast continental expanse that separates the Mediterranean world from the Chinese one. She unravels in a clear and compelling way the complex threads that make up the history of these great overland trade routes, which allowed the transmission across the world of ideas and beliefs, techniques and works of art, helping to shape civilisations that flourished along the way. How did the Romans, following in the footsteps of the Greeks, discover these far-flung regions? What did the Chinese know of the European world? How did they manage to keep the secret of silk manufacture safe for centuries? Did Marco Polo really go to China, or was he just a clever impostor?<br/><br/>In navigating through these questions Boulnois enlightens us about the relationships between the East and the West and their influence on each other in the light of recent archeological discoveries, while also taking into account the recent geopolitical upheavals that have swept through these regions. Color Illustrations and maps", 'language': 'en', 'image': 'https://images.isbndb.com/covers/72/15/9789622177215.jpg', 'title_long': 'Silk Road: Monks, Warriors & Merchants', 'edition': 'Special ed.', 'dimensions': 'Height: 8.2999834 Inches, Length: 6.0999878 Inches, Weight: 2.25 Pounds, Width: 1.1999976 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.0999878}, 'width': {'unit': 'inches', 'value': 1.1999976}, 'weight': {'unit': 'pounds', 'value': 2.25}, 'height': {'unit': 'inches', 'value': 8.2999834}}, 'pages': 574, 'date_published': '2005-11-15', 'subjects': ['History', 'Asia', 'Travel', 'General'], 'authors': ['Luce Boulnois', 'Helen Loveday'], 'title': 'Silk Road: Monks, Warriors & Merchants', 'isbn13': '9789622177215', 'msrp': 26.95, 'binding': 'Paperback', 'isbn': '9622177212', 'isbn10': '9622177212'}}