{'book': {'publisher': 'Hong Kong University Press', 'synopsis': "Many Chinese learners find it difficult to learn English words they are difficult to spell and say, change forms from noun to adjective to verb, have multiple meanings and are tricky to remember. This book suggests ways that teachers can help their students to learn English words. A problem frequently reported by Chinese learners is that they are unable to pronounce words that they have met in written contexts. They say their teachers have seldom taught them how to say the new words they find in their textbooks. Research has shown that if Chinese learners are taught the pronunciation of new words when they first meet them, the words are easier to learn. Another problem is knowing when and how to use words accurately in the right context, with the appropriate level of formality. Harsh Words provides a theoretical background explaining how words are learned and then focuses on the Chinese learner in particular. It covers vocabulary learning strategies, learning words in isolation as well as in context, testing vocabulary, common Chinese errors with words, and vocabulary activities to use in class. One chapter deals with the use of IT in vocabulary development and suggests web sites and software that teachers may want to use with their students. Each chapter contains tasks and revision questions while an answer key is provided at the end. The book is written for teachers, whether training to be English teachers or taking refresher courses, postgraduate diplomas or Master's. While much of the content is applicable to all levels of learners, teachers in secondary schools and universities will find it most useful.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/71/79/9789622097179.jpg', 'title_long': 'Harsh Words: English Words for Chinese Learners', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.63052206932 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.63052206932}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 188, 'date_published': '2005-05-05', 'subjects': ['Reference', 'Words, Language & Grammar', 'Linguistics', 'Study & Teaching', 'Vocabulary, Slang & Word Lists', 'Education & Teaching', 'Schools & Teaching', 'Education Theory', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Monica Hill'], 'title': 'Harsh Words: English Words for Chinese Learners', 'isbn13': '9789622097179', 'msrp': 17, 'binding': 'Paperback', 'isbn': '9622097170', 'isbn10': '9622097170'}}