{'book': {'publisher': 'Compass Publishing', 'synopsis': "The English You Need for the Office is the first book of a two-part series covering the essential vocabulary of the office for the general staff. The seond book (The English You Need for Business) covers the vocabulary essential for executives and outside the office.<br/>The English You Need for the Office introduces vocabulary for talking about daily processes in an office via a lively and flexible presentation. Suitable for in class and for self-study, the text's picture process format helps students learn the English needed for the office efficiently and effectively.<br/>Available separately, the Multi-skills Activity Book plus audio CD is an ideal complement to the main text and exercises listening, reading, comprehension and picture association skills on a chapter by chapter basis. The most important vocabulary is exercised in detail.<br/>Key Features<br/>- 56 color chapters<br/>- Basic vocabulary topics include using a copying machine, sending a fax,<br/>making telephone calls and office safety<br/>- Key vocabulary sideboards in every unit<br/>- Detailed index for every key term with usage notes<br/>- Appendices cover conversions, common world currencies and irregular verb tables<br/>- Free audio CD includes key vocabulary and chapter by chapter conversation practice<br/>- Separate Multi-skills Activity Book to complement the main text", 'language': 'zh', 'image': 'https://images.isbndb.com/covers/02/04/9789623280204.jpg', 'title_long': 'The English You Need for the Office, Multi-Skills Activity Book w/Audio CD', 'dimensions': 'Height: 10.75 Inches, Length: 8.25 Inches, Width: 0.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.25}, 'width': {'unit': 'inches', 'value': 0.25}, 'height': {'unit': 'inches', 'value': 10.75}}, 'pages': 90, 'date_published': '2003', 'subjects': ['Reference', 'English as a Second Language'], 'authors': ['Susan Dean', 'Lawrence J. Zwier'], 'title': 'The English You Need for the Office, Multi-Skills Activity Book w/Audio CD', 'isbn13': '9789623280204', 'msrp': 17, 'binding': 'Perfect Paperback', 'isbn': '9623280203', 'isbn10': '9623280203'}}