{'book': {'publisher': 'Diana', 'synopsis': 'Divertida, emocionante y bien escrita. Una guia sobre como descubrir a un conyuge enganador. Cuando el maridito llega a casa oliendo a perfume, el siguiente paso deberia ser comprar Guia para la venganza femenina Si estas enganando a tu otra mitad, este es el libro que no quieres que lea. De que es capaz una esposa enganada al descubrir que su marido tiene otra mujer? Greg y Ann Clouthier, investigadores privados, abren los archivos de sus casos y comparten 23 historias increibles e hilarantes sobre lo que puede suceder cuando una mujer es llevada al limite. Calculadoramente crueles, dulcemente perversas y traviesamente astutas, las mujeres utilizan su creatividad para vengarse: como la que puso crema para depilar en el champu de su marido, la que le cocino los peces de su acuario o la que mezclo laxante en los brownies que ei se comeria. Guia para la venganza femenina revela historias verdaderas de gente de diferentes ambitos, cuyos nombres y datos han sido cambiados para proteger a personas inocentes... y no tan inocentes.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/28/83/9789681342883.jpg', 'title_long': 'Guia para la venganza femenina (Spanish Edition)', 'dimensions': 'Height: 8.5 Inches, Length: 5.25 Inches, Weight: 0.5 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.5}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 256, 'date_published': '2008-01-01', 'subjects': ['Self-Help', 'Relationships', 'Marriage', 'Emotions', 'Humor & Entertainment', 'Humor', 'Self-Help & Psychology', 'Health, Fitness & Dieting', 'Mental Health', 'Psychology & Counseling', 'Politics & Social Sciences', 'Sociology', 'Marriage & Family'], 'authors': ['Gregg y Ann Clouthier'], 'title': 'Guia para la venganza femenina (Spanish Edition)', 'isbn13': '9789681342883', 'msrp': 14, 'binding': 'Paperback', 'isbn': '9681342887', 'isbn10': '9681342887'}}