{'book': {'publisher': 'Aguilar', 'synopsis': 'Abolishing the line that separates reality from fiction has been, and will always be, one of the most sought after desires. While magic and literature have accomplished it, few writers have done so with such authority. In our time, no one has done so in such a fun and moving manner as Alfredo Bryce Echenique. Guía triste de París is an excellent example of Bryce Echenique\x92s renowned talent in recreating this world. He extracts information from both reality and fiction, giving us fourteen stories where that line, between what took place and what could have or should have happened, is impeccably abolished.<br/>Despues de varias novelas, Alfredo Bryce Echenique regresa a "ese endemoniado genero llamado cuento". Y lo hace con esta soberbia coleccion de relatos que llevan la marca de un escritor que ha hecho del amor y la amistad el lema de su vida.<br/>Abolir la frontera que separa la realidad de la ficcion ha sido, desde siempre, uno de los mas caros anhelos del ser humano. La magia y la literatura lo han conseguido, pero pocos privilegiados logran ejercerlas con suficiente autoridad, y en nuestro tiempo ninguno de modo tan divertido y conmovedor como Alfredo Bryce Echenique.<br/>"Guia triste de Paris" es una excelente muestra de su reconocido talento para recrear el mundo. Tomando materiales de ambos lados de esa frontera, Bryce nos entrega catorce historias en las que suprime limpiamente las barreras entre lo que fue y lo que pudo o debio ser. Una operacion que realiza con total naturalidad, pues, como el mismo confiesa, suele dejar a la fantasia "entrar y circular libremente por donde le de la real gana, en cualquier circunstancia o momento, incluso dormido".', 'language': 'es', 'image': 'https://images.isbndb.com/covers/61/91/9789681906191.jpg', 'title_long': 'Guía triste de París (Spanish Edition)', 'edition': '0', 'dimensions': 'Height: 8.5 Inches, Length: 5 Inches, Weight: 0.55 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.55}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 192, 'date_published': '1999-12-31', 'subjects': ['Literature & Fiction', 'World Literature', 'Romance'], 'authors': ['Alfredo Bryce Echenique'], 'title': 'Guía triste de París (Spanish Edition)', 'isbn13': '9789681906191', 'msrp': 14.95, 'binding': 'Paperback', 'isbn': '9681906195', 'isbn10': '9681906195'}}