{'book': {'publisher': 'Alamah', 'synopsis': 'Two thousand years ago Jesus called a small group of disciples to leave their nets and follow him. He gave them a teaching and a path of initiation. And now, at the turning of an age, the ascended master Jesus calls those who would be his disciples to take up that path, to walk and work with him again. Presented here are 28 steps on that path, with commentary and explanation by Elizabeth C. Prophet. The goal is to find and externalize the Christ within.<br/>Description in Spanish: De la mano del maestro es un curso completo y práctico para quien quiere ser algo más que un seguidor de Jesucristo; es para quien aspira a ser su discípulo.<br/>Esta obra contiene una cuidadosa selección de las enseñanzas de Jesús extraídas de sus discursos, así como citas de otros maestros ascendidos que complementan su sentido. También incluye ejercicios espirituales que ayudarán al lector a aplicar estas enseñanzas y a responder a los llamados del Maestro de manera cotidiana.<br/>Jesús nos invita a ser "pescadores de hombres", maestros que difundan su enseñanza en un mundo hambriento de su verdad y consuelo. A través de las páginas de este libro, el Señor te ofrece su mano y te invita a caminar a su lado.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/34/41/9789681913441.jpg', 'title_long': 'De la mano del Maestro/Walking with the Master: Answering the Call of Jesus (Spanish Edition)', 'dimensions': 'Height: 7.25 inches, Length: 4.75 inches, Weight: 1.15 Pounds, Width: 1 inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.75}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.15}, 'height': {'unit': 'inches', 'value': 7.25}}, 'pages': 636, 'date_published': '2004', 'subjects': ['Self-Help', 'Personal Transformation', 'Religion & Spirituality', 'New Age & Spirituality', 'New Thought'], 'authors': ['Elizabeth Clare Propher'], 'title': 'De la mano del Maestro/Walking with the Master: Answering the Call of Jesus (Spanish Edition)', 'isbn13': '9789681913441', 'msrp': 14.95, 'binding': 'Paperback', 'isbn': '9681913442', 'isbn10': '9681913442'}}