{'book': {'publisher': 'Aguilar', 'synopsis': 'Uno de los secuestros que mayor consternación ha causado en la opinión pública mexicana fue el de la escritora Ernestina Sodi y su hermana, la actriz laura Zapata, perpetrado por la banda de secuestradores "Los Tiras", quienes se encuentran tras las rejas a raíz de la denuncia que ambas presentaron después de su liberación. Las hermanas fueron privadas de su libertad la noche del 22 de septiembre del 2002 a la salida de un teatro, después de asistir a un ensayo de la actriz; golpeadas y amedrentadas, fueron trasladadas a una casa que los secuestradores adaptaron para retener a sus victimas y donde permanecieron encerradas, con los ojos vendados, mientras los secuestradores iniciaban las negociaciones para pedir su rescate. Después de transcurridos 18 días, y al no obtener respuesta de los familiares de sus victimas, los secuestradores liberaron a Laura Zapata. Sin embargo, Ernestina Sodi permaneció cautiva durante tres meses, hasta que su hermana menor, la cantante y actriz Thalía, completó la suma exigida. ENGLISH DESCRIPTION This is the kidnapping that has caused the greatest concern in Mexican public opinion. The abduction of Ernestina Sodi and her sister, the actress Laura Zapata, was perpetrated by a band of professionals, who are now incarcerated. The sisters were taken hostage in 2002, and Ernestina Sodi remained captive for three months, until her younger sister, the singer Thalía, came up with the demanded sum. Those days Ernestina Sodi endured physical and psychological abuses that left deep wounds in her life and that of her family. This book is the painful account of her confinement. Through its pages we penetrate the dark, violent, and merciless world of organized crime; we will also witness the desperation, impotence, rage, and infinite fear, but also the luminous hope of freedom.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/21/23/9789681912123.jpg', 'title_long': 'Libranos del mal. Relato de un secuestro', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6.25 Inches, Weight: 0.55 Pounds, Width: 0.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 0.25}, 'weight': {'unit': 'pounds', 'value': 0.55}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 200, 'date_published': '2006-10-01', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Actors & Entertainers', 'Memoirs', 'Humor & Entertainment', 'Politics & Social Sciences', 'Social Sciences', 'Criminology'], 'authors': ['Ernestina Sodi Miranda'], 'title': 'Libranos del mal. Relato de un secuestro', 'isbn13': '9789681912123', 'msrp': 16.95, 'binding': 'Paperback', 'isbn': '9681912128', 'isbn10': '9681912128'}}