{'book': {'publisher': 'Secretaria de Educacion Publica', 'synopsis': 'La serie Español. Cuarto grado está formada por dos nuevos libros de texto gratuitos. Lecturas y Actividades. Fueron elaborados en el año 2000 y sustituyen a todos los materiales que, hasta el ciclo 1999-2000, se utilizaron en las escuelas primarias para esta asignatura y grado.<br/><br/>El libro de Lecturas es el eje articulador de los nuevos materiales. Con base en los textos que reúne se plantean ejercicios y juegos en el libro de Actividades.<br/><br/>La elaboración de estos libros estuvo a cargo de maestros y especialistas cuya propuesta didáctica recupera, tanto resultados de investigaciones recientes sobre la adquisición de la lengua escrita y el desarrollo de habilidades comunicativas en los niños, como la amplia experiencia docente acumulada a lo largo de varios años por muchos profesores de este ciclo escolar.<br/><br/>Las maestras y los maestros de cuarto grado contarán además con el Libro para el maestro de Español, que incluye recomendaciones puntuales sobre el uso de los materiales dirigidos a los alumnos, las formas en que éstos se articulan y las maneras de vincular los otros libros de texto gratuitos del grado con los procesos de enseñanza de la lectura y la escritura. Este libro para el maestro se suma al Fichero. Actividades didácticas, previamente distribuido. Los dos materiales, en conjunto, ofrecen los apoyos necesarios para que los profesores desempeñen adecuadamente su labor docente en este campo.<br/><br/>La renovación de los libros de Español forma parte del proceso general para el mejoramiento de la calidad de la enseñanza primaria que desarrolla el gobierno de la República.<br/><br/>Para que esta tarea de renovación tenga éxito es indispensable mantener actualizados los materiales, a partir de las observaciones que surjan de su uso y evaluación. Para ello, son necesarias las opiniones de los niños y los maestros que trabajarán con estos libros, así como las sugerencias de las madres y los padres de familia que comparten con sus hijos las actividades escolares.<br/><br/>La Secretaría de Educación Pública necesita sus recomendaciones y críticas. Estas aportaciones serán estudiadas con atención y servirán para que el mejoramiento de los materiales educativos sea una actividad sistemática y permanente.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/05/98/9789682960598.jpg', 'title_long': 'Espanol Cuarto grado Lecturas', 'edition': '1', 'dimensions': 'Weight: 0.5 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 0.5}}, 'pages': 110, 'date_published': '1997', 'subjects': ['Subjects'], 'authors': ['Secretaría de Educación Pública', 'Javier Hinojosa'], 'title': 'Espanol Cuarto grado Lecturas', 'isbn13': '9789682960598', 'msrp': 128.36, 'binding': 'Unknown Binding', 'isbn': '9682960592', 'isbn10': '9682960592'}}