{'book': {'publisher': 'ADN Editores', 'synopsis': 'La manzana de Einstein hace referencia a quien construyera una teoría de la gravitación más general que la que realizó Isaac Newton: Albert Einstein. Éste propuso a principios del siglo XX dos teorías que revolucionaron la física: la teoría especial y general de la relatividad. Muchos conocen la anécdota —que no es cierta— de que a Newton se le ocurrió la ley de la gravitación universal cuando observó como caía una manzana del árbol. A partir de esa anécdota fue que para referirnos a las teorías de la relatividad escogimos a las nuevas manzanas que curvan el espacio tiempo y permiten que existan los hoyos negros, así como los viajes en el tiempo.Francisco Noreña Villarías nos lleva de la mano para entender ambas teorías cuyos resultados chocan con nuestro sentido común. Su destacada labor como maestro de física y matemáticas con estudiantes de 12 a 18 años en el Colegio Moderno Americano y en el Instituto Tecnológico Autónomo de México, así como su gran capacidad como divulgador de la ciencia nos permiten entender la relatividad especial y general gracias a su espléndida exposición escrita. El autor es maestro en ciencias y estudió la carrera de física en la Facultad de Ciencias de la UNAM.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/91/58/9789686849158.jpg', 'title_long': 'La manzana de Einstein (Spanish Edition)', 'edition': 'First Edition', 'dimensions': 'Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.37037660016 Pounds, Width: 0.31 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.31}, 'weight': {'unit': 'pounds', 'value': 0.37037660016}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 136, 'date_published': '2021-08-05', 'subjects': ['Science & Math', 'Physics', 'Mechanics'], 'authors': ['Francisco Noreña Villarías'], 'title': 'La manzana de Einstein (Spanish Edition)', 'isbn13': '9789686849158', 'msrp': 14.95, 'binding': 'Paperback', 'isbn': '9686849157', 'isbn10': '9686849157'}}