{'book': {'publisher': 'Editorial Pax Mexico', 'synopsis': 'After outlining the nutritional needs of children according to age, from the first year into adolescence, the authors show the importance of different foods while dispelling common doubts about sugar, sweets, diets, and snacks. They explain how to design a healthy and tasty menu that is also easy to prepare, offering a variety of possibilities and taking into account personal taste as well as the child’s own psychology.<br/><br/>Después de presentar las necesidades nutricionales según la edad—del primer año de vida en adelante—las autoras muestran la importancia de cada alimento y despejan las dudas comunes sobre el azúcar, la comida chatarra, las dietas y las entre comidas. Tambien muestra cómo diseñar un menú sano y nutritivo, fácil de preparar y bien balanceado para que los niños coman adecuadamente, ofreciendo en cada caso varias posibilidades y tomando en cuenta la psicología del niño y la sensibilidad personal.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/68/34/9789688606834.jpg', 'title_long': 'Recetario vegetariano para nutrir bien a niños melindrosos: Cómo balancear los nutrientes para tener hijos sanos', 'dimensions': 'Height: 9 Inches, Length: 6.75 Inches, Weight: 0.45 Pounds, Width: 0.24 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.75}, 'width': {'unit': 'inches', 'value': 0.24}, 'weight': {'unit': 'pounds', 'value': 0.45}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 120, 'date_published': '2007-04-01', 'subjects': ['Cookbooks, Food & Wine', 'Vegetarian & Vegan', 'Non-Vegan Vegetarian', 'Health, Fitness & Dieting', 'Diets & Weight Loss', 'Vegetarian', 'Nutrition', 'Parenting & Relationships', 'Parenting', 'Reference', 'Foreign Language Study & Reference'], 'authors': ['María Elena Díaz', 'María Elena Figueroa'], 'title': 'Recetario vegetariano para nutrir bien a niños melindrosos: Cómo balancear los nutrientes para tener hijos sanos', 'isbn13': '9789688606834', 'msrp': 13, 'binding': 'Paperback', 'isbn': '9688606839', 'isbn10': '9688606839'}}