{'book': {'publisher': 'Ediciones Paidós', 'synopsis': 'Aunque cada vez más homosexuales «salen del clóset», y a pesar de que en algunos países se toman medidas para evitar la discriminación basada en la orientación sexual y se buscan formas de extender a parejas de un mismo sexo los beneficios del matrimonio, en casi todo el mundo gays y lesbianas siguen siendo una minoría discriminada y marginada. Al mismo tiempo, constituyen una parte invisible de la sociedad heterosexual: se encuentran en todas las etnias, todas las clases sociales, todas las religiones, todas las profesiones, todas las ciudades del mundo (como lo resume una consigna alegremente coreada en las marchas del orgullo gay, «estamos en todas partes»). Con sus conductas y relaciones no circunscritas a los roles tradicionales, y al buscar modelos alternativos de pareja, de comunicación y de sexualidad, gays y lesbianas son un ejemplo paradigmático de lo que significa formar parte de una sociedad y simultáneamente vivir al margen de ella. Basada en las investigaciones más recientes y en su propia experiencia clínica y personal, la psicoterapeuta Marina Castañeda analiza y explica la dimensión subjetiva de la homosexualidad para todo aquel interesado en comprenderla desde dentro (los homosexuales mismos) o desde fuera (sus familiares, sus amigos, sus terapeutas). Entre los temas aquí estudiados destacan la manera como uno se vuelve homosexual y construye su identidad, la homofobia internalizada, el clóset, las dinámicas de las relaciones amorosas entre personas de un mismo sexo, la bisexualidad, la función social y cultural de la homosexualidad, las implicaciones de la marginalidad, y las perspectivas para las nuevas generaciones. La experiencia homosexual es, en suma, un libro innovador que con gran acierto contribuye a cubrir la preocupante ausencia de información seria y desprejuiciada sobre el tema en el mundo de habla hispana.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/42/81/9789688534281.jpg', 'title_long': 'La experiencia homosexual: Para comprender la homosexualidad desde dentro y desde fuera (Paidos contextos) (Spanish Edition)', 'dimensions': 'Height: 9.17321 Inches, Length: 6.10235 Inches, Weight: 0.7495716908 Pounds, Width: 0.8661417314 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.10235}, 'width': {'unit': 'inches', 'value': 0.8661417314}, 'weight': {'unit': 'pounds', 'value': 0.7495716908}, 'height': {'unit': 'inches', 'value': 9.17321}}, 'pages': 252, 'date_published': '2000-01-18', 'subjects': ['Self-Help', 'Relationships', 'Love & Romance', 'Literature & Fiction', 'Romance', 'Politics & Social Sciences', 'Social Sciences', 'LGBTQ+ Demographic Studies'], 'authors': ['Marina Castañeda'], 'title': 'La experiencia homosexual: Para comprender la homosexualidad desde dentro y desde fuera (Paidos contextos) (Spanish Edition)', 'isbn13': '9789688534281', 'msrp': 11.95, 'binding': 'Paperback', 'isbn': '9688534285', 'isbn10': '9688534285'}}