{'book': {'publisher': 'Suma', 'synopsis': "Communication and lack of it, crudeness and sense of humor, virtuality and reality, solitude and company, button and buttonhole, sadist and masochist, Lord and slave, Paula and Sapiens. Through a daring, intimate, tender, lively, direct, contemporary, ironic, and truly funny narrative, Rosa Penasco delves into the principles and rules that inspire the complicated and hidden world of S&M. Description in Spanish: Comunicacion e incomunicacion, crudeza y sentido del humor, virtualidad y realidad, soledad y compania, boton y ojal, sadico y masoquista, AMO y sumisa, Paula y Sapiens. AMOSAPIENS es un sadico que busca desesperadamente a su sumisa a traves de la red, para segun comenta en los chats ''complementarse como el boton y el ojal y alcanzar juntos el extasis, a traves del BDSM o el arte erotico del bondage o ataduras, dominacion, sadismo y masoquismo''. PAULA es una mujer en plena crisis de los treinta, ajetreada, trabajadora free lance, urbana, curiosa e inocente que, sin saber nada del tema, termina enredada a traves de un evolucionado juego erotico-cibernetico, primero en la red de los chats de sexo y, despues, en la red sadomasoquista que, poco a poco y con paciencia y maestria, le tiende el propio Sapiens. A traves de una narrativa audaz, intimista, tierna, agil, directa, contemporanea, ironica y muy divertida, Rosa Penasco consigue bucear por la complicada psicologia de AMO-AS, sumiso-as, y en los principios y reglas que inspiran las relaciones sadomasoquistas. La sumisa insumisa es, ademas de una novela erotica que muestra con claridad el oculto mundo del sadomasoquismo, una historia de dualidades, de opuestos y complementos.", 'language': 'es', 'image': 'https://images.isbndb.com/covers/39/56/9789705803956.jpg', 'title_long': 'La sumisa insumisa (Spanish Edition)', 'dimensions': 'Height: 9.25 Inches, Length: 6 Inches, Weight: 0.0104940036712 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 0.0104940036712}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 400, 'date_published': '2008-10-20', 'subjects': ['Literature & Fiction', 'Erotica', 'Romance', 'Contemporary'], 'authors': ['Rosa Penasco'], 'title': 'La sumisa insumisa (Spanish Edition)', 'isbn13': '9789705803956', 'msrp': 19.99, 'binding': 'Paperback', 'isbn': '9705803951', 'isbn10': '9705803951'}}