{'book': {'publisher': 'Alfaguara', 'synopsis': 'XI Premio Alfaguara de Novela<br/>Espiridiona Cenda, una joven cubana de sólo veintiséis pulgadas de estatura, llega a la Nueva York de fines del siglo XIX con el deseo de triunfar como bailarina y cantante. Esta biografía imaginaria de un personaje real recrea con libertad y una fabulación ilimitada las aventuras y desventuras de Chiquita, una mujer seductora e independiente que llegó a convertirse en una de las celebridades mejor pagadas de los teatros de vaudeville y las ferias de su tiempo.<br/>Elegante, humorística y llena de peripecias, la novela es un ambicioso fresco de una época pródiga en transformaciones sociales y milagros tecnológicos, en que las potencias se disputaban territorios, las cofradías secretas no habían perdido la esperanza de convertir el mundo en una gran Arcadia y las «curiosidades humanas» ejercían una extraña atracción sobre las multitudes.<br/>Protagonista de amores tempestuosos, dueña de un talismán mágico y testigo de intrigas diplomáticas, la liliputiense Chiquita vuelve a la vida en estas páginas, con todo su genio, su crueldad y su encanto, convertida en un personaje literario inolvidable. ENGLISH DESCRIPTION Twenty-six-inch tall Espiridiona Cenda disembarks in late 19th Century New York with one goal in mind\x97becoming the city’s most successful singer and dancer with her stage name, \x93Chiquita: The Living Doll”. This imaginary biography of the real-life woman recreates the adventures and misfortunes of Chiquita, an alluring and independent woman that lived to become one of the highest paid celebrities in the Vaudeville theatres and fairs of her day. The star of fiery romances, owner of a magic talisman, and witness to countless political intrigues, Chiquita comes to life in these pages as an unforgettable literary character\x97in all her glory, genius, cruelty and charm. Elegant, humorous, and brimming with adventures, the novel is an ambitious fresco of a period that abounded in social transformations and technological miracles, where the mightiest of countries fought for territories, where underground brotherhoods diligently worked to turn the world in to a great Arcadia, and where \x93human curiosities” exerted a strange fascination among the crowds.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/38/95/9789705803895.jpg', 'title_long': 'Chiquita (Spanish Edition)', 'edition': 'PRIMERA EDICION', 'dimensions': 'Height: 9.4 Inches, Length: 6 Inches, Weight: 1.39773074108 Pounds, Width: 2 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 2}, 'weight': {'unit': 'pounds', 'value': 1.39773074108}, 'height': {'unit': 'inches', 'value': 9.4}}, 'pages': 600, 'date_published': '2008-05-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Biographical', 'United States'], 'authors': ['Antonio Orlando Rodríguez'], 'title': 'Chiquita (Spanish Edition)', 'isbn13': '9789705803895', 'msrp': 19.99, 'binding': 'Paperback', 'isbn': '9705803897', 'isbn10': '9705803897'}}