{'book': {'publisher': 'Alfaguara', 'synopsis': 'Toqué mi cuerpo y le dije que sentía vergüenza, que mi cuerpo no era más que un poco de tierra, de pena, de desolación, de esclavitud. -Carlos Fuentes, El tuerto es rey-<br/><br/>La anécdota de la obra teatral de Carlos Fuentes es sencilla: una señora llamada Donata y su criado habitan una casa abandonada. Ambos están ciegos, pero cada uno cree que el otro ve. En la medida en que esta pieza obedece a las leyes del suspense, se trata del paulatino descubrimiento de que el otro está tan ciego como él mismo.<br/><br/>El tuerto es rey se estrenó con la dirección de Jorge Lavelli en el Theater An Der Wien de Viena, Austria el 25 de mayo de 1970.<br/><br/>En esta obra teatral, Donata y su criado, el Duque, habitan una casa que parece colapsarse. Ambos son ciegos, pero cada uno cree que sólo él lo está y que el otro ve; cada uno cree que el otro es su guardián, su lazarillo, su propiedad.<br/><br/>Ambos esperan el regreso del marido de Donata, quien ha fijado con severidad las reglas de conducta de su casa y luego abandonó a los ciegos a las tentaciones de la libertad: convertirse en otro, librarse tanto de la indiferente ausencia como de la promiscua sospecha del señor.<br/><br/>Carlos Fuentes, sobre El tuerto es rey:<br/><br/>"Se trata de una puesta en escena que muestra un sistema o relaciones de dependencia, en donde procuré que en ella coincidiesen el significante, la estructura y el significado, la cifra temática: ambos son identificables como una relación de dependencia. Se observa a la señora y su criado como personajes latinoamericanos que transitan constantemente de la nostalgia a la esperanza, del recuerdo a la premonición, de una América Hispana de lodo a una Europa de polvo, de ese espacio horizontal de los objetos y su posesión a otro espacio vertical de naturaleza desposeída. De las selvas de Tabasco a las aceras de París y de las ocupaciones finales (esperar la muerte) a las ocupaciones originales (inventar la vida)".', 'language': 'en', 'image': 'https://images.isbndb.com/covers/09/62/9789705800962.jpg', 'title_long': 'El tuerto es rey', 'dimensions': 'Height: 9.5 Inches, Length: 6 Inches, Weight: 0.881849048 Pounds, Width: 0.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.25}, 'weight': {'unit': 'pounds', 'value': 0.881849048}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 112, 'date_published': '2014-03-25', 'subjects': ['Literature & Fiction', 'Dramas & Plays', 'Regional & Cultural', 'United States'], 'authors': ['Carlos Fuentes'], 'title': 'El tuerto es rey', 'isbn13': '9789705800962', 'msrp': 14.99, 'binding': 'Paperback', 'isbn': '9705800960', 'isbn10': '9705800960'}}