{'book': {'publisher': 'Alfaguara', 'synopsis': "Eusebio Cardoso es un escritor que, al tiempo en que ve cómo se desmorona su segundo matrimonio por culpa de una infidelidad, le va narrando a un lector la escena que éste protagoniza cuando, al ir a visitar a su amigo pintor, él está teniendo relaciones sexuales con su esposa. Por una parte, se dará cuenta de la forma en que se ha ido fraguando la relación entre Matilde y Arturo. Todo ha empezado debido a que él es hijo de un prominente político que le cambió la cara a este país y ella necesita investigar al respecto para su tesis. Entonces, intercalada con su historia de enamoramiento pasional, estará la historia de un político mexicano mezclada con la de Empédocles y siguiendo las líneas de la filosofía helénica: sucede que este político se creía algo así como una reencarnación del filósofo. En el otro plano, vemos al profesor Cardoso viviendo un segundo romance con su segunda esposa en una ciudad norteamericana donde da clases sobre novela de la Revolución. Por su mecanismo bastante truculento, se sabrá que su actual esposa es media hermana de su esposa anterior. Algo que no pudo saberse sino hasta que la segunda se atrevió a leer una carta que dejó su madre biológica al momento de darla en adopción. De cualquier modo, y tras la sorpresa y el reencuentro entre ambas familias, éstas se desintegrarán por una infidelidad cometida por Cardoso. Será él quien decida irse a buscar al lector para emprender un viaje a lo más remoto de la península de Baja California. Entonces empezará el mecanismo del absurdo. Toda la plétora de personajes reales, históricos y de otras novelas tendrán cabida en una reunión que servirá para aclarar qué es lo que ha pasado. Porque sólo de esa forma se podrá llegar a un final que lo cierre todo, es decir, justo al principio. ENGLISH DESCRIPTION After meeting Irene in a conference, which bears a marked resemblance to his own daughter, Eusebio decides to abandon his life and family to move to the US with her. His new life appears to be going according to plan until Irene decides its time to read a letter written by her biological mother before giving her up for adoption, only to find out that her real mother is Eusebio's ex-mother-in-law. From then on, a series of frictions occur in parallel to the novel that he is writing, a symbolic story in which author and characters join together and share roles. This is a great work of literature.", 'language': 'es', 'image': 'https://images.isbndb.com/covers/26/76/9789705802676.jpg', 'title_long': 'Fricción (Spanish Edition)', 'dimensions': 'Height: 9.75 Inches, Length: 6.25 Inches, Weight: 1.15 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.15}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 456, 'date_published': '2008-03-01', 'subjects': ['Literature & Fiction', 'Literary', 'Romance', 'Historical'], 'authors': ['Eloy Urroz'], 'title': 'Fricción (Spanish Edition)', 'isbn13': '9789705802676', 'msrp': 24.99, 'binding': 'Paperback', 'isbn': '970580267X', 'isbn10': '970580267X'}}