{'book': {'publisher': 'Aguilar', 'synopsis': 'Voy a hablarte sobre tu familia y la mía. Sé muy bien que como padres tú y yo compartimos prioridades muy importantes. Al igual que tú, amo a mi familia más que a nada en el mundo y quiero que tengamos seguridad, salud, felicidad y prosperidad en todo lo que hagamos, tanto dentro del hogar como fuera de él. Los cínicos te dirán que en esta sociedad, que avanza a ritmo vertiginoso, la familia se está volviendo obsoleta, que simplemente es un concepto anticuado y olvidado, sepultado en el mundo atareado de la gente "culta". Estoy aquí para decirte que eso no es cierto. Actualmente la familia es mucho más importante que en las generaciones del pasado y su deterioro es inaceptable. Esta es una lucha que podemos y debemos ganar; lo haremos si logramos hacer nuestra tarea y nos abocamos a ella. En La familia es primero intento transmitirte, con suma precisión, lo que necesitas dejar de hacer y lo que debes hacer para guiar a tu familia con sentido y energía para que los mensajes e influencias nocivas sean disipadas. Quiero ayudarte a definir el éxito en esta labor para que tomes los pasos y así generarlo y asegurarlo para ti y los tuyos. Tu hijos son las estrellas de tu corona y es hora de que brillen; está bien que lo hagan y, si haces tu trabajo, seguramente brillarán. ENGLISH DESCRIPTION Families seldom have just one problem; trouble runs in packs. With over a quarter century of experience in family counseling, TV\'s "Dr. Phil" McGraw has learned that good parenting isn\'t a quick fix; it\'s a constant day-by-day tuning job that requires a thorough rethinking and reordering of priorities. In Family First, he delineates a realistic plan for changing family dynamics.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/32/92/9789707703292.jpg', 'title_long': 'La Familia es Primero: La Estrategia Ganadora para Crear una Familia Fenomenal (Family First)', 'edition': 'Spanish Language Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.05 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.05}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 448, 'date_published': '2006-01-01', 'subjects': ['Self-Help', 'Relationships', 'Parenting & Relationships', 'Family Relationships', 'Parenting'], 'authors': ['Phil Dr Mcgraw'], 'title': 'La Familia es Primero: La Estrategia Ganadora para Crear una Familia Fenomenal (Family First)', 'isbn13': '9789707703292', 'msrp': 19.95, 'binding': 'Paperback', 'isbn': '9707703296', 'isbn10': '9707703296'}}