{'book': {'publisher': 'Aguilar', 'synopsis': 'Quienes enfrentan los problemas del sobrepeso anhelan librarse de la pesada carga física y emocional que representan pero no tienen las herramientas suficientes ni la orientación adecuada para lograrlo, la mayoría de las veces pasan de una dieta a otra sin obtener buenos resultados y acrecentando sus malestares físicos y emocionales. Con La solución definitiva al sobrepeso el doctor Phil McGraw ofrece un programa comprobable para perder peso en forma permanente y empezar a vivir con pasión y poder renovados.<br/><br/>ENGLISH DESCRIPTIONDr. Phil wants to lead you to weight loss freedom. He\'s spent over thirty years working with overweight patients to get results that last. Now, in The Ultimate Weight Solution, he sounds his loudest wake-up call yet, giving the bottom-line truth and his unprecedented 7 Key approach to permanent weight loss. You know all too well that the "diet" experience can be bitterly disappointing. In this landmark book, Dr. Phil delivers an action-oriented plan to give you immediate results, results that will last a lifetime. Forget counting calories or tracking carbs or fat; you\'ll get the real reasons you\'ve lost control of your weight, with tools to identify what to eat, when to eat, how to eat, and why you eat when you don\'t want to.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/10/52/9789707701052.jpg', 'title_long': 'La solución definitiva al sobrepeso', 'edition': 'Spanish Language Edition', 'dimensions': 'Height: 8.75 Inches, Length: 5.75 Inches, Weight: 1.05 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.05}, 'height': {'unit': 'inches', 'value': 8.75}}, 'pages': 432, 'date_published': '2005-03-30', 'subjects': ['Cookbooks, Food & Wine', 'Special Diet', 'Health, Fitness & Dieting', 'Diets & Weight Loss', 'Weight Loss', 'Other Diets'], 'authors': ['Dr. Phil Mcgraw'], 'title': 'La solución definitiva al sobrepeso', 'isbn13': '9789707701052', 'msrp': 19.95, 'binding': 'Paperback', 'isbn': '9707701056', 'isbn10': '9707701056'}}