{'book': {'publisher': 'Aguilar', 'synopsis': 'Después del éxito sin precedentes de Quiúbole con...para chavas, Gaby Vargas y Yordi Rosado, a quienes ya conoces súper bien, forman en esta ocasión un nuevo dúo dinámico para revelarnos la otra cara de la moneda: Quiúbole con... para chavos, algo así como la media naranja del de las niñas, pero con un plus: está magníficamente ilustrado por los reconocidos dibujantes Humberto Ramos y Francisco Herrera, quienes poseen un estilo increíble y han trabajado para D.C. Comics e ilustraron el cómic del grupo Moderatto.La adolescencia es una etapa de la vida un poco complicada en la que, de la noche a la mañana y sin avisar, te llegan una tonelada de dudas existenciales, mil cambios en tu estado de ánimo (al estilo Dr. Jekyll y Mr. Hyde), cambios impresionantes en tu cuerpo e inquietudes de todo tipo. Por ejemplo,¿te has preguntado por qué ahora ves diferente a la amigas de tu hermana? Como que ya no te parecen tan feas,¿verdad?¿Te saca de onda que tus papás te sigan tratando como si siguieras en la primaria, sobre todo delante de tus cuates del fut? La escuela,¿sirve para algo? Y las drogas,¿de verdad son tan dañinas como dicen? Para enfrentar esta avalancha de dudas y no morir en el intento debes estar preparado. Y para ello no hay nada mejor que este libro. De hecho, no existe otro igual. ENGLISH DESCRIPTION After the unprecedented success of Quiúbole with... for Girls, Vargas and Rosado now reveal the other face of the coin: Quiúbole with... for Guys. Adolescence is a complicated stage of life in which, overnight and without warning, you are faced with uncertainties of all kinds. Here, guys will find the answer to all the questions that keep you up at night, from the physical to the mental changes.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/40/91/9789707704091.jpg', 'title_long': 'Quiubole con... para hombres (Spanish Edition)', 'edition': 'PRIMERA EDICION. SEGUNDA IMPRESION', 'dimensions': 'Height: 9.25 Inches, Length: 6 Inches, Weight: 1.7 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.7}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 400, 'date_published': '2006-11-01', 'subjects': ['Teen & Young Adult', 'Social Issues', 'Politics & Social Sciences'], 'authors': [], 'title': 'Quiubole con... para hombres (Spanish Edition)', 'isbn13': '9789707704091', 'msrp': 19.95, 'binding': 'Paperback', 'isbn': '9707704098', 'isbn10': '9707704098'}}