{'book': {'publisher': 'Santillana USA Publishing Company', 'synopsis': 'One of the major causes of teenage pregnancy is the lack of understanding effective contraceptive methods. As a psychologist specializing in human sexuality, Ochoa explains traditional and modern contraceptives. With her clever style she provides answers to common questions about birth control. This helpful guide will create awareness to the young generation of what it means to enjoy a responsible sex life. Description in spanish: El problema de los embarazos no deseados en las adolescentes es tan común como el lamentable desconocimiento de las formas en que pueden evitarlo; actualmente sólo un tercio de la población aplica de manera constante y consciente los métodos anticonceptivos, y es triste saber que el aborto resulta una práctica común. Con su incomparable estilo y el afilado ingenio que la caracteriza, en Los anticonceptivos explicados a los jóvenes Anabel Ochoa ofrece toda la información sobre las técnicas tradicionales –y las más actuales– para evitar el embarazo, siempre en forma sistematizada y comprensible. En estas páginas descubrirás: • Las ventajas y los inconvenientes de la píldora anticonceptiva; • qué es el anillo vaginal y cómo colocarlo en tu cuerpo; • cómo utilizar la inyección mensual y qué es el implante anticonceptivo; • todo sobre el condón masculino y el condón femenino; • qué es el diafragma, la esponja, los espermicidas y • cuáles son los anticonceptivos del futuro. Además, Anabel Ochoa expone con claridad las características y eficacia de los métodos naturales y responde todas las dudas relacionadas con la píldora de emergencia, los riesgos de un embarazo durante la lactancia y en qué consiste la píldora abortiva. Los anticonceptivos explicados a los jóvenes no sólo orienta a las nuevas generaciones en forma excelente, también crea la conciencia necesaria para que puedan gozar su sexualidad plenamente y con responsabilidad.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/22/71/9789707702271.jpg', 'title_long': 'Anticonceptivos Explicados a Los Jovenes (Spanish Edition)', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.7 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.7}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 272, 'date_published': '2005-11-30', 'subjects': ['Teen & Young Adult', 'Personal Health', 'Politics & Social Sciences', "Women's Studies", 'Education & Teaching', 'Schools & Teaching', 'Parent Participation'], 'authors': ['Anabel Ochoa'], 'title': 'Anticonceptivos Explicados a Los Jovenes (Spanish Edition)', 'isbn13': '9789707702271', 'msrp': 14.95, 'binding': 'Paperback', 'isbn': '9707702273', 'isbn10': '9707702273'}}