{'book': {'publisher': 'INFAROM', 'synopsis': "Continuing his series of books on the mathematics of gambling, the author shows how a simple-rule game such as roulette is suited to a complex mathematical model whose applications generate improved betting systems that take into account a player's personal playing criteria. The book is both practical and theoretical, but is mainly devoted to the application of theory. About two-thirds of the content is lists of categories and sub-categories of improved betting systems, along with all the parameters that might stand as the main objective criteria in a personal strategy - odds, profits and losses. The work contains new and original material not published before. The mathematical chapter describes complex bets, the profit function, the equivalence between bets and all their properties. All theoretical results are accompanied by suggestive concrete examples and can be followed by anyone with a minimal mathematical background because they involve only basic algebraic skills and set theory basics. The reader may also choose to skip the math and go directly to the sections containing applications, where he or she can pick desired numerical results from tables. The book offers no new so-called winning strategies, although it discusses them from a mathematical point of view. It does, however, offer improved betting systems and helps to organize a player's choices in roulette betting, according to mathematical facts and personal strategies. It is a must-have roulette handbook to be studied before placing your bets on the turn of either a European or American roulette wheel.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/20/78/9789738752078.jpg', 'title_long': 'Roulette Odds and Profits: The Mathematics of Complex Bets', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.64154518242 Pounds, Width: 0.45 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.45}, 'weight': {'unit': 'pounds', 'value': 0.64154518242}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 212, 'date_published': '2008-01-11', 'subjects': ['Computers & Technology', 'Programming Languages', 'Humor & Entertainment', 'Puzzles & Games', 'Gambling', 'Math Games', 'Science & Math', 'Mathematics', 'Applied'], 'authors': ['Catalin Barboianu'], 'title': 'Roulette Odds and Profits: The Mathematics of Complex Bets', 'isbn13': '9789738752078', 'msrp': 23, 'binding': 'Paperback', 'isbn': '9738752078', 'isbn10': '9738752078'}}