{'book': {'publisher': 'American University in Cairo Press', 'synopsis': 'The invention of mummification enabled the ancient Egyptians to preserve the bodies not only of humans but also of animals, so that they could live forever. Mummified animals are of four different types: food offerings, pets, sacred animals, and votive offerings. For the first time, a series of studies on the different types of animal mummies, the methods of mummification, and the animal cemeteries located at sites throughout Egypt are drawn together in a definitive volume on ancient Egyptian animal mummies. Studies of these animals provide information not only about the fauna of the country, and indirectly, its climate, but also about animal domestication, veterinary practices, human nutrition, mummification technology, and the religious practices of the ancient Egyptians.<br/>A new postscript is included in this paperback edition, taking account of the latest discoveries and research.<br/>Contributors: Edda Bresciani, Aidan Dodson, Salima Ikram, Dieter Kessler, Abd el-Halim Nur el-Din, Paul Nicholson, Donald Redford, Susan Redford, Roger Lichtenberg, and Alain Zivie.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/85/80/9789774248580.jpg', 'title_long': 'Divine Creatures: Animal Mummies in Ancient Egypt', 'dimensions': 'Height: 7.3 Inches, Length: 9.7 Inches, Weight: 1.85 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 9.7}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.85}, 'height': {'unit': 'inches', 'value': 7.3}}, 'pages': 264, 'date_published': '2005-04-01', 'subjects': ['History', 'Americas', 'United States', 'Ancient Civilizations', 'Egypt', 'Middle East', 'World', 'Religion & Spirituality', 'Politics & Social Sciences', 'Archaeology'], 'authors': [], 'title': 'Divine Creatures: Animal Mummies in Ancient Egypt', 'isbn13': '9789774248580', 'msrp': 34.95, 'binding': 'Hardcover', 'isbn': '9774248589', 'isbn10': '9774248589'}}