{'book': {'publisher': 'The American University in Cairo Press', 'synopsis': 'An estimated 200 million people in the world suffer from schistosomiasis (bilharzia), and according to the World Health Organization it ranks second behind malaria in terms of socioeconomic and public health importance in tropical and subtropical areas. The disease was present in Egypt in the Old Kingdom (c. 2600 BCE), and in 1998 it was estimated that almost six million Egyptians―one fifth of the rural population―were infected. Thus it remains one of the most serious public health problems in rural Egypt. This study is the first to paint a broad picture of schistosomiasis in rural Egypt. The authors’ research in three Nile Delta villages between 1991 and 1997 provides an in-depth community-level view of patterns of transmission and strategies for control. An analysis of recent research and policy presents the national context for the study.<br/>Schistosomiasis is primarily a behavioral disease, associated with human behavior in relation to water, especially canals; strategies for disease control and treatment need to consider what people do, where, when, and why. Gender, Behavior, and Health stresses an area of particular concern to social scientists: gender issues are most fully revealed at the local level, where an infection such as schistosomiasis is transmitted, diagnosed, treated, and ultimately (it is hoped) prevented. This book is unique in presenting schistosomiasis primarily from the viewpoint of the social sciences, yet fully incorporating material from the biomedical sciences and other relevant disciplines.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/72/86/9789774247286.jpg', 'title_long': 'Gender, Behavior, and Health: Schistosomiasis Transmission and Control in Rural Egypt', 'edition': '1', 'dimensions': 'Height: 5.9 Inches, Length: 9 Inches, Weight: 0.91 Pounds, Width: 0.7 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 9}, 'width': {'unit': 'inches', 'value': 0.7}, 'weight': {'unit': 'pounds', 'value': 0.91}, 'height': {'unit': 'inches', 'value': 5.9}}, 'pages': 244, 'date_published': '2004-11-04', 'subjects': ['Medical Books', 'Medicine', 'Internal Medicine', 'Test Preparation & Review', 'Politics & Social Sciences', 'Philosophy', 'Ethics & Morality', 'Social Sciences', 'Gender Studies', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Samiha El Katsha'], 'title': 'Gender, Behavior, and Health: Schistosomiasis Transmission and Control in Rural Egypt', 'isbn13': '9789774247286', 'msrp': 24.5, 'binding': 'Paperback', 'isbn': '9774247280', 'isbn10': '9774247280'}}