{'book': {'publisher': 'World Scientific Publishing Company', 'synopsis': "Biological data of all kinds is proliferating at an incredible rate. If humans attempt to read such data in the form of numbers and letters, they will take in the information at a snail's pace. If the information is rendered graphically, however, human analysts can assimilate it and gain insight at a much faster rate. The emphasis of this book is on the graphic representation of information-containing sequences such as DNA and amino acid sequences in order to help the human analyst find interesting and biologically relevant patterns. The editor's goal is to make this voyage through molecular biology, genetics and computer graphics as accessible to a broad audience as possible, with the inclusion of glossaries at the end of most chapters and program outlines where applicable. The book will be of most interest to biologists and computer scientists and the various large reference lists should be of interest to beginners and advanced students of biology, graphic art and computer science. Contributors have sought to find pattern and meaning in the cacophony of genetic and protein sequence data using unusual computer graphics and musical techniques.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/42/72/9789810214272.jpg', 'title_long': 'Visualizing Biological Information', 'dimensions': 'Height: 8.85 Inches, Length: 6.33 Inches, Weight: 1.15 Pounds, Width: 0.71 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.33}, 'width': {'unit': 'inches', 'value': 0.71}, 'weight': {'unit': 'pounds', 'value': 1.15}, 'height': {'unit': 'inches', 'value': 8.85}}, 'pages': 240, 'date_published': '1995-06-15', 'subjects': ['Science & Math', 'Biological Sciences', 'Bioinformatics', 'Evolution', 'Genetics', 'Mathematics', 'Pure Mathematics', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': [], 'title': 'Visualizing Biological Information', 'isbn13': '9789810214272', 'msrp': 120, 'binding': 'Hardcover', 'related': {'Page Fidelity': '981283205X', 'eBook': '981283205X'}, 'isbn': '9810214278', 'isbn10': '9810214278', 'other_isbns': [{'isbn': '9789812832054', 'binding': 'print'}]}}