{'book': {'publisher': 'Singaporemath.com Inc.', 'synopsis': 'The Primary Mathematics U.S. Edition series of elementary math textbooks and workbooks is meant to be part of a system of learning in which adult supervision and independent practice go hand in hand. The main feature of this series is the use of the Concrete> Pictorial>Abstract approach. The students are provided with the necessary learning experiences beginning with the concrete and pictorial stages, followed by the abstract stage to enable them to learn mathematics meaningfully. This approach encourages active thinking process, communication of mathematical ideas and problem solving. This helps develop the foundation students will need for more advanced mathematics.<br/>Practice exercises are designed to provide the students with further practice after they have done the relevant workbook exercises. Review exercises are provided for cumulative reviews of concepts and skills. All the practice exercises and review exercises are optional exercises.<br/><br/>Our recommendation:<br/><br/>Primary Mathematics U.S. Edition 1A-6B is ideal for both classroom and home use for 1st - 7th grades. This is the most popular (Singapore Math) primary math series used by schools and homeschoolers in the U.S. and Canada.<br/><br/>Recommended for those who want a solid, basic math program with a proven track record and an emphasis on concept development, mental techniques, and problem solving. This is primarily a direct instruction program. Students are given several approaches for solving problems and are encouraged to discuss ideas and explore additional methods.<br/><br/>Answer keys booklets are not included, but are available - one for Primary 1A-3B and one for Primary 4A-6B.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/49/71/9789810184971.jpg', 'title_long': 'PRIMARY MATHEMATICS 1B-WORKBOOK', 'edition': 'U.S. Edition', 'dimensions': 'Weight: 0.6 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 0.6}}, 'pages': 176, 'date_published': '2003', 'subjects': ['Subjects'], 'authors': ['marshall-cavendish'], 'title': 'PRIMARY MATHEMATICS 1B-WORKBOOK', 'isbn13': '9789810184971', 'msrp': 8.7, 'binding': 'Paperback', 'isbn': '9810184972', 'isbn10': '9810184972'}}