{'book': {'publisher': 'World Scientific Publishing Company', 'synopsis': 'A Second Genesis enquires why nature is intelligible. The fast growth of technology and deeper understanding of the humanities have provided significant clues. Answering the question why nature can be understood requires an introduction to the new science of astrobiology and the exploration of the Solar System. A careful discussion of a "second Genesis" is presented, namely our present awareness that life may have emerged on other worlds. Writing this volume has been motivated by the need to encourage a constructive dialogue between science and faith. Such an objective for a new book is timely, since science is inserted with well-defined frontiers in the context of human culture. Similarly, the frontiers of faith do not require religion to justify itself in scientific terms, avoiding current unnecessary controversies.This book intends to engage readers interested in the position of humans in nature. It makes a serious effort to avoid demanding detailed knowledge of science, philosophy, or theology, but will require some careful reading and meditation.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/50/31/9789812835031.jpg', 'title_long': 'Second Genesis, A: Stepping-Stones Towards the Intelligibility of Nature', 'dimensions': 'Height: 9.8 Inches, Length: 6.5 Inches, Weight: 1.5 Pounds, Width: 0.9 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 0.9}, 'weight': {'unit': 'pounds', 'value': 1.5}, 'height': {'unit': 'inches', 'value': 9.8}}, 'pages': 248, 'date_published': '2008-12-30', 'subjects': ['Religion & Spirituality', 'Religious Studies', 'Science & Religion', 'Theology', 'Science & Math', 'History & Philosophy', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Julian Chela-Flores'], 'title': 'Second Genesis, A: Stepping-Stones Towards the Intelligibility of Nature', 'isbn13': '9789812835031', 'msrp': 70, 'binding': 'Hardcover', 'related': {'Page Fidelity': '9812835040', 'eBook': '9812835040'}, 'isbn': '9812835032', 'isbn10': '9812835032', 'other_isbns': [{'isbn': '9789812835048', 'binding': 'print'}]}}