{'book': {'publisher': 'ISEAS-Yusof Ishak Institute', 'synopsis': '"For two decades now, Stephen C. Headley has been one of the most original and systematic ethnographers of Javanese religion and cultural history. No one in contemporary Javanese ethnography has combed through the annals of nineteenth and twentieth century scholarship with as careful an eye for the variety of Javanese traditions. None combines this historical ethnography with as careful and unusual body of contemporary ethnography. Headley\'s new book brings these long-developed skills to bear on contemporary religious change in the Surakarta region of Central Java. In his analysis of the Durga ritual complex, Headley sheds light on one of the most unusual court traditions to have survived in an era of deepening Islamization. Headley\'s analysis of this ritual complex, and its implications for our understanding of popular Javanese religion, deserves to be read by all serious students of Java, as well as anyone interested in religion in Indonesia. However, Headley moves well beyond this unusual ritual complex, to take us through the twists and turns of religious culture and politics in what is one of the richest but also most troubled of cultural regions in Java. The result is a rich, multi-layered, and fascinating study, one that changes forever our understanding of Javanese tradition in a Java becoming Islamic." Robert Hefner, Institute on Religion and World Affairs, Boston University.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/24/27/9789812302427.jpg', 'title_long': "Durga's Mosque: Cosmology, Conversion and Community in Central Javanese Islam", 'dimensions': 'Height: 9.21 Inches, Length: 6.14 Inches, Weight: 2.29 Pounds, Width: 1.31 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.14}, 'width': {'unit': 'inches', 'value': 1.31}, 'weight': {'unit': 'pounds', 'value': 2.29}, 'height': {'unit': 'inches', 'value': 9.21}}, 'pages': 620, 'date_published': '2004-08-01', 'subjects': ['Religion & Spirituality', 'Islam', 'Rituals & Practice', 'Science & Math', 'Astronomy & Space Science', 'Cosmology'], 'authors': ['Stephen Cavana Headley'], 'title': "Durga's Mosque: Cosmology, Conversion and Community in Central Javanese Islam", 'isbn13': '9789812302427', 'msrp': 80, 'binding': 'Hardcover', 'isbn': '9812302425', 'isbn10': '9812302425'}}