{'book': {'publisher': 'World Scientific Publishing Company', 'synopsis': "Equally important to our understanding of history and humanity are the great works of literature. The Nobel Prize for literature recognizes modern classics and the efforts of authors to bridge gaps between different cultures, time periods and styles.Below is a list of the prizewinners during the period 2001 - 2005.(2001) Sir Vidiadhar Surajprasad Naipaul -- for having united perceptive narrative and incorruptible scrutiny in works that compel us to see the presence of suppressed histories; (2002) Imre Kertész -- for writing that upholds the fragile experience of the individual against the barbaric arbitrariness of history; (2003) John M Coetzee -- who in innumerable guises portrays the surprising involvement of the outsider; (2004) Elfriede Jelinek -- for her musical flow of voices and counter-voices in novels and plays that with extraordinary linguistic zeal reveal the absurdity of society's clichés and their subjugating power; (2005) Harold Pinter -- who in his plays uncovers the precipice under everyday prattle and forces entry into oppression's closed rooms.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/43/52/9789812794352.jpg', 'title_long': 'Nobel Lectures in Literature 2001-2005', 'dimensions': 'Height: 10 Inches, Length: 6.7 Inches, Weight: 0.95 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.7}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.95}, 'height': {'unit': 'inches', 'value': 10}}, 'pages': 116, 'date_published': '2008-09-15', 'subjects': ['Literature & Fiction', 'Essays & Correspondence', 'Essays', 'History & Criticism', 'Criticism & Theory', 'Reference', 'Words, Language & Grammar', 'Rhetoric', 'Writing, Research & Publishing Guides', 'Writing', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Horace Engdahl'], 'title': 'Nobel Lectures in Literature 2001-2005', 'isbn13': '9789812794352', 'msrp': 69, 'binding': 'Hardcover', 'isbn': '9812794352', 'isbn10': '9812794352'}}