{'book': {'publisher': 'Wspc/Others', 'synopsis': 'This unique book fills a vital gap present in most study and examination guides -- it offers inspiration and motivation to make the student want to excel. As such, it is a valuable complement to the author\'s other book, Scholars\' Secrets. The author shares his personal story about how he overcame poverty and parental abuse, and progressed from doing badly in primary school to topping his class in postgraduate studies. He also features stories about "famous failures" -- people who succeeded in life despite having little or no formal education, such as Benjamin Franklin, Abraham Lincoln and multi-billionaire Li Ka Shing. Thus, academic qualifications are by no means the "be all and end all". Ultimately, the difference lies in PRAISE, a life skills model developed by the author for excellence and success. Through the six key concepts of Prizedream, Rules, Analysis, Invincibility, Strategy and Excellence, this model will help you overcome whatever obstacles you face, as it leads you out of mediocrity and conformity towards your unique vision.Related Title: - Scholars\' Secrets', 'language': 'en', 'image': 'https://images.isbndb.com/covers/00/40/9789812790040.jpg', 'title_long': 'Success Secrets: Real-Life Stories To Inspire And Motivate', 'edition': '1', 'dimensions': 'Height: 7.7 Inches, Length: 5.2 Inches, Weight: 0.48 Pounds, Width: 0.44 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.2}, 'width': {'unit': 'inches', 'value': 0.44}, 'weight': {'unit': 'pounds', 'value': 0.48}, 'height': {'unit': 'inches', 'value': 7.7}}, 'pages': 194, 'date_published': '2008-04-21', 'subjects': ['Self-Help', 'Motivational', 'Health, Fitness & Dieting', 'Mental Health', 'Psychology & Counseling', 'Test Preparation', 'Study & Test-Taking Skills', 'Education & Teaching', 'Schools & Teaching', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['George Tan'], 'title': 'Success Secrets: Real-Life Stories To Inspire And Motivate', 'isbn13': '9789812790040', 'msrp': 20, 'binding': 'Paperback', 'isbn': '9812790047', 'isbn10': '9812790047'}}