{'book': {'publisher': 'Berlitz Travel', 'synopsis': 'Berlitz Handbook Australia is the ultimate practical, inspirational guide to this fascinating destination, with 304 pages combining authoritative narrative detail and stunning color photography. What sets the guide apart is the illuminating Unique Experiences section, packed full of practical advice on how to make the most of all the opportunities unique to Australia – from exploring the Great Barrier Reef to discovering Aboriginal culture and tasting great wines.<br/>The guide starts with a rundown of Australia’s Top 25 Attractions, ranging from the stupendously scenic Great Ocean Road to the magnificent Sydney Opera House. In the Trip Planner you’ll find itineraries outlining how best to maximise your time Down Under, whether you’re embarking on a Three Week East Coast Escape or a one-month ‘Best of Australia’ tour.<br/><br/>The Places Section tackles each of Australia’s eight states and territories in turn – starting with New South Wales, home of the world’s lifestyle capital Sydney, and finishing up in the ‘Holiday Isle’ of Tasmania. Each chapter is color-coded for easy reference, and features everything you’ll need to know about the sights and attractions in the area as well as maps to help you get around and carefully chosen listings of the best places to sleep, eat, drink and get active. The Places section is interspersed with fully mapped tours, suggesting a classic walking or driving route such as a Yarra River Walk in Melbourne or a drive down Tasmania’s Heritage Highway, and Cultural Spreads that give a striking insight into an element of Australia’s culinary, artistic, sporting or popular culture, from festivals in Adelaide to the Northern Territory’s Royal Flying Doctor Service.<br/><br/>Further practical advice is provided in a chapter dedicated to accommodations, transportation, health and safety, money and budgeting, responsible travel and family holidays. The Setting the Scene chapter is devoted to Australia’s historical and cultural background, plus information on the country’s cuisine.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/90/16/9789812689016.jpg', 'title_long': 'Berlitz Australia: Handbook (Berlitz Handbooks)', 'dimensions': 'Height: 7.62 Inches, Length: 5.19 Inches, Weight: 1.17 Pounds, Width: 1.08 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.19}, 'width': {'unit': 'inches', 'value': 1.08}, 'weight': {'unit': 'pounds', 'value': 1.17}, 'height': {'unit': 'inches', 'value': 7.62}}, 'pages': 304, 'date_published': '2011-09-01', 'subjects': ['Travel', 'Australia & South Pacific', 'Australia', 'General'], 'authors': ['Virginia Maxwell'], 'title': 'Berlitz Australia: Handbook (Berlitz Handbooks)', 'isbn13': '9789812689016', 'msrp': 17.99, 'binding': 'Paperback', 'isbn': '981268901X', 'isbn10': '981268901X'}}