{'book': {'publisher': 'Alfaguara', 'synopsis': 'Hay lugares de los que nunca se vuelve<br/>La novela más intensa y turbadora de Arturo Pérez-Reverte<br/><br/>En una torre junto al Mediterráneo, en busca de la foto que nunca pudo hacer, un antiguo fotógrafo pinta un gran fresco circular en la pared: el paisaje intemporal de una batalla. Lo acompañan en la tarea un rostro que regresa del pasado para cobrar una deuda mortal, y la sombra de una mujer desaparecida diez años atrás. En torno a esos tres personajes, Arturo Pérez-Reverte ha escrito la más intensa y turbadora historia de su larga carrera de novelista. Deslumbrante de principio a fin, El pintor de batallas arrastra al lector, subyugado, a través de la compleja geometría del caos del siglo XX: el arte, la ciencia, la guerra, el amor, la lucidez y la soledad, se combinan en el vasto mural de un mundo que agoniza.<br/><br/>La crítica ha dicho:<br/>«El pintor de batallas es, en mi opinión, el libro más descorazonador, más duro y más triste de Pérez-Reverte. Y también seguramente el más lúcido, además del más ambicioso, intelectual y literariamente.»<br/>José Manuel Sánchez Ron, El País<br/><br/>«Una trágica historia de amor, guerra y de la crueldad entre los hombres... en un estilo que recuerda a Milan Kundera, el autor se pregunta el sentido de la guerra, el uso de la violencia, y cómo ésta oscuridad de la humanidad se relaciona con nuestra capacidad para el arte y el amor. Este irresistible pas de deux es la obra más conmovedora de Arturo Pérez-Reverte hasta ahora.»<br/>Mike Cooper, Waterstone?s<br/><br/>«El escritor español regresa a su pasado de corresponsal de guerra a través de esta novela impresionante... Difícilmente un libro ha sumergido al lector tan profundamente en los limos del mal como éste.»<br/>Anthony Palou, Le Figaro Magazine<br/><br/>«Porque se ha nutrido de experiencia, porque es un escritor avezado que se ve obligado acompartir con los lectores sus dudas y sus escrúpulos, este Pintor de batallas es, simplemente, un gran libro?.»<br/>Jacques de Decaer,Le Soir<br/><br/>«Arturo Pérez-Reverte confirma de nuevo su lugar como gran maestro del thriller histórico en esta magistral novela que conjuga secretos enterrados bajo las cenizas de un pasado funesto, glosas filosóficas y un diabólico sentido de la intriga. Apasionante.»<br/>Elias Lévy, Voir-Québec ENGLISH DESCRIPTION Faulques, a war photographer, witnessed most of the wars of the end of the 20th Century, but he was never able to capture the photo that would explain the chaos of the universe. Now, as continues to try to understand it, he starts painting a grand circular fresco on the inside wall of a tower on the Mediterranean, disturbed by the memories of a woman he can never forget, and an unexpected visit: a man who wants to kill him.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/34/01/9789870403401.jpg', 'title_long': 'El pintor de batallas (Spanish Edition)', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 5.75 Inches, Weight: 0.9 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 304, 'date_published': '2006-03-05', 'subjects': ['Literature & Fiction', 'World Literature', 'Literary'], 'authors': ['Arturo Perez-Reverte'], 'title': 'El pintor de batallas (Spanish Edition)', 'isbn13': '9789870403401', 'msrp': 19.95, 'binding': 'Paperback', 'isbn': '9870403409', 'isbn10': '9870403409'}}