{'book': {'publisher': 'Vergara & Riba', 'synopsis': 'Product Description      Offers a selection of quotations, poems, and short passages on friendship from a variety of sources, from the Bible and the ancient Greeks to Pablo Neruda, Albert Einstein, and Deepak Chopra.      From Publishers Weekly      Elegantly printed in sage-green and white, the latest gift book from Vergara & Riba Editoras is a collection of literary aphorisms about friendship and friends. Riba\'s selection of quotations is eclectic; Henry Miller, Miguel de Unamuno, Henry Thoreau, the Book of Ruth, Paulo Coehlo, and Jos? Ortega y Gasset all rub shoulders here. Argentine Adolfo Bioy Casares opts for the philosophical: "In solitude, we can all be arbitrary. Dialog with friends is necessary to maintain sanity. Alone, we\'re capable of any foolishness." Marlene Dietrich\'s wisdom is more sassy: "The ones who really matter are the friends you can call at four in the morning." However, as with most Vergara & Riba books, the real selling point is the book\'s excellent production quality. Good paper stock, hardcovers, sage-green borders of leaves and flowers running down the side of each page these are the details that make an otherwise-slight anthology feel like a true gift book. Ideal for impulse display at bookstores. Marcela Vald?s, "Criticas" Copyright 2001 Reed Business Information, Inc.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/81/17/9789879338117.jpg', 'title_long': 'UN Brindis Por Los Amigos (Spanish Edition)', 'dimensions': 'Height: 7.5 Inches, Length: 7.5 Inches, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.5}, 'width': {'unit': 'inches', 'value': 0.75}, 'height': {'unit': 'inches', 'value': 7.5}}, 'pages': 5, 'date_published': '2001', 'subjects': ['Religion & Spirituality', 'New Age & Spirituality', 'Politics & Social Sciences', 'Philosophy', 'Ethics & Morality'], 'authors': [], 'title': 'UN Brindis Por Los Amigos (Spanish Edition)', 'isbn13': '9789879338117', 'msrp': 17.95, 'binding': 'Hardcover', 'isbn': '9879338111', 'isbn10': '9879338111'}}