{'book': {'publisher': 'Mp Ediciones Corp', 'synopsis': 'Product description El primer volumen de la coleccion PC Users Responde lleva el titulo de 110 preguntas sobre Windows 98 y fue escrito por nuestro especialista Ricardo Goldberger que, gracias a su experiencia contestando dudas de los lectores de las revistas, sabe con exactitud lo que la gente necesita. Esta nueva coleccion de la editorial PC Users aplica el estilo de las FAQ (Frequently Asked Questions: "preguntas mas frecuentes") en Internet, bajo la forma de guia practica. En sus capitulos se explica todo lo necesario para dominar las principales caracteristicas y recursos del sistema operativo lider en el mundo. Para quienes desean tener un panorama accesible de las caracteristicas de Windows 98, este libro puede ser una gran solucion: instalacion y arranque, la interfase, manejo de archivos y juegos bajo DOS. From the Publisher Entre el contenido de este libro usted encontrara respuestas a: Instalar de cero o actualizar? Pueden convivir Windows 98 y NT? Cuales son las teclas de funcion que sirven en Windows 98? Como asignar distintos sonidos a Windows? Que es un acceso directo y para que sirve? Se cuelga muy seguido, que hacer? Como se personaliza una carpeta? Como crear una barra de herramientas personal? Que significa guardar una busqueda? Que se puede hacer en una sesion MS-DOS que no se pueda hacer Windows? Puedo usar juegos para MS-DOS en Windows? Y muchisimas mas... Apendices: El Editor de Registro. Los PowerToys. Guia de atajos de teclado. Sitios web sobre Windows 98. About the Author Ricardo D. Golberger es medico y periodista cientifico. Un dia quiso probar si su hobby podia ser, ademas, rentable. Comenzo a escribir articulos para PC Users y, hoy en dia, es autor de varios libros sobre Windows e Internet Explorer . Other books: 115 preguntas avanzadas sobre Windows 98, coleccion PC Users Responde. Los secretos sobre Windows 98, coleccion PC Users Express. Manual de Windows 98, coleccion PC Users. Guia rapida de Internet Explorer 4.0, coleccion Compumagazine Guias Rapidas. Guia rapida de Internet Explorer 5.0, coleccion PC Users Express. Guia visual de Internet Explorer 4.0, coleccion PC Users Guias Visuales. Windows 2000, coleccion CM (de proxima aparicion).', 'language': 'es', 'image': 'https://images.isbndb.com/covers/19/54/9789879131954.jpg', 'title_long': '110 Preguntas y Tips sobre Windows 98 (FAQ style): Users Responde, en Espanol / Spanish (PC Users Responde) (Spanish Edition)', 'dimensions': 'height: 216 mm, length: 152 mm, width: 13 mm, weight: 340 g', 'dimensions_structured': {'length': {'unit': 'mm', 'value': 152}, 'width': {'unit': 'mm', 'value': 13}, 'weight': {'unit': 'g', 'value': 340}, 'height': {'unit': 'mm', 'value': 216}}, 'pages': 229, 'date_published': '1999-06-24', 'subjects': ['Computers & Technology'], 'authors': ['Ricardo Goldberger', 'MP Ediciones'], 'title': '110 Preguntas y Tips sobre Windows 98 (FAQ style): Users Responde, en Espanol / Spanish (PC Users Responde) (Spanish Edition)', 'isbn13': '9789879131954', 'msrp': 13.9, 'binding': 'paperback', 'isbn': '9879131959', 'isbn10': '9879131959'}}