{'book': {'publisher': 'Flamingo', 'synopsis': "A heart rending story of the lives of a few inhabitants of a small American town and the massive effect of one very violent death.<br/>Langston Braverman has just walked out on her PhD oral exams and returned home to Haddington, Indiana in a fragile emotional state. She retreats to her parents' attic, unsure what to do with the summer or the rest of her life, but with vague plans to write the great American novel. But it's hot, and she is distracted beyond capacity to think by the banality of this small-town home she has returned to, and plunged deep in the trauma of a self-imposed existential dilemma from which not even news of the death of her childhood best friend, Alice, can rouse her.<br/>A few houses down Plum Street, Amos Townsend, the local preacher, is suffering from a crippling crisis of faith, wondering how he can continue in the role of spiritual leader of this community. Traumatised by Alice's violent death, guilt-ridden over his inability to prevent it, he feels a responsibility for the welfare of Alice's two suddenly orphaned young girls, altered beyond recognition from the shock of having witnessed the bloody end to their parents' marriage. Langston's mother, meanwhile, has forced her into the role of carer, and the developing relationship between the damaged children, and these two slightly hopeless adults helps all four embark on a process of recovery and redemption that is heartbreakingly poignant and utterly convincing.<br/>'The Solace of Leaving Early' is a remarkable novel - generous, warm-hearted, smart and ambitious. It is a novel of people and ideas, of family ties, and of how those ties endure for better or worse, of grief and love, of leaving home and returning, of the overwhelming secrets that rest quietly within us. It is so sweet and smart, it's a present.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/25/37/9780007152537.jpg', 'title_long': 'The Solace of Leaving Early', 'edition': 'First Edition', 'dimensions': 'Height: 7.79526 Inches, Length: 5.07873 Inches, Weight: 0.5291094288 Pounds, Width: 0.82 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.07873}, 'width': {'unit': 'inches', 'value': 0.82}, 'weight': {'unit': 'pounds', 'value': 0.5291094288}, 'height': {'unit': 'inches', 'value': 7.79526}}, 'pages': 336, 'date_published': '2003', 'subjects': ['Literature & Fiction', 'Contemporary'], 'authors': ['Haven Kimmel'], 'title': 'The Solace of Leaving Early', 'isbn13': '9780007152537', 'msrp': 14.45, 'binding': 'Paperback', 'isbn': '0007152531', 'isbn10': '0007152531'}}