{'book': {'publisher': 'Farrar, Straus and Giroux.', 'synopsis': 'A riveting, original book about the creation of the modern American mind. The Metaphysical Club was an informal group that met in Cambridge, Massachusetts, in 1872, to talk about ideas. Its members included Oliver Wendell Holmes, Jr., founder of modern jurisprudence; William James, the father of modern American psychology; and Charles Sanders Peirce, logician, scientist, and the founder of semiotics. The Club was probably in existence for about nine months. No records were kept. The one thing we know that came out of it was an idea -- an idea about ideas. This book is the story of that idea. Holmes, James, and Peirce all believed that ideas are not things "out there" waiting to be discovered but are tools people invent -- like knives and forks and microchips -- to make their way in the world. They thought that ideas are produced not by individuals, but by groups of individuals -- that ideas are social. They do not develop according to some inner logic of their own but are entirely dependent -- like germs -- on their human carriers and environment. And they thought that the survival of any idea depends not on its immutability but on its adaptability. \'The Metaphysical Club\' is written in the spirit of this idea about ideas. It is not a history of philosophy but an absorbing narrative about personalities and social history, a story about America. It begins with the American Civil War and ends with World War I. This is a book about the evolution of the American mind during the crucial period that formed the world we now inhabit.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/69/03/9780007126903.jpg', 'title_long': 'The Metaphysical Club : A Story of Ideas in America', 'dimensions': 'Height: 7.79526 Inches, Length: 5.07873 Inches, Weight: 0.8157103694 Pounds, Width: 1.33858 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.07873}, 'width': {'unit': 'inches', 'value': 1.33858}, 'weight': {'unit': 'pounds', 'value': 0.8157103694}, 'height': {'unit': 'inches', 'value': 7.79526}}, 'pages': 560, 'date_published': '2002', 'subjects': ['Biographies & Memoirs', 'Leaders & Notable People', 'Political', 'History'], 'authors': ['Louis Menand'], 'title': 'The Metaphysical Club : A Story of Ideas in America', 'isbn13': '9780007126903', 'msrp': 14.22, 'binding': 'Paperback', 'isbn': '0007126905', 'isbn10': '0007126905'}}