{'book': {'publisher': 'HarperCollins Publishers Canada, Limited', 'synopsis': "'Four classic tales from the author of The Hobbit The fat and unheroic Farmer Giles of Ham is called upon to do battle with the dragon Chrysophylax: Niggle the painter sets out to paint the perfect tree: Hobbits, princesses, dwarves and trolls partake in the adventures of Tom Bombadil: and Smith of Wootton Major journeys to the land of Faery via the magical ingredients of a giant cake. This definitive collection of J.R.R. Tolkien's acclaimed short stories and poems reaffirms his status as a master storyteller for readers young and old. FARMER GILES OF HAM 1949 A fabulous tale of the days when giants and dragons walked the kingdom - SUNDAY TIMES LEAF BY NIGGLE 1964 A haunting and successful demonstration of the qualities of faerie - NEW YORK TIMES THE ADVENTURES OF TOM BOMBADIL 1961 Something close to genius - THE LISTENER SMITH OF WOOTTON MAJOR 1967 Whoever reads it at eight will no doubt still be going back to it at eighty - NEW STATESMAN Cover illustration by J.R.R. Tolkien' to 'The definitive collection of J.R.R. Tolkien’s five acclaimed modern classic ‘fairie’ tales in the vein of The Hobbit. Enchanted by a sand-sorcerer, the toy dog Roverandom explores a world filled with strange and fabulous creatures; the fat and unheroic Farmer Giles of Ham is called upon to do battle with the dragon Chrysophylax; Hobbits, princesses, dwarves and trolls partake in the adventures of Tom Bombadil; Smith of Wootton Major journeys to the land of Faery via the magical ingredients of a giant cake; and Niggle the painter sets out to paint the perfect tree.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/91/24/9780007149124.jpg', 'title_long': 'Tales from the Perilous Realm', 'dimensions': 'Height: 7.00786 Inches, Length: 4.37007 Inches, Weight: 0.23589462034 Pounds, Width: 0.86614 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.37007}, 'width': {'unit': 'inches', 'value': 0.86614}, 'weight': {'unit': 'pounds', 'value': 0.23589462034}, 'height': {'unit': 'inches', 'value': 7.00786}}, 'pages': 192, 'date_published': '2002', 'subjects': ['Science Fiction & Fantasy', 'Fantasy', 'Anthologies'], 'authors': ['J. R. R. Tolkien'], 'title': 'Tales from the Perilous Realm', 'isbn13': '9780007149124', 'msrp': 14.45, 'binding': 'Paperback', 'isbn': '0007149123', 'isbn10': '0007149123'}}