{'book': {'publisher': 'Harpercollins Pub Ltd', 'synopsis': "The new novel that Sidney Sheldon's millions of fans all over the world have been waiting for. And, like his seventeen previous books, it is destined for a top place on bestseller lists everywhere.<br/><br/>In New York, Denver, Paris and Berlin, four people have died separately in apparent accidents. Two women -- the widows of two of the dead -- find themselves under ruthless attack and are drawn together in fear, confusion and for mutual protection. But are they being targeted because one of them is the prosecution witness at a famous criminal trial? Or is there a connection to the mystery behind their husband's deaths? Meanwhile, Tanner Kingsley,<br/><br/>Chief Executive of an international Think Tank created only seven years ago, is on the cusp of an amazing discovery which could alter the future of the world. If properly handled, the outcome of this could deliver unbelievable power into the company's hands. But are the mysterious deaths connected to this volatile secret? And can it be further protected?<br/><br/>Thrown together, the women could not be more different: Diane Stevens is a well-connected, affluent artist from the Upper East Side. Philadelphia neighbourhood with a new 'uncle' every month, believed she had at last found safety and contentment in Paris, married to a brilliant scientist.<br/><br/>Taut with suspense and vivid characterization, and with an unnervingly realistic premise that could alter our lives, ARE YOU AFRAID OF THE DARK is Sheldon at the top of his form.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/51/62/9780007165162.jpg', 'title_long': 'Are You Afraid of the Dark?', 'edition': 'Reprint', 'dimensions': 'Height: 7.00786 Inches, Length: 4.37007 Inches, Weight: 0.5070632026 Pounds, Width: 0.98425 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.37007}, 'width': {'unit': 'inches', 'value': 0.98425}, 'weight': {'unit': 'pounds', 'value': 0.5070632026}, 'height': {'unit': 'inches', 'value': 7.00786}}, 'pages': 400, 'date_published': '2005', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Horror', 'Action & Adventure', 'Contemporary', 'Mystery, Thriller & Suspense'], 'authors': ['Sidney Sheldon'], 'title': 'Are You Afraid of the Dark?', 'isbn13': '9780007165162', 'msrp': 14.45, 'binding': 'Paperback', 'isbn': '0007165161', 'isbn10': '0007165161'}}