{'book': {'publisher': 'William Morrow', 'synopsis': 'From master crime writer Joseph Wambaugh, the acclaimed author of such classics as The Onion Field and The Choirboys, comes the extraordinary true story of a firefighter who may have been, according to U.S. government profilers, "the most prolific American arsonist of the twentieth century."<br/>Growing up in Los Angeles, John Orr would watch in awe as firefighters scrambled to put out blazes with seeming disregard for their own lives. One day he would become a fireman himself, and a good one. As a member of the Glendale Fire Department, he rose through the ranks, eventually becoming a fire captain and one of southern California\'s best-known and most-respected arson investigators, as well as a writer of firefighting articles and finally of a fact-based novel. But there was another, unseen life, one that included many women, a need for risk, and a hunger for recognition.<br/>While Orr busted a string of petty arsonists, there was one serial criminal he could not track down. The fire lover used the same simple yet devastating device and was unerring in his execution. His lethal handiwork led to the death of four innocent people and countless millions of dollars worth of property damage. Homes, retail stores during business hours, fields of dry brush in stifling summer heat -- little was safe from his obsession to see them burn.<br/>But after years of terror and destruction, he would make a mistake. He would leave behind a precious clue that investigators would use to lead them to the true identity of the fire lover, to the shock and disbelief of the firefighting community.<br/>Chilling, colorful, and vivid, Fire Lover is Joseph Wambaugh at his best. He explores the making of a deviant personality, the fascinating intricacies of fire science, the uneasy relationship between firefighting and law-enforcement communities, and a legal system gone haywire. Based on his trademark meticulous research, interviews, case records, and thousands of pages of court transcripts, Wambaugh fashions a powerful narrative. You will never look at fire the same way again.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/52/77/9780060095277.jpg', 'title_long': 'Fire Lover: A True Story', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.5 Inches, Weight: 1.35 Pounds, Width: 1.125 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 1.125}, 'weight': {'unit': 'pounds', 'value': 1.35}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 352, 'date_published': '2002-04', 'subjects': ['Biographies & Memoirs', 'True Crime', 'Crime & Criminal Biographies', 'Murder & Mayhem', 'Politics & Social Sciences', 'Social Sciences', 'Criminology'], 'authors': ['Joseph Wambaugh'], 'title': 'Fire Lover: A True Story', 'isbn13': '9780060095277', 'msrp': 25.95, 'binding': 'Hardcover', 'isbn': '006009527X', 'isbn10': '006009527X'}}