{'book': {'publisher': 'William Morrow', 'synopsis': '“Seamless in its storytelling and enthralling in its plotting.”<br/>—Ft. Lauderdale Sun-Sentinel<br/>“Dark and remarkable….Once [Todd] grabs you, there’s no putting the novel down.”<br/>—Detroit Free Press<br/>The Winston-Salem Journal declares that, “like P. D. James and Ruth Rendell, Charles Todd writes novels that transcend genre.” A Long Shadow proves that statement true beyond the shadow of a doubt. Once again featuring Todd’s extraordinary protagonist, Scotland Yard investigator and shell-shocked World War One veteran, Inspector Ian Rutledge, A Long Shadow immerses readers in the sights and sounds of post-war Great Britain, as the damaged policeman pursues answers to a constable’s slaying and the three-year-old mystery of a young girl’s disappearance in a tiny Northamptonshire village. Read Todd’s A Long Shadow and see why the Washington Post calls the Rutledge crime novels, “one of the best historical series being written today.”', 'language': 'en', 'image': 'https://images.isbndb.com/covers/67/17/9780060786717.jpg', 'title_long': 'A Long Shadow: An Inspector Ian Rutledge Mystery (Inspector Ian Rutledge Mysteries)', 'edition': 'First American Edition First Printing', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.3 Pounds, Width: 1.13 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.13}, 'weight': {'unit': 'pounds', 'value': 1.3}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 352, 'date_published': '2006-01-03', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Traditional Detectives', 'Thrillers & Suspense', 'Suspense'], 'authors': ['Charles Todd'], 'title': 'A Long Shadow: An Inspector Ian Rutledge Mystery (Inspector Ian Rutledge Mysteries)', 'isbn13': '9780060786717', 'msrp': '0.00', 'binding': 'Hardcover', 'isbn': '006078671X', 'isbn10': '006078671X'}}