{'book': {'publisher': 'Amistad', 'synopsis': 'From National Book Award-nominated author Edward P. Jones comes a debut novel of stunning emotional depth and unequaled literary power<br/><br/>Henry Townsend, a farmer, boot maker, and former slave, through the surprising twists and unforeseen turns of life in antebellum Virginia, becomes proprietor of his own plantation―as well his own slaves. When he dies, his widow Caldonia succumbs to profound grief, and things begin to fall apart at their plantation: slaves take to escaping under the cover of night, and families who had once found love under the weight of slavery begin to betray one another. Beyond the Townsend household, the known world also unravels: low-paid white patrollers stand watch as slave “speculators” sell free black people into slavery, and rumors of slave rebellions set white families against slaves who have served them for years.<br/>An ambitious, courageous, luminously written masterwork, The Known World seamlessly weaves the lives of the freed and the enslaved―and allows all of us a deeper understanding of the enduring multidimensional world created by the institution of slavery. The Known World not only marks the return of an extraordinarily gifted writer, it heralds the publication of a remarkable contribution to the canon of American classic literature.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/91/76/9780061159176.jpg', 'title_long': 'The Known World', 'edition': 'First Printing In Paperback', 'dimensions': 'Height: 1.26 Inches, Length: 8.29 Inches, Weight: 0.98 Pounds, Width: 5.56 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.29}, 'width': {'unit': 'inches', 'value': 5.56}, 'weight': {'unit': 'pounds', 'value': 0.98}, 'height': {'unit': 'inches', 'value': 1.26}}, 'pages': 388, 'date_published': '2006-08-29', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'United States', 'Black & African American', 'Literary', 'Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies'], 'authors': ['Edward P. Jones'], 'title': 'The Known World', 'isbn13': '9780061159176', 'msrp': 16.99, 'binding': 'Paperback', 'related': {'Kindle Edition': '0061746363', 'eBook': '0061746363', 'ePub': '0061746363'}, 'isbn': '0061159174', 'isbn10': '0061159174', 'other_isbns': [{'isbn': '9780061746369', 'binding': 'print'}]}}