{'book': {'publisher': 'Penguin Classics', 'synopsis': 'The acclaimed Pelican Shakespeare series edited by A. R. Braunmuller and Stephen Orgel<br/><br/>The legendary Pelican Shakespeare series features authoritative and meticulously researched texts paired with scholarship by renowned Shakespeareans. Each book includes an essay on the theatrical world of Shakespeare’s time, an introduction to the individual play, and a detailed note on the text used. Updated by general editors Stephen Orgel and A. R. Braunmuller, these easy-to-read editions incorporate over thirty years of Shakespeare scholarship undertaken since the original series, edited by Alfred Harbage, appeared between 1956 and 1967. With definitive texts and illuminating essays, the Pelican Shakespeare will remain a valued resource for students, teachers, and theater professionals for many years to come.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/45/48/9780140714548.jpg', 'title_long': 'Hamlet (The Pelican Shakespeare)', 'edition': 'Presumed to be 1st as edition is unstated', 'dimensions': 'Height: 7.75 Inches, Length: 0.75 Inches, Weight: 0.35 Pounds, Width: 5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 0.75}, 'width': {'unit': 'inches', 'value': 5}, 'weight': {'unit': 'pounds', 'value': 0.35}, 'height': {'unit': 'inches', 'value': 7.75}}, 'pages': 148, 'date_published': '2001-12-01', 'subjects': ['Literature & Fiction', 'Classics', 'Dramas & Plays', 'United States', 'Education & Teaching', 'Studying & Workbooks', 'Study Guides', 'Self Service', 'Custom Stores'], 'authors': ['William Shakespeare'], 'title': 'Hamlet (The Pelican Shakespeare)', 'isbn13': '9780140714548', 'msrp': 6, 'binding': 'Paperback', 'isbn': '0140714545', 'isbn10': '0140714545'}}