{'book': {'publisher': 'Penguin Classics', 'synopsis': 'In addition to being an uncompromising defender of liberty, esteemed diplomat, and successor to George Washington, John Adams was a passionate and prolific writer. Adams biographer John Patrick Diggins gathers an impressive variety of his works in this compact, original volume, including parts of his diary and autobiography, and selections from his rich correspondence with this wife, Abigail, Thomas Jefferson, and others. The Portable John Adams also features his most important political works: “A Dissertation on Canon and Feudal Law,” “Thoughts on Government,” “A Defense of Constitutions,” “Novanglus,” and “Discources in Davila.” There is no finer introduction to the protean genius of this seminal American philosopher.<br/><br/>For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/77/80/9780142437780.jpg', 'title_long': 'The Portable John Adams (Penguin Classics)', 'edition': 'First Edition Thus', 'dimensions': 'Height: 7.7 Inches, Length: 1.3 Inches, Weight: 0.96342008494 Pounds, Width: 5.1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 1.3}, 'width': {'unit': 'inches', 'value': 5.1}, 'weight': {'unit': 'pounds', 'value': 0.96342008494}, 'height': {'unit': 'inches', 'value': 7.7}}, 'pages': 576, 'date_published': '2004-06-29', 'subjects': ['Biographies & Memoirs', 'Historical', 'United States', 'Leaders & Notable People', 'Military', 'Presidents & Heads of State', 'History', 'Americas', 'Reference', 'Politics & Social Sciences', 'Politics & Government', 'Political Science', 'Self Service', 'Custom Stores'], 'authors': ['John Adams'], 'title': 'The Portable John Adams (Penguin Classics)', 'isbn13': '9780142437780', 'msrp': 30, 'binding': 'Paperback', 'related': {'ePub': '1440650969'}, 'isbn': '0142437786', 'isbn10': '0142437786', 'other_isbns': [{'isbn': '9781440650963', 'binding': 'print'}]}}