{'book': {'publisher': 'Oxford University Press', 'synopsis': '"There is a whale in the sea, as white as a ghost, and it haunts me. Sometimes, when I\'m afloat in sleep, like a drowned sailor, he swims towards me--a nightmare all in white, jaws gaping, and I wake up screaming and salt-water wet with sweat. Somewhere out there in the bottomless oceans lives Moby Dick, a great white winter of a whale, and I shiver still at the thought of him."<br/>In vivid and compelling language, the award-winning author Geraldine McCaughrean retells Herman Melville\'s classic story of the obsessed Captain Ahab and his relentless hunt for the great white whale, Moby Dick. Together with Starbuck, the mate; Queequeg, the harpoonist; the sinister crewman Fedallah; and the innocent narrator, Ishmael, Ahab travels the oceans of the world in pursuit of the elusive monster, braving waves like strips of volcanoes and lightning like the visitation of angels.<br/>McCaughrean\'s text is beautifully complemented by Victor Ambrus\'s evocative pictures of ships and the sea and of the white monster, Moby Dick, a creature as vast and dangerous as the sea itself. Children and young adults will be thrilled and captivated by this wonderful adventure tale.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/15/36/9780192781536.jpg', 'title_long': 'Moby Dick: or The White Whale (Oxford Illustrated Classics)', 'edition': 'Later Printing', 'dimensions': 'Height: 11.25 Inches, Length: 7.75 Inches, Weight: 0.9 Pounds, Width: 0.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.75}, 'width': {'unit': 'inches', 'value': 0.25}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 11.25}}, 'pages': 104, 'date_published': '1998-04-16', 'subjects': ["Children's Books", 'Classics'], 'authors': ['Herman Melville'], 'title': 'Moby Dick: or The White Whale (Oxford Illustrated Classics)', 'isbn13': '9780192781536', 'msrp': 12.95, 'binding': 'Paperback', 'isbn': '0192781537', 'isbn10': '0192781537'}}