{'book': {'publisher': 'Oxford University Press', 'synopsis': "More than two millennia ago the famous Chinese general Sun Tzu wrote the classic work on military strategy, The Art of War. Now, in Sun Tzu and the Art of Business, Mark R. McNeilly shows how Sun Tzu's strategic principles can be successfully applied to modern business situations. Here are really two books in one: McNeilly's synthesis of Sun Tzu's ideas into six strategic principles for the business executive, plus the entire text of Samuel B. Griffith's popular translation of The Art of War. Within, McNeilly explains how to gain market share without inciting competitive retaliation, how to attack a competitor's weak points, and how to maximize the power of market information for competitive advantage. He also demonstrates the value of speed, preparation, and secrecy in throwing the competition off-balance, employing strategy to beat the competition, and the need for character in successful leaders. In his final chapter, McNeilly presents a practical method to put Sun Tzu and The Art of Business into practice. By using modern examples throughout the book from GE, Microsoft, AT&T, BMW, Southwest Airlines, FedEx, and many others, he illustrates how, by following the wisdom of history's most respected strategist, executives can avoid the pitfalls of management fads and achieve lasting competitive advantage.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/78/97/9780195137897.jpg', 'title_long': 'Sun Tzu and the Art of Business: Six Strategic Principles for Managers', 'dimensions': 'Height: 5.2 Inches, Length: 7.9 Inches, Weight: 0.4960400895 Pounds, Width: 0.7 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.9}, 'width': {'unit': 'inches', 'value': 0.7}, 'weight': {'unit': 'pounds', 'value': 0.4960400895}, 'height': {'unit': 'inches', 'value': 5.2}}, 'pages': 272, 'date_published': '2000-04-13', 'subjects': ['Business & Money', 'Management & Leadership', 'Leadership & Motivation', 'Management', 'Systems & Planning', 'Strategy & Competition', 'Business Development & Entrepreneurship', 'Entrepreneurship', 'Processes & Infrastructure', 'Strategic Planning'], 'authors': ['Mark R. McNeilly'], 'title': 'Sun Tzu and the Art of Business: Six Strategic Principles for Managers', 'isbn13': '9780195137897', 'msrp': 19.95, 'binding': 'Paperback', 'isbn': '0195137892', 'isbn10': '0195137892', 'other_isbns': [{'isbn': '9780199920792', 'binding': 'print'}]}}