{'book': {'publisher': 'Oxford University Press', 'synopsis': "Now in its sixth edition, Modern Latin America is a lively interpretive history and the leading text in the field. Thoroughly updated and revised, the book includes a new chapter on the history of Colombia from the wars of independence to the violent conflicts of the present day. It also examines such topics as:<br/>* the impact of 9/11 on U.S.-Latin American relations<br/>* globalization<br/>* drug trafficking<br/>* women's roles in society and politics<br/>* the fragility and uncertainty of democracy in Latin America<br/><br/>The book features sociocultural sections and boxes in nearly every chapter, covering such diverse areas as the psychology of exile, Santería in Cuba, baseball in the Dominican Republic, and the popularity of Latin music in the U.S. All political and economic information has been updated. As in earlier editions, the authors use an in-depth case study approach that guides readers through the major countries of Latin America, highlighting central themes including European-New World interaction, racial mixtures, military takeovers, and United States intervention in the area. With an insightful look into the future, Modern Latin America, Sixth Edition, will continue to be an exceptional text for undergraduate courses on contemporary Latin American history, society, and politics.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/01/39/9780195170139.jpg', 'title_long': 'Modern Latin America', 'edition': '6th', 'dimensions': 'Height: 6.1 Inches, Length: 9.1 Inches, Weight: 1.61598838046 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 9.1}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.61598838046}, 'height': {'unit': 'inches', 'value': 6.1}}, 'pages': 512, 'date_published': '2005-01-07', 'subjects': ['History', 'World', 'Politics & Social Sciences', 'Politics & Government', 'International & World Politics', 'Political Science', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Thomas E. Skidmore', 'Peter H. Smith'], 'title': 'Modern Latin America', 'isbn13': '9780195170139', 'msrp': 55.95, 'binding': 'Paperback', 'isbn': '019517013X', 'isbn10': '019517013X'}}