{'book': {'publisher': 'Oxford University Press', 'synopsis': "The Greek Tragedy in New Translations series is based on the conviction that only translators who write poetry themselves, or who work in collaboration with poets, can properly re-create the celebrated and timeless tragedies of the great Greek writers. These new translations are more than faithful to the original text, going beyond the literal meaning in order to evoke the poetic intensity and rich metaphorical texture of the Greek language.<br/>Euripides was one of the most popular and controversial of all the Greek tragedians, and his plays are marked by an independence of thought, ingenious dramatic devices, and a subtle variety of register and mood. Medea, is a story of betrayal and vengeance. Medea, incensed that her husband Jason would leave her for another after the many sacrifices she has made for him, murders both his new bride and their own children in revenge. It is an excellent example of the prominence and complexity that Euripides gave to female characters. This new translation does full justice to the lyricism of Euripides original work, while a new introduction provides a guide to the play, complete with interesting details about the traditions and social issues that influenced Euripides's world.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/56/63/9780195145663.jpg', 'title_long': 'Medea (Greek Tragedy in New Translations)', 'edition': '1', 'dimensions': 'Height: 5.2 Inches, Length: 7.9 Inches, Weight: 0.22928075248 Pounds, Width: 0.26 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.9}, 'width': {'unit': 'inches', 'value': 0.26}, 'weight': {'unit': 'pounds', 'value': 0.22928075248}, 'height': {'unit': 'inches', 'value': 5.2}}, 'pages': 128, 'date_published': '2006-08-10', 'subjects': ['Literature & Fiction', 'Dramas & Plays', 'British & Irish', 'Ancient & Classical', 'Reference', 'Words, Language & Grammar', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Euripides'], 'title': 'Medea (Greek Tragedy in New Translations)', 'isbn13': '9780195145663', 'msrp': 11.95, 'binding': 'Paperback', 'related': {'Kindle Edition': '0199881855', 'ePub': '0199881855'}, 'isbn': '0195145666', 'isbn10': '0195145666', 'other_isbns': [{'isbn': '9780199881857', 'binding': 'print'}]}}