{'book': {'publisher': 'University of Chicago Press', 'synopsis': 'With this volume, the University of Chicago Press completes its translation of a work that is indispensable not only to serious readers of Flaubert but to anyone interested in the last major contribution by one of the twentieth century\'s greatest thinkers.<br/><br/>That Sartre\'s study of Flaubert, The Family Idiot, is a towering achievement in intellectual history has never been disputed. Yet critics have argued about the precise nature of this novel or biography or "criticism-fiction" which is the summation of Sartre\'s philosophical, social, and literary thought. In the preface, Sartre writes: "The Family Idiot is the sequel to Search for a Method. The subject: what, at this point in time, can we know about a man? It seemed to me that this question could only be answered by studying a specific case."<br/><br/>Sartre discusses Flaubert\'s personal development, his relationship to his family, his decision to become a writer, and the psychosomatic crisis or "conversion" from his father\'s domination to the freedom of his art. Sartre blends psychoanalysis with a sociological study of the ideology of the period, the crisis in literature, and Flaubert\'s influence on the future of literature.<br/><br/>While Sartre never wrote the final volume he envisioned for this vast project, the existing volumes constitute in themselves a unified work—one that John Sturrock, writing in the Observer, called "a shatteringly fertile, digressive and ruthless interpretation of these few cardinal years in Flaubert\'s life."<br/><br/>"A virtuoso perfomance. . . . For all that this book does to make one reconsider his life, The Family Idiot is less a case study of Flaubert than it is a final installment of Sartre\'s mythology. . . . The translator, Carol Cosman, has acquitted herself brilliantly."—Frederick Brown, New York Review of Books<br/><br/>"A splendid translation by Carol Cosman. . . . Sartre called The Family Idiot a \'true novel,\' and it does tell a story and eventually reach a shattering climax. The work can be described most simply as a dialectic, which shifts between two seemingly alternative interpretations of Flaubert\'s destiny: a psychoanalytic one, centered on his family and on his childhood, and a Marxist one, whose guiding themes are the status of the artist in Flaubert\'s period and the historical and ideological contradictions faced by his social class, the bourgeoisie."—Fredric Jameson, New York Times Book Review<br/><br/>Jean-Paul Sartre (1906-1980) was offered, but declined, the Nobel Prize for literature in 1964. His many works of fiction, drama, and philosophy include the monumental study of Flaubert, The Family Idiot, and The Freud Scenario, both published in translation by the University of Chicago Press.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/51/91/9780226735191.jpg', 'title_long': 'The Family Idiot: Gustave Flaubert, 1821-1857, Volume 5 (Volume 5)', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 2.30603526052 Pounds, Width: 1.7 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.7}, 'weight': {'unit': 'pounds', 'value': 2.30603526052}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 632, 'date_published': '1994-01-26', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Historical', 'United States', 'Europe', 'Literature & Fiction', 'History & Criticism', 'Regional & Cultural'], 'authors': ['Jean-Paul Sartre'], 'title': 'The Family Idiot: Gustave Flaubert, 1821-1857, Volume 5 (Volume 5)', 'isbn13': '9780226735191', 'msrp': 70, 'binding': 'Hardcover', 'isbn': '0226735192', 'isbn10': '0226735192', 'other_isbns': [{'isbn': '9780226822006', 'binding': 'printisbncanonical'}]}}