{'book': {'publisher': 'Crown', 'synopsis': 'It was 1733 when the poet and philosopher Voltaire met Emilie du Châtelet, a beguiling—and married—aristocrat who would one day popularize Newton’s arcane ideas and pave the way for Einstein’s theories. In an era when women were rarely permitted any serious schooling, this twenty-seven-year-old’s nimble conversation and unusual brilliance led Voltaire, then in his late thirties, to wonder, “Why did you only reach me so late?” They fell immediately and passionately in love.<br/><br/>Through the prism of their tumultuous fifteen-year relationship we see the crumbling of an ancient social order and the birth of the Enlightenment. Together the two lovers rebuilt a dilapidated and isolated rural chateau at Cirey where they conducted scientific experiments, entertained many of the leading thinkers of the burgeoning scientific revolution, and developed radical ideas about the monarchy, the nature of free will, the subordination of women, and the separation of church and state.<br/><br/>But their time together was filled with far more than reading and intellectual conversation. There were frantic gallopings across France, sword fights in front of besieged German fortresses, and a deadly burning of Voltaire’s books by the public executioner at the base of the grand stairwell of the Palais de Justice in Paris. The pair survived court intrigues at Versailles, narrow escapes from agents of the king, a covert mission to the idyllic lakeside retreat of Frederick the Great of Prussia, forays to the royal gambling tables (where Emilie put her mathematical acumen to lucrative use), and intense affairs that bent but did not break their bond.<br/><br/>Along with its riveting portrait of Voltaire as a vulnerable romantic, Passionate Minds at last does justice to the supremely unconventional life and remarkable achievements of Emilie du Châtelet—including her work on the science of fire and the nature of light. Long overlooked, her story tells us much about women’s lives at the time of the Enlightenment. Equally important, it demonstrates how this graceful, quick-witted, and attractive woman worked out the concepts that would lead directly to the “squared” part of Einstein’s revolutionary equation: E=mc2.<br/><br/>Based on a rich array of personal letters, as well as writings from houseguests, neighbors, scientists, and even police reports, Passionate Minds is both panoramic and intimate in feeling. It is an unforgettable love story and a vivid rendering of the birth of modern ideas.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/72/00/9780307237200.jpg', 'title_long': 'Passionate Minds: The Great Love Affair of the Enlightenment, Featuring the Scientist Emilie du Chatelet, the Poet Voltaire, Sword Fights, Book Burnings, Assorted Kings, Seditious Verse, and...', 'edition': 'First Edition', 'dimensions': 'Height: 9.5 Inches, Length: 6.25 Inches, Weight: 1.45 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 1.45}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 384, 'date_published': '2006-10-10', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Historical', 'Europe', 'Professionals & Academics', 'Scientists', 'History', 'Americas', 'United States', 'France', 'Politics & Social Sciences', 'Sociology'], 'authors': ['David Bodanis'], 'title': 'Passionate Minds: The Great Love Affair of the Enlightenment, Featuring the Scientist Emilie du Chatelet, the Poet Voltaire, Sword Fights, Book Burnings, Assorted Kings, Seditious Verse, and...', 'isbn13': '9780307237200', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0307237206', 'isbn10': '0307237206'}}