{'book': {'publisher': 'Del Rey', 'synopsis': '“This amusing, sad, and heartfelt look at [Adams’s] lifeis a true gift.”—New York Post<br/><br/>It all started when Douglas Adams demolished planet Earth in order to make way for an intergalactic expressway—and then invited everyone to thumb a ride on a comical cosmic road trip in The Hitchhiker’s Guide to the Galaxy. Adams made the universe a much funnier place to inhabit and forever changed the way we think about towels, extraterrestrial poetry, and especially the number 42. And then, too soon, he was gone.<br/><br/>In Wish You Were Here, Nick Webb, a longtime friend of the author, reveals the many sides, quirks, and contradictions of Douglas Adams. A summation as celebration, it is a look back at a life well worth the vicarious reliving, as studded with anecdote, droll comic incident, and heartfelt insight as its subject’s own unforgettable tales of cosmic wanderlust.<br/><br/>Praise for Wish You Were Here<br/><br/>“Webb’s tale brims with affection and humour; every page is a delight.”—The Daily Mail<br/><br/>“It’s perhaps the ultimate credit to Webb that he can be just as funny as Adams in his writing. With many of the same veins of humour that Adams had running throughout this biography, it’s as if the great hitchhiker has never really left.”—The Leeds Guide', 'language': 'en', 'image': 'https://images.isbndb.com/covers/65/17/9780345476517.jpg', 'title_long': 'Wish You Were Here: The Official Biography of Douglas Adams', 'edition': 'Reprint', 'dimensions': 'Height: 8.23 Inches, Length: 5.55 Inches, Weight: 0.665 Pounds, Width: 0.85 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.55}, 'width': {'unit': 'inches', 'value': 0.85}, 'weight': {'unit': 'pounds', 'value': 0.665}, 'height': {'unit': 'inches', 'value': 8.23}}, 'pages': 368, 'date_published': '2005-12-27', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Actors & Entertainers', 'Authors', 'Professionals & Academics', 'Scientists', 'Humor & Entertainment', 'Humor', 'Self Service', 'Custom Stores'], 'authors': ['Nick Webb'], 'title': 'Wish You Were Here: The Official Biography of Douglas Adams', 'isbn13': '9780345476517', 'msrp': 15.38, 'binding': 'Paperback', 'isbn': '0345476514', 'isbn10': '0345476514'}}