{'book': {'publisher': 'Farrar, Straus and Giroux', 'synopsis': 'What John McPhee\'s books all have in common is that they are about real people in real places. Here, at his adventurous best, he is out and about with people who work in freight transportation.<br/><br/>Over the past eight years, John McPhee has spent considerable time in the company of people who work in freight transportation. Uncommon Carriers is his sketchbook of them and of his journeys with them. He rides from Atlanta to Tacoma alongside Don Ainsworth, owner and operator of a sixty-five-foot,<br/>eighteen-wheel chemical tanker carrying hazmats. McPhee attends ship-handling school on a pond in the foothills of the French Alps, where, for a tuition of $15,000 a week, skippers of the largest ocean ships refine their capabilities in twenty-foot scale models. He goes up the "tight-assed" Illinois River on a<br/>"towboat" pushing a triple string of barges, the overall vessel being "a good deal longer than the Titanic." And he travels by canoe up the canal-and-lock commercial waterways traveled by Henry David Thoreau and his brother, John,<br/>in a homemade skiff in 1839.<br/><br/>Uncommon Carriers is classic work by McPhee, in prose distinguished, as always, by its author\'s warm humor, keen insight, and rich sense of human character.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/03/90/9780374280390.jpg', 'title_long': 'Uncommon Carriers', 'edition': 'First Edition', 'dimensions': 'Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.9 Pounds, Width: 0.7499985 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.7499985}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 256, 'date_published': '2006-05-16', 'subjects': ['Literature & Fiction', 'Essays & Correspondence', 'Essays', 'Literary', 'Engineering & Transportation', 'Transportation'], 'authors': ['John McPhee'], 'title': 'Uncommon Carriers', 'isbn13': '9780374280390', 'msrp': 24, 'binding': 'Hardcover', 'isbn': '0374280398', 'isbn10': '0374280398', 'other_isbns': [{'isbn': '9781429988971', 'binding': 'printisbncanonical'}]}}