{'book': {'publisher': "G.P. Putnam's Sons", 'synopsis': 'The NUMA crew, under Kurt Austin’s direction, take on a blood-thirsty family with a fortune built on crime, in what may be race to discover the very secret of ever-lasting life in this heart-bounding installment in the #1 New York Times-bestselling series.<br/><br/>Kurt Austin is mid-mission when his new colleague, the stunning archeologist Skye Labelle, is called away to examine a mysterious 16th-century military helmet discovered in the possession of a very contemporary-looking corpse. Ms. Labelle’s research on the armor draws her into the sights of a ruthless black-widow with her own plans for the artifact. As danger creeps closer to Ms. Labelle, a scientist half-way across the globe is kidnapped. At the same time, experts working to harvest an enzyme discovered two thousand feet down in the North Atlantic, in an area known as “Lost City,” start turning up dead. Worlds apart in location and areas of expertise, they all have something in common. And it’s up to Kurt Austin, with the help of Joe Zavala and the NUMA Special Assignments Team, to put the pieces together if he’s going to keep his friend safe.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/41/91/9780425204191.jpg', 'title_long': 'Lost City (The NUMA Files)', 'edition': 'Reprint', 'dimensions': 'Height: 7.44 Inches, Length: 4.24 Inches, Weight: 0.64 Pounds, Width: 1.19 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.24}, 'width': {'unit': 'inches', 'value': 1.19}, 'weight': {'unit': 'pounds', 'value': 0.64}, 'height': {'unit': 'inches', 'value': 7.44}}, 'pages': 544, 'date_published': '2005-07-26', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Sea Stories', 'Action & Adventure', 'Mystery, Thriller & Suspense', 'Sea Adventures', 'War & Military', 'Contemporary', 'Thrillers & Suspense', 'Suspense', 'Self Service', 'Custom Stores'], 'authors': ['Clive Cussler', 'Paul Kemprecos'], 'title': 'Lost City (The NUMA Files)', 'isbn13': '9780425204191', 'msrp': 9.99, 'binding': 'Paperback', 'related': {'Kindle Edition': '1101205016', 'ePub': '1101205016'}, 'isbn': '0425204197', 'isbn10': '0425204197', 'other_isbns': [{'isbn': '9781101205013', 'binding': 'print'}]}}