{'book': {'publisher': 'Berkley', 'synopsis': 'A woman diagnosed with dissociative identity disorder reveals her harrowing journey from abuse to recovery in this #1 New York Times bestselling autobiography written by her own multiple personalities.<br/><br/>Successful, happily married Truddi Chase began therapy hoping to find the reasons behind her extreme anxiety, mood swings, and periodic blackouts. What emerged from her sessions was terrifying: Truddi’s mind and body were inhabited by the Troops—ninety-two individual voices that emerged to shield her from her traumatizing childhood.<br/><br/>For years the Troops created a world where she could hide from the pain of the ritualized sexual abuse she suffered at the hands of her own stepfather—abuse that began when she was only two years old. It was a past that Truddi didn’t even know existed, until she and her therapist took a journey to where the nightmare began...<br/><br/>Written by the Troops themselves, When Rabbit Howls is told by the very alter-egos who stayed with Truddi Chase, watched over her, and protected her. What they reveal is a spellbinding descent into a personal hell—and an ultimate, triumphant deliverance for the woman they became.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/33/11/9780425183311.jpg', 'title_long': 'When Rabbit Howls: A First-Person Account of Multiple Personality, Memory, and Recovery', 'edition': 'Reprint', 'dimensions': 'Height: 8.26 Inches, Length: 5.27 Inches, Weight: 0.77 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.27}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 0.77}, 'height': {'unit': 'inches', 'value': 8.26}}, 'pages': 400, 'date_published': '2002-02-05', 'subjects': ['Self-Help', 'Abuse', 'Biographies & Memoirs', 'Memoirs', 'Health, Fitness & Dieting', 'Mental Health', 'Dissociative Disorders', 'Psychology & Counseling', 'Neuropsychology', 'Pathologies', 'Psychotherapy, TA & NLP', 'Parenting & Relationships', 'Family Relationships'], 'authors': ['Truddi Chase'], 'title': 'When Rabbit Howls: A First-Person Account of Multiple Personality, Memory, and Recovery', 'isbn13': '9780425183311', 'msrp': 16, 'binding': 'Paperback', 'isbn': '0425183319', 'isbn10': '0425183319', 'other_isbns': [{'isbn': '9781101666623', 'binding': 'printisbncanonical'}]}}