{'book': {'publisher': 'Dell', 'synopsis': '“Matchless storyteller”(Romantic Times) Mary Balogh weaves a tantalizing web of wit and seduction in her new novel—an irresistible tale of two unlikely lovers and one unforgettable summer.<br/><br/>Kit Butler is cool, dangerous, one of London’s mostinfamous bachelors—marriage is the last thing on his mind. But Kit’s family has other plans. Desperate to thwart his father’s matchmaking, Kit needs a bride...fast. Enter Miss Lauren Edgeworth.<br/><br/>A year after being abandoned at the altar, Lauren has determined that marriage is not for her. When these two fiercely independent souls meet, sparks fly—and a deal is hatched. Lauren will masquerade as Kit’s intended if he agrees to provide a passionate, adventurous, unforgettable summer. When summer ends, she will break off the engagement, rendering herself unmarriageable and leaving them both free. Everything is going perfectly—until Kit does the unthinkable: He begins to fall in love. A summer to remember is not enough for him. But how can he convince Lauren to be his...for better, for worse, for the rest of their lives?', 'language': 'en', 'image': 'https://images.isbndb.com/covers/66/34/9780440236634.jpg', 'title_long': 'A Summer to Remember: A Bedwyn Family Novel (Get Connected Romances)', 'dimensions': 'Height: 6.75 Inches, Length: 4.23 Inches, Weight: 0.41 Pounds, Width: 0.84 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.23}, 'width': {'unit': 'inches', 'value': 0.84}, 'weight': {'unit': 'pounds', 'value': 0.41}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 384, 'date_published': '2003-03-04', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Romance', 'Historical', 'Regency'], 'authors': ['Mary Balogh'], 'title': 'A Summer to Remember: A Bedwyn Family Novel (Get Connected Romances)', 'isbn13': '9780440236634', 'msrp': '0.00', 'binding': 'Mass Market Paperback', 'related': {'Kindle Edition': '0440334098'}, 'isbn': '0440236630', 'isbn10': '0440236630', 'other_isbns': [{'isbn': '9780440334095', 'binding': 'printisbn'}]}}