{'book': {'publisher': 'Yearling', 'synopsis': "Just when the Hatford brothers were expecting three boys to move into the house across the river, where their best friends, the Bensons, used to live, the Malloys arrive instead. Wally and his brothers decide to make Caroline and her sisters so miserable that they'll want to go back to Ohio, but they haven't counted on the ingenuity of the girls.<br/><br/>From dead fish to dead bodies, floating cakes to floating heads, the pranks and tricks continue—first by the boys, then the girls—until someone is taken prisoner! Will the Malloys leave West Virginia? Will the Bensons come back? Trust the four Hatford boys and the three Malloy girls to do anything to get one up on each other in this fun-filled war of the wits.<br/><br/>Readers will cheer for their favorites in this lively story of two feuding families written by Newbery Medal winner Phyllis Reynolds Naylor.<br/><br/>Watch for the continuing chronicles of the Hatfords and the Malloys in The Girls Get Even.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/84/12/9780440418412.jpg', 'title_long': 'The Boys Start the War (Boy/Girl Battle)', 'edition': 'Reissue', 'dimensions': 'Height: 7.69 Inches, Length: 5.25 Inches, Weight: 0.2 Pounds, Width: 0.38 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 0.38}, 'weight': {'unit': 'pounds', 'value': 0.2}, 'height': {'unit': 'inches', 'value': 7.69}}, 'pages': 144, 'date_published': '2002-01-08', 'subjects': ["Children's Books", 'Growing Up & Facts of Life', 'Friendship, Social Skills & School Life', 'Literature & Fiction', 'Humor', 'Self Service', 'Custom Stores'], 'authors': ['Phyllis Reynolds Naylor'], 'title': 'The Boys Start the War (Boy/Girl Battle)', 'isbn13': '9780440418412', 'msrp': 6.99, 'binding': 'Paperback', 'related': {'ePub': '0307514854'}, 'isbn': '0440418410', 'isbn10': '0440418410', 'other_isbns': [{'isbn': '9780307514851', 'binding': 'printisbn'}]}}