{'book': {'publisher': 'Yearling', 'synopsis': 'Now available in paperback with gorgeous new cover art!<br/><br/>A captivating story of courage and strength against terrible odds, this is the story of Midge, left to stay with her eccentric uncle during the holidays, and her adventures with the Various, a band of fairies. The existence of the Various, who are strange, wild, and sometimes even deadly, has been kept secret since the beginning of time, but when their world begins to clash with the human world, they are threatened with extinction.<br/><br/>This wonderfully imaginative story of love and loyalty is the first in a powerful trilogy. VOYA says of The Various: “A marvelous blend of oldfashioned storytelling, the book has a freshness and immediacy that will intrigue fantasy lovers of all ages.”<br/><br/>“A rousing addition to the durable genre of British fairy lit.”—New York Times<br/><br/>“Augarde unfolds the events gradually, allowing readers to luxuriate in the near-idyllic setting he has created and beckoning them back for future installments.”—Publishers Weekly', 'language': 'en', 'image': 'https://images.isbndb.com/covers/02/93/9780440420293.jpg', 'title_long': 'The Various: Book 1 in the Touchstone Trilogy', 'edition': 'Reprint', 'dimensions': 'Height: 7.5 Inches, Length: 5.15 Inches, Weight: 0.8 Pounds, Width: 0.8 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.15}, 'width': {'unit': 'inches', 'value': 0.8}, 'weight': {'unit': 'pounds', 'value': 0.8}, 'height': {'unit': 'inches', 'value': 7.5}}, 'pages': 448, 'date_published': '2005-11-08', 'subjects': ["Children's Books", 'Literature & Fiction', 'Science Fiction & Fantasy', 'Fantasy & Magic'], 'authors': ['Steve Augarde'], 'title': 'The Various: Book 1 in the Touchstone Trilogy', 'isbn13': '9780440420293', 'msrp': 11.99, 'binding': 'Paperback', 'related': {'ePub': '037589280X'}, 'isbn': '0440420296', 'isbn10': '0440420296', 'other_isbns': [{'isbn': '9780375892806', 'binding': 'printisbn'}]}}