{'book': {'publisher': 'Dell', 'synopsis': 'NEW YORK TIMES BESTSELLER • The fifth book in Diana Gabaldon’s acclaimed Outlander saga, the basis for the Starz original series.<br/><br/>“A grand adventure written on a canvas that probes the heart, weighs the soul and measures the human spirit across [centuries].”—CNN<br/><br/>The year is 1771, and war is coming. Jamie Fraser’s wife tells him so. Little as he wishes to, he must believe it, for hers is a gift of dreadful prophecy—a time-traveler’s certain knowledge.<br/><br/>Born in the year of Our Lord 1918, Claire Randall served England as a nurse on the battlefields of World War II, and in the aftermath of peace found fresh conflicts when she walked through a cleftstone on the Scottish Highlands and found herself an outlander, an English lady in a place where no lady should be, in a time—1743—when the only English in Scotland were the officers and men of King George’s army.<br/><br/>Now wife, mother, and surgeon, Claire is still an outlander, out of place, and out of time, but now, by choice, linked by love to her only anchor—Jamie Fraser. Her unique view of the future has brought him both danger and deliverance in the past; her knowledge of the oncoming revolution is a flickering torch that may light his way through the perilous years ahead—or ignite a conflagration that will leave their lives in ashes.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/16/61/9780440221661.jpg', 'title_long': 'The Fiery Cross (Outlander)', 'edition': 'Outlander', 'dimensions': 'Height: 6.85 Inches, Length: 4.15 Inches, Weight: 1.2875 Pounds, Width: 2.2 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.15}, 'width': {'unit': 'inches', 'value': 2.2}, 'weight': {'unit': 'pounds', 'value': 1.2875}, 'height': {'unit': 'inches', 'value': 6.85}}, 'pages': 1443, 'date_published': '2005-08-30', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'Contemporary', 'Romance', 'Time Travel', 'Science Fiction & Fantasy', 'Fantasy', 'Romantic', 'Self Service', 'Custom Stores'], 'authors': ['Diana Gabaldon'], 'title': 'The Fiery Cross (Outlander)', 'isbn13': '9780440221661', 'msrp': '0.00', 'binding': 'Mass Market Paperback', 'isbn': '0440221668', 'isbn10': '0440221668'}}