{'book': {'publisher': 'Ace', 'synopsis': "“A fierce and beautiful story of rage and compassion, betrayal and loyalty, damage and love...A fairy tale for adults, one you'll never forget.”—Alice Hoffman, New York Times bestselling author of The Rules of Magic<br/><br/>The only daughter of a beloved king and queen, Princess Lissar has grown up in the shadow of her parent’s infinite adoration for each other—an infatuation so great that it could only be broken by the queen’s unexpected passing. As Lissar reaches womanhood, it becomes clear to everyone in the kingdom that she has inherited her late mother’s breathtaking beauty. But on the eve of her seventeenth birthday, Lissar's exquisite looks become a curse...<br/><br/>Betrayed and abused, Lissar is forced to flee her home to escape her father's madness. With her loyal dog Ash at her side, Lissar finds refuge in the mountains where she has the chance to heal and start anew. And as she unlocks a door to a world of magic, Lissar finds the key to her survival and begins an adventure beyond her wildest dreams.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/23/98/9780441012398.jpg', 'title_long': 'Deerskin', 'edition': 'Reprint', 'dimensions': 'Height: 8.23 Inches, Length: 5.41 Inches, Weight: 0.77 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.41}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.77}, 'height': {'unit': 'inches', 'value': 8.23}}, 'pages': 384, 'date_published': '2005-05-03', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Horror', 'Literary', 'Mythology & Folk Tales', 'Folklore', 'Science Fiction & Fantasy', 'Fantasy', 'Epic', 'Sword & Sorcery', 'Humorous', 'Romantic'], 'authors': ['Robin McKinley'], 'title': 'Deerskin', 'isbn13': '9780441012398', 'msrp': 14, 'binding': 'Paperback', 'related': {'ePub': '1497673674'}, 'isbn': '0441012396', 'isbn10': '0441012396', 'other_isbns': [{'isbn': '9781497673670', 'binding': 'print'}]}}