{'book': {'publisher': 'Alliance Entertainment', 'synopsis': 'Ilona Andrews invites you to experience the first novel in the #1 New York Times bestselling series featuring the intriguing fantasy world of mercenary Kate Daniels…<br/><br/>When the magic is up, rogue mages cast their spells and monsters appear, while guns refuse to fire and cars fail to start. But then technology returns, and the magic recedes as unpredictably as it arose, leaving all kinds of paranormal problems in its wake.<br/><br/>Kate Daniels is a down-on-her-luck mercenary who makes her living cleaning up these magical problems. But when Kate’s guardian is murdered, her quest for justice draws her into a power struggle between two strong factions within Atlanta’s magic circles.<br/><br/>The Masters of the Dead, necromancers who can control vampires, and the Pack, a paramilitary clan of shapechangers, blame each other for a series of bizarre killings—and the death of Kate’s guardian may be part of the same mystery. Pressured by both sides to find the killer, Kate realizes she’s way out of her league—but she wouldn’t have it any other way...', 'language': 'es', 'image': 'https://images.isbndb.com/covers/48/97/9780441014897.jpg', 'title_long': 'Magic Bites', 'dimensions': 'Height: 6.75 Inches, Length: 4.19 Inches, Weight: 0.29 Pounds, Width: 0.91 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 0.91}, 'weight': {'unit': 'pounds', 'value': 0.29}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 260, 'date_published': '2014', 'subjects': ['Literature & Fiction', 'Action & Adventure', 'Fantasy', 'Romance', 'Literary', 'Paranormal', 'Science Fiction & Fantasy', 'Paranormal & Urban', 'Romantic'], 'authors': ['ANDREWS,ILONA'], 'title': 'Magic Bites', 'isbn13': '9780441014897', 'msrp': 7.99, 'binding': 'Paperback', 'related': {'Kindle Edition': '1101041978', 'ePub': '1101041978'}, 'isbn': '0441014895', 'isbn10': '0441014895', 'other_isbns': [{'isbn': '9781101041970', 'binding': 'print'}]}}