{'book': {'publisher': 'Churchill Livingstone', 'synopsis': "This is the New Edition of the world's best-selling review book on anesthesiology, combining comprehensive coverage of essential knowledge with an easy-to-use format. Its in-depth, yet succinct discussions make it the ideal way for readers to master the information they need to know. Concise coverage of a broad variety of timely topics makes this the perfect resource for certification, recertification, or use as a refresher on every aspect of the specialty. Over 60 entirely new or completely rewritten chapters reflect a more comprehensive range of material than ever before. Brand-new discussions explore anesthetic management for cardiopulmonary bypass, off-pump coronary bypass, and automatic internal cardiac defibrillator procedures; arrhythmias; anesthesia for magnetic resonance imaging; occupational transmission of blood-borne pathogens; preoperative evaluation of the patient with cardiac disease; anticoagulation and the neuraxis; regional anesthesia and pain relief in children, including combined, continuous spinal, and epidural; and much more. Updated discussions deliver the latest information on ocular complications, pacemakers, perioperative myocardial ischemia, latex allergy, the autonomic nervous system, obstetric anesthesia, aspiration pneumonia, and other timely concerns.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/60/16/9780443066016.jpg', 'title_long': 'Anesthesiology Review (Anesthesiology Review)(3rd Edition)', 'edition': '3', 'dimensions': 'Height: 10.75 Inches, Length: 8.5 Inches, Weight: 3.1415872335 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 3.1415872335}, 'height': {'unit': 'inches', 'value': 10.75}}, 'pages': 624, 'date_published': '2001-10-05', 'subjects': ['Medical Books', 'Medicine', 'Surgery', 'Test Preparation', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': [], 'title': 'Anesthesiology Review (Anesthesiology Review)(3rd Edition)', 'isbn13': '9780443066016', 'msrp': 99.95, 'binding': 'Paperback', 'isbn': '0443066019', 'isbn10': '0443066019'}}