{'book': {'publisher': 'Grand Central Publishing', 'synopsis': "#1 NEW YORK TIMES BESTSELLER<br/><br/>CELEBRATING THE 20th ANNIVERSARY WITH A NEW FOREWORD BY THE AUTHOR<br/><br/>Wounded in the line of duty, NYPD homicide detective John Corey convalesces in the Long Island township of Southold, home to farmers, fishermen -- and at least one killer. Tom and Judy Gordon, a young, attractive couple Corey knows, have been found on their patio, each with a bullet in the head. The local police chief, Sylvester Maxwell, wants Corey's big-city expertise, but Maxwell gets more than he bargained for.<br/><br/>John Corey doesn't like mysteries, which is why he likes to solve them. His investigations lead him into the lore, legends, and ancient secrets of northern Long Island -- more deadly and more dangerous than he could ever have imagined. During his journey of discovery, he meets two remarkable women, Detective Beth Penrose and Mayflower descendant Emma Whitestone, both of whom change his life irrevocably. Ultimately, through his understanding of the murders, John Corey comes to understand himself.<br/><br/>Fast-paced and atmospheric, marked by entrancing characters, incandescent storytelling, and brilliant comic touches, Plum Island is Nelson DeMille at his thrill-inducing best.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/90/84/9780446679084.jpg', 'title_long': 'Plum Island (A John Corey Novel, 1)', 'dimensions': 'Height: 8 Inches, Length: 5.25 Inches, Weight: 1.1 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.1}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 592, 'date_published': '2002-01-01', 'subjects': ['Literature & Fiction', 'Action & Adventure', 'Mystery, Thriller & Suspense', 'Literary', 'Mystery', 'Police Procedurals', 'Thrillers & Suspense', 'Suspense', 'Self Service', 'Custom Stores'], 'authors': ['Nelson DeMille'], 'title': 'Plum Island (A John Corey Novel, 1)', 'isbn13': '9780446679084', 'msrp': 15.99, 'binding': 'Paperback', 'isbn': '0446679089', 'isbn10': '0446679089'}}