{'book': {'publisher': 'Grand Central Publishing', 'synopsis': 'Newsweek calls him "an extraordinarily canny and empathetic observer." In bestseller after bestseller, Turow uses his background as a lawyer to create suspense fiction so authentic it reads with the hammering impact of fact. But before he became a worldwide sensation, Scott Turow wrote a book that is entirely true, the account of his own searing indoctrination into the field of law called ... The first year of law school is an intellectual and emotional ordeal so grueling that it ensures only the fittest survive. Now Scott Turow takes you inside the oldest and most prestigious law school in the country when he becomes a "One L," as entering students are known at Harvard Law School. In a book that became a national bestseller, a law school primer, and a classic autobiography, he brings to life the fascinating, shocking reality of that first year. Provocative and riveting, One L reveals the experience directly from the combat zone: the humiliations, triumphs, hazings, betrayals, and challenges that will make him a lawyer-and forever change Turow\'s mind, test his principles, and expose his heart.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/37/85/9780446673785.jpg', 'title_long': 'One L: The Turbulent True Story of a First Year at Harvard Law School', 'edition': '1st Trade Prn Sep 1997', 'dimensions': 'Height: 8 Inches, Length: 5.25 Inches, Weight: 0.65 Pounds, Width: 0.755 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 0.755}, 'weight': {'unit': 'pounds', 'value': 0.65}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 288, 'date_published': '1997-09-01', 'subjects': ['Law', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Legal', 'Self Service', 'Custom Stores'], 'authors': ['Scott Turow'], 'title': 'One L: The Turbulent True Story of a First Year at Harvard Law School', 'isbn13': '9780446673785', 'msrp': 13.95, 'binding': 'Paperback', 'isbn': '0446673781', 'isbn10': '0446673781'}}