{'book': {'publisher': 'Fawcett', 'synopsis': 'It was the site of one of the most infamous assassinations in American history. Now bestselling mystery master Margaret Truman premieres a new murder at Ford’s Theater–one that’s hot off today’s headlines.<br/><br/>The body of Nadia Zarinski, an attractive young woman who worked for senator Bruce Lerner–and who volunteered at Ford’s–is discovered in the alley behind the theatre. Soon a pair of mismatched cops–young, studious Rick Klieman and gregarious veteran Moses “Mo” Johnson–start digging into the victim’s life, and find themselves confronting an increasing cast of suspects.<br/><br/>There’s Virginia Senator Lerner himself, rumored to have had a sexual relationship with Nadia–and half the women in D.C. under ninety. . . . Clarise Emerson, producer/director of Ford’s Theatre and ex-wife of the Senator, whose nomination to head the National Endowment for the Arts (NEA) is now threatened by the scandal . . . Jeremiah Lerner, her aimless, hot-tempered son, said to have been sleeping with Nadia when his famous father wasn’t . . . Bernard Crowley, the theatre’s controller, whose emotions overflow at the mention of the crime . . . faded British stage star Sydney Bancroft, desperate for recognition and a comeback, and armed with damning information about Clarise Emerson . . . and other complex characters from both sides of the footlights.<br/><br/>With her unparalleled understanding of Washington and its players, and her savvy sense of how strange bedfellows cut deals even in the midst of mayhem, Margaret Truman always delivers the most sophisticated and satisfying suspense. Murder at Ford’s Theatre is her most compelling, insightful novel yet, sure to earn her a standing ovation from her many fans and new followers alike.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/73/89/9780449007389.jpg', 'title_long': "Murder at Ford's Theatre (Capital Crimes)", 'edition': 'First Edition', 'dimensions': 'Height: 6.8 Inches, Length: 4.2 Inches, Weight: 0.41 Pounds, Width: 0.85 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.2}, 'width': {'unit': 'inches', 'value': 0.85}, 'weight': {'unit': 'pounds', 'value': 0.41}, 'height': {'unit': 'inches', 'value': 6.8}}, 'pages': 384, 'date_published': '2003-09-30', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Political', 'Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Thrillers & Suspense', 'Suspense', 'Self Service', 'Custom Stores'], 'authors': ['Margaret Truman'], 'title': "Murder at Ford's Theatre (Capital Crimes)", 'isbn13': '9780449007389', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'isbn': '0449007383', 'isbn10': '0449007383'}}