{'book': {'publisher': 'Ballantine Books', 'synopsis': 'After losing a job, boyfriend, and apartment all within one kick-me-when-I\'m-down week, Alice Lewis desperately needs a break. So when an old pal sweeps into London and offers her escape, Alice jumps at the chance--and onto the next plane to Los Angeles, the city of . . . yeah, right.<br/><br/>L.A. turns out to be a little less "angelic" than the down-to-earth English girl anticipated. For one, there\'s the new nine-to-five: the unbelievably glamorous, frenzied chore of coddling (doing PR for) the stars--not to mention the bevy of gorgeous, stick-thin models who suddenly appear in Alice\'s orbit and the suntan/convertible lifestyle that taunts her pasty-white self (starting with her thighs). And just when she thinks her new life couldn\'t get any more surreal, Alice acquires that most American of accessories: her very own stalker.<br/><br/>While the B-list actresses grumble how unfair it is that Alice gets a stalker and they don\'t, Alice tries to figure out who the mystery man leaving her poems and flowers could be. Is it Charlie, the slick but twisted talent agent? Or Paddy, the hot Irish director who has eyes for any breathing woman? Or maybe it\'s Tommy, the unbelievably beautiful and totally wasted movie star? Because if truth be told, Alice doesn\'t think it\'s all that strange, this stalker business. In fact, she\'s pretty sure it\'s downright romantic . . .', 'language': 'en', 'image': 'https://images.isbndb.com/covers/55/76/9780449005576.jpg', 'title_long': 'Catching Alice: A Novel', 'edition': 'Reissue', 'dimensions': 'Height: 8.24 Inches, Length: 5.43 Inches, Weight: 0.5688 Pounds, Width: 0.74 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.43}, 'width': {'unit': 'inches', 'value': 0.74}, 'weight': {'unit': 'pounds', 'value': 0.5688}, 'height': {'unit': 'inches', 'value': 8.24}}, 'pages': 336, 'date_published': '2000-10-31', 'subjects': ['Literature & Fiction', "Women's Fiction", 'Contemporary', 'Humor & Satire', 'Humorous', 'Romance', 'Self Service', 'Custom Stores'], 'authors': ['Clare Naylor'], 'title': 'Catching Alice: A Novel', 'isbn13': '9780449005576', 'msrp': 9.99, 'binding': 'Paperback', 'related': {'Kindle Edition': '0345464303', 'ePub': '0345464303'}, 'isbn': '0449005577', 'isbn10': '0449005577', 'other_isbns': [{'isbn': '9780345464309', 'binding': 'printisbn'}]}}