{'book': {'publisher': 'Ballantine Books', 'synopsis': 'The beloved author of Fried Green Tomatoes at the Whistle Stop Cafe presents more than 150 delectable recipes from the café that inspired her bestselling novel.<br/><br/>“[Fannie Flagg’s Original Whistle Stop Cafe Cookbook] will make for some mighty fine eating.”—Fort Worth Star-Telegram<br/><br/>“No matter where you come from, East or West, North or South, and no matter if your cafe was called the Whistle Stop, the Busy Bee, the Melrose Diner, or the Chatter Box, close your eyes, forget your troubles, and come on back home with me for just a little while. . . .”<br/><br/>After the tremendous success of Fried Green Tomatoes at the Whistle Stop Cafe and the hit movie that followed, Fannie Flagg received thousands of requests from all over the world asking for recipes from the little café of her Alabama childhood that was the inspiration for the cafe in her novel.<br/><br/>Now she joyfully shares those recipes in what may well be the first cookbook ever written by a satisfied customer rather than a cook! In Fannie Flagg’s Original Whistle Stop Cafe Cookbook, you’ll find over 150 wonderful recipes for:<br/><br/>• Fried Green Tomatoes<br/>• Skinless Fried Chicken<br/>• Pork Chops with Apples and Sweet Potatoes<br/>• Baked Ham and Pineapple Rings<br/>• Southern Cream Gravy<br/>• Fried Catfish<br/>• Lemon Ice Box Pie<br/>• And much more!<br/><br/>These delicious, hearty meals are the ultimate comfort food. But most of all, this food, and this cookbook, come imbued with love.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/02/83/9780449910283.jpg', 'title_long': "Fannie Flagg's Original Whistle Stop Cafe Cookbook: Featuring : Fried Green Tomatoes, Southern Barbecue, Banana Split Cake, and Many Other Great Recipes", 'edition': '1', 'dimensions': 'Height: 9.19 Inches, Length: 7.35 Inches, Weight: 0.82 Pounds, Width: 0.58 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.35}, 'width': {'unit': 'inches', 'value': 0.58}, 'weight': {'unit': 'pounds', 'value': 0.82}, 'height': {'unit': 'inches', 'value': 9.19}}, 'pages': 224, 'date_published': '1995-09-11', 'subjects': ['Cookbooks, Food & Wine', 'Cooking Education & Reference', 'Reference', 'Essays', 'Regional & International', 'U.S. Regional', 'Encyclopedias & Subject Guides', 'Cooking', 'Self Service', 'Custom Stores'], 'authors': ['Fannie Flagg'], 'title': "Fannie Flagg's Original Whistle Stop Cafe Cookbook: Featuring : Fried Green Tomatoes, Southern Barbecue, Banana Split Cake, and Many Other Great Recipes", 'isbn13': '9780449910283', 'msrp': 18, 'binding': 'Paperback', 'related': {'ePub': '0345533828'}, 'isbn': '0449910288', 'isbn10': '0449910288', 'other_isbns': [{'isbn': '9780345533821', 'binding': 'printisbn'}]}}