{'book': {'publisher': 'Berkley', 'synopsis': 'The national bestseller that Newsday called “the most authoritative and candid look yet at the personal lives…of the oft-scrutinized group,” from the author of All You Need Is Love: The Beatles in Their Own Words.<br/><br/>In The Love You Make, Peter Brown, a close friend of and business manager for the band—and the best man at John and Yoko’s wedding—presents a complete look at the dramatic offstage odyssey of the four lads from Liverpool who established the greatest music phenomenon of the twentieth century. Written with the full cooperation of each of the group’s members and their intimates, this book tells the inside story of the music and the madness, the feuds and the drugs, the marriages and the affairs—from the greatest heights to the self-destructive depths of the Fab Four.<br/><br/>In-depth and definitive, The Love You Make is an astonishing account of four men who transformed the way a whole generation of young people thought and lived. It reigns as the most comprehensive, revealing biography available of John, Paul, George, and Ringo.<br/><br/>Includes 32 pages of rare and revealing photos<br/><br/>A Literary Guild® Alternate Selection', 'language': 'en', 'image': 'https://images.isbndb.com/covers/73/57/9780451207357.jpg', 'title_long': "The Love You Make: An Insider's Story of the Beatles", 'edition': 'Reprint', 'dimensions': 'Height: 8 Inches, Length: 5.2 Inches, Weight: 0.89 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.2}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.89}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 464, 'date_published': '2002-11-05', 'subjects': ['Arts & Photography', 'Music', 'Biographies & Memoirs', 'Arts & Literature', 'Actors & Entertainers', 'Composers & Musicians', 'Humor & Entertainment', 'Pop Culture', 'Beatles', 'Literature & Fiction', 'Dramas & Plays', 'Comedy', 'Self Service', 'Custom Stores'], 'authors': ['Peter Brown', 'Steven Gaines'], 'title': "The Love You Make: An Insider's Story of the Beatles", 'isbn13': '9780451207357', 'msrp': 17, 'binding': 'Paperback', 'related': {'Kindle Edition': '1440674078', 'ePub': '1440674078'}, 'isbn': '0451207351', 'isbn10': '0451207351', 'other_isbns': [{'isbn': '9781440674075', 'binding': 'print'}]}}