{'book': {'publisher': 'Berkley', 'synopsis': 'A warrior with inner demons falls for a woman who could save his soul in this seductive novel from the #1 New York Times bestselling Black Dagger Brotherhood series.<br/><br/>Within the Black Dagger Brotherhood, Rhage is the warrior vampire with the strongest appetites. He’s the deadliest fighter, the most voracious lover, the quickest to act on his impulses. He’s also been cursed with two hundred years of hell. Possessed by a beast, he lives in fear of the times when his inner dragon comes out and he’s a danger to everyone around him.<br/><br/>Mary Luce has unwittingly found herself in the vampire world, and under Rhage’s protection. With her own life-threatening curse to bear, she’s not looking for love. Besides, she’s stopped believing in saving grace and miracles long ago. But when Rhage’s intense sexual attraction turns into emotional bonding, he knows he must have her for his mate. As their enemies close in, Mary finds herself praying for something she fears she’ll never have: life eternal with the one she loves.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/80/49/9780451218049.jpg', 'title_long': 'Lover Eternal (Black Dagger Brotherhood, Book 2)', 'edition': 'Reissue', 'dimensions': 'Height: 6.75 Inches, Length: 4.13 Inches, Weight: 0.48 Pounds, Width: 1.16 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.13}, 'width': {'unit': 'inches', 'value': 1.16}, 'weight': {'unit': 'pounds', 'value': 0.48}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 464, 'date_published': '2006-03-07', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Romance', 'Paranormal', 'Romantic Suspense', 'Vampires', 'Fantasy', 'Science Fiction & Fantasy', 'Paranormal & Urban', 'Romantic', 'Self Service', 'Custom Stores'], 'authors': ['J.R. Ward'], 'title': 'Lover Eternal (Black Dagger Brotherhood, Book 2)', 'isbn13': '9780451218049', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'related': {'Kindle Edition': '1101128542', 'ePub': '1101128542'}, 'isbn': '0451218043', 'isbn10': '0451218043', 'other_isbns': [{'isbn': '9781101128541', 'binding': 'print'}]}}