{'book': {'publisher': 'Signet', 'synopsis': 'The enlightening memoir of the industrialist as famous for his philanthropy as for his fortune.<br/><br/>His good friend Mark Twain dubbed him “St. Andrew.” British Prime Minister William Gladstone called him an “example” for the wealthy. Such terms seldom apply to multimillionaires. But Andrew Carnegie was no run-of-the-mill steel magnate. At age 13 and full of dreams, he sailed from his native Dunfermline, Scotland, to America. The story of his success begins with a $1.20-a-week job at a bobbin factory. By the end of his life, he had amassed an unprecedented fortune—and given away more than 90 percent of it for the good of mankind.<br/><br/>Here, for the first time in one volume, are two impressive works by Andrew Carnegie himself: his autobiography and “The Gospel of Wealth,” a groundbreaking manifesto on the duty of the wealthy to give back to society all of their fortunes. And he practiced what he preached, erecting 1,600 libraries across the country, founding Carnegie Mellon University, building Carnegie Hall, and performing countless other acts of philanthropy because, as Carnegie wrote, “The man who dies thus rich dies disgraced.”<br/><br/>With an Introduction by Gordon Hutner', 'language': 'en', 'image': 'https://images.isbndb.com/covers/03/87/9780451530387.jpg', 'title_long': 'The Autobiography of Andrew Carnegie and the Gospel of Wealth (Signet Classics)', 'edition': 'Reissue', 'dimensions': 'Height: 6.78 Inches, Length: 4.13 Inches, Weight: 0.38139971326 Pounds, Width: 0.85 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.13}, 'width': {'unit': 'inches', 'value': 0.85}, 'weight': {'unit': 'pounds', 'value': 0.38139971326}, 'height': {'unit': 'inches', 'value': 6.78}}, 'pages': 352, 'date_published': '2006-11-07', 'subjects': ['Biographies & Memoirs', 'Historical', 'United States', 'Leaders & Notable People', 'Rich & Famous', 'Memoirs', 'Professionals & Academics', 'Business', 'Self Service', 'Custom Stores'], 'authors': ['Andrew Carnegie'], 'title': 'The Autobiography of Andrew Carnegie and the Gospel of Wealth (Signet Classics)', 'isbn13': '9780451530387', 'msrp': 7.95, 'binding': 'Mass Market Paperback', 'related': {'ePub': '1101098376'}, 'isbn': '0451530381', 'isbn10': '0451530381', 'other_isbns': [{'isbn': '9781101098370', 'binding': 'print'}]}}