{'book': {'publisher': 'NAL', 'synopsis': 'In the heart of Panama, a volcanic lake feeds a serpentine river—its stone banks laid by the Inca, who took back the gold and jewels plundered from them by the conquistadors. Legend has it that the Twice-Stolen Treasure has been buried for centuries in the Panamanian jungle. Discovering it means surviving the unpredictable black waters of the River of Ruin....<br/><br/>It begins at a Paris auction house, with a favor granted by an old high school friend to geologist Philip Mercer: the opportunity to buy a rare diary written during the French attempt at digging the Panama Canal. But Mercer isn’t the only one who wants it. Three Chinese assassins have been dispatched to get it, forcing Mercer into a subterranean game of cat and mouse that takes him from the hellish maze of l’empire de la mort and through the sewers of Paris.<br/><br/>Mercer realizes he has uncovered an intricate Chinese plot to trigger a deadly shift in the world’s balance of power. At stake is control of the canal, recently handed over to the government of Panama by the United States. Only Philip Mercer—with help from beautiful U.S. Army officer Lauren Vanik, a cell of tough French Foreign Legion commandos, and a crusty eighty-year-old retired sea captain named Harry White—can stop them.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/05/42/9780451410542.jpg', 'title_long': 'River of Ruin', 'edition': '1', 'dimensions': 'Height: 6.87 Inches, Length: 4.25 Inches, Weight: 0.57 Pounds, Width: 1.37 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.25}, 'width': {'unit': 'inches', 'value': 1.37}, 'weight': {'unit': 'pounds', 'value': 0.57}, 'height': {'unit': 'inches', 'value': 6.87}}, 'pages': 544, 'date_published': '2002-12-03', 'subjects': ['Literature & Fiction', 'Action & Adventure', 'Mystery, Thriller & Suspense', 'Contemporary', 'Thrillers & Suspense', 'Self Service', 'Custom Stores'], 'authors': ['Jack Du Brul'], 'title': 'River of Ruin', 'isbn13': '9780451410542', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'related': {'ePub': '1101098015'}, 'isbn': '0451410548', 'isbn10': '0451410548', 'other_isbns': [{'isbn': '9781101098011', 'binding': 'print'}]}}