{'book': {'publisher': 'Plume', 'synopsis': 'As featured in the book and movie Forks Over Knives, the bestselling author of The Starch Solution and The Healthiest Diet on the Planet returns with over 300 recipes that can be prepared in 15 minutes or less. The perfect gift for the busy and health-conscious chef!<br/><br/>By greatly simplifying the work involved in preparing healthy, whole food, exciting meals, bestselling authors Dr. John McDougall and Mary McDougall continue to build upon the success of their acclaimed, low-fat and plant-based McDougall Program books. In this latest edition, they share their secrets for lowering cholesterol, alleviating allergies, and dramatically reducing the risk of heart disease, cancer, osteoporosis, and diabetes with food that is irresistible to the whole family.<br/><br/>Featuring over 300 recipes (including healthy Mediterranean diet recipes) that can be prepared in fifteen minutes or less, The McDougall Quick and Easy Cookbook is the busy person\'s answer to eating right. Discover shopping tips and cooking hints to save time, reduce fat, and make great-tasting meals. Learn the viable egg and dairy replacements to eliminate fat, cholesterol, and animal protein from your diet. And refer to the updated "McDougall-Okayed Packaged and Canned Products" list.<br/><br/>The economical, fast, and innovative recipes in The McDougall Quick and Easy Cookbook help make good health and longer life easier than ever to achieve.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/69/63/9780452276963.jpg', 'title_long': 'The McDougall Quick and Easy Cookbook: Over 300 Delicious Low-Fat Recipes You Can Prepare in Fifteen Minutes or Less', 'edition': '1st Edition (later printing)', 'dimensions': 'Height: 9.08 Inches, Length: 7.98 Inches, Weight: 1.3007273458 Pounds, Width: 0.86 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.98}, 'width': {'unit': 'inches', 'value': 0.86}, 'weight': {'unit': 'pounds', 'value': 1.3007273458}, 'height': {'unit': 'inches', 'value': 9.08}}, 'pages': 336, 'date_published': '1999-04-01', 'subjects': ['Cookbooks, Food & Wine', 'Quick & Easy', 'Special Diet', 'Low Fat', 'Weight Loss', 'Vegetarian & Vegan', 'Vegan', 'Health, Fitness & Dieting', 'Diets & Weight Loss'], 'authors': ['John A. McDougall', 'Mary McDougall'], 'title': 'The McDougall Quick and Easy Cookbook: Over 300 Delicious Low-Fat Recipes You Can Prepare in Fifteen Minutes or Less', 'isbn13': '9780452276963', 'msrp': 19.99, 'binding': 'Paperback', 'related': {'ePub': '1101119179'}, 'isbn': '0452276969', 'isbn10': '0452276969', 'other_isbns': [{'isbn': '9781101119174', 'binding': 'print'}]}}