{'book': {'publisher': 'NAL', 'synopsis': "The publication of the letters of Ayn Rand is a cause for celebration, not only among the countless millions of Ayn Rand admirers the world over, but also among all those interested in the key political, philosophical, and artistic issues of our century. For there is no separation between Ayn Rand the vibrant, creative woman and Ayn Rand the intellectual dynamo, the rational thinker, who was also a passionately committed champion of individual freedom.<br/><br/>These remarkable letters begin in 1926, with a note from the twenty-year-old Ayn Rand, newly arrived in Chicago from Soviet Russia, an impoverished unknown determined to realize the promise of the land of opportunity. They move through her struggles and successes as a screenwriter, a playwright, and a novelist, her sensational triumph as the author of The Fountainhead and Atlas Shrugged, and her eminence as founder and shaper of Objectivism, one of the most challenging philosophies of our time. They are written to such famed contemporaries as Cecil B. DeMille, Frank Lloyd Wright, H.L. Mencken, Alexander Kerensky, Barry Goldwater and Mickey Spillane<br/>There are letters to philosophers, priests, publishers, and political columnists; to her beloved husband, Frank O' Connor; and to her intimate circle of friends and her growing legion of followers. Her letters range in tone from warm affection to icy fury, and in content from telling commentaries on the events of the day to unforgettably eloquent statements of her philosophical ideas. They are presented chronologically, with explanatory notes by Michael S. Berliner, who identifies the recipients of the letters and provides relevant background and context. Here is a chronicle that captures the inspiring drama of a towering literary genius and seminal thinker, and--often day-by-day--her amazing life.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/40/44/9780452274044.jpg', 'title_long': 'Letters of Ayn Rand', 'edition': 'Reprint', 'dimensions': 'Height: 9.01 Inches, Length: 5.97 Inches, Weight: 1.63803460666 Pounds, Width: 1.51 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.97}, 'width': {'unit': 'inches', 'value': 1.51}, 'weight': {'unit': 'pounds', 'value': 1.63803460666}, 'height': {'unit': 'inches', 'value': 9.01}}, 'pages': 704, 'date_published': '1997-02-01', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Professionals & Academics', 'Philosophers', 'Literature & Fiction', 'Essays & Correspondence', 'Letters', 'Short Stories & Anthologies', 'Anthologies', 'Self Service', 'Custom Stores'], 'authors': ['Ayn Rand'], 'title': 'Letters of Ayn Rand', 'isbn13': '9780452274044', 'msrp': 20.99, 'binding': 'Paperback', 'related': {'ePub': '1101137282'}, 'isbn': '0452274044', 'isbn10': '0452274044', 'other_isbns': [{'isbn': '9781101137284', 'binding': 'print'}]}}