{'book': {'publisher': 'E.P. Dutton', 'synopsis': 'Beauty Punishment - Ann Rice This sequel to The Claiming of Sleeping Beauty, the first of Anne Rice\'s (writing as A.N. Roquelaure) elegantly written volumes of erotica, continues her explicit, teasing exploration of the psychology of human desire. Now Beauty, having indulged in a secret and forbidden infatuation with the rebellious slave Prince Tristan, is sent away from the Satyricon-like world of the Castle. Sold at auction, she will soon experience the tantalizing punishments of "the village," as her education in love, cruelty, dominance, submission, and tenderness is turned over to the brazenly handsome Captain of the Guard. And once again Rice\'s fabulous tale of pleasure and pain dares to explore the most primal and well-hidden desires of the human heart. Even more haunting than her own novel Belinda, this second installment is not to be missed. Anne Rice was born in New Orleans in 1941. She is the author of many bestselling novels, including the widely successful Vampire Chronicles. Her first novel, Interview with the Vampire, was made into a film in 1994 starring Tom Cruise and Brad Pitt. Her other books include the Mayfair Witches series, the novels The Mummy or Ramses the Damned, Violin, Angel Time, the Sleeping Beauty trilogy, and most recently, The Wolf Gift. Anne lives and works in Southern California.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/66/29/9780452266629.jpg', 'title_long': "Beauty's Punishment: The Further Erotic Adventures of Sleeping Beauty", 'edition': 'First Edition', 'dimensions': 'Height: 20 Inches, Length: 20 Inches, Weight: 1 Pounds, Width: 20 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 20}, 'width': {'unit': 'inches', 'value': 20}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 20}}, 'pages': 233, 'date_published': '1984-03-26', 'subjects': ['Literature & Fiction', 'Erotica'], 'authors': ['A. N. Roquelaure'], 'title': "Beauty's Punishment: The Further Erotic Adventures of Sleeping Beauty", 'isbn13': '9780452266629', 'msrp': 12.95, 'binding': 'Hardcover', 'isbn': '0452266629', 'isbn10': '0452266629'}}