{'book': {'publisher': 'Plume', 'synopsis': 'The #1 New York Times bestseller by Senator Al Franken, author of Giant of the Senate<br/><br/>Senator Al Franken’s landmark bestseller, Lies (And the Lying Liars Who Tell Them): A Fair and Balanced Look at the Right, was praised as a “bitterly funny assault” (The New York Times) that rang “with the moral clarity of an angel’s trumpet” (The Associated Press). Now, this master of political humor strikes again with a powerful and provocative message for all of us.<br/><br/>In these pages, Senator Franken reveals the alarming story of how: • Bush (barely) beat Kerry with his campaign of “fear, smear, and queers,” and then claimed a nonexistent mandate.<br/>• “Casino Jack” Abramoff, the Republicans’ nearest and dearest friend, made millions of dollars off of the unspeakable misery of the poor and the powerless. And, also, Native Americans.<br/>• The administration successfully implemented its strategy to destroy America’s credibility and goodwill around the world.<br/><br/>Complete with new material for this paperback edition, The Truth (with jokes) is more than just entertaining, intelligent, and insightful. It is at once prescient in its analysis of right-wing mendacity and incompetence, and inspiring in its vision of a better tomorrow for all Americans (except Jack Abramoff).', 'language': 'en', 'image': 'https://images.isbndb.com/covers/76/79/9780452287679.jpg', 'title_long': 'The Truth (with jokes)', 'edition': 'Reprint', 'dimensions': 'Height: 8.22 Inches, Length: 5.48 Inches, Weight: 0.75 Pounds, Width: 0.95 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.48}, 'width': {'unit': 'inches', 'value': 0.95}, 'weight': {'unit': 'pounds', 'value': 0.75}, 'height': {'unit': 'inches', 'value': 8.22}}, 'pages': 384, 'date_published': '2006-09-26', 'subjects': ['Humor & Entertainment', 'Humor', 'Political', 'Literature & Fiction', 'Humor & Satire', 'Satire', 'Politics & Social Sciences', 'Politics & Government', 'Ideologies & Doctrines', 'United States', 'Elections & Political Process', 'Specific Topics'], 'authors': ['Al Franken'], 'title': 'The Truth (with jokes)', 'isbn13': '9780452287679', 'msrp': 13.53, 'binding': 'Paperback', 'isbn': '0452287677', 'isbn10': '0452287677'}}