{'book': {'publisher': 'Plume', 'synopsis': 'Written 75 years ago, 1984 was George Orwell’s chilling prophecy about the future. And while 1984 has come and gone, his dystopian vision of a government that will do anything to control the narrative is timelier than ever...<br/><br/>This 75th Anniversary Edition includes:<br/>• A New Introduction by Dolen Perkins-Valdez, author of Take My Hand, winner of the 2023 NAACP Image Award for Outstanding Literary Work—Fiction<br/>• A Foreword by Thomas Pynchon<br/>• A New Afterword by Sandra Newman, author of Julia: A Retelling of George Orwell’s 1984<br/><br/>“The Party told you to reject the evidence of your eyes and ears. It was their final, most essential command.”<br/><br/>Winston Smith toes the Party line, rewriting history to satisfy the demands of the Ministry of Truth. With each lie he writes, Winston grows to hate the Party that seeks power for its own sake and persecutes those who dare to commit thoughtcrimes. But as he starts to think for himself, Winston can’t escape the fact that Big Brother is always watching...<br/><br/>A startling and haunting vision of the world, 1984 is so powerful that it is completely convincing from start to finish. No one can deny the influence of this novel, its hold on the imaginations of multiple generations of readers, or the resiliency of its admonitions—a legacy that seems only to grow with the passage of time.<br/><br/>•Nominated as one of America’s best-loved novels by PBS’s The Great American Read•', 'language': 'en', 'image': 'https://images.isbndb.com/covers/42/34/9780452284234.jpg', 'title_long': 'Nineteen Eighty-Four', 'edition': 'Reprint', 'dimensions': 'Weight: 1 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 1}}, 'pages': 368, 'date_published': '2014', 'subjects': ['Literature & Fiction', 'Classics', 'Genre Fiction', 'Political', 'Literary', 'Reference', 'Science Fiction & Fantasy', 'Science Fiction', 'Dystopian', 'Politics & Social Sciences', 'Politics & Government', 'Specific Topics'], 'authors': ['Daniel J. Levitin'], 'title': 'Nineteen Eighty-Four', 'isbn13': '9780452284234', 'msrp': 12.5, 'binding': 'Paperback', 'isbn': '0452284236', 'isbn10': '0452284236'}}