{'book': {'publisher': 'Plume', 'synopsis': '#1 New York Times bestselling author of Women Food and God<br/><br/>This is how Geneen Roth remembers her time as an emotional overeater and self-starver. After years of struggle, Roth finally broke free from the destructive cycle of bingeing and purging. In the two decades since her triumph, she has gone on to help tens of thousands of others do the same through her lectures, workshops, and retreats. Those she has met during this time have shared stories that are both heartrending and inspiring, which Roth has gathered for this unique book.<br/>Twenty years after its original publication, Feeding the Hungry Heart continues to inspire women and men, helping them win the battle against a hunger that goes deeper than a need for food.<br/>With contributions from Ronda Slater, Sylvia Gillett, Carolyn Janik, Janet Robyns, Sharon Sperling, Lyn Lifshin, Linda Ostreicher, Sondra Spatt Olsen, Jill Jeffery, Penny Skillman, Leslie Lawrence, Juneil Parmenter, Lisa Wagner, Joan P. Campbell, Micki Seltzer, Rita Garitano, Barbara Florio Graham, Linda Myer, Laura Fraser, Rachel Lawrence, Florinda Colavin, and other Breaking Free workshop participants.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/08/31/9780452270831.jpg', 'title_long': 'Feeding the Hungry Heart: The Experience of Compulsive Eating', 'edition': 'Reissue', 'dimensions': 'Height: 7.93 Inches, Length: 5.35 Inches, Weight: 0.42 Pounds, Width: 0.58 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.35}, 'width': {'unit': 'inches', 'value': 0.58}, 'weight': {'unit': 'pounds', 'value': 0.42}, 'height': {'unit': 'inches', 'value': 7.93}}, 'pages': 196, 'date_published': '1993-09-01', 'subjects': ['Self-Help', 'Eating Disorders & Body Image', 'Crafts, Hobbies & Home', 'Home Improvement & Design', 'How-to & Home Improvements'], 'authors': ['Geneen Roth'], 'title': 'Feeding the Hungry Heart: The Experience of Compulsive Eating', 'isbn13': '9780452270831', 'msrp': 16, 'binding': 'Paperback', 'isbn': '0452270839', 'isbn10': '0452270839'}}