{'book': {'publisher': 'Plume', 'synopsis': 'Winner of the Pulitzer Prize and the National Book Award<br/><br/>With a Introduction by Adam Gopnik<br/><br/>Fifty years after the March on the Pentagon, Norman Mailer’s seminal tour de force remains as urgent and incisive as ever. Winner of America’s two highest literary awards, The Armies of the Night uniquely and unforgettably captures the Sixties’ tidal wave of love and rage at its crest and a towering genius at his peak.<br/><br/>The time is October 21, 1967. The place is Washington, D.C. Depending on the paper you read, 20,000 to 200,000 protestors are marching to end the war in Vietnam, while helicopters hover overhead and federal marshals and soldiers with fixed bayonets await them on the Pentagon steps. Among the marchers is a writer named Norman Mailer. From his own singular participation in the day’s events and his even more extraordinary perceptions comes a classic work that shatters the mold of traditional reportage. Intellectuals and hippies, clergymen and cops, poets and army MPs crowd the pages of a book in which facts are fused with techniques of fiction to create the nerve-end reality of experiential truth.<br/><br/>“[Mailer’s] genuine wit and bellicose charm, and his fervent and intense sense of legitimately caring, render The Armies of the Night an artful document, worthy to be judged as literature.”—Time<br/><br/>“Only a born novelist could have written a piece of history so intelligent, mischievous, penetrating and alive.”—Alfred Kazin, The New York Times Book Review', 'language': 'en', 'image': 'https://images.isbndb.com/covers/27/98/9780452272798.jpg', 'title_long': 'The Armies of the Night::History as a Novel::the Novel as History[Paperback,1994]', 'edition': 'Reprint', 'dimensions': 'Weight: 0.6 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 0.6}}, 'pages': 304, 'date_published': '1994', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Historical', 'United States', 'Literature & Fiction', 'Genre Fiction', 'War', 'History & Criticism', 'Books & Reading', 'Criticism & Theory', 'Regional & Cultural', 'Contemporary', 'Politics & Social Sciences', 'Politics & Government', 'Specific Topics'], 'authors': ['Norman Mailer'], 'title': 'The Armies of the Night::History as a Novel::the Novel as History[Paperback,1994]', 'isbn13': '9780452272798', 'msrp': 11.55, 'binding': 'Paperback', 'related': {'ePub': '1623730236'}, 'isbn': '0452272793', 'isbn10': '0452272793', 'other_isbns': [{'isbn': '9781623730239', 'binding': 'print'}]}}