{'book': {'publisher': 'Civitas Books', 'synopsis': "The story of foster care in the United States is the story of the failure of the social safety net to aid poor, largely black, parents in their attempt to make a home for their children.<br/><br/>Shattered Bonds tells this story as no other book has before -- from the perspective of a prominent black, female legal theoretician. The current state of the child-welfare system in America is a well-known tragedy. Thousands of children every year are removed from their parents' homes, often for little reason other than the endemic poverty that afflicts women and children more than any other group in the United States.<br/><br/>Dorothy Roberts, an acclaimed legal scholar and social critic, reveals the racial politics of child welfare in America through extensive legal research and original interviews with Chicago families in the foster care system. She describes the racial imbalance in foster care, the concentration of state intervention in certain neighborhoods, the alarming percentages of children in substitute care, the difficulty that poor and black families have in meeting state's standards for regaining custody of children placed in foster care, and the relationship between state supervision of families and continuing racial inequality.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/05/96/9780465070596.jpg', 'title_long': 'Shattered Bonds: The Color Of Child Welfare', 'edition': 'Reprint', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.95 Pounds, Width: 1.2 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.2}, 'weight': {'unit': 'pounds', 'value': 0.95}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 352, 'date_published': '2002-12-25', 'subjects': ['Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies', 'Sociology', 'Race Relations', 'Politics & Government', 'Public Affairs & Policy'], 'authors': ['Dorothy Roberts'], 'title': 'Shattered Bonds: The Color Of Child Welfare', 'isbn13': '9780465070596', 'msrp': 17.5, 'binding': 'Paperback', 'related': {'ePub': '0786730641'}, 'isbn': '0465070590', 'isbn10': '0465070590', 'other_isbns': [{'isbn': '9780786730643', 'binding': 'print'}]}}