{'book': {'publisher': 'Basic Books', 'synopsis': 'At what point does theory depart the realm of testable hypothesis and come to resemble something like aesthetic speculation, or even theology? The legendary physicist Wolfgang Pauli had a phrase for such ideas: He would describe them as "not even wrong," meaning that they were so incomplete that they could not even be used to make predictions to compare with observations to see whether they were wrong or not. In Peter Woit\'s view, superstring theory is just such an idea. In Not Even Wrong , he shows that what many physicists call superstring "theory" is not a theory at all. It makes no predictions, even wrong ones, and this very lack of falsifiability is what has allowed the subject to survive and flourish. Not Even Wrong explains why the mathematical conditions for progress in physics are entirely absent from superstring theory today and shows that judgments about scientific statements, which should be based on the logical consistency of argument and experimental evidence, are instead based on the eminence of those claiming to know the truth. In the face of many books from enthusiasts for string theory, this book presents the other side of the story.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/27/58/9780465092758.jpg', 'title_long': 'Not Even Wrong: The Failure of String Theory and the Search for Unity in Physical Law', 'edition': 'First Edition', 'dimensions': 'Height: 9.75 Inches, Length: 6.25 Inches, Weight: 1.25 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.25}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 320, 'date_published': '2006-09-04', 'subjects': ['Science & Math', 'Physics', 'Quantum Theory'], 'authors': ['Peter Woit'], 'title': 'Not Even Wrong: The Failure of String Theory and the Search for Unity in Physical Law', 'isbn13': '9780465092758', 'msrp': 26.95, 'binding': 'Hardcover', 'related': {'ePub': '046500363X'}, 'isbn': '0465092756', 'isbn10': '0465092756', 'other_isbns': [{'isbn': '9780465003631', 'binding': 'print'}]}}