{'book': {'publisher': 'Basic Books', 'synopsis': 'More than twenty years ago, a little-known Swiss psychoanalyst wrote a book that changed the way many people viewed themselves and their world. In simple but powerful prose, the deeply moving Drama of the Gifted Child showed how parents unconsciously form and deform the emotional lives of their children. Alice Miller\'s stories about the roots of suffering in childhood resonated with readers, and her book soon became a backlist best seller. In The Truth Will Set You Free Miller returns to the intensely personal tone and themes of her best-loved work. Only by embracing the truth of our past histories can any of us hope to be free of pain in the present, she argues. Miller uses vivid true stories to reveal the perils of early-childhood mistreatment and the dangers of mindless obedience to parental will. Drawing on the latest research on brain development, she shows how spanking and humiliation produce dangerous levels of denial, which leads in turn to emotional blindness and to mental barriers that cut off awareness and the ability to learn new ways of acting. If this cycle repeats itself, the grown child will perpetrate the same abuse on later generations -- a message vitally important, especially given the increasing popularity of programs like Tough Love and of "child disciplinarians" like James Dobson. The Truth Will Set You Free will provoke and inform all readers who want to know Alice Miller\'s latest thinking on this important subject.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/58/53/9780465045853.jpg', 'title_long': 'The Truth Will Set You Free: Overcoming Emotional Blindness and Finding Your True Adult Self', 'edition': 'Reprint', 'dimensions': 'Height: 8 Inches, Length: 5.25 Inches, Weight: 0.4850169764 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.4850169764}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 224, 'date_published': '2002-12-10', 'subjects': ['Self-Help', 'Abuse', 'Health, Fitness & Dieting', 'Mental Health', 'Post-traumatic Stress Disorder', 'Psychology & Counseling', 'Child Psychology', 'Developmental Psychology', 'Pathologies', 'Parenting & Relationships', 'Family Relationships'], 'authors': ['Alice Miller'], 'title': 'The Truth Will Set You Free: Overcoming Emotional Blindness and Finding Your True Adult Self', 'isbn13': '9780465045853', 'msrp': 15.99, 'binding': 'Paperback', 'isbn': '0465045855', 'isbn10': '0465045855', 'other_isbns': [{'isbn': '9780465004621', 'binding': 'print'}]}}