{'book': {'publisher': 'Basic Books', 'synopsis': "From the New York Times bestselling author of Upheaval, a fun and wide-ranging exploration of why human sexuality is so different from other animals', and how it made us who we are<br/><br/>To us humans, the sex lives of animals seem weird. But it's our own sex lives that are truly bizarre. We are the only social species to insist on carrying out sex privately. Stranger yet, we have sex at any time, even during periods of infertility, such as pregnancy or post-menopause. A human female doesn't know her precise time of fertility and certainly doesn't advertise it to human males by the striking color changes, smells, and sounds used by other female mammals.<br/><br/>Why do we differ so radically in these and other important aspects of our sexuality from our closest ancestor, the apes? Why does the human female, virtually alone among mammals, go through menopause? Why does the human male stand out as one of the few mammals to stay with the female he impregnates, to help raise the children that he sired? Why is the human penis so unnecessarily large?<br/><br/>There is no one better qualified than Jared Diamond to explain the evolutionary forces that operated on our ancestors to make us so different sexually. With wit and a wealth of fascinating examples, Why Is Sex Fun? shows how our sexuality, as much as our large brains or upright posture, led to human' rise in the animal kingdom.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/12/69/9780465031269.jpg', 'title_long': 'Why Is Sex Fun?: The Evolution of Human Sexuality (Science Masters)', 'edition': 'First Edition', 'dimensions': 'Height: 8 Inches, Length: 5.375 Inches, Weight: 0.38 Pounds, Width: 0.375 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.375}, 'width': {'unit': 'inches', 'value': 0.375}, 'weight': {'unit': 'pounds', 'value': 0.38}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 176, 'date_published': '1998-09-25', 'subjects': ['Self-Help', 'Sex', 'Health, Fitness & Dieting', 'Psychology & Counseling', 'Sexuality', 'Evolutionary Psychology', 'Sexual Health', 'General', 'Science & Math', 'Behavioral Sciences', 'Biological Sciences', 'Biology', 'Evolution', 'Medical Books', 'Psychology', 'Politics & Social Sciences', 'Social Sciences', 'Human Sexuality', 'Anthropology', 'Cultural', 'Physical'], 'authors': ['Jared M Diamond'], 'title': 'Why Is Sex Fun?: The Evolution of Human Sexuality (Science Masters)', 'isbn13': '9780465031269', 'msrp': 16.99, 'binding': 'Paperback', 'related': {'ePub': '0465013074'}, 'isbn': '0465031269', 'isbn10': '0465031269', 'other_isbns': [{'isbn': '9780465013074', 'binding': 'print'}]}}