{'book': {'publisher': 'For Dummies', 'synopsis': 'Want to play — and win — poker\'s hottest game?<br/><br/>Turn on the TV, drop by a newsstand, or just browse the checkout your local supermarket and you\'ll see firsthand that Texas Hold \'Em is the poker game everyone\'s playing. It\'s a game that\'s deceptively simple, yet within its easy framework you’ll find truth and trickery, boredom and fear, skill and misfortune—in other words, all the things that make life fun and worth living!<br/>Texas Hold\'em For Dummies introduces you to the fundamental concepts and strategies of this wildly popular game. It covers the rules for playing and betting, odds, etiquette, Hold\'em lingo, and offers sound advice to avoid mistakes. This handy reference guide gives new and even seasoned players winning strategies and tactics not just for playing the game, but for winning. You\'ll learn: Rules and strategies for limit, no-limit, tournament, and online play How to "play" the other players The importance of your bankroll—recommended sizes and more Hands you should and should not play How to camouflage your play and dodge traps When, who, and how to bluff How to maximize your win with check-raising and trapping The different approaches for playing in private games, casinos, card rooms, tournaments, and on the Internet How to use mathematics to your advantage<br/>Texas Hold \'Em is a game of both skill and chance. But it\'s a game that can be beaten, and whether you want to make money, sharpen your game, or just have a good time, Texas Hold \'Em for Dummies will give you the winning edge.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/60/43/9780470046043.jpg', 'title_long': "Texas Hold'em For Dummies", 'edition': '1', 'dimensions': 'Height: 9.25 Inches, Length: 6 Inches, Weight: 0.8 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.8}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 288, 'date_published': '2006-09-15', 'subjects': ['Humor & Entertainment', 'Puzzles & Games', 'Card Games', 'Poker'], 'authors': ['Mark Harlan'], 'title': "Texas Hold'em For Dummies", 'isbn13': '9780470046043', 'msrp': 10.36, 'binding': 'Paperback', 'related': {'eBook': '1118050738'}, 'isbn': '047004604X', 'isbn10': '047004604X', 'other_isbns': [{'isbn': '9781118050736', 'binding': 'ebook'}]}}