{'book': {'publisher': 'For Dummies', 'synopsis': 'Thinking about buying or selling items on eBay? Whether you want to use eBay to make smart bids and win auctions or turn household clutter into cash, eBay for Dummies, Fifth Edition is your passport to the most successful trading community on the planet. Beginning with an overview of what eBay is and how to become a registered user, eBay for Dummies helps you discover how you can: Search for items to buy and list items to sell on eBay Place a bid—and determine how much you should spend Use pictures and basic HTML to make your eBay listings more appealing Communicate well and close deals without a problem Identify auction terms (reserve price, starting bid, Buy It Now, etc.) Organize your transactions and interactions using the My eBay page Resolve buying and selling issues with eBay’s Trust & Safety program And much more!<br/>Registering at eBay makes you part of a really unique community of people who like to collect, buy, and sell items of just about every kind! So if you’re ready to join the millions of people who use their home computers to make great deals, buy cool stuff, and turn a profit, eBay for Dummies does all the legwork so you can sit back and let the bidding begin!', 'language': 'en', 'image': 'https://images.isbndb.com/covers/52/99/9780470045299.jpg', 'title_long': 'eBay For Dummies', 'edition': '5', 'dimensions': 'Height: 10.25 Inches, Length: 6.5 Inches, Weight: 1.3 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.5}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 1.3}, 'height': {'unit': 'inches', 'value': 10.25}}, 'pages': 386, 'date_published': '2006-10-30', 'subjects': ['Business & Money', 'Business Development & Entrepreneurship', 'Processes & Infrastructure', 'E-Commerce', 'Computers & Technology', 'Internet & Social Media', 'Self Service', 'Custom Stores', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Marsha Collier'], 'title': 'eBay For Dummies', 'isbn13': '9780470045299', 'msrp': 21.99, 'binding': 'Paperback', 'isbn': '0470045299', 'isbn10': '0470045299'}}