{'book': {'publisher': 'Wiley', 'synopsis': '"What William Cecil has accomplished at Biltmore Estate is one of the great preservation success stories of all time. He has set a high standard for what all historic house museums strive for: magnificently preserved buildings and grounds, engaging interpretation, and--perhaps most challenging of all--economic self-sufficiency. It is no surprise that Biltmore Estate is widely recognized as one of America\'s finest places to visit."<br/>―Richard Moe, President of the National Trust for Historic Preservation<br/>"Biltmore is a glorious national historic landmark that, through creative vision and entrepreneurial management, preserves and provides insight into a way of life in the early 1900s. Bill is the imaginative and multifaceted leader who has built this great monument to enrich his community. George and I admire his dedication and success."<br/>―George and Abby Rockefeller O\'Neill<br/>"Bill Cecil and his team at Biltmore Estate have sure proved that they know how to build a successful business. They did it the old-fashioned way: embrace a bold idea that others said could not be done and--through commitment, determination, and hard work--bring it to life. Their achievement against the odds is inspiring, and their vision and perseverance are valuable lessons to us all."<br/>―Don Logan, Chairman, Media & Communications Group, Time Warner<br/>"If George Vanderbilt did nothing more than engage the two most prominent and storied designers of their time, architect Richard Morris Hunt and landscape architect Frederick Law Olmsted, to carry out his vision of a European estate in the southern Appalachians, he would have created an American icon. The beauty of the method by which the estate was executed and, even today, the meticulous attention to detail, in the presentation and care of the estate by William Cecil, have brought history to life."<br/>―Gary J. Walters, Chief Usher, The White House', 'language': 'en', 'image': 'https://images.isbndb.com/covers/81/81/9780471758181.jpg', 'title_long': 'Lady on the Hill: How Biltmore Estate Became an American Icon', 'edition': '1', 'dimensions': 'Height: 9.299194 Inches, Length: 6.2992 Inches, Weight: 1.2000201845184 Pounds, Width: 1.200785 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.2992}, 'width': {'unit': 'inches', 'value': 1.200785}, 'weight': {'unit': 'pounds', 'value': 1.2000201845184}, 'height': {'unit': 'inches', 'value': 9.299194}}, 'pages': 352, 'date_published': '2006-03-10', 'subjects': ['Arts & Photography', 'Architecture', 'Buildings', 'Historic Preservation', 'History', 'Business & Money', 'Industries', 'Hospitality, Travel & Tourism', 'Americas', 'United States', 'World'], 'authors': ['Howard E. Covington Jr.', 'The Biltmore Company'], 'title': 'Lady on the Hill: How Biltmore Estate Became an American Icon', 'isbn13': '9780471758181', 'msrp': 29.95, 'binding': 'Hardcover', 'isbn': '0471758183', 'isbn10': '0471758183'}}