{'book': {'publisher': 'Wiley', 'synopsis': "THE BESTSELLING GUIDE TO REAL ESTATE INVESTING<br/><br/>Now in its fifth edition, Investing in Real Estate is the straightforward guide that helps you start growing your fortune by investing in houses and small apartment buildings. Successful real estate investor Gary Eldred shows you how you can outperform the stock market by investing in residential real estate--the surest and safest way to build assets.<br/><br/>This updated edition covers all the new trends and tactics in real estate investing, including how to shop for properties outside your home market and how to use option arms to achieve positive cash flow. As always, you'll find all the information you need to start investing now, as well as up-to-date tips on negotiating deals, spotting market trends, and using the Internet as a research tool to find and buy properties. Let the authors show you how to:<br/>* Buy with a low or no-money down payment<br/>* Build wealth without paying income taxes<br/>* Find the neighborhoods and properties that will appreciate fastest<br/>* Add value to your properties with smart improvements<br/>* Choose the best financing for your investments<br/>* Protect your net worth with LLCs and other legal strategies<br/><br/>Whether you need money for your child's college tuition, a prosperous retirement, or a higher quality of life, Investing in Real Estate, Fifth Edition is the best guide available to help you start building real wealth right now.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/12/06/9780471741206.jpg', 'title_long': 'Investing in Real Estate, 5th Edition', 'edition': '5', 'dimensions': 'Height: 9.01573 Inches, Length: 6.14172 Inches, Weight: 0.9149183873 Pounds, Width: 0.972439 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.14172}, 'width': {'unit': 'inches', 'value': 0.972439}, 'weight': {'unit': 'pounds', 'value': 0.9149183873}, 'height': {'unit': 'inches', 'value': 9.01573}}, 'pages': 352, 'date_published': '2005-11-18', 'subjects': ['Business & Money', 'Economics', 'Investing', 'Introduction', 'Real Estate', 'Investments'], 'authors': ['Paul McGreevy', 'Gary W. Eldred'], 'title': 'Investing in Real Estate, 5th Edition', 'isbn13': '9780471741206', 'msrp': 19.95, 'binding': 'Paperback', 'isbn': '0471741205', 'isbn10': '0471741205'}}