{'book': {'publisher': 'For Dummies', 'synopsis': 'You have a cool Web site, and a really great product, service, or cause you want people to know about. But visitors aren’t beating down your cyber-door. What happened? The answer, most likely, is that you haven’t made your site irresistible to search engines.<br/>Search engines have a great deal of control over the volume of traffic a Web site gets, because they put your site in front of people searching for your product or service. If you know the secrets of wooing the search engines, you can Gain greater visibility for your site Advance your position in the rankings Avoid techniques that cause search engines to bump your site to the end of the list Make pay-per-click advertising pay off<br/>In addition to the familiar ones like Google and Yahoo!, there are dozens of other search engines out there. Search Engine Optimization For Dummies, 2 Edition shows you how to create a site that will pop to the top like a cork whenever people search for related products or services. It will help you Become familiar with search engines and search directories and find out which keywords work Build your site with techniques that search engines like and avoid the ones they don’t Register your site with the top search systems and get it listed in directories Find out why links are important and see how to get other sites to link to yours Work with Google AdWords and Yahoo! Search, and explore the best and most economical ways to use pay-per-click advertising Discover the common mistakes that make Web sites invisible to search engines<br/>There’s even a companion Web site with all the links in the book neatly (and conveniently) arranged so you don’t have to type them, plus a bonus chapter to help you power up your skills. Search Engine Optimization For Dummies, 2 Edition has been updated with the latest information on search engines plus plenty of tips and tricks to help your site get the attention it deserves!', 'language': 'en', 'image': 'https://images.isbndb.com/covers/99/82/9780471979982.jpg', 'title_long': 'Search Engine Optimization For Dummies, Second Edition', 'edition': '2', 'dimensions': 'Height: 9 Inches, Length: 7.5 Inches, Weight: 1.3 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.3}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 408, 'date_published': '2006-05-08', 'subjects': ['Computers & Technology', 'Web Development & Design', 'Web Design', 'Internet & Social Media', 'Search Engine Optimization', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Peter Kent'], 'title': 'Search Engine Optimization For Dummies, Second Edition', 'isbn13': '9780471979982', 'msrp': 24.99, 'binding': 'Paperback', 'isbn': '0471979988', 'isbn10': '0471979988'}}