{'book': {'publisher': 'Dover Publications', 'synopsis': "The illuminated letters in this volume by the great Victorian designer Owen Jones, many taken from an illustrated edition of The Psalms of David, represent popular alphabet motifs that have been copied by artists and designers for more than a century throughout Europe and North America.<br/>Each page of this versatile archive contains approximately 40 magnificently embellished individual letters of the alphabet. (There's also an additional page of equally attractive Arabic and Roman numerals.) Foliated and filigreed designs — ranging from small to large, simple to spectacular — display the meticulous craftsmanship and attention to detail that have become synonymous with Victorian design.<br/>Commercial artists, graphic designers, and craftspeople will find this elegant and versatile treasury of copyright-free decorative letters an excellent and indispensable sourcebook for graphic projects calling for old-fashioned Victorian charm.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/60/78/9780486256078.jpg', 'title_long': '1001 Illuminated Initial Letters: 27 Full-Color Plates (Dover Pictorial Archive)', 'dimensions': 'Height: 12.5 Inches, Length: 9.25 Inches, Weight: 0.4 Pounds, Width: 0.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 9.25}, 'width': {'unit': 'inches', 'value': 0.25}, 'weight': {'unit': 'pounds', 'value': 0.4}, 'height': {'unit': 'inches', 'value': 12.5}}, 'pages': 32, 'date_published': '1988-04-01', 'subjects': ['Arts & Photography', 'Decorative Arts & Design', 'Decorative Arts', 'Other Media', 'Calligraphy', 'Graphic Design', 'Clip Art'], 'authors': ['Owen Jones'], 'title': '1001 Illuminated Initial Letters: 27 Full-Color Plates (Dover Pictorial Archive)', 'isbn13': '9780486256078', 'msrp': 8.39, 'binding': 'Paperback', 'related': {'ePub': '0486155439'}, 'isbn': '0486256073', 'isbn10': '0486256073', 'other_isbns': [{'isbn': '9780486155432', 'binding': 'print'}]}}