{'book': {'publisher': 'Dover Publications', 'synopsis': 'Written for the undergraduate who has completed a year of calculus, this clear, skillfully organized text combines two important topics in modern mathematics in one comprehensive volume.<br/>As Professor Dettman (Oakland University, Rochester, Michigan) points out, "Not only is linear algebra indispensable to the mathematics major, but . . . it is that part of algebra which is most useful in the application of mathematical analysis to other areas, e.g. linear programming, systems analysis, statistics, numerical analysis, combinatorics, and mathematical physics."<br/>The book progresses from familiar ideas to more complex and difficult concepts, with applications introduced along the way, to clarify or illustrate theoretical material.<br/>Among the topics covered are complex numbers, including two-dimensional vectors and functions of a complex variable; matrices and determinants; vector spaces; symmetric and hermitian matrices; first order nonlinear equations; linear differential equations; power-series methods; Laplace transforms; Bessel functions; systems of differential equations; and boundary value problems.<br/>To reinforce and expand each chapter, numerous worked-out examples are included. A unique pedagogical feature is the starred section at the end of each chapter. Although these sections are not essential to the sequence of the book, they are related to the basic material and offer advanced topics to stimulate the more ambitious student. These topics include power series; existence and uniqueness theorems; Hilbert spaces; Jordan forms; Green\'s functions; Bernstein polynomials; and the Weierstrass approximation theorem.<br/>This carefully structured textbook provides an ideal, step-by-step transition from first-year calculus to multivariable calculus and, at the same time, enables the instructor to offer special challenges to students ready for more advanced material.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/19/10/9780486651910.jpg', 'title_long': 'Introduction to Linear Algebra and Differential Equations (Dover Books on Mathematics)', 'edition': 'Revised ed.', 'dimensions': 'Height: 8.47 Inches, Length: 5.38 Inches, Weight: 0.95680621708 Pounds, Width: 0.84 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.38}, 'width': {'unit': 'inches', 'value': 0.84}, 'weight': {'unit': 'pounds', 'value': 0.95680621708}, 'height': {'unit': 'inches', 'value': 8.47}}, 'pages': 432, 'date_published': '1986-12-01', 'subjects': ['Science & Math', 'Mathematics', 'Applied', 'Pure Mathematics', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['John W. Dettman'], 'title': 'Introduction to Linear Algebra and Differential Equations (Dover Books on Mathematics)', 'isbn13': '9780486651910', 'msrp': 10.36, 'binding': 'Paperback', 'related': {'ePub': '0486158314'}, 'isbn': '0486651916', 'isbn10': '0486651916', 'other_isbns': [{'isbn': '9780486158310', 'binding': 'print'}]}}