{'book': {'publisher': 'Dover Publications', 'synopsis': "Prosperous and socially prominent, George Babbitt appears to have everything a man could wish: good health, a fine family, and a profitable business in a booming Midwestern city. But the middle-aged real estate agent is shaken from his self-satisfaction by a growing restlessness with the limitations of his life. When a personal crisis forces a reexamination of his values, Babbitt mounts a rebellion against social expectations — jeopardizing his reputation and business standing as well as his marriage.<br/>Widely considered Sinclair Lewis's greatest novel, this satire of the American social landscape created a sensation upon its 1922 publication. Babbitt's name became an instant and enduring synonym for middle-class complacency, and the strictures of his existence revealed the emptiness of the mainstream vision of success. His story reflects the nature of a conformist society, in which the pressures of maintaining propriety can ultimately cause individuals to lose their place in the world.<br/>Babbitt ranks among the important 20th-century works addressing the struggles of people caught in the machinery of modern life, and it remains ever-relevant as a cautionary tale against clinging to conventional values.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/16/73/9780486431673.jpg', 'title_long': 'Babbitt (Dover Thrift Editions: Classic Novels)', 'dimensions': 'Height: 8.5 Inches, Length: 5 Inches, Weight: 0.5401325419 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.5401325419}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 320, 'date_published': '2003-09-22', 'subjects': ['Humor & Entertainment', 'Humor', 'Self-Help & Psychology', 'Literature & Fiction', 'Classics', 'Genre Fiction', 'Psychological', 'United States', 'Humor & Satire', 'Satire', 'Literary'], 'authors': ['Sinclair Lewis'], 'title': 'Babbitt (Dover Thrift Editions: Classic Novels)', 'isbn13': '9780486431673', 'msrp': 6, 'binding': 'Paperback', 'related': {'eBook': '0486115208', 'ePub': '0486115208'}, 'isbn': '0486431673', 'isbn10': '0486431673', 'other_isbns': [{'isbn': '9780486115207', 'binding': 'fpid13alias'}]}}