{'book': {'publisher': 'Dover Publications', 'synopsis': '"Although we are amused, we may also be embarrassed to find our friends or even ourselves among the gullible advocates of plausible-sounding doubletalk." — Saturday Review<br/>"A very able and even-tempered presentation." — New Yorker<br/>This witty and engaging book examines the various fads, fallacies, strange cults, and curious panaceas which at one time or another have masqueraded as science. Not just a collection of anecdotes but a fair, reasoned appraisal of eccentric theory, it is unique in recognizing the scientific, philosophic, and sociological-psychological implications of the wave of pseudoscientific theories which periodically besets the world.<br/>To this second revised edition of a work formerly titled In the Name of Science, Martin Gardner has added new, up-to-date material to an already impressive account of hundreds of systematized vagaries. Here you will find discussions of hollow-earth fanatics like Symmes; Velikovsky and wandering planets; Hörbiger, Bellamy, and the theory of multiple moons; Charles Fort and the Fortean Society; dowsing and the other strange methods for finding water, ores, and oil. Also covered are such topics as naturopathy, iridiagnosis, zone therapy, food fads; Wilhelm Reich and orgone sex energy; L. Ron Hubbard and Dianetics; A. Korzybski and General Semantics. A new examination of Bridey Murphy is included in this edition, along with a new section on bibliographic reference material.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/39/42/9780486203942.jpg', 'title_long': 'Fads and Fallacies in the Name of Science (Popular Science)', 'edition': '2nd Revised ed.', 'dimensions': 'Height: 8 Inches, Length: 5.5 Inches, Weight: 0.8487787 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.8487787}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 384, 'date_published': '1957-06-01', 'subjects': ['Science & Math', 'History & Philosophy'], 'authors': ['Martin Gardner'], 'title': 'Fads and Fallacies in the Name of Science (Popular Science)', 'isbn13': '9780486203942', 'msrp': 16.95, 'binding': 'Paperback', 'related': {'eBook': '0486131629', 'ePub': '0486131629'}, 'isbn': '0486203948', 'isbn10': '0486203948', 'other_isbns': [{'isbn': '9780486131627', 'binding': 'print'}]}}