{'book': {'publisher': 'Dover Publications', 'synopsis': "From one of the 20th century's preeminent novelists and poets comes this passionate tale of romance amid the chaos of modern life. D. H. Lawrence's compelling account of two couples' search for romantic fulfillment is steeped in an edgy eroticism bordering on violence. The literary world reacted with shock upon its 1921 publication: nearly a century later, the novel's psychological penetration continues to captivate readers.<br/>Women in Love reintroduces two sisters, Ursula and Gudrun Brangwen, who initially appeared in Lawrence's previous novel, The Rainbow (1915). Ursula's relationship with Rupert Birkin, an introspective and misanthropic school inspector, is contrasted with that of Gudrun and Gerald Crich, an overbearing industrialist. Set in a coal-mining town in the English Midlands, their stories explore the disastrous effects of industrialization on the psyche and suggest that rebirth can be achieved only through emotional intensity.<br/>Composed at the height of the author's powers, Women in Love is the novel that Lawrence considered his masterpiece (the characters of Rupert and Ursula are widely regarded as Lawrence's depiction of himself and his wife, Frieda). Rich in symbolism and lyric prose, it offers a complex meditation on the meaning of love in a changing world.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/45/83/9780486424583.jpg', 'title_long': 'Women in Love (Dover Thrift Editions: Classic Novels)', 'dimensions': 'Height: 8.25 Inches, Length: 5 Inches, Weight: 0.70106999316 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.70106999316}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 416, 'date_published': '2003-01-15', 'subjects': ['Literature & Fiction', 'Classics', 'Genre Fiction', 'Psychological', 'Romance'], 'authors': ['D. H. Lawrence'], 'title': 'Women in Love (Dover Thrift Editions: Classic Novels)', 'isbn13': '9780486424583', 'msrp': 9, 'binding': 'Paperback', 'related': {'ePub': '0486115348'}, 'isbn': '0486424588', 'isbn10': '0486424588', 'other_isbns': [{'isbn': '9780486115344', 'binding': 'print'}]}}