{'book': {'publisher': 'Dover Publications', 'synopsis': "Artists, illustrators, collectors, and historians of industry, art, and invention will all welcome this superb republication of copperplates engraved to illustrate Diderot's great eighteenth-century Encyclopédie. The first work of its kind, the Encyclopédie was the crowning venture of the Enlightenment. In this two-volume set, available for the first time in a paperbound edition, Dover has painstakingly reprinted 485 of the finest plates — considered among the greatest achievements of eighteenth-century graphic art — most in full size.<br/>Diderot committed his encyclopedia to publicizing trade secrets in the hope it would lead to more rational industrial processes. The plates offer, therefore, a unique and invaluable record of manufacturing and the trades just prior to the Industrial Revolution. Each of the major trades is illustrated in sequences detailing machinery and processes from raw material to finished product. In fact, most plates are so clear and accurate that an engineer could almost use them to construct machines ready to go into eighteenth-century production. Moreover, the variety of arts, crafts, tools, and trades illustrated here is staggering: 56 plates on agriculture and the rural arts; 40 plates dealing with the iron foundry; 44 plates on metalworking; 67 plates on glassmaking; 28 plates showing masonry and carpentry; 55 plates dealing with textiles; and scores of others amount to a total of more than 2,000 illustrations.<br/>This inexpensive edition will serve libraries, students, and teachers as a primary reference on Europe before the Industrial Revolution. In addition, commercial artists, designers, and crafters will find here a wealth of unusual, royalty-free illustrations for a host of art and craft uses.<br/>Extensive, detailed notes, prepared by historian Charles Coulston Gillispie, clearly identify and explain objects, procedures, and techniques of each industry. Mr. Gillispie's Introduction is an extensive essay on the place of the encyclopedia in the eighteenth-century Enlightenment.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/42/87/9780486274287.jpg', 'title_long': 'A Diderot Pictorial Encyclopedia of Trades and Industry, Vol. 1 (Dover Pictorial Archive Series)', 'dimensions': 'Height: 12.25 Inches, Length: 9.25 Inches, Weight: 2.87041865124 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 9.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 2.87041865124}, 'height': {'unit': 'inches', 'value': 12.25}}, 'pages': 239, 'date_published': '1993-01-18', 'subjects': ['Arts & Photography', 'Graphic Design', 'Clip Art', 'Business & Money', 'Economics', 'Reference', 'Encyclopedias & Subject Guides', 'Antiques & Collectibles', 'History', 'Science & Math', 'Technology', 'History of Technology'], 'authors': ['Denis Diderot'], 'title': 'A Diderot Pictorial Encyclopedia of Trades and Industry, Vol. 1 (Dover Pictorial Archive Series)', 'isbn13': '9780486274287', 'msrp': 29.95, 'binding': 'Paperback', 'isbn': '0486274284', 'isbn10': '0486274284'}}