{'book': {'publisher': 'Dover Publications', 'synopsis': '"The Origin is one of the most important books ever published, and a knowledge of it should be a part of the intellectual equipment of every educated person. . . . The book will endure in future ages so long as a knowledge of science persists among mankind." — Nature<br/>It took Charles Darwin more than twenty years to publish this book, in part because he realized that it would ignite a firestorm of controversy. On the Origin of Species first appeared in 1859, and it remains a continuing source of conflict to this day. Even among those who reject its ideas, however, the work\'s impact is undeniable. In science, philosophy, and theology, this is a book that changed the world.<br/>In addition to its status as the focus of a dramatic turning point in scientific thought, On the Origin of Species stands as a remarkably readable study. Carefully reasoned and well-documented in its arguments, the work offers coherent views of natural selection, adaptation, the struggle for existence, survival of the fittest, and other concepts that form the foundation of modern evolutionary theory. This volume is a reprint of the critically acclaimed first edition.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/00/63/9780486450063.jpg', 'title_long': 'On the Origin of Species: By Means of Natural Selection (Dover Thrift Editions: Science)', 'edition': 'Dover Giant Thrift E', 'dimensions': 'Height: 8.3 Inches, Length: 5.22 Inches, Weight: 0.54895103238 Pounds, Width: 0.85 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.22}, 'width': {'unit': 'inches', 'value': 0.85}, 'weight': {'unit': 'pounds', 'value': 0.54895103238}, 'height': {'unit': 'inches', 'value': 8.3}}, 'pages': 336, 'date_published': '2006-06-23', 'subjects': ['History', 'World', 'Science & Math', 'Biological Sciences', 'Animals', 'Biology', 'Ecology', 'Evolution', 'Nature & Ecology', 'Animal Rights', 'Natural History', 'Nature Writing & Essays'], 'authors': ['Charles Darwin'], 'title': 'On the Origin of Species: By Means of Natural Selection (Dover Thrift Editions: Science)', 'isbn13': '9780486450063', 'msrp': '0.00', 'binding': 'Paperback', 'related': {'eBook': '0486114821', 'ePub': '0486114821'}, 'isbn': '0486450066', 'isbn10': '0486450066', 'other_isbns': [{'isbn': '9780486114828', 'binding': 'fpid13alias'}]}}