{'book': {'publisher': 'Dover Publications', 'synopsis': 'Starved and mistreated, empty bowl in hand, the young hero musters the courage to approach his master, saying, "Please, sir, I want some more." Oliver Twist\'s famous cry of the heart has resounded with readers since the novel\'s initial appearance in 1837, and the book remains a popular favorite with fans of all ages.<br/>Dickens was no stranger to the pain of hunger and the degradation of poverty. He poured his own youthful experience of Victorian London\'s unspeakable squalor into this realistic depiction of the link between destitution and crime. Oliver escapes his miserable servitude by running away to London, where he unwillingly but inevitably joins a scabrous gang of thieves. Masterminded by the loathsome Fagin, the underworld crew features some of Dickens\' most memorable characters, including the juvenile pickpocket known as the Artful Dodger, the vicious Bill Sikes, and gentle Nancy, an angel of self-sacrifice.<br/>A profound social critic, Dickens introduced genteel readers to the problems of the poor in a way that had rarely been attempted before. This tale of the struggle between hope and cruelty continues to speak to modern audiences.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/45/38/9780486424538.jpg', 'title_long': 'Oliver Twist (Dover Thrift Editions)', 'edition': '1', 'dimensions': 'Height: 8.2 Inches, Length: 5.2 Inches, Weight: 0.59965735264 Pounds, Width: 0.9 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.2}, 'width': {'unit': 'inches', 'value': 0.9}, 'weight': {'unit': 'pounds', 'value': 0.59965735264}, 'height': {'unit': 'inches', 'value': 8.2}}, 'pages': 368, 'date_published': '2002-12-30', 'subjects': ['Literature & Fiction', 'Classics', 'Genre Fiction', 'Coming of Age', 'Contemporary', 'Literary'], 'authors': ['Charles Dickens'], 'title': 'Oliver Twist (Dover Thrift Editions)', 'isbn13': '9780486424538', 'msrp': 6, 'binding': 'Paperback', 'related': {'eBook': '0486114961', 'ePub': '0486114961'}, 'isbn': '0486424537', 'isbn10': '0486424537', 'other_isbns': [{'isbn': '9780486114965', 'binding': 'fpid13alias'}]}}