{'book': {'publisher': 'Dover Publications', 'synopsis': '"Galápagos is a glorious book. It is high romance, exact science, fascinating history, wild adventure."—Nation<br/>The Galápagos Islands are famed for their remarkable wildlife, including land and marine iguanas, land tortoises, four-eyed fish, and flightless cormorants and albatross. In 1835, Charles Darwin observed variations among the islands\' species that inspired him to formulate the theory of natural selection. Eighty-eight years later, in 1923, a scientific expedition sponsored by the New York Zoological Society followed in Darwin\'s wake. Led by renowned biologist and explorer William Beebe, the scientists visited the the islands to study and obtain specimens of indigenous plants and animals. This is Beebe\'s personal account of that fascinating expedition.<br/>Combining rare literary skill with careful research, Beebe produced an exceptionally readable volume, replete with youthful enthusiasm, a romantic\'s awe before the mysteries of nature, and a scientist\'s passion for accurate description. He recounts the expedition\'s enormously productive results, including specimens of 60 species previously unknown to science, and an unparalleled accumulation of data that stimulated many scientific papers and new avenues of naturalistic inquiry. Beebe\'s account is enhanced with more than 100 splendid illustrations, selected from hundreds of paintings, drawings, and photographs by expedition members. A classic of popular science, it is scientifically rigorous as well as exciting and accessible.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/64/29/9780486256429.jpg', 'title_long': "Galapagos: World's End", 'edition': 'First Thus', 'dimensions': 'Height: 8.4 Inches, Length: 5.5 Inches, Weight: 1.35 Pounds, Width: 1.3 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.3}, 'weight': {'unit': 'pounds', 'value': 1.35}, 'height': {'unit': 'inches', 'value': 8.4}}, 'pages': 442, 'date_published': '1988-05-01', 'subjects': ['History', 'World', 'Expeditions & Discoveries', 'Reference', 'Writing, Research & Publishing Guides', 'Writing', 'Science & Math', 'History & Philosophy', 'Nature & Ecology', 'Travel', 'South America', 'Ecuador & Galapagos Islands'], 'authors': ['William Beebe'], 'title': "Galapagos: World's End", 'isbn13': '9780486256429', 'msrp': 19.95, 'binding': 'Paperback', 'related': {'eBook': '0486140083', 'ePub': '0486140083'}, 'isbn': '0486256421', 'isbn10': '0486256421', 'other_isbns': [{'isbn': '9780486140087', 'binding': 'print'}]}}