{'book': {'publisher': 'Dover Publications', 'synopsis': "Arthur Schopenhauer's Die Welt als Wille und Vorstellung is one of the most important philosophical works of the nineteenth century, the basic statement of one important stream of post-Kantian thought. It is without question Schopenhauer's greatest work. Conceived and published before the philosopher was 30 and expanded 25 years later, it is the summation of a lifetime of thought.<br/>For 70 years, the only unabridged English translation of this work was the Haldane-Kemp collaboration. In 1958, a new translation by E. F. J. Payne appeared that decisively supplanted the older one. Payne's translation is superior because it corrects nearly 1,000 errors and omissions in the Haldane-Kemp translation, and it is based on the definitive 1937 German edition of Schopenhauer's work prepared by Dr. Arthur Hübscher. Payne's edition is the first to translate into English the text's many quotations in half a dozen languages. It is thus the most useful edition for the student or teacher.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/76/11/9780486217611.jpg', 'title_long': 'The World as Will and Representation, Vol. 1', 'edition': '58441st', 'dimensions': 'Height: 8.75 Inches, Length: 5.25 Inches, Weight: 1.7 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.7}, 'height': {'unit': 'inches', 'value': 8.75}}, 'pages': 694, 'date_published': '1966-06-01', 'subjects': ['Politics & Social Sciences', 'Philosophy', 'Free Will & Determinism', 'Metaphysics', 'Modern'], 'authors': ['Arthur Schopenhauer'], 'title': 'The World as Will and Representation, Vol. 1', 'isbn13': '9780486217611', 'msrp': 19.95, 'binding': 'Paperback', 'related': {'Kindle Edition': '0486132781', 'eBook': '0486132781', 'ePub': '0486132781'}, 'isbn': '0486217612', 'isbn10': '0486217612', 'other_isbns': [{'isbn': '9780486132785', 'binding': 'print'}]}}