{'book': {'publisher': 'Dover Publications', 'synopsis': 'The definitive guide to classical ballet - Experience the beauty and grace of ballet with this comprehensive guide. Fully describes and defines over 1,100 ballet steps, movements, poses and concepts.<br/><br/>"Miss Grant has made more information available in one book than we have ever had before. Teacher\'s organizations would do well to consider the use of Miss Grant\'s Technical Manual as an official textbook." — Dance Magazine<br/><br/>Teacher recommended, Gail Grant\'s Technical Manual has long been one of the most popular and effective ballet reference guides. Completely revised and updated, this third edition is virtually a new work and should be owned by every student, dance teacher, choreographer, and ballet enthusiast — even those who purchased the second edition. Extensive revision, expansion, and the inclusion of more than 300 new terms have added immeasurably to the value of this concise, definitive manual.<br/><br/>Moving from "abstract ballet" and "adage, adagio" to "working leg" and "wrapped position," the book fully describes and defines over 1,100 ballet steps (saul de chat, jeté enveloppé, failli, entrechat six, etc.), movements and poses (arabesque, épaulement, attitude, en arrière, retiré, à terre, dégagé, etc.), and other expressions and concepts. For each, first a phonetic transcription is provided, then a literal translation, and finally an explanation of how the step is performed, the pose captured, or the movement executed, of how the concept fits in with actual ballet dancing, or of the purpose or function of the idea. A pronunciation guide, cross-references to alternate names for similar steps and positions that vary from the Russian to the French or Italian schools, and a bibliography are all invaluable aids.<br/><br/>But the most important supplement is the15-page pictorial section, drawn by the author, who is both a successful ballet teacher and dancer. Keyed to the dictionary (and vice-versa), these diagrams show clearly the exact foot, leg, arm, and body positions for the proper execution of many of the more common ballet steps and movements. This essential and easy reference is a must for every teacher, aspiring dancer, and ballet class.<br/>With over 1,100 ballet steps, movements and poses described and defined, this manual is a must-have for any aspiring dancer. Learn about the proper execution of many popular ballet steps and movements with the keyed diagrams and comprehensive guide. Expanded content - Benefit from a pronunciation guide, alternate names for similar steps in different schools of ballet, and a bibliography with useful resources. Get that knowledge pathway started by understanding the basics of classical ballet like never before! Comprehensive Guide and Pictorial Section - Dive deep into 15 pages of pictorials that show the exact foot, leg, arm, and body positions for proper execution of all major ballet steps and movements. Enjoy cross-references to different names in the Russian, French, and Italian schools. Explore alternate uses for popular concepts that help fit them in with actual ballet dancing. Understand what purpose or function an idea serves and improve your performance quality like never before! This manual is the perfect introduction into discovering the world of classical ballet! It\'s the ideal assistance for every teacher, aspiring dancer, and ballet class.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/84/34/9780486218434.jpg', 'title_long': 'Technical Manual and Dictionary of Classical Ballet (Dover Books on Dance)', 'edition': 'Subsequent', 'dimensions': 'Height: 7.99211 Inches, Length: 4.96062 Inches, Weight: 0.41226442994 Pounds, Width: 0.3937 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.96062}, 'width': {'unit': 'inches', 'value': 0.3937}, 'weight': {'unit': 'pounds', 'value': 0.41226442994}, 'height': {'unit': 'inches', 'value': 7.99211}}, 'pages': 176, 'date_published': '1982-01-01', 'subjects': ['Arts & Photography', 'Performing Arts', 'Dance', 'Music', 'Reference', 'Dictionaries & Thesauruses', 'Dictionaries'], 'authors': ['Gail Grant'], 'title': 'Technical Manual and Dictionary of Classical Ballet (Dover Books on Dance)', 'isbn13': '9780486218434', 'msrp': 7.95, 'binding': 'Paperback', 'related': {'Kindle Edition': '0486132862', 'eBook': '0486132862', 'ePub': '0486132862'}, 'isbn': '0486218430', 'isbn10': '0486218430', 'other_isbns': [{'isbn': '9780486132860', 'binding': 'print'}]}}