{'book': {'publisher': 'Thames & Hudson', 'synopsis': "Whether as performers or as spectators, more people enjoy dance today than ever before. Its extraordinary range extends from classical ballet and baroque court spectacles to avant-garde modern dance, tap, and ethnic dancing. Anyone with an interest in dance has felt the need for a guide to the art's rich history and complex present state. Susan Au's lucid text covers the entire spectrum of dance, vividly describing the great performers and performances of the past as well as exploring in detail the dance world of today. A generous selection of illustrations completes the picture, taking the reader from the palaces of the Medici to the lofts of Manhattan, from the dancing of Louis XIV to the experimental choreography of Twyla Tharp and Pina Bausch. A completely new final chapter documents the work of the chief dancers and choreographers from the 1980s to the present, covering offshoots of modern dance such as Tanztheater and Butoh, and recent developments such as performance art and site-specific choreography. The author discusses the upsurge in the popularity of dances of the past, among them ballroom dancing and the Argentine tango, and notes the revival of tap dancing as well as the successful adaptation of Irish stepdancing to the theater. In addition, she records the uses dance and dancers have made of recent technological advances, including cinedance and videodance, CD-ROMs, and the Internet. 145 illustrations and photographs (25 in color)", 'language': 'en', 'image': 'https://images.isbndb.com/covers/35/21/9780500203521.jpg', 'title_long': 'Ballet and Modern Dance (World of Art)', 'edition': 'Second Edition, Revised', 'dimensions': 'Height: 8.3 Inches, Length: 6 Inches, Weight: 1.0361726314 Pounds, Width: 0.7 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.7}, 'weight': {'unit': 'pounds', 'value': 1.0361726314}, 'height': {'unit': 'inches', 'value': 8.3}}, 'pages': 224, 'date_published': '2002-06-17', 'subjects': ['Arts & Photography', 'Performing Arts', 'Dance', 'Theater'], 'authors': ['Susan Au'], 'title': 'Ballet and Modern Dance (World of Art)', 'isbn13': '9780500203521', 'msrp': 19.95, 'binding': 'Paperback', 'isbn': '0500203520', 'isbn10': '0500203520'}}