{'book': {'publisher': 'Gramercy Books', 'synopsis': 'Before you see the movie, read the original novel!<br/><br/>First published more than thirty-five years ago, Pierre Boulle’s chilling novel launched one of the greatest science fiction sagas in motion picture history, from the classic 1968 movie starring Charlton Heston and Roddy McDowell, through four sequels and two television series . . . and now the newest film adaptation directed by Tim Burton.<br/><br/>In the not-too-distant future, three astronauts land on what appears to be a planet just like Earth, with lush forests, a temperate climate, and breathable air. But while it appears to be a paradise, nothing is what it seems.<br/><br/>They soon discover the terrifying truth: On this world humans are savage beasts, and apes rule as their civilized masters. In an ironic novel of nonstop action and breathless intrigue, one man struggles to unlock the secret of a terrifying civilization, all the while wondering: Will he become the savior of the human race, or the final witness to its damnation? In a shocking climax that rivals that of the original movie, Boulle delivers the answer in a masterpiece of adventure, satire, and suspense.<br/><br/>From the Paperback edition.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/94/86/9780517209486.jpg', 'title_long': 'Planet of the Apes (Cinema Classics (Gramercy Books (Firm)).)', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 0.89948602896 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.89948602896}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 191, 'date_published': '2000-06-06', 'subjects': ['Literature & Fiction', 'Classics', 'Genre Fiction', 'TV, Movie, Video Game Adaptations'], 'authors': ['Pierre Boulle'], 'title': 'Planet of the Apes (Cinema Classics (Gramercy Books (Firm)).)', 'isbn13': '9780517209486', 'msrp': 7.99, 'binding': 'Hardcover', 'isbn': '0517209489', 'isbn10': '0517209489'}}