{'book': {'publisher': 'University of California Press', 'synopsis': 'o Includes the authoritative texts for eleven pieces written between 1868 and 1902<br/><br/>o Publishes, for the first time, the complete text of "Villagers of 1840-3," Mark Twain\'s astounding feat of memory<br/><br/>o Features a biographical directory and notes that reflect extensive new research on Mark Twain\'s early life in Missouri<br/><br/>Throughout his career, Mark Twain frequently turned for inspiration to memories of his youth in the Mississippi River town of Hannibal, Missouri. What has come to be known as the Matter of Hannibal inspired two of his most famous books, Tom Sawyer and Huckleberry Finn, and provided the basis for the eleven pieces reprinted here. Most of these selections (eight of them fiction and three of them autobiographical) were never completed, and all were left unpublished. Written between 1868 and 1902, they include a diverse assortment of adventures, satires, and reminiscences in which the characters of his own childhood and of his best-loved fiction, particularly Huck Finn and Tom Sawyer, come alive again. The autobiographical recollections culminate in an astounding feat of memory titled "Villagers of 1840-3" in which the author, writing for himself alone at the age of sixty-one, recalls with humor and pathos the characters of some one hundred and fifty people from his childhood. Accompanied by notes that reflect extensive new research on Mark Twain\'s early life in Missouri, the selections in this volume offer a revealing view of Mark Twain\'s varied and repeated attempts to give literary expression to the Matter of Hannibal.<br/><br/>Texts established by Dahlia Armon, Paul Baender, Walter Blair, William M. Gibson, and Franklin R. Rogers', 'language': 'en', 'image': 'https://images.isbndb.com/covers/89/54/9780520238954.jpg', 'title_long': 'Huck Finn and Tom Sawyer among the Indians: And Other Unfinished Stories (Mark Twain Library)', 'dimensions': 'Height: 8.5 Inches, Length: 5.5 Inches, Weight: 1.00089866948 Pounds, Width: 0.89 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.89}, 'weight': {'unit': 'pounds', 'value': 1.00089866948}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 392, 'date_published': '2002-12-02', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Regional & Cultural', 'United States', 'Literary'], 'authors': ['Mark Twain'], 'title': 'Huck Finn and Tom Sawyer among the Indians: And Other Unfinished Stories (Mark Twain Library)', 'isbn13': '9780520238954', 'msrp': 19.95, 'binding': 'Paperback', 'isbn': '0520238958', 'isbn10': '0520238958'}}