{'book': {'publisher': 'University of California Press', 'synopsis': 'Pathologies of Power uses harrowing stories of illness, of life—and death—in extreme situations to interrogate our understanding of human rights. Paul Farmer, a physician and anthropologist with twenty years of experience studying diseases in Haiti, Peru, and Russia, argues that promoting the social and economic rights of the world’s poor is the most important human rights struggle of our times. A thoughtful memoir with passionate eyewitness accounts from the prisons of Russia and the beleaguered villages of Haiti and Chiapas, this book links the lived experiences of individual victims to a broader analysis of structural violence. Farmer challenges conventional thinking within human rights circles and exposes the relationships between political and economic injustice, on one hand, and the suffering and illness of the powerless, on the other.<br/><br/>Farmer shows that the same social forces that give rise to epidemic diseases such as HIV and tuberculosis also sculpt risk for human rights violations. He illustrates the ways that racism and gender inequality in the United States are mirrored in pathology, plague, disease and death. Yet this doctor’s autobiography is far from a hopeless inventory of human suffering. Farmer’s disturbing examples are linked to a guarded optimism that new medical and social technologies will develop in tandem with a more informed sense of social justice. Otherwise, he concludes, we will be guilty of managing social inequality rather than addressing structural violence. Farmer’s urgent plea to think about human rights in the context of global public health and to consider critical issues of quality and access for the world’s poor should be of fundamental concern to pathologists, medical students, and humanitarians in a world characterized by the bizarre proximity of surfeit and suffering.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/32/62/9780520243262.jpg', 'title_long': 'Pathologies of Power: Health, Human Rights, and the New War on the Poor (Volume 4) (California Series in Public Anthropology)', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.3007273458 Pounds, Width: 1.1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.1}, 'weight': {'unit': 'pounds', 'value': 1.3007273458}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 438, 'date_published': '2004-11-22', 'subjects': ['Business & Money', 'Economics', 'Economic Conditions', 'History', 'Africa', 'Americas', 'South America', 'Reference', 'Medical Books', 'Administration & Medicine Economics', 'Health Care Delivery', 'Politics & Social Sciences', 'Social Sciences', 'Poverty', 'Anthropology', 'General', 'Sociology', 'Class'], 'authors': ['Paul Farmer'], 'title': 'Pathologies of Power: Health, Human Rights, and the New War on the Poor (Volume 4) (California Series in Public Anthropology)', 'isbn13': '9780520243262', 'msrp': 29.95, 'binding': 'Paperback', 'related': {'Page Fidelity': '0520931475', 'eBook': '0520931475'}, 'isbn': '0520243269', 'isbn10': '0520243269', 'other_isbns': [{'isbn': '9780520931473', 'binding': 'ebook'}]}}