{'book': {'publisher': 'Transworld Publishers', 'synopsis': "'The Sparrow is one of my favourite science fiction novels and it destroyed me in the best way when I read it. It is so beautifully written and the construction of the narrative is masterful'<br/>Emma Newman, author of Planetfall<br/>THE ACCLAIMED GENRE-DEFINING WINNER OF THE 1998 ARTHUR C. CLARKE AWARD<br/>Set in the 21st century - a number of decades from now - The Sparrow is the story of a charismatic Jesuit priest and talented linguist, Emilio Sandoz, who - in response to a remarkable radio signal from the depths of space - leads a scientific mission to make first contact with an extra-terrestrial culture.<br/>In the true tradition of Jesuit adventurers before him, Sandoz and his companions are prepared to endure isolation, suffering - even death - but nothing can prepare them for the civilisation they encounter. Or for the tragic misunderstanding that brings the mission to a devastating end. Once considered a living saint, Sandoz returns alone to Earth horrifically maimed, both physically and spiritually, the mission's sole survivor - only to be blamed for the mission's failure and accused of heinous crimes.<br/>Written in clean, effortless prose and peopled with memorable characters who never lose their humanity or humour, The Sparrow is a powerful, haunting fiction - a tragic but ultimately triumphant novel about the nature of faith, of love and what it means to be 'human' and widely considered to be a classic of the genre.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/77/75/9780552997775.jpg', 'title_long': 'Sparrow', 'edition': 'First Edition', 'dimensions': 'Height: 7.79526 Inches, Length: 4.99999 Inches, Weight: 0.76279942652 Pounds, Width: 1.25984 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.99999}, 'width': {'unit': 'inches', 'value': 1.25984}, 'weight': {'unit': 'pounds', 'value': 0.76279942652}, 'height': {'unit': 'inches', 'value': 7.79526}}, 'pages': 512, 'date_published': '2006-09-01', 'subjects': ['Christian Books & Bibles', 'Literature & Fiction', 'Science Fiction', 'Genre Fiction', 'Family Saga', 'Historical', 'TV, Movie, Video Game Adaptations', 'Literary', 'Religion & Spirituality', 'Science Fiction & Fantasy', 'Adventure'], 'authors': ['Mary Doria Russell'], 'title': 'Sparrow', 'isbn13': '9780552997775', 'msrp': 16.5, 'binding': 'Paperback', 'isbn': '0552997773', 'isbn10': '0552997773'}}