{'book': {'publisher': 'Spectra', 'synopsis': 'Ever since his stunning novel The Wasp Factory set readers on fire, Iain M. Banks has been defying category and convention with his thrilling speculative fiction. Now he goes a step beyond his previous imaginative journeys to create his most exciting and provocative science fiction novel yet.<br/><br/>Count Alandre Sessine VII has already died seven times. He has only one life left - one last chance to catch his killer. His only clues point to a conspiracy beyond his own murder. For a catastrophe is fast approaching the earth from which there is no escape - until a loophole through apocalypse is discovered. And a chosen few will do anything to keep it a secret.<br/><br/>Someone has betrayed Sessine, killed him before he could uncover the truth. Now he has three days before his funeral to live the way men used to live: restricted to one life where one mistake could be his last.<br/><br/>Suddenly he finds himself an outlaw, a fugitive, a desperado.<br/><br/>And his only hope of survival is finding others like himself.<br/><br/>Others who hold a piece of the puzzle to an enigmatic weapon of salvation and chaos...', 'language': 'en', 'image': 'https://images.isbndb.com/covers/45/99/9780553374599.jpg', 'title_long': 'Feersum Endjinn: A Novel', 'edition': 'No Edition Stated', 'dimensions': 'Height: 9.05 Inches, Length: 6 Inches, Weight: 1.08 Pounds, Width: 0.66 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.66}, 'weight': {'unit': 'pounds', 'value': 1.08}, 'height': {'unit': 'inches', 'value': 9.05}}, 'pages': 324, 'date_published': '1995-06-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Action & Adventure', 'Fantasy', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense', 'Science Fiction & Fantasy', 'Science Fiction', 'Adventure'], 'authors': ['Iain M Banks'], 'title': 'Feersum Endjinn: A Novel', 'isbn13': '9780553374599', 'msrp': 16, 'binding': 'Paperback', 'isbn': '0553374591', 'isbn10': '0553374591'}}