{'book': {'publisher': 'Bantam', 'synopsis': '“A stunner, exquisitely plotted and characterized, with Todd’s trademark meticulous backdrop of World War I-era England.”—Strand Magazine<br/><br/>The Great War is still raging when Francesca Hatton’s adored grandfather dies on the family estate in England’s isolated Exe Valley. Among his effects, Francesca is stunned to find an unsigned letter cursing the Hattons and their descendants. Then a stranger appears, accusing her grandfather of murder. Was the loving protector Francesca remembers really a vindictive man who cultivated dangerous enemies? At the center of the intrigue is an unusual white stone hidden in a garden where Francesca once played with her five male cousins—all dead now on France’s battlefields. According to Hatton’s will, the Murder Stone must be dug up, transported to Scotland, and buried forever. But before Francesca can begin the journey, a series of ominous “accidents” occur. As Francesca sets out to pursue the truth, she also sets herself in the sights of someone determined to exact a revenge too long overdue.<br/><br/>Praise for The Murder Stone<br/><br/>“Todd’s mysteries are among the most intelligent and affecting being written these days.”—Washington Post Book World<br/><br/>“Seamless . . . a compelling insight into the home front during 1916.”—Chicago Tribune<br/><br/>“A gripping novel of family secrets set against the tragedy of World War I.”—Mystery Lovers Bookshop News<br/><br/>“Many twists and turns, angst-ridden characters, and an evocative historical setting. A gripping read.”—Library Journal', 'language': 'en', 'image': 'https://images.isbndb.com/covers/66/02/9780553586602.jpg', 'title_long': 'The Murder Stone: A Novel of Suspense', 'edition': 'Reprint', 'dimensions': 'Height: 6.78 Inches, Length: 4.19 Inches, Weight: 0.52 Pounds, Width: 0.89 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 0.89}, 'weight': {'unit': 'pounds', 'value': 0.52}, 'height': {'unit': 'inches', 'value': 6.78}}, 'pages': 416, 'date_published': '2004-08-31', 'subjects': ['Literature & Fiction', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Traditional Detectives', 'Historical', 'Thrillers & Suspense', 'Suspense', 'Crime', 'Self Service', 'Custom Stores'], 'authors': ['Charles Todd'], 'title': 'The Murder Stone: A Novel of Suspense', 'isbn13': '9780553586602', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'isbn': '0553586602', 'isbn10': '0553586602'}}