{'book': {'publisher': 'Bantam', 'synopsis': 'Meet the smart, sexy — supernatural — women of the otherworld. This is not your mother’s coven...<br/><br/>Kelley Armstrong returns with the eagerly awaited follow-up to Dime Store Magic. Paige Winterbourne, a headstrong young woman haunted by a dark legacy, is now put to the ultimate test as she fights to save innocents from the most insidious evil of all.. . .<br/><br/>In the aftermath of her mother’s murder, Paige broke with the elite, ultraconservative American Coven of Witches. Now her goal is to start a new Coven for a new generation. But while Paige pitches her vision to uptight thirty-something witches in business suits, a more urgent matter commands her attention.<br/><br/>Someone is murdering the teenage offspring of the underworld’s most influential Cabals — a circle of families that makes the mob look like amateurs. And none is more powerful than the Cortez Cabal, a faction Paige is intimately acquainted with. Lucas Cortez, the rebel son and unwilling heir, is none other than her boyfriend. But love isn’t blind, and Paige has her eyes wide open as she is drawn into a hunt for an unnatural-born killer. Pitted against shamans, demons, and goons, it’s a battle chilling enough to make a wild young woman grow up in a hurry. If she gets the chance.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/70/74/9780553587074.jpg', 'title_long': 'Industrial Magic', 'dimensions': 'Height: 6.8 Inches, Length: 4.15 Inches, Weight: 0.64 Pounds, Width: 1.15 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.15}, 'width': {'unit': 'inches', 'value': 1.15}, 'weight': {'unit': 'pounds', 'value': 0.64}, 'height': {'unit': 'inches', 'value': 6.8}}, 'pages': 528, 'date_published': '2004-10-26', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'United States', 'Romance', 'Science Fiction & Fantasy', 'Fantasy', 'Paranormal & Urban', 'Romantic'], 'authors': ['Kelley Armstrong'], 'title': 'Industrial Magic', 'isbn13': '9780553587074', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'related': {'ePub': '0553901001'}, 'isbn': '0553587072', 'isbn10': '0553587072', 'other_isbns': [{'isbn': '9780553901009', 'binding': 'printisbn'}]}}