{'book': {'publisher': 'Bantam', 'synopsis': "The curse will last one hundred full years....<br/><br/>A notoriously fierce soldier, Marcus Kincardine wears his clan's tartan as a symbol of his heritage--and a reminder of the curse that haunts his kin. To rid them of this evil, the legend says, Marcus must wed a fabled warrior maiden with hair like an angel's halo, eyes the color of the rarest heather, and an extraordinary gift that makes her more formidable than any army. But first he must win the most desperate battle of his life...the one for her mind, her body, and her heart.<br/><br/>Lady Avalon d'Farouche can't deny she bears the telltale marks of the Kincardine legend, nor can she disown the strange, mystical intuition that allows her to see things others cannot. Yet Avalon believes she alone holds the key to her destiny--a future in which no man will own her. So when Marcus Kincardine seizes her for his own purposes, she never expects him to ignite a fiery passion within her. Still, she refuses to sacrifice her soul and fulfill the legend by surrendering to desire. But how long can she deny him...and how long will he let her?", 'language': 'en', 'image': 'https://images.isbndb.com/covers/05/49/9780553580549.jpg', 'title_long': 'The Truelove Bride: A Novel', 'dimensions': 'Height: 6.9 Inches, Length: 4.15 Inches, Weight: 0.39903669422 Pounds, Width: 0.95 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.15}, 'width': {'unit': 'inches', 'value': 0.95}, 'weight': {'unit': 'pounds', 'value': 0.39903669422}, 'height': {'unit': 'inches', 'value': 6.9}}, 'pages': 368, 'date_published': '1999-06-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'United States', 'Romance', 'Historical', 'Medieval', 'Scottish', 'Action & Adventure'], 'authors': ['Shana Abé'], 'title': 'The Truelove Bride: A Novel', 'isbn13': '9780553580549', 'msrp': 6.37, 'binding': 'Mass Market Paperback', 'related': {'Kindle Edition': '0307833925', 'ePub': '0307833925'}, 'isbn': '055358054X', 'isbn10': '055358054X', 'other_isbns': [{'isbn': '9780307833921', 'binding': 'printisbn'}]}}