{'book': {'publisher': 'Random House Publishing Group', 'synopsis': 'NEW YORK TIMES BESTSELLER • When a pair of lowlife thieves cross the border into Tijuana, three tenacious cops cross the line.<br/><br/>Fin Finnegan is a San Diego police detective and wannabe actor who’s passing midlife crisis and heading straight for midlife meltdown. The last thing he wants when he’s gearing up for a TV audition is a routine truck theft case. The last thing he needs after three messy divorces is a sexy female investigator assigned to the case. Fin’s abysmal luck is holding out—he’s got not only the theft investigation but an uneasy alliance with two strong-willed women, each working a separate angle of his once-simple case.<br/><br/>Tough, sexy environmental cop Nell Salter is looking into a chemical spill that has set off a chain reaction of death in the barrios of Tijuana and across the border. She’s also looking for a relationship that doesn’t turn toxic. Young, fresh-faced navy detective Bobbie Ann Doggett is investigating the theft of two thousand pairs of navy flight-deck shoes—and swooning over the Olivier of the San Diego PD. Mix in a unpredictable speed-freak trucker and his sociopath boss, and the result is a toxic cocktail of drugs, corruption, sex, and murder.<br/><br/>Praise for Finnegan’s Week<br/><br/>“A frolic, a joy, a hoot, a riot of a book.”—The New York Times Book Review<br/><br/>“Raunchy and often hilarious . . . [Joseph] Wambaugh is at the top of his form here.”—Publishers Weekly', 'language': 'en', 'image': 'https://images.isbndb.com/covers/32/49/9780553763249.jpg', 'title_long': "Finnegan's Week", 'edition': 'Bantam', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.94 Pounds, Width: 0.88 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.88}, 'weight': {'unit': 'pounds', 'value': 0.94}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 352, 'date_published': '1995-08-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Contemporary', 'Literary', 'Mystery, Thriller & Suspense', 'Mystery', 'Police Procedurals', 'Thrillers & Suspense', 'Crime', 'Romance', 'Romantic Suspense', 'Self Service', 'Custom Stores'], 'authors': ['Joseph Wambaugh'], 'title': "Finnegan's Week", 'isbn13': '9780553763249', 'msrp': 19, 'binding': 'Paperback', 'isbn': '0553763245', 'isbn10': '0553763245'}}