{'book': {'publisher': 'Bantam', 'synopsis': 'Every so often a character so captures the hearts and imaginations of readers that he seems to take on a life of his own long after the final page is turned. For such a character, one book is not enough—readers must know what happens next. Now Dean Koontz returns with the novel his fans have been demanding. With the emotional power and sheer storytelling artistry that are his trademarks, Koontz takes up once more the story of a unique young hero and an eccentric little town in a tale that is equal parts suspense and terror, adventure and mystery—and altogether irresistibly odd.<br/><br/>We’re all a little odd beneath the surface. He’s the most unlikely hero you’ll ever meet—an ordinary guy with a modest job you might never look at twice. But there’s so much more to any of us than meets the eye—and that goes triple for Odd Thomas. For Odd lives always between two worlds in the small desert town of Pico Mundo, where the heroic and the harrowing are everyday events. Odd never asked to communicate with the dead—it’s something that just happened. But as the unofficial goodwill ambassador between our world and theirs, he’s got a duty to do the right thing. That’s the way Odd sees it and that’s why he’s won hearts on both sides of the divide between life and death.<br/><br/>A childhood friend of Odd’s has disappeared. The worst is feared. But as Odd applies his unique talents to the task of finding the missing person, he discovers something worse than a dead body, encounters an enemy of exceptional cunning, and spirals into a vortex of terror. Once again Odd will stand against our worst fears. Around him will gather new allies and old, some living and some not. For in the battle to come, there can be no innocent bystanders, and every sacrifice can tip the balance between despair and hope. Whether you’re meeting Odd Thomas for the first time or he’s already an old friend, you’ll be led on an unforgettable journey through a world of terror, wonder and delight—to a revelation that can change your life. And you can have no better guide than Odd Thomas.<br/><br/>From the Hardcover edition.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/82/62/9780553588262.jpg', 'title_long': 'Forever Odd (Odd Thomas, No 2)', 'edition': 'Reprinted Edition', 'dimensions': 'Height: 6.95 Inches, Length: 4.2 Inches, Weight: 0.45 Pounds, Width: 1.02 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.2}, 'width': {'unit': 'inches', 'value': 1.02}, 'weight': {'unit': 'pounds', 'value': 0.45}, 'height': {'unit': 'inches', 'value': 6.95}}, 'pages': 400, 'date_published': '2006-10-31', 'subjects': ['Humor & Entertainment', 'Humor', 'Self-Help & Psychology', 'Literature & Fiction', 'Genre Fiction', 'Psychological', 'Action & Adventure', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Psychological Thrillers', 'Suspense'], 'authors': ['Dean Koontz'], 'title': 'Forever Odd (Odd Thomas, No 2)', 'isbn13': '9780553588262', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'isbn': '0553588265', 'isbn10': '0553588265'}}