{'book': {'publisher': 'Spectra / Bantam Books [1992]', 'synopsis': "Author of The Chronicles Of Thomas Covenant, one of the most acclaimed fantasy series of all time, master storyteller Stephen R. Donaldson retums with the second book in his long-awaited new science fiction series--a story about dark passions, perilous alliances, and dubious heroism set in a stunningly imagined future.<br/><br/>Beautiful, brilliant, and dangerous, Morn Hyland is an ex-police officer for the United Mining Companies--and the target of two ruthless, powerful men. One is the charismatic ore-pirate Nick Succorso, who sees Morn as booty wrested from his vicious rival, Angus Thermopyle. thermopyle once made the mistake of underestimating Morn and now he's about to pay the ultimate price. Both men think they can possess her, but Morn is no one's trophy--and no one's pawn.<br/><br/>Meanwhile, withing the borders of Forbidden Space, wait the Amnioin, an alien race capable of horrific atrocities. The Amnion want something unspeakable from humanity--and they will go to unthinkable lengths to get it.<br/><br/>In Forbidden Knowledge, Stephen R. Donaldson spins a galaxy-wide web of intrigue, deception, and betrayal that tightens with inexorable strength around characters and readers alike.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/76/07/9780553297607.jpg', 'title_long': 'The Gap into Vision: Forbidden Knowledge', 'edition': 'First Edition', 'dimensions': 'Weight: 0.000625 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 0.000625}}, 'pages': 480, 'date_published': '1992', 'subjects': ['Science Fiction & Fantasy', 'Science Fiction'], 'authors': ['Stephen R. [cover art by Stephen Youll] Donaldson'], 'title': 'The Gap into Vision: Forbidden Knowledge', 'isbn13': '9780553297607', 'msrp': 7.99, 'binding': 'Paperback', 'related': {'Kindle Edition': '0307755657', 'ePub': '0307755657'}, 'isbn': '0553297600', 'isbn10': '0553297600', 'other_isbns': [{'isbn': '9780307755650', 'binding': 'printisbn'}]}}