{'book': {'publisher': 'Spectra', 'synopsis': "The multiple-award-winning science fiction master returns to the universe that is his greatest triumph--the world of Hyperion and The Fall of<br/>Hyperion --with a novel even more magnificent than its predecessors.<br/><br/>Dan Simmons's Hyperion was an immediate sensation on its first publication in 1989. This staggering multifaceted tale of the far future heralded the conquest of the science fiction field by a man who had already won the World Fantasy Award for his first novel (Song of Kali) and had also published one of the most well-received horror novels in the field, Carrion Comfort. Hyperion went on to win the Hugo Award as Best Novel, and it and its companion volume, The Fall of Hyperion, took their rightful places in the science fiction pantheon of new classics.<br/><br/>Now, six years later, Simmons returns to this richly imagined world of technological achievement, excitement, wonder and fear. Endymion is a story about love and memory, triumph and terror--an instant candidate for the field's highest honors.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/29/40/9780553572940.jpg', 'title_long': 'Endymion (Hyperion)', 'edition': 'Reprint', 'dimensions': 'Height: 6.85 Inches, Length: 4.17 Inches, Weight: 0.63 Pounds, Width: 1.2 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.17}, 'width': {'unit': 'inches', 'value': 1.2}, 'weight': {'unit': 'pounds', 'value': 0.63}, 'height': {'unit': 'inches', 'value': 6.85}}, 'pages': 576, 'date_published': '1996-11-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'United States', 'Science Fiction & Fantasy', 'Science Fiction', 'Adventure', 'Space Opera'], 'authors': ['Dan Simmons'], 'title': 'Endymion (Hyperion)', 'isbn13': '9780553572940', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'related': {'ePub': '0307781917'}, 'isbn': '0553572946', 'isbn10': '0553572946', 'other_isbns': [{'isbn': '9780307781918', 'binding': 'printisbn'}]}}