{'book': {'publisher': 'Bantam', 'synopsis': 'You have good reason to be afraid. . . .<br/><br/>It was a case that haunts Bobby Dodge to this day—the case that nearly killed him and changed his life forever. Now, in an underground chamber on the grounds of an abandoned Massachusetts mental hospital, the gruesome discovery of six mummified corpses resurrects his worst nightmare: the return of a killer he thought dead and buried. There’s no place to run. . . . Bobby’s only lead is wrapped around a dead woman’s neck. Annabelle Granger has been in hiding for as long as she can remember. Her childhood was a blur of new cities and assumed identities. But what—or who—her family was running from, she never knew. Now a body is unearthed from a grave, wearing a necklace bearing Annabelle’s name, and the danger is too close to escape. This time, she’s not going to run. You know he will find you. . . .<br/><br/>The new threat could be the dead psychopath’s copycat, his protégé—or something far more terrifying. Dodge knows the only way to find him is to solve the mystery of Annabelle Granger, and to do that he must team up with his former lover, partner, and friend D. D. Warren from the Boston P.D. But the trail leads back to a woman from Bobby’s past who may be every bit as dangerous as the new killer—a beautiful survivor-turned-avenger with an eerie link to Annabelle. From its tense opening pages to its shocking climax, Hide is a thriller that delves into our deepest, darkest fears. Where there is no one to trust. Where there is no place left to hide.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/43/24/9780553804324.jpg', 'title_long': 'Hide', 'dimensions': 'Height: 9.5 Inches, Length: 6.31 Inches, Weight: 1.95 Pounds, Width: 1.49 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.31}, 'width': {'unit': 'inches', 'value': 1.49}, 'weight': {'unit': 'pounds', 'value': 1.95}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 384, 'date_published': '2007-01-30', 'subjects': ['Literature & Fiction', 'United States', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense', 'Teen & Young Adult'], 'authors': ['Lisa Gardner'], 'title': 'Hide', 'isbn13': '9780553804324', 'msrp': 25, 'binding': 'Hardcover', 'related': {'Kindle Edition': '0553903403', 'ePub': '0553903403'}, 'isbn': '0553804324', 'isbn10': '0553804324', 'other_isbns': [{'isbn': '9780553903409', 'binding': 'printisbn'}]}}