{'book': {'publisher': 'Bantam', 'synopsis': "For six months in 1942, Stalingrad is the center of a titanic struggle between the Russian and German armies—the bloodiest campaign in mankind's long history of warfare. The outcome is pivotal. If Hitler's forces are not stopped, Russia will fall. And with it, the world....<br/><br/>German soldiers call the battle Rattenkrieg, War of the Rats. The combat is horrific, as soldiers die in the smoking cellars and trenches of a ruined city. Through this twisted carnage stalk two men—one Russian, one German—each the top sniper in his respective army. These two marksmen are equally matched in both skill and tenacity. Each man has his own mission: to find his counterpart—and kill him.<br/><br/>But an American woman trapped in Russia complicates this extraordinary duel. Joining the Russian sniper's cadre, she soon becomes one of his most talented assassins—and perhaps his greatest weakness. Based on a true story, this is the harrowing tale of two adversaries enmeshed in their own private war—and whose fortunes will help decide the fate of the world.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/13/55/9780553581355.jpg', 'title_long': 'War of the Rats: A Novel', 'edition': 'Reissue', 'dimensions': 'Height: 6.82 inches, Length: 4.1 Inches, Weight: 0.55 Pounds, Width: 1.08 inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.1}, 'width': {'unit': 'inches', 'value': 1.08}, 'weight': {'unit': 'pounds', 'value': 0.55}, 'height': {'unit': 'inches', 'value': 6.82}}, 'pages': 512, 'date_published': '2000-06-06', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'War', 'Action & Adventure', 'Mystery, Thriller & Suspense', 'United States', 'Contemporary', 'Thrillers & Suspense', 'Suspense', 'Military'], 'authors': ['David L. Robbins'], 'title': 'War of the Rats: A Novel', 'isbn13': '9780553581355', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'related': {'ePub': '0307575373'}, 'isbn': '055358135X', 'isbn10': '055358135X', 'other_isbns': [{'isbn': '9780307575371', 'binding': 'printisbn'}]}}