{'book': {'publisher': 'Bantam', 'synopsis': 'In this wickedly funny novel, Robert Ludlum combines the explosive pacing of The Bourne Identity and The Bourne Supremacy with a bitingly witty send-up of everything from government bureaucrats and pandering military men to the mob, the law, and organized religion.<br/><br/>War hero and infamous ladies’ man, General MacKenzie Hawkins is a living legend. His life story had even been sold to Hollywood. But now he stands accused of defacing a historic monument in China’s Forbidden City. Under house arrest in Peking, with a case against him pending in Washington, it looks like the end of Mac’s illustrious career.<br/><br/>But he has a plan of his own—and it includes kidnapping the Pope. What’s the ransom? Just one American dollar—for every Catholic in the world. Add to the mix a slew of shady “investors,” Hawkins’s four persuasive, well-endowed ex-wives, and a young lawyer and fellow soldier who wants nothing more than to return to private life—and you’ve got one relentlessly irreverent page-turner.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/10/96/9780553271096.jpg', 'title_long': 'The Road to Gandolfo', 'edition': 'Reissue', 'dimensions': 'Height: 6.9 Inches, Length: 4.15 Inches, Weight: 0.35 Pounds, Width: 0.85 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.15}, 'width': {'unit': 'inches', 'value': 0.85}, 'weight': {'unit': 'pounds', 'value': 0.35}, 'height': {'unit': 'inches', 'value': 6.9}}, 'pages': 320, 'date_published': '1992', 'subjects': ['Literature & Fiction', 'Action & Adventure', 'Contemporary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Spies & Politics', 'Crime'], 'authors': ['Robert Ludlum'], 'title': 'The Road to Gandolfo', 'isbn13': '9780553271096', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'related': {'Kindle Edition': '0307813924', 'ePub': '0307813924'}, 'isbn': '0553271091', 'isbn10': '0553271091', 'other_isbns': [{'isbn': '9780307813923', 'binding': 'printisbn'}]}}