{'book': {'publisher': 'Bantam', 'synopsis': '"Tom Robbins has a grasp on things that dazzles the brain and he\'s also a world-class storyteller."<br/>--Thomas Pynchon<br/><br/>In Fierce Invalids Home From Hot Climates, his seventh and biggest novel, the wise, witty, always gutsy Tom Robbins brings onstage the most complex and compelling character he has ever created.<br/><br/>Switters is a contradiction for all seasons: an anarchist who works for the government, a pacifist who carries a gun, a vegetarian who sops up ham gravy, a cyberwhiz who hates computers, a robust bon vivant who can be as squeamish as any fop, a man who, though obsessed with the preservation of innocence, is aching to deflower his high-school-age stepsister (only to become equally enamored of a nun ten years his senior).<br/><br/>Yet there is nothing remotely wishy-washy about Switters. He doesn\'t merely pack a pistol. He is a pistol.<br/><br/>And as we dog Switters\'s strangely elevated heels across four continents, in and out of love and danger, Robbins explores, challenges, mocks, and celebrates virtually every major aspect of our mercurial era.<br/><br/>As many readers well know, to describe a Tom Robbins plot does not begin to describe a Tom Robbins novel. Moreover, the internationally acclaimed, best-selling author, with his love of language, nuance, and surprise, is as opposed to story summations as J.D. Salinger. It is revealing, however, to learn what things Robbins lists as having influenced the writing of Fierce Invalids:<br/><br/>"This book was inspired by an entry from Bruce Chatwin\'s journal, by a CIA agent I met in Southeast Asia, by the mystery surrounding the lost prophecy of the Virgin of Fatima, by the increasing evidence that the interplay of opposites is the engine that runs the universe, and by embroidered memories of old Terry and the Pirates comic books."<br/><br/>Robbins also has said that throughout the writing of Fierce Invalids Home From Hot Climates he was guided by the advice of Julia Child: "Learn to handle hot things. Keep your knives sharp. Above all, have a good time."<br/><br/>Perhaps that is why he has managed to write a provocative, rascally novel that takes no prisoners--and yet is upbeat, romantic, meaningful, adventurous, edifying, and fun.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/77/53/9780553107753.jpg', 'title_long': 'Fierce Invalids Home from Hot Climates', 'edition': 'First Edition', 'dimensions': 'Height: 9.49 Inches, Length: 6.29 Inches, Weight: 1 Pounds, Width: 1.29 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.29}, 'width': {'unit': 'inches', 'value': 1.29}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 9.49}}, 'pages': 432, 'date_published': '2000-05', 'subjects': ['Literature & Fiction', 'Humor & Satire', 'Satire', 'Literary'], 'authors': ['Tom Robbins'], 'title': 'Fierce Invalids Home from Hot Climates', 'isbn13': '9780553107753', 'msrp': 27.5, 'binding': 'Hardcover', 'isbn': '0553107755', 'isbn10': '0553107755'}}