{'book': {'publisher': 'Random House Audio', 'synopsis': 'The night belongs to the shooter who can see through it<br/><br/>Bob Lee Swagger has seen -- and delivered -- dozens of deaths.As a United States Marine sniper in Vietnam, his astonishing accuracy with a rifle earned him the nickname "Bob the Nailer;" twenty years later he was forced to kill again to unravel a brutal conspiracy. Now happily secluded with his wife and young daughter in the Arizona desert, Bob believes all the killing is behind him. Until a young writer, Russ Pewtie, arrives at his door with troubling questions about the past.<br/><br/>Forty years earlier, Swagger\'s father, a dedicated state trooper, was gunned down by two robbers in a sensational shoot-out just outside of Blue Eye, Arkansas. Faced with Russ\' persistence and a desire to make peace with a father he never really knew, Swagger decides to discover what really happened that night long ago in Arkansas. But it soon becomes clear that powerful people don\'t want the truth uncovered -- and Swagger must use all his combat skills and ruthless cunning just to survive.<br/><br/>Like the infrared "black light" that exposes a sniper\'s target in the dead of night, Swagger homes in on the shadowy figures desperate to keep the secret of his father\'s murder buried. And with the relentless pace that is Stephen Hunter\'s trademark, Black Light accelerates to its exhilarating climax -- an explosion of gunfire that blasts open the secrets of two generations.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/74/81/9780553477481.jpg', 'title_long': 'Black Light', 'dimensions': 'Height: 7.25 Inches, Length: 4.5 Inches, Weight: 0 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.5}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 0}, 'height': {'unit': 'inches', 'value': 7.25}}, 'pages': 4, 'date_published': '1996-05-01', 'subjects': ['Literature & Fiction', 'Action & Adventure', 'Mystery, Thriller & Suspense', 'Contemporary', 'Thrillers & Suspense', 'Spies & Politics'], 'authors': ['Stephen Hunter'], 'title': 'Black Light', 'isbn13': '9780553477481', 'msrp': '0.00', 'binding': 'Audio Cassette', 'isbn': '055347748X', 'isbn10': '055347748X'}}