{'book': {'publisher': 'Spectra', 'synopsis': 'Kim Stanley Robinson’s Mars trilogy is one of science fiction’s most honored stories, with Red Mars winning the distinguished Nebula Award, and both Green Mars and Blue Mars honored with the Hugo. Now Robinson returns to the realm he has made his own—the planet Mars—in a brilliantly imagined drama with a searing poetic vision.<br/><br/>From a training mission in Antarctica to blistering sandstorms sweeping through labyrinths of barren canyons, the interwoven stories of The Martians set in motion a sprawling cast of characters upon the surface of Mars. As the planet is transformed from an unexplored and forbidding terrain to a troubled image of a re-created Earth, we meet the First Hundred explorers—men and women who are bound together by Earth’s tenuous toehold on Mars. Presenting unforgettable stories of hope and disappointment, of fierce physical and psychological struggles, The Martians is an epic chronicle of a planet that represents one of humanity’s most glorious possibilities.<br/><br/>Praise for The Martians<br/><br/>“A uniquely rewarding experience of state-of-the-art science fiction.”—The New York Times Book Review<br/><br/>“No one familiar with Robinson’s trilogy can read through these final, valedictory stories without feeling moved.”—The Washington Post<br/><br/>“The stories are beautifully written, the characters are well developed and the author’s passion for ecology manifests itself on every page.”—Publishers Weekly (starred review)', 'language': 'en', 'image': 'https://images.isbndb.com/covers/40/12/9780553574012.jpg', 'title_long': 'The Martians (Mars Trilogy)', 'edition': 'First Edition', 'dimensions': 'Height: 6.81 Inches, Length: 4.19 Inches, Weight: 0.5621787681 Pounds, Width: 1.18 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 1.18}, 'weight': {'unit': 'pounds', 'value': 0.5621787681}, 'height': {'unit': 'inches', 'value': 6.81}}, 'pages': 434, 'date_published': '2000-10-03', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'United States', 'Science Fiction & Fantasy', 'Science Fiction', 'Adventure', 'Anthologies', 'Hard Science Fiction', 'Exploration'], 'authors': ['Kim Stanley Robinson'], 'title': 'The Martians (Mars Trilogy)', 'isbn13': '9780553574012', 'msrp': 8.99, 'binding': 'Paperback', 'related': {'ePub': '0553898302'}, 'isbn': '0553574019', 'isbn10': '0553574019', 'other_isbns': [{'isbn': '9780553898309', 'binding': 'printisbn'}]}}