{'book': {'publisher': 'Spectra', 'synopsis': 'By the time Phil Chase is elected president, the world’s climate is far on its way to irreversible change. Food scarcity, housing shortages, diminishing medical care, and vanishing species are just some of the consequences. The erratic winter the Washington, D.C., area is experiencing is another grim reminder of a global weather pattern gone haywire: bone-chilling cold one day, balmy weather the next.<br/><br/>But the president-elect remains optimistic and doesn’t intend to give up without a fight. A maverick in every sense of the word, Chase starts organizing the most ambitious plan to save the world from disaster since FDR–and assembling a team of top scientists and advisers to implement it.<br/><br/>For Charlie Quibler, this means reentering the political fray full-time and giving up full-time care of his young son, Joe. For Frank Vanderwal, hampered by a brain injury, it means trying to protect the woman he loves from a vengeful ex and a rogue “black ops” agency not even the president can control–a task for which neither Frank’s work at the National Science Foundation nor his study of Tibetan Buddhism can prepare him.<br/><br/>In a world where time is running out as quickly as its natural resources, where surveillance is almost total and freedom nearly nonexistent, the forecast for the Chase administration looks darker each passing day. For as the last–and most terrible–of natural disasters looms on the horizon, it will take a miracle to stop the clock . . . the kind of miracle that only dedicated men and women can bring about.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/31/36/9780553803136.jpg', 'title_long': 'Sixty Days and Counting', 'edition': 'First Edition', 'dimensions': 'Height: 9.67 Inches, Length: 6.42 Inches, Weight: 1.65 Pounds, Width: 1.21 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.42}, 'width': {'unit': 'inches', 'value': 1.21}, 'weight': {'unit': 'pounds', 'value': 1.65}, 'height': {'unit': 'inches', 'value': 9.67}}, 'pages': 400, 'date_published': '2007-02-27', 'subjects': ['Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Technothrillers', 'Science Fiction & Fantasy', 'Science Fiction'], 'authors': ['Kim Stanley Robinson'], 'title': 'Sixty Days and Counting', 'isbn13': '9780553803136', 'msrp': '0.00', 'binding': 'Hardcover', 'related': {'ePub': '0553903500'}, 'isbn': '0553803131', 'isbn10': '0553803131', 'other_isbns': [{'isbn': '9780553903508', 'binding': 'printisbn'}]}}