{'book': {'publisher': 'Bantam', 'synopsis': 'Past midnight, Chyna Shepard, twenty-six, gazes out a moonlit window, unable to sleep on her first night in the Napa Valley home of her best friend’s family. Instinct proves reliable. A murderous sociopath, Edgler Foreman Vess, has entered the house, intent on killing everyone inside. A self-proclaimed “homicidal adventurer,” Vess lives only to satisfy all appetites as they arise, to immerse himself in sensation, to live without fear, remorse or limits, to live with intensity. Chyna is trapped in his deadly orbit.<br/><br/>Chyna is a survivor, toughened by a lifelong struggle for safety and self-respect. Now she will be tested as never before. At first her sole aim is to get out alive—until, by chance, she learns the identity of Vess’s next intended victim, a faraway innocent only she can save. Driven by a newly discovered thirst for meaning beyond mere self-preservation, Chyna musters every inner resource she has to save an endangered girl…as moment by moment, the terrifying threat of Edgler Foreman Vess intensifies.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/29/18/9780553582918.jpg', 'title_long': 'Intensity', 'edition': 'Reissue', 'dimensions': 'Height: 6.87 Inches, Length: 4.19 Inches, Weight: 0.5 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.19}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 0.5}, 'height': {'unit': 'inches', 'value': 6.87}}, 'pages': 464, 'date_published': '2000', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Horror', 'Psychological', 'Contemporary', 'Mystery, Thriller & Suspense', 'Mystery', 'Thrillers & Suspense', 'Psychological Thrillers', 'Suspense'], 'authors': ['Dean Koontz'], 'title': 'Intensity', 'isbn13': '9780553582918', 'msrp': '0.00', 'binding': 'Mass Market Paperback', 'related': {'Kindle Edition': '0307414167', 'ePub': '0307414167'}, 'isbn': '0553582917', 'isbn10': '0553582917', 'other_isbns': [{'isbn': '9780307414168', 'binding': 'printisbn'}]}}