{'book': {'publisher': 'Bantam Books', 'synopsis': 'Dean Koontz’s unique talent for writing terrifying thrillers with a heart and soul is nowhere more evident than in this latest suspense masterpiece that pits one man against the ultimate deadline. If there were speed limits for the sheer pulse-racing excitement allowed in one novel, Velocity would break them all. Get ready for the ride of your life.<br/><br/>Velocity<br/><br/>Bill Wile is an easygoing, hardworking guy who leads a quiet, ordinary life. But that is about to change. One evening, after his usual eight-hour bartending shift, he finds a typewritten note under the windshield wiper of his car. If you don’t take this note to the police and get them involved, I will kill a lovely blond schoolteacher. If you do take this note to the police, I will instead kill an elderly woman active in charity work. You have four hours to decide. The choice is yours.<br/><br/>It seems like a sick joke, and Bill’s friend on the police force, Lanny Olson, thinks so too. His advice to Bill is to go home and forget about it. Besides, what could they do even if they took the note seriously? No crime has actually been committed. But less than twenty-four hours later, a young blond schoolteacher is found murdered, and it’s Bill’s fault: he didn’t convince the police to get involved. Now he’s got another note, another deadline, another ultimatum…and two new lives hanging in the balance.<br/><br/>Suddenly Bill’s average, seemingly innocuous life takes on the dimensions and speed of an accelerating nightmare. Because the notes are coming faster, the deadlines growing tighter, and the killer becoming bolder and crueler with every communication—until Bill is isolated with the terrifying knowledge that he alone has the power of life and death over a psychopath’s innocent victims. Until the struggle between good and evil is intensely personal. Until the most chilling words of all are: The choice is yours.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/82/55/9780553588255.jpg', 'title_long': 'VELOCITY', 'edition': 'Reprint', 'dimensions': 'Height: 6.9 Inches, Length: 4.18 Inches, Weight: 0.53 Pounds, Width: 1.07 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.18}, 'width': {'unit': 'inches', 'value': 1.07}, 'weight': {'unit': 'pounds', 'value': 0.53}, 'height': {'unit': 'inches', 'value': 6.9}}, 'pages': 460, 'date_published': '2006-04-25', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Horror', 'Psychological', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Psychological Thrillers', 'Suspense', 'Self Service', 'Custom Stores'], 'authors': ['Dean Koontz'], 'title': 'VELOCITY', 'isbn13': '9780553588255', 'msrp': '0.00', 'binding': 'Mass Market Paperback', 'related': {'ePub': '0307414302'}, 'isbn': '0553588257', 'isbn10': '0553588257', 'other_isbns': [{'isbn': '9780307414304', 'binding': 'printisbn'}]}}