{'book': {'publisher': 'Bantam', 'synopsis': "Luanne Rice is a rarity among novelists today; she's a true storyteller. Her unique ability to weave together the bonds of love and family with the challenges and rewards of everyday life has garnered her eight consecutive top-ten New York Times bestselling paperbacks. With Beach Girls, Luanne Rice returns to the place that she was born to write about—the Connecticut shore—to tell a story about a family of women whose lives encompass three generations, their histories intertwined with that of the mystic coastal town that has forever bound them to one another.<br/><br/>Beach Girls explores the complex and contradictory territories of love, family and friendship. Luanne Rice's sensuous prose and unforgettably rich and textured characters guide us toward a truth that lies within and sometimes beyond our dreams—an enduring strength that we all must embrace to find our way home and into the hearts of those we cherish most. Beach Girls is an enthralling novel of haunting beauty that will resonate long after the final page is turned.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/72/41/9780553587241.jpg', 'title_long': "Beach Girls (Hubbard's Point)", 'edition': 'First Thus', 'dimensions': 'Height: 6.84 Inches, Length: 4.23 Inches, Weight: 0.49 Pounds, Width: 0.94 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.23}, 'width': {'unit': 'inches', 'value': 0.94}, 'weight': {'unit': 'pounds', 'value': 0.49}, 'height': {'unit': 'inches', 'value': 6.84}}, 'pages': 448, 'date_published': '2004-08-03', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Family Saga', 'Family Life', "Women's Fiction", 'Domestic Life', 'Friendship', 'Mothers & Children', 'Contemporary', 'Self Service', 'Custom Stores'], 'authors': ['Luanne Rice'], 'title': "Beach Girls (Hubbard's Point)", 'isbn13': '9780553587241', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'related': {'ePub': '055390051X'}, 'isbn': '0553587242', 'isbn10': '0553587242', 'other_isbns': [{'isbn': '9780553900514', 'binding': 'printisbn'}]}}