{'book': {'publisher': 'Bantam', 'synopsis': 'The true story only Joseph Wambaugh could tell. A band of California cops set loose in no-man’s-land to come home heroes. Or come home dead.<br/><br/>Not since Joseph Wambaugh’s bestselling The Onion Field has there been a true police story as fascinating, as totally gripping as Lines and Shadows. The media hailed them as heroes. Others denounced them as lawless renegades. A squad of tough cops called the Border Crime Task Force. A commando team sent to patrol the snake-infested no-man’s-land south of San Diego. Not to apprehend the thousands of illegal aliens slipping into the U.S., but to stop the ruthless bandits who preyed on them nightly—relentlessly robbing, raping, and murdering defenseless men, women, and children.<br/><br/>The task force plan was simple. They would disguise themselves as illegal aliens. They would confront the murderous shadows of the night. Yet each time they walked into the violent blackness along the border, they came closer to another boundary line—a fragile line within each man. And crossing it meant destroying their sanity and their lives.<br/><br/>Praise for Lines and Shadows<br/><br/>“With each book, it seems, Mr. Wambaugh’s skill as a writer increases. . . . In Lines and Shadows he gives an off-trail, action-packed true account of police work and the intimate lives of policemen that, for my money, is his best book yet.”—The New York Times Book Review<br/><br/>“A saga of courage, craziness, brutality and humor. . . . One of his best books, comparable to The Onion Field for storytelling and revelatory power.”—Chicago Sun-Times', 'language': 'en', 'image': 'https://images.isbndb.com/covers/32/56/9780553763256.jpg', 'title_long': 'Lines and Shadows', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.36025215654 Pounds, Width: 0.9 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.9}, 'weight': {'unit': 'pounds', 'value': 1.36025215654}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 416, 'date_published': '1995-11-01', 'subjects': ['Biographies & Memoirs', 'Professionals & Academics', 'Law Enforcement', 'True Crime', 'Crime & Criminal Biographies', 'Espionage', 'Organized Crime', 'Politics & Social Sciences', 'Social Sciences', 'Criminology'], 'authors': ['Joseph Wambaugh'], 'title': 'Lines and Shadows', 'isbn13': '9780553763256', 'msrp': 18.64, 'binding': 'Paperback', 'related': {'ePub': '0804150699'}, 'isbn': '0553763253', 'isbn10': '0553763253', 'other_isbns': [{'isbn': '9780804150699', 'binding': 'printisbn'}]}}