{'book': {'publisher': 'Bantam', 'synopsis': 'She has been called "the Julia Child of mystery writers." Now, Diane Mott Davidson, who masterfully served up The Last Suppers, Killer Pancake, and Dying for Chocolate, returns with an irresistible five-star helping of suspense. When caterer Goldy Schulz takes a job with a multimillion-dollar financial firm, she finds herself in a high-stakes world where someone is out to make a killing....<br/><br/>Goldy, owner of Goldilocks\' Catering, barely weathered a disastrous spring in which relentless rains and driving snow put a real damper on her business. But now, thanks to her best friend, Marla, the Colorado caterer is suddenly cooking up a storm...lovingly preparing Crab Quesadillas, Tomato-Brie Pie, and Gold Foil-Wrapped Fudge Bars for her wealthy new client, Prospect Financial Partners.<br/><br/>The Prospect Partners\' financial whiz, Tony Royce, with whom Marla is having a tempestuous affair, and Albert Lipscomb, who is personally managing Marla\'s money, have hired Goldy to prepare a sumptuous party to kick off their latest venture: the reopening of the Eurydice Gold Mine. Anxious to take advantage of a golden opportunity, Goldy arrives at the mine site early, loaded down with goodies. Yet just when she thinks she can relax, all hell breaks loose--and the main culprit is Marla.<br/><br/>Her best friend is sure the mine venture is a scam. And when, several days later, Albert ends up missing, it looks as if Marla was right. Why, then, is the police captain treating Goldy\'s best friend as if she had committed a crime? And how can Goldy keep her fourteen-year-old son Arch and his unreliable bloodhound from making matters worse?<br/><br/>As Goldy works furiously to restore her business by whipping up hot, fragrant Sour Cream Cherry Coffeecake and featherlight Cinnamon Scones, she finds<br/>herself drawn into a most unusual situation of missing partners, stolen millions, and multiple homicides. And only when Goldy can discover which of the victims is the main corpse will she be able to unravel the mystery that threatens to cancel out her friend\'s dearest asset--her life.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/46/30/9780553574630.jpg', 'title_long': 'The Main Corpse', 'edition': 'Reprint', 'dimensions': 'Weight: 0.39903669422 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 0.39903669422}}, 'pages': 384, 'date_published': '1997', 'subjects': ['Mystery, Thriller & Suspense', 'Mystery', 'Women Sleuths', 'Cozy', 'Thrillers & Suspense', 'Suspense'], 'authors': ['Diane Mott Davidson'], 'title': 'The Main Corpse', 'isbn13': '9780553574630', 'msrp': '0.00', 'binding': 'Paperback', 'related': {'Kindle Edition': '0307428559', 'ePub': '0307428559'}, 'isbn': '0553574639', 'isbn10': '0553574639', 'other_isbns': [{'isbn': '9780307428554', 'binding': 'printisbn'}]}}