{'book': {'publisher': 'Bantam', 'synopsis': 'Christopher Snow is the best-known resident of 12,000-strong Moonlight Bay, California. This is because 28-year-old Chris has xeroderma pigmentosum (XP)—a light-sensitivity so severe that he cannot leave his house in daylight, cannot enter a normally-lit room, cannot sit at a computer. Chris\'s natural element is the night, and his parents, both academics, chose to live in Moonlight Bay because in a small town Chris can make the nightscape his own—roaming freely through the town on his bike, surfing in the moonlight, exploring while most people sleep.<br/><br/>But Chris\'s brilliant mother, a scientist, was killed in a car accident 2 years ago, and as the book opens his father, Steven Snow, is dying of cancer; Chris\'s protected life is about to change forever. We meet Chris as he is carefully preparing himself to go out in the late-afternoon sun to visit the hospital. In his last moments of life his father tells Chris he is "sorry" and that Chris should "fear nothing"—cryptic words that Chris cannot really relate to.<br/><br/>Steven Snow\'s body is removed to the hospital basement for transport to the funeral home/crematorium, and when Chris goes downstairs for a final moment of farewell, he witnesses a frightening and clandestine encounter: the funeral director and another man Chris doesn\'t recognize are substituting the body of a hitchhiker for Steven Snow\'s body–which is being taken not to the crematorium but to some secret destination.<br/><br/>For Chris, this scene is the first intimation of a conspiracy that he will come to realize envelopes many of his townspeople. His parents knew of it and wanted to protect Chris from it. His best friend has had hints of something wrong because of the frightening nocturnal visitors that have come to his beachhouse. And the first person to try to explain to Chris what\'s going on—and warn him about the special danger he himself is in—will be hideously murdered.<br/><br/>In the 24 hours this book encompasses, Christopher Snow will find out that, sheltered though he\'s been, he has the soul of a fighter and an adventurer. By the end of the book he will have killed a man, will have discovered the role his own mother played in the birth of the conspiracy, will have come to recognize the extraordinary guardians that, unknown to him, have watched over him for years. He will realize that some people hate him, others revere him, and neither his own life nor those of anyone he knows will ever be the same.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/97/58/9780553579758.jpg', 'title_long': 'Fear Nothing', 'edition': 'Reissue', 'dimensions': 'Height: 6.9 Inches, Length: 4.1 Inches, Weight: 1 Pounds, Width: 0.95 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.1}, 'width': {'unit': 'inches', 'value': 0.95}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 6.9}}, 'pages': 448, 'date_published': '1998', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Horror', 'Contemporary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense'], 'authors': ['Dean Koontz'], 'title': 'Fear Nothing', 'isbn13': '9780553579758', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'related': {'Kindle Edition': '0307414108', 'ePub': '0307414108'}, 'isbn': '0553579754', 'isbn10': '0553579754', 'other_isbns': [{'isbn': '9780307414106', 'binding': 'printisbn'}]}}