{'book': {'publisher': 'Samuel French Ltd', 'synopsis': '5 male, 2 female, plus children\'s chorus<br/>Scenery: Various sets<br/>Now a major motion picture! Wes Anderson, in his first animated film, adapted this classic story to the big screen. It delighted audiences, dazzled critics and built upon the foundation of an already fantastic tale.<br/>"This is precisely the movie that a child smitten with Roald Dahl\'s fiction and fascinated by the enigmas of the adult world would dream of making: something to amaze and terrify the grown-ups and win the envy and adulation of his peers."- The New York Times<br/>This charming play will have delighted audiences gripping their seats! When Mr Fox steals one chicken too many Three Farmers, just about the meanest men you will ever encounter, decide the only cure is to rid themselves of Mr Fox by any means possible. They are ready to shoot him, starve him or dig him out, but clever Mr. Fox has other plans.<br/>Outwitted at every turn, the farmers\' ploys backfire, and all the animals celebrate a feast at their expense. This hilarious tale of ingenuity and trickery by Roald Dahl, adapted for the stage by David Wood, can be performed by a small company of experienced actors supported by a large number of community and child actors.<br/>"Another excellent adaptation of Roald Dahl\'s children\'s classic by David Wood . . designed to capture fertile imaginations with its appealing storyline and simple language, no wonder it is a hit."- The Stage<br/>"This is a fantastic show to be enjoyed by kids of all ages."- The CoventryTelegraph', 'language': 'en', 'image': 'https://images.isbndb.com/covers/13/33/9780573051333.jpg', 'title_long': "Fantastic Mr. Fox (French's Acting Edition S)", 'dimensions': 'Height: 8 Inches, Length: 5 Inches, Weight: 0.17 Pounds, Width: 0.15 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5}, 'width': {'unit': 'inches', 'value': 0.15}, 'weight': {'unit': 'pounds', 'value': 0.17}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 70, 'date_published': '2011-01-05', 'subjects': ['Literature & Fiction', 'Dramas & Plays', 'British & Irish'], 'authors': ['David Wood'], 'title': "Fantastic Mr. Fox (French's Acting Edition S)", 'isbn13': '9780573051333', 'msrp': '0.00', 'binding': 'Paperback', 'isbn': '057305133X', 'isbn10': '057305133X'}}