{'book': {'publisher': 'Voyager', 'synopsis': 'The stunning first volume in Janny Wurts’s epic tale of two half-brothers cursed to life-long enmity, now re-released with a striking new cover.<br/>Let each who reads determine the good and the evil for himself<br/>Athera is besieged by the Mistwraith, which blights the land and dims the mysteries guarded by the last fugitives of the old bloodlines.<br/>But from a prophecy springs hope: the gifts of two brothers – one dark, one fair, raised on opposite sides of a relentless war – when paired may challenge the Mistwraith’s invasion, though at brutal cost…<br/>Arithon, Master of Shadow, musician and mage, commands the power of illusion and darkness. Taken prisoner in battle, his fate falls to his half-brother, Prince Lysaer – a man endowed with the gift of light through the mother they share. Lysaer is the legitimate son of a king who was betrayed by his queen’s choice to father Arithon by his mortal enemy but that does not save him:<br/>Vengeful fury drives the king to banish both Lysaer and Arithon from the world they know to the troubled realms of Athera beyond the Worldsend Gate.<br/>The two exiles are thrown together by hatred and spilled blood – then bound by destiny to champion Athera’s sundered heritage. The highest stakes ride the backlash of their conflict – they must reforge their adverse ideals into balance, or destroy the etheric grace of a culture all but lost to antiquity.<br/>A subtle and intricate tale of morality and difference, justice versus compassion, told with epic scope and real magic, Curse of the Mistwraith remains a modern classic of the fantasy genre.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/06/97/9780586210697.jpg', 'title_long': 'The Curse Of The Mistwraith', 'edition': 'paperback / softback', 'dimensions': 'Height: 7 Inches, Length: 4.5 Inches, Weight: 0.771617917 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.5}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 0.771617917}, 'height': {'unit': 'inches', 'value': 7}}, 'pages': 848, 'date_published': '2004', 'subjects': ['Science Fiction & Fantasy', 'Fantasy', 'Epic'], 'authors': ['Janny Wurts'], 'title': 'The Curse Of The Mistwraith', 'isbn13': '9780586210697', 'msrp': 0.99, 'binding': 'Paperback', 'isbn': '0586210695', 'isbn10': '0586210695'}}