{'book': {'publisher': 'iUniverse', 'synopsis': 'Today\'s high-flying, high-rolling conglomarateurs and corporate raiders are a tame lot compared to their immediate predecessors. The most notorious of these is Robert Vesco, the Kingfish himself, who in 1973 fled the United States accused of looting $250 million from Investors Overseas Services. Now, in this riveting account, noted author Arthur Herzog tells the astounding story of this high school dropout from Detroit, who parlayed cunning, ambition, a brilliant mind, and above all, other people\'s gullibility and money into a vast financial empire. Vesco\'s was a different kind of white collar crime. Indeed, there are many today who think he is not a criminal at all—just a victim of the SEC ("See Everything Crooked"). Working narrowly within the system, Vesco joined together smaller companies to form ever larger ones; then, driving up the price of stocks, he attracted investors by the thousands worldwide. When, at last, the dream fell apart, he got out before being thrown in jail. What followed was a desperate escape—and an equally desperate chase by the FBI, CIA, and SEC—to the Bahamas, Nicaragua, Costa Rica, and finally Havana, Cuba, where Vesco now lives under the protection of Fidel Castro.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/20/99/9780595272099.jpg', 'title_long': "Vesco: From Wall Street to Castro's Cuba The Rise, Fall, and Exile of the King of White Collar Crime", 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.2897042327 Pounds, Width: 1.02 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1.02}, 'weight': {'unit': 'pounds', 'value': 1.2897042327}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 408, 'date_published': '2003-03-11', 'subjects': ['Biographies & Memoirs', 'Professionals & Academics', 'Business', 'True Crime', 'Crime & Criminal Biographies', 'Business & Money', 'Business Culture', 'Ethics'], 'authors': ['Arthur Herzog III'], 'title': "Vesco: From Wall Street to Castro's Cuba The Rise, Fall, and Exile of the King of White Collar Crime", 'isbn13': '9780595272099', 'msrp': 23.95, 'binding': 'Paperback', 'isbn': '0595272096', 'isbn10': '0595272096'}}