{'book': {'publisher': "O'Reilly Media", 'synopsis': "Rails Cookbook is packed with the solutions you need to be a proficient developer with Rails, the leading framework for building the new generation of Web 2.0 applications. Recipes range from the basics, like installing Rails and setting up your development environment, to the latest techniques, such as developing RESTful web services.<br/><br/>With applications that are code light, feature-full and built to scale quickly, Rails has revolutionized web development. The Rails Cookbook addresses scores of real-world challenges; each one includes a tested solution, plus a discussion of how and why it works, so that you can adapt the techniques to similar situations. Topics include: Modeling data with the ActiveRecord library Setting up views with ActionView and RHTML templates Building your application's logic into ActionController Testing and debugging your Rails application Building responsive web applications using JavaScript and Ajax Ensuring that your application is security and performs well Deploying your application with Mongrel and Apache Using Capistrano to automate deployment Using the many Rails plugins Working with graphics<br/><br/>Whether you're new to Rails or an experienced developer, you'll discover ways to test, debug and secure your applications, incorporate Ajax, use caching to improve performance, and put your application into production. Want to get ahead of the Web 2.0 curve? This valuable cookbook will save you hundreds of hours when developing applications with Rails.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/73/10/9780596527310.jpg', 'title_long': "Rails Cookbook: Recipes for Rapid Web Development with Ruby (Cookbooks (O'Reilly))", 'edition': '1', 'dimensions': 'Height: 9.19 Inches, Length: 7 Inches, Weight: 1.7 Pounds, Width: 0.97 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 0.97}, 'weight': {'unit': 'pounds', 'value': 1.7}, 'height': {'unit': 'inches', 'value': 9.19}}, 'pages': 541, 'date_published': '2007-01-16', 'subjects': ['General', 'COM060080', 'cs.cmp_sc.app_sw'], 'authors': ['Rob Orsini'], 'title': "Rails Cookbook: Recipes for Rapid Web Development with Ruby (Cookbooks (O'Reilly))", 'isbn13': '9780596527310', 'msrp': 39.99, 'binding': 'Paperback', 'related': {'Page Fidelity': '0596513836', 'eBook': '0596513836', 'ePub': '0596554648'}, 'isbn': '0596527314', 'isbn10': '0596527314', 'other_isbns': [{'isbn': '9780596513832', 'binding': 'print'}, {'isbn': '9780596554644', 'binding': 'print'}]}}