{'book': {'publisher': "O'Reilly Media", 'synopsis': "Do you want to push Ruby to its limits? The Ruby Cookbook is the most comprehensive problem-solving guide to today's hottest programming language. It gives you hundreds of solutions to real-world problems, with clear explanations and thousands of lines of code you can use in your own projects.<br/><br/>From data structures and algorithms, to integration with cutting-edge technologies, the Ruby Cookbook has something for every programmer. Beginners and advanced Rubyists alike will learn how to program with: Strings and numbers Arrays and hashes Classes, modules, and namespaces Reflection and metaprogramming XML and HTML processing Ruby on Rails (including Ajax integration) Databases Graphics Internet services like email, SSH, and BitTorrent Web services Multitasking Graphical and terminal interfaces<br/><br/>If you need to write a web application, this book shows you how to get started with Rails. If you're a system administrator who needs to rename thousands of files, you'll see how to use Ruby for this and other everyday tasks. You'll learn how to read and write Excel spreadsheets, classify text with Bayesian filters, and create PDF files. We've even included a few silly tricks that were too cool to leave out, like how to blink the lights on your keyboard.<br/>The Ruby Cookbook is the most useful book yet written about Ruby. When you need to solve a problem, don't reinvent the wheel: look it up in the Cookbook.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/36/95/9780596523695.jpg', 'title_long': "Ruby Cookbook (Cookbooks (O'Reilly))", 'edition': '1', 'dimensions': 'Height: 9.19 Inches, Length: 7 Inches, Weight: 2.81750770836 Pounds, Width: 1.7 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 1.7}, 'weight': {'unit': 'pounds', 'value': 2.81750770836}, 'height': {'unit': 'inches', 'value': 9.19}}, 'pages': 906, 'date_published': '2006-08-22', 'subjects': ['General', 'JavaScript', 'Games', 'COM051000', 'cs.cmp_sc.app_sw', 'cs.cmp_sc.prog_lang', 'Professional, Career & Trade -> Computer Science -> General', 'Professional, Career & Trade -> Computer Science -> Programming Languages (Jr/Sr)', 'Professional, Career & Trade -> Computer Science -> JavaScript'], 'authors': ['Lucas Carlson', 'Leonard Richardson'], 'title': "Ruby Cookbook (Cookbooks (O'Reilly))", 'isbn13': '9780596523695', 'msrp': 49.99, 'binding': 'Paperback', 'isbn': '0596523696', 'isbn10': '0596523696', 'other_isbns': [{'isbn': '9780596529291', 'binding': 'printisbn'}]}}