{'book': {'publisher': "O'Reilly Media", 'synopsis': "You can set your watch to it: As soon as Apple comes out with another version of Mac OS X, David Pogue hits the streets with another meticulous Missing Manual to cover it with a wealth of detail. The new Mac OS X 10.4, better known as Tiger, is faster than its predecessors, but nothing's too fast for Pogue and Mac OS X: The Missing Manual. There are many reasons why this is the most popular computer book of all time.<br/>With its hallmark objectivity, the Tiger Edition thoroughly explores the latest features to grace the Mac OS. Which ones work well and which do not? What should you look for? This book tackles Spotlight, an enhanced search feature that helps you find anything on your computer; iChat AV for videoconferencing; Automator for automating repetitive, manual or batch tasks; and the hundreds of smaller tweaks and changes, good and bad, that Apple's marketing never bothers to mention.<br/>Mac OS X: The Missing Manual, Tiger Edition is the authoritative book that's ideal for every user, including people coming to the Mac for the first time. Our guide offers an ideal introduction that demystifies the Dock, the unfamiliar Mac OS X folder structure, and the entirely new Mail application. There are also mini-manuals on iLife applications such as iMovie, iDVD, and iPhoto, those much-heralded digital media programs, and a tutorial for Safari, Mac's own web browser.<br/>And plenty more: learn to configure Mac OS X using the System Preferences application, keep your Mac secure with FileVault, and learn about Tiger's enhanced Firewall capabilities. If you're so inclined, this Missing Manual also offers an easy introduction to the Terminal application for issuing basic Unix commands.<br/>There's something new on practically every page, and David Pogue brings his celebrated wit and expertise to every one of them. Mac's brought a new cat to town and we have a great new way to tame it.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/94/10/9780596009410.jpg', 'title_long': 'Mac OS X Tiger: Missing Manual', 'edition': '5th', 'dimensions': 'Height: 9.19 Inches, Length: 7 Inches, Weight: 2.91451110364 Pounds, Width: 1.68 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 1.68}, 'weight': {'unit': 'pounds', 'value': 2.91451110364}, 'height': {'unit': 'inches', 'value': 9.19}}, 'pages': 864, 'date_published': '2005-07', 'subjects': ['Macintosh', 'Mainframes & Minicomputers', 'General', 'COM050020', 'cs.cmp_sc.hardw', 'cs.cmp_sc.opert_systm'], 'authors': ['David Pogue'], 'title': 'Mac OS X Tiger: Missing Manual', 'isbn13': '9780596009410', 'msrp': 49.99, 'binding': 'Paperback', 'related': {'Page Fidelity': '1449392105', 'eBook': '1449392105', 'ePub': '1449379079'}, 'isbn': '0596009410', 'isbn10': '0596009410', 'other_isbns': [{'isbn': '9781449379070', 'binding': 'print'}, {'isbn': '9781449392109', 'binding': 'print'}]}}