{'book': {'publisher': "O'Reilly Media", 'synopsis': "There was a time, not too long ago, when the typewriter and notebook ruled, and the computer as an everyday tool was simply a vision. Revolution in the Valley traces this vision back to its earliest roots: the hallways and backrooms of Apple, where the groundbreaking Macintosh computer was born. The book traces the development of the Macintosh, from its inception as an underground skunkworks project in 1979 to its triumphant introduction in 1984 and beyond.<br/><br/>The stories in Revolution in the Valley come on extremely good authority. That's because author Andy Hertzfeld was a core member of the team that built the Macintosh system software, and a key creator of the Mac's radically new user interface software. One of the chosen few who worked with the mercurial Steve Jobs, you might call him the ultimate insider.<br/><br/>When Revolution in the Valley begins, Hertzfeld is working on Apple's first attempt at a low-cost, consumer-oriented computer: the Apple II. He sees that Steve Jobs is luring some of the company's most brilliant innovators to work on a tiny research effort the Macintosh. Hertzfeld manages to make his way onto the Macintosh research team, and the rest is history.<br/><br/>Through lavish illustrations, period photos, and Hertzfeld's vivid first-hand accounts, Revolution in the Valley reveals what it was like to be there at the birth of the personal computer revolution. The story comes to life through the book's portrait of the talented and often eccentric characters who made up the Macintosh team. Now, over 20 years later, millions of people are benefiting from the technical achievements of this determined and brilliant group of people.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/71/95/9780596007195.jpg', 'title_long': 'revolution_in_the_valley', 'edition': '1', 'dimensions': 'Height: 7.62 Inches, Length: 7.62 Inches, Weight: 4.97 Pounds, Width: 0.98 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.62}, 'width': {'unit': 'inches', 'value': 0.98}, 'weight': {'unit': 'pounds', 'value': 4.97}, 'height': {'unit': 'inches', 'value': 7.62}}, 'pages': 320, 'date_published': '2004', 'subjects': ['Computer Literacy', 'Macintosh', 'General', 'COM046020', 'cs.cmp_sc.app_sw', 'cs.cmp_sc.opert_systm'], 'authors': ['Andy Hertzfeld'], 'title': 'revolution_in_the_valley', 'isbn13': '9780596007195', 'msrp': 24.95, 'binding': 'Hardcover', 'related': {'Page Fidelity': '144939938X', 'eBook': '144939938X', 'ePub': '1449323871'}, 'isbn': '0596007191', 'isbn10': '0596007191', 'other_isbns': [{'isbn': '9781449323875', 'binding': 'print'}, {'isbn': '9781449399382', 'binding': 'print'}]}}