{'book': {'publisher': "O'Reilly Media", 'synopsis': "CSS: The Definitive Guide, 3rd Edition, provides you with a comprehensive guide to CSS implementation, along with a thorough review of all aspects of CSS 2.1. Updated to cover Internet Explorer 7, Microsoft's vastly improved browser, this new edition includes content on positioning, lists and generated content, table layout, user interface, paged media, and more.<br/>Simply put, Cascading Style Sheets (CSS) is a way to separate a document's structure from its presentation. The benefits of this can be quite profound: CSS allows a much richer document appearance than HTML and also saves time -- you can create or change the appearance of an entire document in just one place; and its compact file size makes web pages load quickly.<br/>CSS: The Definitive Guide, 3rd Edition, provides you with a comprehensive guide to CSS implementation, along with a thorough review of all aspects of CSS 2.1. Updated to cover Internet Explorer 7, Microsoft's vastly improved browser, this new edition includes content on positioning, lists and generated content, table layout, user interface, paged media, and more. Author Eric Meyer tackles the subject with passion, exploring in detail each individual CSS property and how it interacts with other properties. You'll not only learn how to avoid common mistakes in interpretation, you also will benefit from the depth and breadth of his experience and his clear and honest style. This is the complete sourcebook on CSS.<br/>The 3rd edition contains: Updates to reflect changes in the latest draft version of CSS 2.1 Browser notes updated to reflect changes between IE6 and IE7 Advanced selectors supported in IE7 and other major browsers included A new round of technical edits by a fresh set of editors Clarifications and corrected errata, including updated URLs of referenced online resources", 'language': 'en', 'image': 'https://images.isbndb.com/covers/73/34/9780596527334.jpg', 'title_long': 'CSS: The Definitive Guide: The Definitive Guide', 'edition': 'Third', 'dimensions': 'Height: 9.19 Inches, Length: 7 Inches, Weight: 1.84747375556 Pounds, Width: 1.1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 1.1}, 'weight': {'unit': 'pounds', 'value': 1.84747375556}, 'height': {'unit': 'inches', 'value': 9.19}}, 'pages': 536, 'date_published': '2006-12-12', 'subjects': ['User Interfaces', 'Site Design', 'General', 'Page Design', 'COM060130', 'cs.cmp_sc.app_sw', 'cs.cmp_sc.intrn_www', 'cs.offc_tch.intrn_wb_pg_dsg'], 'authors': ['Eric Meyer'], 'title': 'CSS: The Definitive Guide: The Definitive Guide', 'isbn13': '9780596527334', 'msrp': 44.99, 'binding': 'Paperback', 'related': {'Page Fidelity': '0596153910', 'eBook': '0596153910', 'ePub': '1449397255'}, 'isbn': '0596527330', 'isbn10': '0596527330', 'other_isbns': [{'isbn': '9780596153915', 'binding': 'print'}, {'isbn': '9781449397258', 'binding': 'print'}]}}