{'book': {'publisher': 'Three Rivers Press', 'synopsis': 'Few would question the truism that humankind is the crowning achievement of evolution; that the defining thrust of life\'s history yields progress over time from the primitive and simple to the more advanced and complex; that the disappearance of .400 hitting in baseball is a fact to be bemoaned; or that identifying an existing trend can be helpful in making important life decisions. Few, that is, except Stephen Jay Gould who, in his new book Full House: The Spread of Excellence from Plato to Darwin, proves that all of these intuitive truths are, in fact, wrong.<br/><br/>"All of these mistaken beliefs arise out of the same analytical flaw in our reasoning, our Platonic tendency to reduce a broad spectrum to a single, pinpointed essence," says Gould. "This way of thinking allows us to confirm our most ingrained biases that humans are the supreme being on this planet; that all things are inherently driven to become more complex; and that almost any subject can be expressed and understood in terms of an average."<br/><br/>In Full House, Gould shows why a more accurate way of understanding our world (and the history of life) is to look at a given subject within its own context, to see it as a part of a spectrum of variation rather than as an isolated "thing" and then to reconceptualize trends as expansion or contraction of this "full house" of variation, and not as the progress or degeneration of an average value, or single thing. When approached in such a way, the disappearance of .400 hitting becomes a cause for celebration, signaling not a decline in greatness but instead an improvement in the overall level of play in baseball; trends become subject to suspicion, and too often, only a tool of those seeking to advance a particular agenda; and the "Age of Man" (a claim rooted in hubris, not in fact) more accurately becomes the "Age of Bacteria."<br/><br/>"The traditional mode of thinking has led us to draw many conclusions that don\'t make satisfying sense," says Gould. "It tells us that .400 hitting has disappeared because batters have gotten worse, but how can that be true when record performances have improved in almost any athletic activity?" In a personal eureka!, Gould realized that we were looking at the picture backward, and that a simple conceptual inversion would resolve a number of the paradoxes of the conventional view.<br/><br/>While Full House deftly reveals the shortcomings of the popular reasoning we apply to everyday life situations, Gould also explores his beloved realm of natural history as well. Whether debunking the myth of the successful evolution of the horse (he grants that the story still deserves distinction, but as the icon of evolutionary failure); presenting evidence that the vaunted "progress of life" is really random motion away from simple beginnings, not directed impetus toward complexity; or relegating the kingdoms of Animalai and Plantae to their proper positions on the genealogical chart for all of life (as mere twigs on one of the three bushes), Full House asks nothing less than that we reconceptualize our view of life in a fundamental way.<br/><br/>From the Hardcover edition.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/14/06/9780609801406.jpg', 'title_long': 'Full House: The Spread of Excellence from Plato to Darwin', 'edition': 'Reprint', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.9 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 244, 'date_published': '1997-09-16', 'subjects': ['Science & Math', 'Evolution'], 'authors': ['Stephen Jay Gould'], 'title': 'Full House: The Spread of Excellence from Plato to Darwin', 'isbn13': '9780609801406', 'msrp': 15.95, 'binding': 'Paperback', 'isbn': '0609801406', 'isbn10': '0609801406'}}