{'book': {'publisher': 'Clarkson Potter', 'synopsis': 'In his first cookbook, Food Network star, Tyler Florence prepares you to cook for any occasion with recipes that range from dinner with friends to table for two and from one pot wonders to cocktail parties all featuring his signature bold, irresistible, real flavors.<br/><br/>With a culinary sensibility refined in some of New York’s most high-profile restaurants, and a down-home practicality gained as the cooking guru of Food 911, Tyler cooks food that’s fresh, flavorful, and totally doable. In Tyler Florence’s Real Kitchen, he’ll show you how to cook simple meals that taste amazing, from comfort-food to classics to vibrantly new dishes.<br/><br/>Tyler’s first cookbook stays true to his cooking philosophy—use great, simple ingredients and let the natural flavors speak for themselves. He offers can’t-miss recipes for all the crowd-pleasing dishes that you crave—cold fried chicken, a perfect meatloaf, or drop-dead lasagna. Tyler’s bold, uncomplicated style even makes sophisticated food easy, with recipes like Pan-Roasted Sirloin with Arugula, Sweet Peppers, and Olive Salad or Steamed Mussels with Saffron and Tomato. He’ll show you how to get a great meal from the grocery bag to the table with the least fuss and the most flavor, or how to throw a barbecue with the best burgers (spiced up with horseradish and Havarti cheese) that your friends have ever had. From weekend brunch (including Soft Scrambled Eggs with Salmon and Avocado and an assortment of dim sum) to quick weeknight dinners for two (like Hong Kong Crab Cakes with Baby Bok Choy), and a selection of great party food and cocktails, this is a cookbook you’ll use again and again for every occasion.<br/><br/>With helpful notes on essential pantry staples and a list of the kitchen equipment you really need, Tyler Florence’s Real Kitchen is a fresh, creative exploration of just how fun (and delicious) your cooking can be.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/99/72/9780609609972.jpg', 'title_long': "Tyler Florence's Real Kitchen: An Indispensable Guide for Anybody Who Likes to Cook", 'edition': '1', 'dimensions': 'Height: 10 Inches, Length: 8 Inches, Weight: 2.9 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 2.9}, 'height': {'unit': 'inches', 'value': 10}}, 'pages': 304, 'date_published': '2003-03-25', 'subjects': ['Cookbooks, Food & Wine', 'Cooking Methods', 'Cooking for One or Two', 'Quick & Easy', 'Regional & International', 'U.S. Regional', 'Celebrities & TV Shows'], 'authors': ['Tyler Florence'], 'title': "Tyler Florence's Real Kitchen: An Indispensable Guide for Anybody Who Likes to Cook", 'isbn13': '9780609609972', 'msrp': 32.5, 'binding': 'Hardcover', 'related': {'Kindle Edition': '0307492230', 'ePub': '0307492230'}, 'isbn': '0609609971', 'isbn10': '0609609971', 'other_isbns': [{'isbn': '9780307492234', 'binding': 'printisbn'}]}}