{'book': {'publisher': 'Clarkson Potter', 'synopsis': 'Ina Garten and The Barefoot Contessa Cookbook provide the perfect recipe for hosting parties that are easy and fun for everyone—including the cook.<br/><br/>For more than twenty years, Barefoot Contessa, the acclaimed specialty food store, has been cooking and baking extraordinary dishes for enthusiastic customers in the Hamptons. For many of those years, people have tried to get the exuberant owner, Ina Garten, to share the secrets of her store. Finally, the energy and style that make Barefoot Contessa such a special place are shown here, with dozens of recipes and more than 160 breathtaking photographs, in The Barefoot Contessa Cookbook.<br/><br/>Ina’s most popular recipes use familiar ingredients, but they taste even better than you would expect. Her Pan-Fried Onion Dip is the real thing, with slowly caramelized onions and fresh sour cream. Tomato soup is created from oven-roasted tomatoes and fresh basil to intensify the flavors. Meatloaf is as good as your grandmother’s, but it’s healthier because it’s made with ground turkey and fresh herbs. The light and flaky Maple Oatmeal Scones are baked with rolled oats, whole wheat, and real maple syrup. Now these and other famous Barefoot Contessa recipes can be prepared at home.<br/><br/>Ina says that before she owned a specialty food store she often spent a week making dinner for six friends. Her experience at Barefoot Contessa has given her hundreds of ideas for creating wonderful parties in a few hours. And they’re all in this book. Crab Cakes with Rémoulade Sauce can be stored overnight in the refrigerator and sautéed just before guests arrive. Cheddar Corn Chowder can be made days ahead, reheated, and served with a salad and bread for a delicious autumn lunch. The ingredients for Grilled Salmon Salad can all be prepared ahead and tossed together before serving. The batter for the Raspberry Corn Muffins can be mixed a day before and popped into the oven just before breakfast.<br/><br/>Ina Garten teaches us how to entertain with style, simplicity, and a relaxed sense of fun. There are notes throughout the book for giving cocktail parties, lunches, and dinner parties where everything is done before the guests arrive. And there are easy instructions for creating gorgeous party platters that don’t even require you to cook!', 'language': 'en', 'image': 'https://images.isbndb.com/covers/21/95/9780609602195.jpg', 'title_long': 'The Barefoot Contessa Cookbook', 'edition': '1', 'dimensions': 'Height: 10.25 Inches, Length: 7.77 Inches, Weight: 2.36335544864 pounds, Width: 0.89 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.77}, 'width': {'unit': 'inches', 'value': 0.89}, 'weight': {'unit': 'pounds', 'value': 2.36335544864}, 'height': {'unit': 'inches', 'value': 10.25}}, 'pages': 256, 'date_published': '1999-04-06', 'subjects': ['Cookbooks, Food & Wine', 'Cooking Methods', 'Cooking for One or Two', 'Main Courses & Side Dishes', 'Brunch & Tea', 'Regional & International', 'U.S. Regional', 'Kitchen Appliances', 'Blenders', 'Entertaining & Holidays', 'Party Planning', 'Reference'], 'authors': ['Ina Garten', 'Martha Stewart'], 'title': 'The Barefoot Contessa Cookbook', 'isbn13': '9780609602195', 'msrp': 35, 'binding': 'Hardcover', 'related': {'ePub': '0307956059'}, 'isbn': '0609602195', 'isbn10': '0609602195', 'other_isbns': [{'isbn': '9780307956057', 'binding': 'printisbn'}]}}