{'book': {'publisher': 'Harmony', 'synopsis': "In this groundbreaking, major work on intuition, well-being, and brain science, Dr. Mona Lisa Schulz reveals innovative, fresh, and exciting ways to tap into intuitions that have the power to improve your health and save your life.<br/><br/>Like Spontaneous Healing and Anatomy of the Spirit, this book gives new insights into the intimate connections between the mind, body, and emotions. Like The Man Who Mistook His Wife for a Hat, it provides astonishing new perspectives on what science has uncovered about the powers of the mind and cellular memories. Dr. Schulz relates how her clients have used intuition to gain insight into the underlying meaning of their life challenges, stories that will inspire you to learn your own body's unique perceptive language. By learning to read your sensations, memories, and the signals of distress and disease, you can strengthen your mind-body consciousness and empower yourself to create a healthier, happier life.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/42/47/9780609804247.jpg', 'title_long': 'Awakening Intuition: Using Your Mind-Body Network for Insight and Healing', 'edition': 'Illustrated', 'dimensions': 'Height: 8 Inches, Length: 5.2 Inches, Weight: 0.95 Pounds, Width: 0.9 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.2}, 'width': {'unit': 'inches', 'value': 0.9}, 'weight': {'unit': 'pounds', 'value': 0.95}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 416, 'date_published': '1999-04-20', 'subjects': ['Health, Fitness & Dieting', 'Alternative Medicine', 'Healing', 'Meditation', "Women's Health", 'General', 'Religion & Spirituality', 'New Age & Spirituality', 'Mental & Spiritual Healing'], 'authors': ['Mona Lisa Schulz M.D. Ph.D.'], 'title': 'Awakening Intuition: Using Your Mind-Body Network for Insight and Healing', 'isbn13': '9780609804247', 'msrp': '0.00', 'binding': 'Paperback', 'isbn': '0609804243', 'isbn10': '0609804243'}}