{'book': {'publisher': 'Harper Perennial', 'synopsis': 'Shortlisted for the Man Booker Prize: A “rich, Chekhovian novel” about family and forgiveness from the acclaimed author of Fire on the Mountain (The New Yorker).<br/>At the heart of this wonderful novel are the moving relationships between the estranged members of the Das family. Bimla is a dissatisfied but ambitious teacher at a women’s college who lives in her childhood home, where she cares for her mentally challenged brother, Baba. Tara is her younger, unambitious sister, married and with children of her own. Raja is their popular, brilliant, and successful brother. When Tara returns for a visit with Bimla and Baba, old memories and tensions resurface, blending into a domestic drama that leads to beautiful and profound moments of self-understanding.<br/>Set in the vividly portrayed environs of Old Delhi, “Clear Light of Day does what only the very best novels can do: it totally submerges us. It also takes us so deeply into another world that we almost fear we won’t be able to climb out again” (New York Times Book Review).', 'language': 'en', 'image': 'https://images.isbndb.com/covers/45/18/9780618074518.jpg', 'title_long': 'Clear Light Of Day', 'edition': 'Reprint', 'dimensions': 'Height: 8.2 Inches, Length: 5.5 Inches, Weight: 1 Pounds, Width: 0.48 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.48}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 8.2}}, 'pages': 192, 'date_published': '2000-09-12', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Family Life', "Women's Fiction", 'Domestic Life', 'Sisters', 'United States', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors': ['Anita Desai'], 'title': 'Clear Light Of Day', 'isbn13': '9780618074518', 'msrp': 11.53, 'binding': 'Paperback', 'isbn': '0618074511', 'isbn10': '0618074511', 'other_isbns': [{'isbn': '9780547526294', 'binding': 'printisbncanonical'}]}}