{'book': {'publisher': 'William Morrow', 'synopsis': "The authorized biography of the creator of Middle-earth. In the decades since his death in September 1973, millions have read THE HOBBIT, THE LORD OF THE RINGS, and THE SILMARILLION and become fascinated about the very private man behind the books. Born in South Africa in January 1892, John Ronald Reuel Tolkien was orphaned in childhood and brought up in near-poverty. He served in the first World War, surviving the Battle of the Somme, where he lost many of the closest friends he'd ever had. After the war he returned to the academic life, achieving high repute as a scholar and university teacher, eventually becoming Merton Professor of English at Oxford where he was a close friend of C.S. Lewis and the other writers known as The Inklings.<br/><br/>Then suddenly his life changed dramatically. One day while grading essay papers he found himself writing 'In a hole in the ground there lived a hobbit' -- and worldwide renown awaited him.<br/><br/>Humphrey Carpenter was given unrestricted access to all Tolkien's papers, and interviewed his friends and family. From these sources he follows the long and painful process of creation that produced THE LORD OF THE RINGS and THE SILMARILLION and offers a wealth of information about the life and work of the twentieth century's most cherished author.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/70/23/9780618057023.jpg', 'title_long': 'J.r.r. Tolkien: A Biography', 'edition': 'Reprint', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.57 Pounds, Width: 0.62 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.62}, 'weight': {'unit': 'pounds', 'value': 0.57}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 304, 'date_published': '2000-06-06', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Community & Culture', 'Women', 'Historical', 'Europe', 'Leaders & Notable People', 'Military', 'Rich & Famous', 'Royalty', 'Professionals & Academics', 'Educators', 'Science Fiction & Fantasy', 'Fantasy', 'Self Service', 'Custom Stores'], 'authors': ['Humphrey Carpenter'], 'title': 'J.r.r. Tolkien: A Biography', 'isbn13': '9780618057023', 'msrp': 15.95, 'binding': 'Paperback', 'related': {'Kindle Edition': '0547524420', 'Page Fidelity': '0547524420', 'eBook': '0547524420'}, 'isbn': '0618057021', 'isbn10': '0618057021', 'other_isbns': [{'isbn': '9780547524429', 'binding': 'printisbn'}]}}