{'book': {'publisher': 'Mariner Books', 'synopsis': 'Before seven-year-old Sam Smith discovered the Beatles, he and his father had little in common. Like so many other kids his age, Sam was drawn first to the Fab Four by their trivia as much as by their music and personalities. Peter Smith was content to point Sam to all the clues of Paul McCartney’s putative demise, to reveal who "Julia" was, and so forth. But soon the Beatles opened the two Smiths to each other, and to a harmonious new friendship. They found themselves using the band’s songs and exploits to fuel discussions of life’s splendid complications -- friendship, teamwork, romance, art -- and its inevitable sorrows -- failure, betrayal, and mortality.<br/>Music fans will delight in this singular celebration of the Beatles’ history and continuing cross-generational appeal. Smith takes us everywhere the Fab Four took him and Sam: from the boy’s Beatle-drenched bedroom to the circus of devotion that is Beatlefest to Paul McCartney’s childhood bedroom in a Liverpool row house. Ultimately, the two Smiths come to realize that the object of their affection transcends any facts that could ever be amassed about it. The Beatles’ essence isn’t in Liverpool or London or in heavily annotated lyric sheets. It is, of course, in their songs, and in how they help us understand ourselves and connect with each other.<br/>With a wit and clarity reminiscent of of Nick Hornby’s High Fidelity and Stefan Fatsis’s Word Freak, Smith limns the intensity of an obsession. And he evokes with wry intelligence the love a father and son can share.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/14/52/9780618251452.jpg', 'title_long': 'Two Of Us: The Story of a Father, a Son, and the Beatles', 'edition': 'Annotated edition', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.8 Pounds, Width: 0.5625 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.5625}, 'weight': {'unit': 'pounds', 'value': 0.8}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 224, 'date_published': '2004-02-04', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Composers & Musicians', 'Memoirs', 'Parenting & Relationships', 'Family Relationships', 'Fatherhood', 'Parenting', 'Teenagers', 'Single Parents', 'Parenting Boys', 'Politics & Social Sciences', 'Social Sciences', 'Gender Studies', 'Self Service', 'Custom Stores'], 'authors': ['Peter Smith'], 'title': 'Two Of Us: The Story of a Father, a Son, and the Beatles', 'isbn13': '9780618251452', 'msrp': 23, 'binding': 'Hardcover', 'isbn': '0618251456', 'isbn10': '0618251456'}}