{'book': {'publisher': 'Mariner Books', 'synopsis': "Lavishly illustrated with 1,000 photos, paintings, maps, sculptures and sketches, most appearing here for the first time, Weapons and Warfare is an indispensable chronicle of The Lord of the Rings' many creatures, warriors, armies and battlegrounds. From the graceful and proficient Elves to the horrendous war machines of the Dark Lord, each culture's approach to warfare is explained - how they fought, why they were fighting, what armor they wore and what weapons they used against their enemies. Now you can get as close to a marauding Orc as you could ever wish, without suffering the consequences!<br/><br/>Treating the filmmakers' notes, designs and props as a true archive, Weapons and Warfare describes in detail every major conflict depicted in the film trilogy - from The Last Alliance of Elves and Men to the climactic Battle of the Pelennor Fields - each accompanied by a battle diagram from the films' chief designers.<br/><br/>Armed with a wealth of fascinating facts and unique imagery, and with an exclusive foreword by Christopher Lee and an introduction by the Academy Award winner Richard Taylor, Weapons and Warfare promises to be the most striking companion to The Lord of the Rings movie trilogy published to date.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/10/04/9780618391004.jpg', 'title_long': 'The Lord of the Rings Weapons and Warfare', 'dimensions': 'Height: 10.75 Inches, Length: 8.5 Inches, Weight: 2.15 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.5}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 2.15}, 'height': {'unit': 'inches', 'value': 10.75}}, 'pages': 160, 'date_published': '2003', 'subjects': ['Arts & Photography', 'Performing Arts', 'Humor & Entertainment', 'Movies', 'Reference'], 'authors': ['Chris Smith', 'Christopher Lee'], 'title': 'The Lord of the Rings Weapons and Warfare', 'isbn13': '9780618391004', 'msrp': 1.99, 'binding': 'Paperback', 'isbn': '0618391002', 'isbn10': '0618391002'}}