{'book': {'publisher': 'William Morrow', 'synopsis': '* TOLKIEN * Now a major motion picture *<br/>Acclaimed as “the best book about J.R.R. Tolkien” (A. N. Wilson), this award-winning biography explores J.R.R. Tolkien’s wartime experiences and their impact on his life and his writing of The Hobbit and The Lord of The Rings. “To be caught in youth by 1914 was no less hideous an experience than in 1939 . . . By 1918 all but one of my close friends were dead.”<br/>So J.R.R. Tolkien responded to critics who saw The Lord of the Rings as a reaction to the Second World War. Tolkien and the Great War tells for the first time the full story of how he embarked on the creation of Middle-earth in his youth as the world around him was plunged into catastrophe. This biography reveals the horror and heroism that he experienced as a signals officer in the Battle of the Somme and introduces the circle of friends who spurred his mythology to life. It shows how, after two of these brilliant young men were killed, Tolkien pursued the dream they had all shared by launching his epic of good and evil.<br/>John Garth argues that the foundation of tragic experience in the First World War is the key to Middle-earth’s enduring power. Tolkien used his mythic imagination not to escape from reality but to reflect and transform the cataclysm of his generation. While his contemporaries surrendered to disillusionment, he kept enchantment alive, reshaping an entire literary tradition into a form that resonates to this day.<br/>This is the first substantially new biography of Tolkien since 1977, meticulously researched and distilled from his personal wartime papers and a multitude of other sources.<br/><br/>“Very much the best book about J.R.R. Tolkien that has yet been written.” — A. N. Wilson<br/><br/>“A highly intelligent book . . . Garth displays impressive skills both as researcher and writer.” — Max Hastings<br/><br/>“It is a strange story that Garth tells, but he tells it clearly and compellingly.” — Tom Shippey<br/><br/>“Somewhere, I think, Tolkien is nodding in appreciation.” — Charles Matthews, San Jose Mercury News<br/><br/>“Gripping from start to finish and offers important new insights.” — Library Journal<br/><br/>“A labor of love in which journalist Garth combines a newsman’s nose for a good story with a scholar’s scrupulous attention to detail . . . Brilliantly argued.” — Daily Mail<br/><br/>“Insight into how a writer turned academia into art, how deeply friendship supports and wounds us, and how the death and disillusionment that characterized World War I inspired Tolkien’s lush saga.” — Detroit Free Press', 'language': 'en', 'image': 'https://images.isbndb.com/covers/48/10/9780618574810.jpg', 'title_long': 'Tolkien And The Great War: The Threshold of Middle-earth', 'edition': 'Reprint', 'dimensions': 'Height: 8.75 Inches, Length: 5.5 Inches, Weight: 0.95 Pounds, Width: 1.08 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.08}, 'weight': {'unit': 'pounds', 'value': 0.95}, 'height': {'unit': 'inches', 'value': 8.75}}, 'pages': 432, 'date_published': '2005-06-01', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Leaders & Notable People', 'Military', 'History', 'World War I', 'World War II', 'Self Service', 'Custom Stores'], 'authors': ['John Garth'], 'title': 'Tolkien And The Great War: The Threshold of Middle-earth', 'isbn13': '9780618574810', 'msrp': 14.95, 'binding': 'Paperback', 'isbn': '0618574816', 'isbn10': '0618574816', 'other_isbns': [{'isbn': '9780544263727', 'binding': 'print'}]}}