{'book': {'publisher': 'Mariner Books Classics', 'synopsis': 'THE CLASSIC THAT LAUNCHED THE ENVIRONMENTAL MOVEMENT<br/>“Rachel Carson is a pivotal figure of the twentieth century…people who thought one way before her essential 1962 book Silent Spring thought another way after it.”—Margaret Atwood<br/>Rarely does a single book alter the course of history, but Rachel Carson’s Silent Spring did exactly that. The outcry that followed its publication in 1962 forced the banning of DDT and spurred revolutionary changes in the laws affecting our air, land, and water. Carson’s passionate concern for the future of our planet reverberated powerfully throughout the world. As Carson reminds us, "In nature, nothing exists alone.”<br/>The introduction by the acclaimed biographer Linda Lear, author of Rachel Carson: Witness for Nature, tells the story of Carson’s courageous defense of her truths in the face of a ruthless assault form the chemical industry following the publication of Silent Spring and before her untimely death.<br/>“Wonder and humility are just some of the gifts of Silent Spring. They remind us that we, like all other living creatures, are part of the vast ecosystems of the earth of the earth…this is a book to relish: not for the dark side of human nature, but for the promise of life’s possibility.” —from the Introduction', 'language': 'en', 'image': 'https://images.isbndb.com/covers/90/60/9780618249060.jpg', 'title_long': 'Silent Spring', 'edition': 'Anniversary', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.992080179 Pounds, Width: 0.877 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.877}, 'weight': {'unit': 'pounds', 'value': 0.992080179}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 400, 'date_published': '2022-02-01', 'subjects': ['Engineering & Transportation', 'Engineering', 'Chemical', 'Reference', 'Science & Math', 'Earth Sciences', 'Environmental Science', 'Nature & Ecology', 'Natural History', 'Conservation', 'Environment', 'Environmentalism', 'Sports & Outdoors', 'Self Service', 'Custom Stores'], 'authors': ['Rachel Carson'], 'title': 'Silent Spring', 'isbn13': '9780618249060', 'msrp': 14.95, 'binding': 'Paperback', 'related': {'eBook': '0547527624'}, 'isbn': '0618249060', 'isbn10': '0618249060', 'other_isbns': [{'isbn': '9780547527628', 'binding': 'saleableprint'}]}}