{'book': {'publisher': 'Mariner Books', 'synopsis': 'For fans of sports and just plain great writing, this collection of twenty-seven of the finest pieces from the past year features "outstanding sports reporting on a wealth of different topics" (Booklist). Guest editor Michael Lewis, the best-selling author of Moneyball and Coach, has assembled a compelling look at the sports stories and issues that dominated 2005.<br/><br/>Pamela Colloff reports from the politically and sexually charged world of competitive cheerleading in Texas. Paul Solotaroff meets the star of the University of Georgia wrestling team, a nineteen-year-old world-record weightlifter who was born with no arms or legs. Ben Paynter travels the gay rodeo circuit. Pat Jordan profiles the world\'s greatest poker player, a boyish thirty-year-old whose mom still packs him a brown bag lunch. Jeff Duncan travels to Florida, where a New Orleans high school and its football program are picking up the pieces in the aftermath of Hurricane Katrina. We also discover Linda Robertson reporting on the supersizing of NFL players. S. L. Price profiles the most famous U.S. Paraolympian. Katy Vine introduces a girl who can dunk -- in eighth grade -- and more.<br/><br/>The pieces in this outstanding volume show the true reach and impact of sports, its importance often extending far beyond the playing field. As Lewis writes in his introduction, "What\'s reassuring about great sports writing is what\'s reassuring about great sports performances: facing opposition, and often against the odds, someone, at last, did something right."', 'language': 'en', 'image': 'https://images.isbndb.com/covers/02/28/9780618470228.jpg', 'title_long': 'The Best American Sports Writing 2006 (The Best American Series)', 'edition': 'First Edition', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 1.1 Pounds, Width: 1.0625 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.0625}, 'weight': {'unit': 'pounds', 'value': 1.1}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 416, 'date_published': '2006-10-11', 'subjects': ['Literature & Fiction', 'United States', 'Anthologies', 'Reference', 'Writing, Research & Publishing Guides', 'Writing', 'Sports & Outdoors', 'Miscellaneous', 'Essays', 'History of Sports', 'Journalism', 'Travel', 'Travel Writing'], 'authors': ['Glenn Stout', 'Michael Lewis'], 'title': 'The Best American Sports Writing 2006 (The Best American Series)', 'isbn13': '9780618470228', 'msrp': 22.95, 'binding': 'Paperback', 'isbn': '0618470220', 'isbn10': '0618470220'}}