{'book': {'publisher': 'Houghton Mifflin Harcourt', 'synopsis': 'Designed to be the essential reference works for all readers and students, these volumes present the most thorough analysis possible of Tolkien\'s work within the important context of his life. The Reader\'s Guide includes brief but comprehensive alphabetical entries on a wide range of topics, including a who\'s who of important persons, a guide to places and institutions, details concerning Tolkien\'s source material, information about the political and social upheavals through which the author lived, the importance of his social circle, his service as an infantryman in World War I -- even information on the critical reaction to his work and the "Tolkien cult." The Chronology details the parallel evolutions of Tolkien\'s works and his academic and personal life in minute detail. Spanning the entirety of his long life including nearly sixty years of active labor on his Middle-earth creations, and drawing on such contemporary sources as school records, war service files, biographies, correspondence, the letters of his close friend C. S. Lewis, and the diaries of W. H. Lewis, this book will be an invaluable resource for those who wish to gain a complete understanding of Tolkien\'s status as a giant of twentieth-century literature.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/11/34/9780618391134.jpg', 'title_long': 'J.R.R. Tolkien Companion and Guide (Two Volume Box Set)', 'edition': 'Slp', 'dimensions': 'Height: 9.5 Inches, Length: 6.25 Inches, Weight: 1 Pounds, Width: 4.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 4.5}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 2300, 'date_published': '2006', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Genres & Styles', 'Reference', 'Regional & Cultural', 'Science Fiction & Fantasy', 'Fantasy', 'Science Fiction', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Christina Scull', 'Wayne G. Hammond'], 'title': 'J.R.R. Tolkien Companion and Guide (Two Volume Box Set)', 'isbn13': '9780618391134', 'msrp': 100, 'binding': 'Hardcover', 'isbn': '0618391134', 'isbn10': '0618391134'}}