{'book': {'publisher': 'Harper Paperbacks', 'synopsis': 'The Diezmo tells the incredible story of the Mier Expedition, one of the most absurd and tragic military adventures in the history of Texas -- a country and a state, as Rick Bass writes, that was "born in blood." In the early days of the Republic of Texas, two young men, wild for glory, impulsively volunteer for an expedition Sam Houston has ordered to patrol the Mexican border. But their dreams of triumph soon fade into prayers for survival, and all that is on their minds is getting home and having a cool drink of water. After being captured in a raid on the Mexican village of Mier, escaping, and being recaptured, the men of the expedition are punished with the terrible diezmo, in which one man in ten is randomly chosen to die. The survivors end up in the most dreaded prison in Mexico. There they become pawns in an international chess game to decide the fate of Texas, and with their hopes of release all but extinguished, they make one desperate, last-ditch effort to escape.<br/>A great crossover book with appeal for high school students. It will also interest readers of westerns and historical fiction.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/05/08/9780618710508.jpg', 'title_long': 'The Diezmo: A Novel', 'edition': 'Reprint', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.52 Pounds, Width: 0.56 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.56}, 'weight': {'unit': 'pounds', 'value': 0.52}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 224, 'date_published': '2006-06-15', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'Westerns', 'United States', 'Contemporary', 'Mystery, Thriller & Suspense', 'Mystery', 'Self Service', 'Custom Stores'], 'authors': ['Rick Bass'], 'title': 'The Diezmo: A Novel', 'isbn13': '9780618710508', 'msrp': 14.95, 'binding': 'Paperback', 'isbn': '0618710507', 'isbn10': '0618710507', 'other_isbns': [{'isbn': '9780547346946', 'binding': 'print'}]}}