{'book': {'publisher': 'Houghton Mifflin Harcourt', 'synopsis': 'Philip Roth\'s new novel is a candidly intimate yet universal story of loss, regret, and stoicism. The best-selling author of The Plot Against America now turns his attention from "one family\'s harrowing encounter with history" (New York Times) to one man\'s lifelong skirmish with mortality.<br/><br/>The fate of Roth\'s everyman is traced from his first shocking confrontation with death on the idyllic beaches of his childhood summers, through the family trials and professional achievements of his vigorous adulthood, and into his old age, when he is rended by observing the deterioration of his contemporaries and stalked by his own physical woes.<br/><br/>A successful commercial artist with a New York ad agency, he is the father of two sons from a first marriage who despise him and a daughter from a second marriage who adores him. He is the beloved brother of a good man whose physical well-being comes to arouse his bitter envy, and he is the lonely ex-husband of three very different women with whom he\'s made a mess of marriage. In the end he is a man who has become what he does not want to be.<br/><br/>The terrain of this powerful novel -- Roth\'s twenty-seventh book and the fifth to be published in the twenty-first century -- is the human body. Its subject is the common experience that terrifies us all.<br/><br/>Everyman takes its title from an anonymous fifteenth-century allegorical play, a classic of early English drama, whose theme is the summoning of the living to death.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/51/67/9780618735167.jpg', 'title_long': 'Everyman', 'edition': 'First Edition', 'dimensions': 'Height: 7.75 Inches, Length: 5.75 Inches, Weight: 0.65 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.65}, 'height': {'unit': 'inches', 'value': 7.75}}, 'pages': 182, 'date_published': '2006-04', 'subjects': ['Literature & Fiction', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors': ['Philip Roth'], 'title': 'Everyman', 'isbn13': '9780618735167', 'msrp': '0.00', 'binding': 'Hardcover', 'isbn': '061873516X', 'isbn10': '061873516X', 'other_isbns': [{'isbn': '9780547344942', 'binding': 'printisbn'}]}}