{'book': {'publisher': 'Mariner Books', 'synopsis': '"The essays in this volume are powerful, plainspoken meditations on birthing, dying, and all the business in between," writes Lauren Slater in her introduction to the 2006 edition. "They reflect the best of what we, as a singular species, have to offer, which is reflection in a context of kindness. The essays tell hard-won tales wrestled sometimes from great pain."<br/><br/>The twenty powerful essays in this volume are culled from periodicals ranging from The Sun to The New Yorker, from Crab Orchard Review to Vanity Fair. In "Missing Bellow," Scott Turow reflects on the death of an author he never met, but one who "overpowered me in a way no other writer had." Adam Gopnik confronts a different kind of death, that of his five-year-old daughter\'s pet fish -- a demise that churns up nothing less than "the problem of consciousness and the plotline of Hitchock\'s Vertigo."<br/><br/>A pet is center stage as well in Susan Orlean\'s witty and compassionate saga of a successful hunt for a stolen border collie. Poe Ballantine chronicles a raw-nerved pilgrimage in search of salvation, solace, and a pretty brunette, and Laurie Abraham, in "Kinsey and Me," journeys after the man who dared to plumb the mysteries of human desire. Marjorie Williams gives a harrowing yet luminous account of her life with cancer, and Michele Morano muses on the grammar of the subjunctive mood while proving that "in language, as in life, moods are complicated, but at least in language there are only two."', 'language': 'en', 'image': 'https://images.isbndb.com/covers/52/90/9780618705290.jpg', 'title_long': 'The Best American Essays 2006', 'edition': 'First Edition', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.9 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 304, 'date_published': '2006-10-11', 'subjects': ['Literature & Fiction', 'Essays & Correspondence', 'Essays', 'Genre Fiction', 'Short Stories & Anthologies', 'Anthologies', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Reference', 'Writing, Research & Publishing Guides', 'Writing'], 'authors': ['Robert Atwan'], 'title': 'The Best American Essays 2006', 'isbn13': '9780618705290', 'msrp': 17.95, 'binding': 'Paperback', 'isbn': '0618705295', 'isbn10': '0618705295'}}