{'book': {'publisher': 'William Morrow', 'synopsis': "In The Lord of the Rings: A Reader's Companion internationally acclaimed scholars Wayne G. Hammond and Christina Scull examine Tolkien's masterpiece chapter by chapter, offering expert insights into its evolution, structure, and meaning. They discuss in close detail important literary and historical influences on the development of The Lord of the Rings, connections between that work and other writings by Tolkien, errors and inconsistencies, significant changes to the text during its fifty years of publication, archaic and unusual words used by Tolkien, and words and passages in his invented languages of Middle-earth. Thousands of notes, keyed to standard editions of The Lord of the Rings but universally accessible, reveal the richness and complexity of one of the most popular works of fiction in our time. In addition to their own expertise and that of other scholars and critics, Hammond and Scull frequently draw upon comments by Tolkien himself, made in letters to family, friends, and enthusiasts, in draft texts of The Lord of the Rings, and in works written in later years which amplify or illuminate characters and events in the story. Extensive reference is made also to writings by Tolkien not previously or widely published, including elaborate time-schemes, an unfinished manuscript index to The Lord of the Rings, and most notably, the important Nomenclature or guide to names in The Lord of the Rings prepared for the use of translators, long out of print and now newly transcribed and printed in its entirety. With these resources at hand, even the most seasoned reader of The Lord of the Rings will come to a greater enjoyment and appreciation of Tolkien's magnificent achievement.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/26/70/9780618642670.jpg', 'title_long': "The Lord Of The Rings: A Reader's Companion", 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 2.44 Pounds, Width: 2 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 2}, 'weight': {'unit': 'pounds', 'value': 2.44}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 416, 'date_published': '2005-12-27', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Biographical', 'History & Criticism', 'Criticism & Theory', 'Genres & Styles', 'Regional & Cultural', 'Short Stories & Anthologies', 'Anthologies', 'British & Irish', 'Science Fiction & Fantasy', 'Fantasy', 'Epic', 'Sword & Sorcery', 'Science Fiction'], 'authors': ['Wayne G. Hammond', 'Christina Scull'], 'title': "The Lord Of The Rings: A Reader's Companion", 'isbn13': '9780618642670', 'msrp': 35, 'binding': 'Hardcover', 'isbn': '0618642676', 'isbn10': '0618642676'}}