{'book': {'publisher': 'Viking Adult', 'synopsis': "When today's world leaders need inspiration and strength in times of crisis, they often turn to Winston Churchill, quoting him and citing his heroic example. The son of a member of Parliament, Churchill, a poor academic student, wanted to be a soldier early in life. But after he escaped from a South African prison camp, his national fame catapulted him into a life of politics.<br/><br/>In this Penguin Life, the eminent historian John Keegan charts Churchill's career, following his steadfast leadership during the catastrophic events of World War II while England was dangerously poised on the brink of collapse. With wonderful eloquence, Keegan illuminates Churchill's incredible strength during this crucial moment in history and his unshakable belief that democracy would always prevail. Keegan looks at Churchill's speeches, which are some of the greatest examples of English oratory, and identifies his ability to communicate his own idea of an English past as the source of Churchill's greatness. He also sheds light on the political climate of Churchill's time. The result is an insightful, sensitive portrait of Churchill the war leader and Churchill the man.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/07/98/9780670030798.jpg', 'title_long': 'Winston Churchill', 'edition': 'First Edition', 'dimensions': 'Height: 7.86 Inches, Length: 5.5 Inches, Weight: 0.7 Pounds, Width: 0.82 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.82}, 'weight': {'unit': 'pounds', 'value': 0.7}, 'height': {'unit': 'inches', 'value': 7.86}}, 'pages': 208, 'date_published': '2002-10-14', 'subjects': ['Biographies & Memoirs', 'Historical', 'Europe', 'History', 'Great Britain', 'Sports & Outdoors', 'Biographies'], 'authors': ['John Keegan'], 'title': 'Winston Churchill', 'isbn13': '9780670030798', 'msrp': 19.95, 'binding': 'Hardcover', 'isbn': '0670030791', 'isbn10': '0670030791'}}