{'book': {'publisher': 'Popurri', 'synopsis': 'For nearly a century, the words and works of Dale Carnegie & Associates, Inc., have translated into proven success—a claim verified by millions of satisfied graduates; a perpetual 3,000-plus enrollment roster per week; and book sales, including the mega-bestseller How to Win Friends and Influence People, totaling over thirty million copies.<br/><br/>Now, in The Leader In You, coauthors Stuart R. Levine and Michael A. Crom apply the famed organization’s time-tested human relations principles to demonstrate how anyone, regardless of his or her job, can harness creativity and enthusiasm to work more productively.<br/><br/>With insights from leading figures in the corporate, entertainment, sports, academic, and political arenas—and encompassing interviews and advice from such eminent authorities as Lee Iacocca and Margaret Thatcher—this comprehensive, step-by-step guide includes strategies to help you: identify your leadership strengths; achieve your goals and increase your self-confidence; eliminate an “us vs. them” mentality; become a team player and strengthen cooperation among associates; balance work and leisure; control your worries and energize your life; and much more!<br/><br/>The most important investment you will ever make is in yourself—once you discover the key that unlocks The Leader In You.', 'language': 'ru', 'image': 'https://images.isbndb.com/covers/99/88/9780671519988.jpg', 'title_long': "Kak zavoevyvat' druzei", 'edition': 'Reprinted edition', 'dimensions': 'Height: 6.75 Inches, Length: 4.1875 Inches, Weight: 0.27 Pounds, Width: 0.7 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.1875}, 'width': {'unit': 'inches', 'value': 0.7}, 'weight': {'unit': 'pounds', 'value': 0.27}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 272, 'date_published': '2005', 'subjects': ['Business & Money', 'Management & Leadership', 'Leadership & Motivation', 'Mystery, Thriller & Suspense', 'Mystery'], 'authors': ['S. Levin'], 'title': "Kak zavoevyvat' druzei", 'isbn13': '9780671519988', 'msrp': 7.99, 'binding': 'Hardcover', 'isbn': '0671519980', 'isbn10': '0671519980', 'other_isbns': [{'isbn': '9781439140574', 'binding': 'print'}]}}