{'book': {'publisher': 'Pocket Books', 'synopsis': 'Clive Cussler is an extraordinary author whose life parallels that of his fictional hero, Dirk Pitt. Whether searching for famous shipwrecks or cruising in classic cars from his private collection, Cussler’s spirit feeds the soul of Dirk Pitt—a hero whose adventures race along at supersonic speed. Now with this truly unique insider’s guide, you can dive in and explore the worlds of both Clive Cussler, the grand master of adventure, and Dirk Pitt, the world’s greatest action adventure hero.<br/><br/>Inside Clive Cussler and Dirk Pitt® Revealed you’ll find:<br/><br/>The prologue to Clive Cussler’s next exciting Dirk Pitt novel! An exclusive interview with Clive Cussler—including the evolution of the Dirk Pitt novels and the close ties between Cussler and his hero “The Reunion”—an original short story in which Cussler crashes NUMA’s twenty-year reunion and reminisces with Dirk Pitt and all his favorite characters A brief synopsis of every Dirk Pitt novel, including why Pacific Vortex!—not The Mediterranean Caper—should be considered the first Pitt novel A concordance for the Dirk Pitt novels—complete with A-Z listings of every major character, car, ship, aircraft, weapon, locale, and more. Complete with rare photos, dedications, the Clive Cussler car collection, and advanced Dirk Pitt trivia, Clive Cussler and Dirk Pitt Revealed contains a mother lode of information every fan will treasure.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/62/26/9780671026226.jpg', 'title_long': 'Dirk Pitt Revealed', 'edition': 'Reissue', 'dimensions': 'Height: 6.75 Inches, Length: 4.1875 Inches, Weight: 0.57761112644 Pounds, Width: 1.6 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.1875}, 'width': {'unit': 'inches', 'value': 1.6}, 'weight': {'unit': 'pounds', 'value': 0.57761112644}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 544, 'date_published': '1998-10-01', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Reference', 'Action & Adventure', 'Mystery, Thriller & Suspense', 'Sea Adventures', 'War & Military', 'Thrillers & Suspense', 'Spies & Politics', 'Technothrillers', 'Historical', 'Military', 'Self Service', 'Custom Stores'], 'authors': ['Clive Cussler'], 'title': 'Dirk Pitt Revealed', 'isbn13': '9780671026226', 'msrp': 8.03, 'binding': 'Mass Market Paperback', 'isbn': '0671026224', 'isbn10': '0671026224'}}