{'book': {'publisher': 'Simon & Schuster', 'synopsis': 'The Pulitzer Prize–winning biography of Harry S. Truman, whose presidency included momentous events from the atomic bombing of Japan to the outbreak of the Cold War and the Korean War, told by America’s beloved and distinguished historian.<br/><br/>The life of Harry S. Truman is one of the greatest of American stories, filled with vivid characters—Roosevelt, Churchill, Stalin, Eleanor Roosevelt, Bess Wallace Truman, George Marshall, Joe McCarthy, and Dean Acheson—and dramatic events. In this riveting biography, acclaimed historian David McCullough not only captures the man—a more complex, informed, and determined man than ever before imagined—but also the turbulent times in which he rose, boldly, to meet unprecedented challenges. The last president to serve as a living link between the nineteenth and the twentieth centuries, Truman’s story spans the raw world of the Missouri frontier, World War I, the powerful Pendergast machine of Kansas City, the legendary Whistle-Stop Campaign of 1948, and the decisions to drop the atomic bomb, confront Stalin at Potsdam, send troops to Korea, and fire General MacArthur. Drawing on newly discovered archival material and extensive interviews with Truman’s own family, friends, and Washington colleagues, McCullough tells the deeply moving story of the seemingly ordinary “man from Missouri” who was perhaps the most courageous president in our history.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/92/05/9780671869205.jpg', 'title_long': 'Truman', 'edition': 'Reprint', 'dimensions': 'Height: 9.25 Inches, Length: 6.125 Inches, Weight: 2.38981092008 Pounds, Width: 1.9 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.125}, 'width': {'unit': 'inches', 'value': 1.9}, 'weight': {'unit': 'pounds', 'value': 2.38981092008}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 1120, 'date_published': '1993-06-14', 'subjects': ['Biographies & Memoirs', 'Historical', 'United States', 'Asia', 'Leaders & Notable People', 'Political', 'Presidents & Heads of State', 'History', 'Americas', 'Self Service', 'Custom Stores'], 'authors': ['David McCullough'], 'title': 'Truman', 'isbn13': '9780671869205', 'msrp': 24, 'binding': 'Paperback', 'related': {'Kindle Edition': '0743260295', 'ePub': '1451618220'}, 'isbn': '0671869205', 'isbn10': '0671869205', 'other_isbns': [{'isbn': '9780743260299', 'binding': 'print'}, {'isbn': '9781451618228', 'binding': 'print'}]}}