{'book': {'publisher': 'Belknap Press: An Imprint of Harvard University Press', 'synopsis': "Fought as fiercely by politicians and the public as by troops in Southeast Asia, the Vietnam War--its origins, its conduct, its consequences--is still being contested. In what will become the classic account, based on newly opened archival sources, David Kaiser rewrites what we know about this conflict. Reviving and expanding a venerable tradition of political, diplomatic, and military history, he shows not only why we entered the war, but also why our efforts were doomed to fail.<br/><br/>American Tragedy is the first book to draw on complete official documentation to tell the full story of how we became involved in Vietnam--and the story it tells decisively challenges widely held assumptions about the roles of Eisenhower, Kennedy, and Johnson. Using an enormous range of source materials from these administrations, Kaiser shows how the policies that led to the war were developed during Eisenhower's tenure and nearly implemented in the closing days of his administration in response to a crisis in Laos; how Kennedy immediately reversed course on Laos and refused for three years to follow recommendations for military action in Southeast Asia; and how Eisenhower's policies reemerged in the military intervention mounted by the Johnson administration. As he places these findings in the context of the Cold War and broader American objectives, Kaiser offers the best analysis to date of the actual beginnings of the war in Vietnam, the impact of the American advisory mission from 1962 through 1965, and the initial strategy of General Westmoreland.<br/><br/>A deft re-creation of the deliberations, actions, and deceptions that brought two decades of post-World War II confidence to an ignominious end, American Tragedy offers unparalleled insight into the Vietnam War at home and abroad--and into American foreign policy in the 1960s.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/67/20/9780674006720.jpg', 'title_long': 'American Tragedy: Kennedy, Johnson, and the Origins of the Vietnam War', 'dimensions': 'Height: 9.25 Inches, Length: 6.13 Inches, Weight: 1.7306287567 Pounds, Width: 1.52 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.13}, 'width': {'unit': 'inches', 'value': 1.52}, 'weight': {'unit': 'pounds', 'value': 1.7306287567}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 576, 'date_published': '2002-01-30', 'subjects': ['History', 'Americas', 'United States', 'Asia', 'Southeast Asia', 'Military', 'Vietnam War', 'Politics & Social Sciences', 'Politics & Government', 'International & World Politics'], 'authors': ['David Kaiser'], 'title': 'American Tragedy: Kennedy, Johnson, and the Origins of the Vietnam War', 'isbn13': '9780674006720', 'msrp': 32.5, 'binding': 'Paperback', 'isbn': '0674006720', 'isbn10': '0674006720'}}