{'book': {'publisher': 'Harvard University Press', 'synopsis': 'The publication in 1890 of William James’s acknowledged masterpiece marked a turning point in the development of psychology as a science in America. The Principles of Psychology also became a source of inspiration in philosophy, literature, and the arts. When John Dewey reviewed it, he predicted that it would rank “as a permanent classic, like Locke’s Essay and Hume’s Treatise.”<br/><br/>Its stature undiminished after 91 years, The Principles of Psychology appears now in a new, handsome edition with an authoritative text that corrects the hundreds of errors, some very serious, that have been perpetuated over the years. Prepared according to the modern standards of textual scholarship, this edition incorporates all of the changes James made in the eight printings he supervised, as well as the revisions and new material he added to his own annotated copy. In addition, all footnotes, references, quotations, and translations have been thoroughly checked.<br/><br/>The complete text of the Principles, with footnotes, drawings, and James’s own index, appears in Volumes I and II. Volume III includes extensive notes, appendixes, textual apparatus, and a general index.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/55/93/9780674705593.jpg', 'title_long': 'The Principles of Psychology, Vols. 1-2 (2 Volumes in 1)', 'dimensions': 'Height: 10 Inches, Length: 7.2 Inches, Weight: 5.09929212006 Pounds, Width: 5.8 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.2}, 'width': {'unit': 'inches', 'value': 5.8}, 'weight': {'unit': 'pounds', 'value': 5.09929212006}, 'height': {'unit': 'inches', 'value': 10}}, 'pages': 1376, 'date_published': '1981-12-01', 'subjects': ['Health, Fitness & Dieting', 'Psychology & Counseling', 'Developmental Psychology', 'Medical Books', 'Psychology', 'General', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['William James'], 'title': 'The Principles of Psychology, Vols. 1-2 (2 Volumes in 1)', 'isbn13': '9780674705593', 'msrp': 329.5, 'binding': 'Hardcover', 'isbn': '0674705599', 'isbn10': '0674705599'}}