{'book': {'publisher': 'Belknap Press: An Imprint of Harvard University Press', 'synopsis': 'Mexico’s leading poet, essayist, and cultural critic writes of a Mexican poet of another time and another world, the world of seventeenth-century New Spain. His subject is Sor Juana Inés de la Cruz, the most striking figure in all of Spanish-American colonial literature and one of the great poets of her age.<br/><br/>Her life reads like a novel. A spirited and precocious girl, one of six illegitimate children, is sent to live with relatives in the capital city. She becomes known for her beauty, wit, and amazing erudition, and is taken into the court as the Vicereine’s protégée. For five years she enjoys the pleasures of life at court―then abruptly, at twenty, enters a convent for life. Yet, no recluse, she transforms the convent locutory into a literary and intellectual salon; she amasses an impressive library and collects scientific instruments, reads insatiably, composes poems, and corresponds with literati in Spain. To the consternation of the prelates of the Church, she persists in circulating her poems, redolent more of the court than the cloister. Her plays are performed, volumes of her poetry are published abroad, and her genius begins to be recognized throughout the Hispanic world. Suddenly she surrenders her books, forswears all literary pursuits, and signs in blood a renunciation of secular learning. The rest is silence. She dies two years later, at forty-six.<br/><br/>Octavio Paz has long been intrigued by the enigmas of Sor Juana’s personality and career. Why did she become a nun? How could she renounce her lifelong passion for writing and learning? Such questions can be answered only in the context of the world in which she lived. Paz gives a masterly portrayal of the life and culture of New Spain and the political and ideological forces at work in that autocratic, theocratic, male-dominated society, in which the subjugation of women was absolute.<br/><br/>Just as Paz illuminates Sor Juana’s life by placing it in its historical setting, so he situates her work in relation to the traditions that nurtured it. With critical authority he singles out the qualities that distinguish her work and mark her uniqueness as a poet. To Paz her writings, like her life, epitomize the struggle of the individual, and in particular the individual woman, for creative fulfillment and self-expression.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/10/64/9780674821064.jpg', 'title_long': 'Sor Juana: Or, the Traps of Faith', 'dimensions': 'Height: 9.21 Inches, Length: 6.14 Inches, Weight: 1.67992243644 Pounds, Width: 1.14 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.14}, 'width': {'unit': 'inches', 'value': 1.14}, 'weight': {'unit': 'pounds', 'value': 1.67992243644}, 'height': {'unit': 'inches', 'value': 9.21}}, 'pages': 564, 'date_published': '1990-01-02', 'subjects': ['Biographies & Memoirs', 'Community & Culture', 'Women', 'Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Genres & Styles', 'Regional & Cultural'], 'authors': ['Octavio Paz'], 'title': 'Sor Juana: Or, the Traps of Faith', 'isbn13': '9780674821064', 'msrp': 35.5, 'binding': 'Paperback', 'isbn': '0674821068', 'isbn10': '0674821068'}}