{'book': {'publisher': 'Harvard University Press', 'synopsis': 'Plato’s most influential disciple and proponent.<br/><br/>Plotinus (AD 204/5–270), possibly of Roman descent, but certainly a Greek in education and environment, was the first and greatest of Neoplatonic philosophers. Practically nothing is known of his early life, but at the age of 28 he went to Alexandria, and studied philosophy with Ammonius “Saccas” for eleven years. Wishing to learn the philosophy of the Persians and Indians, he joined the expedition of Gordian III against the Persians in 243, not without subsequent danger. Aged 40 he settled in Rome and taught philosophy there till shortly before his death. In 253 he began to write, and continued to do so till the last year of his life. His writings were edited by his disciple Porphyry, who published them many years after his master’s death in six sets of nine treatises each (the Enneads).<br/><br/>Plotinus regarded Plato as his master, and his own philosophy is a profoundly original development of the Platonism of the first two centuries of the Christian era and the closely related thought of the Neopythagoreans, with some influences from Aristotle and his followers and the Stoics, whose writings he knew well but used critically. There is no real trace of Oriental influence on his thought, and he was passionately opposed to Gnosticism. He is a unique combination of mystic and Hellenic rationalist. His thought dominated later Greek philosophy and influenced both Christians and Muslims, and is still alive today because of its union of rationality and intense religious experience.<br/><br/>The Loeb Classical Library edition of Plotinus is in seven volumes.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/48/81/9780674994881.jpg', 'title_long': 'Plotinus: Volume IV, Enneads IV (Loeb Classical Library No. 443)', 'dimensions': 'Height: 6.63 Inches, Length: 4.47 Inches, Weight: 0.65918216338 Pounds, Width: 0.87 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.47}, 'width': {'unit': 'inches', 'value': 0.87}, 'weight': {'unit': 'pounds', 'value': 0.65918216338}, 'height': {'unit': 'inches', 'value': 6.63}}, 'pages': 464, 'date_published': '1984-01-01', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Movements & Periods', 'Politics & Social Sciences', 'Philosophy', 'Greek & Roman'], 'authors': ['Plotinus'], 'title': 'Plotinus: Volume IV, Enneads IV (Loeb Classical Library No. 443)', 'isbn13': '9780674994881', 'msrp': 24, 'binding': 'Hardcover', 'isbn': '0674994884', 'isbn10': '0674994884'}}