{'book': {'publisher': 'Harvard University Press', 'synopsis': 'Short treatises attributed to a great mind.<br/><br/>Aristotle, great Greek philosopher, researcher, reasoner, and writer, born at Stagirus in 384 BC, was the son of a physician. He studied under Plato at Athens and taught there (367–347); subsequently he spent three years at the court of a former pupil in Asia Minor. After some time at Mitylene, in 343–342 he was appointed by King Philip of Macedon to be tutor of his teen-aged son Alexander. After Philip’s death in 336, Aristotle became head of his own school (of “Peripatetics”), the Lyceum at Athens. Because of anti-Macedonian feeling there after Alexander’s death in 323, he withdrew to Chalcis in Euboea, where he died in 322.<br/><br/>Nearly all the works Aristotle prepared for publication are lost; the priceless ones extant are lecture-materials, notes, and memoranda (some are spurious). They can be categorized as follows:<br/><br/>I Practical: Nicomachean Ethics; Great Ethics (Magna Moralia); Eudemian Ethics; Politics; Economics (on the good of the family); On Virtues and Vices.<br/>II Logical: Categories; Analytics (Prior and Posterior); Interpretation; Refutations used by Sophists; Topica.<br/>III Physical: Twenty-six works (some suspect) including astronomy, generation and destruction, the senses, memory, sleep, dreams, life, facts about animals, etc.<br/>IV Metaphysics: on being as being.<br/>V Art: Rhetoric and Poetics.<br/>VI Other works including the Constitution of Athens; more works also of doubtful authorship.<br/>VII Fragments of various works such as dialogues on philosophy and literature; and of treatises on rhetoric, politics, and metaphysics.<br/><br/>The Loeb Classical Library edition of Aristotle is in twenty-three volumes.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/33/89/9780674993389.jpg', 'title_long': 'Aristotle: Minor Works: On Colours. On Things Heard. Physiognomics. On Plants. On Marvellous Things Heard. Mechanical Problems. On Indivisible Lines. ... Gorgias (Loeb Classical Library No. 307)', 'dimensions': 'Height: 6.69 Inches, Length: 4.5 Inches, Weight: 0.7495716908 Pounds, Width: 0.97 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.5}, 'width': {'unit': 'inches', 'value': 0.97}, 'weight': {'unit': 'pounds', 'value': 0.7495716908}, 'height': {'unit': 'inches', 'value': 6.69}}, 'pages': 528, 'date_published': '1936-01-01', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Movements & Periods', 'Politics & Social Sciences', 'Philosophy', 'Greek & Roman'], 'authors': ['Aristotle'], 'title': 'Aristotle: Minor Works: On Colours. On Things Heard. Physiognomics. On Plants. On Marvellous Things Heard. Mechanical Problems. On Indivisible Lines. ... Gorgias (Loeb Classical Library No. 307)', 'isbn13': '9780674993389', 'msrp': '0.00', 'binding': 'Hardcover', 'isbn': '0674993381', 'isbn10': '0674993381'}}