{'book': {'publisher': 'Harvard University Press', 'synopsis': 'The paramount historian of the early Roman empire.<br/><br/>Tacitus (Cornelius), famous Roman historian, was born in AD 55, 56 or 57 and lived to about 120. He became an orator, married in 77 a daughter of Julius Agricola before Agricola went to Britain, was quaestor in 81 or 82, a senator under the Flavian emperors, and a praetor in 88. After four years’ absence he experienced the terrors of Emperor Domitian’s last years and turned to historical writing. He was a consul in 97. Close friend of the younger Pliny, with him he successfully prosecuted Marius Priscus.<br/><br/>Works: (i) Life and Character of Agricola, written in 97–98, specially interesting because of Agricola’s career in Britain. (ii) Germania (98–99), an equally important description of the geography, anthropology, products, institutions, and social life and the tribes of the Germans as known to the Romans. (iii) Dialogue on Oratory (Dialogus), of unknown date; a lively conversation about the decline of oratory and education. (iv) Histories (probably issued in parts from 105 onwards), a great work originally consisting of at least twelve books covering the period AD 69–96, but only Books 1–4 and part of Book 5 survive, dealing in detail with the dramatic years 69–70. (v) Annals, Tacitus’s other great work, originally covering the period AD 14–68 (Emperors Tiberius, Gaius, Claudius, Nero) and published between 115 and about 120. Of sixteen books at least, there survive Books 1–4 (covering the years 14–28); a bit of Book 5 and all Book 6 (31–37); part of Book 11 (from 47); Books 12–15 and part of Book 16 (to 66).<br/><br/>Tacitus is renowned for his development of a pregnant concise style, character study, and psychological analysis, and for the often terrible story which he brilliantly tells. As a historian of the early Roman empire he is paramount.<br/><br/>The Loeb Classical Library edition of Tacitus is in five volumes.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/03/95/9780674990395.jpg', 'title_long': 'Tacitus: I, Agricola. Germania. Dialogus (Loeb Classical Library)', 'edition': 'Revised', 'dimensions': 'Height: 6.37498725 Inches, Length: 4.2499915 Inches, Weight: 0.55997414548 Pounds, Width: 0.912498175 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.2499915}, 'width': {'unit': 'inches', 'value': 0.912498175}, 'weight': {'unit': 'pounds', 'value': 0.55997414548}, 'height': {'unit': 'inches', 'value': 6.37498725}}, 'pages': 384, 'date_published': '1914-01-01', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Movements & Periods', 'Self Service', 'Custom Stores'], 'authors': ['Tacitus'], 'title': 'Tacitus: I, Agricola. Germania. Dialogus (Loeb Classical Library)', 'isbn13': '9780674990395', 'msrp': 26, 'binding': 'Hardcover', 'isbn': '0674990390', 'isbn10': '0674990390'}}