{'book': {'publisher': 'Harvard University Press', 'synopsis': 'A miscellany of minor works.<br/><br/>Xenophon (ca. 430 to ca. 354 BC) was a wealthy Athenian and friend of Socrates. He left Athens in 401 and joined an expedition including ten thousand Greeks led by the Persian governor Cyrus against the Persian king. After the defeat of Cyrus, it fell to Xenophon to lead the Greeks from the gates of Babylon back to the coast through inhospitable lands. Later he wrote the famous vivid account of this “March Up-Country” (Anabasis); but meanwhile he entered service under the Spartans against the Persian king, married happily, and joined the staff of the Spartan king, Agesilaus. But Athens was at war with Sparta in 394 and so exiled Xenophon. The Spartans gave him an estate near Elis where he lived for years, writing and hunting and educating his sons. Reconciled to Sparta, Athens restored Xenophon to honor, but he preferred to retire to Corinth.<br/><br/>Xenophon’s Anabasis is a true story of remarkable adventures. Hellenica, a history of Greek affairs from 411 to 362, begins as a continuation of Thucydides’ account. There are four works on Socrates (collected in LCL 168). In Memorabilia Xenophon adds to Plato’s picture of Socrates from a different viewpoint. The Apology is an interesting complement to Plato’s account of Socrates’ defense at his trial. Xenophon’s Symposium portrays a dinner party at which Socrates speaks of love; and Oeconomicus has him giving advice on household management and married life. Cyropaedia, a historical romance on the education of Cyrus (the Elder), reflects Xenophon’s ideas about rulers and government.<br/><br/>We also have his Hiero, a dialogue on government; Agesilaus, in praise of that king; Constitution of Lacedaemon (on the Spartan system); Ways and Means (on the finances of Athens); Manual for a Cavalry Commander; a good manual of Horsemanship; and a lively Hunting with Hounds―mostly hare hunting. The Constitution of the Athenians, though clearly not by Xenophon, is an interesting document on politics at Athens. These eight books are collected in the present volume.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/20/23/9780674992023.jpg', 'title_long': 'Xenophon VII (Hiero. Agesilaus. Constitution of the Lacedaemonians. Ways and Means. Cavalry Commander. Art of Horsemanship. On Hunting. Constitution of the Athenians) Loeb Classical Library', 'edition': 'Revised', 'dimensions': 'Height: 6.7 Inches, Length: 4.63 Inches, Weight: 0.7605948039 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.63}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.7605948039}, 'height': {'unit': 'inches', 'value': 6.7}}, 'pages': 576, 'date_published': '1925-01-01', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Movements & Periods', 'Travel', 'Travel Writing', 'Politics & Social Sciences', 'Philosophy', 'Greek & Roman'], 'authors': ['Xenophon'], 'title': 'Xenophon VII (Hiero. Agesilaus. Constitution of the Lacedaemonians. Ways and Means. Cavalry Commander. Art of Horsemanship. On Hunting. Constitution of the Athenians) Loeb Classical Library', 'isbn13': '9780674992023', 'msrp': 24, 'binding': 'Hardcover', 'isbn': '0674992024', 'isbn10': '0674992024'}}