{'book': {'publisher': 'Harvard University Press', 'synopsis': 'Pulitzer Prize–winning novelist Toni Morrison brings the genius of a master writer to this personal inquiry into the significance of African-Americans in the American literary imagination. Her goal, she states at the outset, is to “put forth an argument for extending the study of American literature…draw a map, so to speak, of a critical geography and use that map to open as much space for discovery, intellectual adventure, and close exploration as did the original charting of the New World―without the mandate for conquest.”<br/><br/>Author of Beloved, The Bluest Eye, Song of Solomon, and other vivid portrayals of black American experience, Morrison ponders the effect that living in a historically racialized society has had on American writing in the nineteenth and twentieth centuries. She argues that race has become a metaphor, a way of referring to forces, events, and forms of social decay, economic division, and human panic. Her compelling point is that the central characteristics of American literature individualism, masculinity, the insistence upon innocence coupled to an obsession with figurations of death and hell―are responses to a dark and abiding Africanist presence.<br/><br/>Through her investigation of black characters, narrative strategies, and idiom in the fiction of white American writers, Morrison provides a daring perspective that is sure to alter conventional notions about American literature. She considers Willa Cather and the impact of race on concept and plot; turns to Poe, Hawthorne, and Melville to examine the black force that figures so significantly in the literature of early America; and discusses the implications of the Africanist presence at the heart of Huckleberry Finn. A final chapter on Ernest Hemingway is a brilliant exposition of the racial subtext that glimmers beneath the surface plots of his fiction.<br/><br/>Written with the artistic vision that has earned her a preeminent place in modern letters, Playing in the Dark will be avidly read by Morrison admirers as well as by students, critics, and scholars of American literature.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/37/79/9780674673779.jpg', 'title_long': 'Playing in the Dark : Whiteness and the Literary Imagination', 'edition': 'First Edition ~1st Printing', 'dimensions': 'Height: 8.5 Inches, Length: 5.75 Inches, Weight: 0.59965735264 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.59965735264}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 91, 'date_published': '1992-05-01', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Regional & Cultural', 'Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies', 'Sociology', 'Race Relations', 'Self Service', 'Custom Stores'], 'authors': ['Toni Morrison'], 'title': 'Playing in the Dark : Whiteness and the Literary Imagination', 'isbn13': '9780674673779', 'msrp': 31, 'binding': 'Hardcover', 'isbn': '0674673778', 'isbn10': '0674673778'}}