{'book': {'publisher': 'Harvard University Press', 'synopsis': 'Through a twist of fate that the author of Labyrinths himself would have relished, these lost lectures given in English at Harvard in 1967–1968 by Jorge Luis Borges return to us now, a recovered tale of a life-long love affair with literature and the English language. Transcribed from tapes only recently discovered, This Craft of Verse captures the cadences, candor, wit, and remarkable erudition of one of the most extraordinary and enduring literary voices of the twentieth century. In its wide-ranging commentary and exquisite insights, the book stands as a deeply personal yet far-reaching introduction to the pleasures of the word, and as a first-hand testimony to the life of literature.<br/><br/>Though his avowed topic is poetry, Borges explores subjects ranging from prose forms (especially the novel), literary history, and translation theory to philosophical aspects of literature in particular and communication in general. Probably the best-read citizen of the globe in his day, he draws on a wealth of examples from literature in modern and medieval English, Spanish, French, Italian, German, Greek, Latin, Arabic, Hebrew, and Chinese, speaking with characteristic eloquence on Plato, the Norse kenningar, Byron, Poe, Chesterton, Joyce, and Frost, as well as on translations of Homer, the Bible, and the Rubáiyát of Omar Khayyám.<br/><br/>Whether discussing metaphor, epic poetry, the origins of verse, poetic meaning, or his own “poetic creed,” Borges gives a performance as entertaining as it is intellectually engaging. A lesson in the love of literature and in the making of a unique literary sensibility, this is a sustained encounter with one of the writers by whom the twentieth century will be long remembered.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/82/05/9780674008205.jpg', 'title_long': 'This Craft of Verse (The Charles Eliot Norton Lectures)', 'edition': 'Illustrated', 'dimensions': 'Height: 8.2 Inches, Length: 5.4 Inches, Weight: 0.35053499658 Pounds, Width: 0.4 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.4}, 'width': {'unit': 'inches', 'value': 0.4}, 'weight': {'unit': 'pounds', 'value': 0.35053499658}, 'height': {'unit': 'inches', 'value': 8.2}}, 'pages': 160, 'date_published': '2002-03-30', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Genres & Styles', 'Poetry', 'Ancient, Classical & Medieval', 'Self Service', 'Custom Stores'], 'authors': ['Jorge Luis Borges'], 'title': 'This Craft of Verse (The Charles Eliot Norton Lectures)', 'isbn13': '9780674008205', 'msrp': '0.00', 'binding': 'Paperback', 'related': {'eBook': '0674252616'}, 'isbn': '0674008200', 'isbn10': '0674008200', 'other_isbns': [{'isbn': '9780674252608', 'binding': 'ebook'}, {'isbn': '9780674252615', 'binding': 'ebook'}]}}