{'book': {'publisher': 'Harvard University Press', 'synopsis': 'Bernard Williams is an eloquent member of that small but important group of distinguished thinkers who are trying to erase the borders between the experts and all of us who grapple with moral issues in our own lives. In this book he delivers a sustained indictment of systematic moral theory from Kant onward and offers a persuasive alternative.<br/><br/>Kant’s ideas involved a view of the self we can no longer accept. Modern theories such as utilitarianism and contractualism usually offer criteria that lie outside the self altogether, and this, together with an emphasis on system, has weakened ethical thought. Why should a set of ideas have any special authority over our sentiments just because it has the structure of a theory? How could abstract theory help the individual answer the Socratic question “How should I live?”<br/><br/>Williams’s goal is nothing less than to reorient ethics toward the individual. He accuses modern moral philosophers of retreating to system and deserting individuals in their current social context. He believes that the ethical work of Plato and Aristotle is nearer to the truth of what ethical life is, but at the same time recognizes that the modern world makes unparalleled demands on ethical thought. He deals with the most thorny questions in contemporary philosophy and offers new ideas about issues such as relativism, objectivity, and the possibility of ethical knowledge. Williams has written an imaginative, ingenious book that calls for philosophers to transcend their self-imposed limits and to give full attention to the complexities of the ethical life.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/85/86/9780674268586.jpg', 'title_long': 'Ethics and the Limits of Philosophy', 'dimensions': 'Height: 9.29 Inches, Length: 6.1 Inches, Weight: 0.63 Pounds, Width: 0.65 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.1}, 'width': {'unit': 'inches', 'value': 0.65}, 'weight': {'unit': 'pounds', 'value': 0.63}, 'height': {'unit': 'inches', 'value': 9.29}}, 'pages': 244, 'date_published': '1986-03-15', 'subjects': ['Politics & Social Sciences', 'Philosophy', 'Ethics & Morality', 'Self Service', 'Custom Stores'], 'authors': ['Bernard Williams'], 'title': 'Ethics and the Limits of Philosophy', 'isbn13': '9780674268586', 'msrp': 25.5, 'binding': 'Paperback', 'isbn': '067426858X', 'isbn10': '067426858X'}}