{'book': {'publisher': 'Harvard University Press', 'synopsis': 'In this extensive inquiry into the sources of modern selfhood, Charles Taylor demonstrates just how rich and precious those resources are. The modern turn to subjectivity, with its attendant rejection of an objective order of reason, has led―it seems to many―to mere subjectivism at the mildest and to sheer nihilism at the worst. Many critics believe that the modern order has no moral backbone and has proved corrosive to all that might foster human good. Taylor rejects this view. He argues that, properly understood, our modern notion of the self provides a framework that more than compensates for the abandonment of substantive notions of rationality.<br/><br/>The major insight of Sources of the Self is that modern subjectivity, in all its epistemological, aesthetic, and political ramifications, has its roots in ideas of human good. After first arguing that contemporary philosophers have ignored how self and good connect, the author defines the modern identity by describing its genesis. His effort to uncover and map our moral sources leads to novel interpretations of most of the figures and movements in the modern tradition. Taylor shows that the modern turn inward is not disastrous but is in fact the result of our long efforts to define and reach the good. At the heart of this definition he finds what he calls the affirmation of ordinary life, a value which has decisively if not completely replaced an older conception of reason as connected to a hierarchy based on birth and wealth. In telling the story of a revolution whose proponents have been Augustine, Montaigne, Luther, and a host of others, Taylor’s goal is in part to make sure we do not lose sight of their goal and endanger all that has been achieved. Sources of the Self provides a decisive defense of the modern order and a sharp rebuff to its critics.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/42/63/9780674824263.jpg', 'title_long': 'Sources of the Self: The Making of the Modern Identity', 'edition': 'Reprint', 'dimensions': 'Height: 9.1 Inches, Length: 6.32 Inches, Weight: 1.86070149128 pounds, Width: 1.54 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.32}, 'width': {'unit': 'inches', 'value': 1.54}, 'weight': {'unit': 'pounds', 'value': 1.86070149128}, 'height': {'unit': 'inches', 'value': 9.1}}, 'pages': 624, 'date_published': '1992-03-01', 'subjects': ['Politics & Social Sciences', 'Philosophy', 'Consciousness & Thought', 'Modern', 'Self Service', 'Custom Stores'], 'authors': ['Charles Taylor'], 'title': 'Sources of the Self: The Making of the Modern Identity', 'isbn13': '9780674824263', 'msrp': 39, 'binding': 'Paperback', 'isbn': '0674824261', 'isbn10': '0674824261', 'other_isbns': [{'isbn': '9780674257047', 'binding': 'ebook'}]}}