{'book': {'publisher': 'Modern Library', 'synopsis': 'Read John Berendt\'s Midnight in the Garden of Good and Evil in Large Print.<br/><br/>* All Random House Large Print editions are published in a 16-point typeface<br/><br/>Shots rang out in Savannah\'s grandest mansion in the misty,early morning hours of May 2, 1981. Was it murder or self-defense? For nearly a decade, the shooting and its aftermath reverberated throughout this hauntingly beautiful city of moss-hung oaks and shaded squares. John Berendt\'s sharply observed, suspenseful, and witty narrative reads like a thoroughly engrossing novel, and yet it is a work of nonfiction. Berendt skillfully interweaves a hugely entertaining first-person account of life in this isolated remnant of the Old South with the unpredictable twists and turns of a landmark murder case.<br/><br/>It is a spellbinding story peopled by a gallery of remarkable characters: the well-bred society ladies of the Married Woman\'s Card Club; the turbulent young redneck gigolo; the hapless recluse who owns a bottle of poison so powerful it could kill every man, woman, and child in Savannah; the aging and profane Southern belle who is the "soul of pampered self-absorption"; the uproariously funny black drag queen; the acerbic and arrogant antiques dealer; the sweet-talking, piano-playing con artist; young blacks dancing the minuet at the black debutante ball; and Minerva, the voodoo priestess who works her magic in the graveyard at midnight. These and other Savannahians act as a Greek chorus, with Berendt revealing the alliances, hostilities, and intrigues that thrive in a town where everyone knows everyone else.<br/><br/>Midnight in the Garden of Good and Evil: A Savannah Story is a sublime and seductive reading experience. Brilliantly conceived and masterfully written, this enormously engaging portrait of a most beguiling Southern city is certain to become a modern classic.<br/><br/>From the Trade Paperback edition.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/34/18/9780679643418.jpg', 'title_long': 'Midnight in the Garden of Good and Evil (Modern Library)', 'edition': 'First Edition', 'dimensions': 'Height: 8.25 Inches, Length: 5.75 Inches, Weight: 1.16 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.16}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 416, 'date_published': '2005-09-27', 'subjects': ['Biographies & Memoirs', 'True Crime', 'Murder & Mayhem', 'History', 'Americas', 'United States', 'Politics & Social Sciences', 'Social Sciences', 'Customs & Traditions'], 'authors': ['John Berendt'], 'title': 'Midnight in the Garden of Good and Evil (Modern Library)', 'isbn13': '9780679643418', 'msrp': '0.00', 'binding': 'Hardcover', 'isbn': '0679643419', 'isbn10': '0679643419'}}