{'book': {'publisher': 'Chatto and Windus', 'synopsis': 'Selected by the Modern Library as one of the 100 best novels of all time<br/><br/>From the Modern Library’s new set of beautifully repackaged hardcover classics by William Faulkner—also available are Snopes, As I Lay Dying, The Sound and the Fury, Absalom, Absalom!, and Selected Short Stories<br/><br/>One of William Faulkner’s most admired and accessible novels, Light in August reveals the great American author at the height of his powers. Lena Grove’s resolute search for the father of her unborn child begets a rich, poignant, and ultimately hopeful story of perseverance in the face of mortality. It also acquaints us with several of Faulkner’s most unforgettable characters, including the Reverend Gail Hightower, plagued by visions of Confederate horsemen, and Joe Christmas, a ragged, itinerant soul obsessed with his mixed-race ancestry. Powerfully entwining these characters’ stories, Light in August brings to life Faulkner’s imaginary South, one of literature’s great invented landscapes, in all of its unerringly fascinating glory. Along with a new Foreword by C. E. Morgan, this edition reproduces the corrected text of Light in August as established in 1985 by Faulkner expert Noel Polk.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/24/80/9780679642480.jpg', 'title_long': 'Light in August', 'dimensions': 'Height: 8.3 Inches, Length: 5.6 Inches, Weight: 1.26324876126 Pounds, Width: 1.2 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.6}, 'width': {'unit': 'inches', 'value': 1.2}, 'weight': {'unit': 'pounds', 'value': 1.26324876126}, 'height': {'unit': 'inches', 'value': 8.3}}, 'pages': 480, 'date_published': '1952', 'subjects': ['Literature & Fiction', 'Classics'], 'authors': ['William Faulkner'], 'title': 'Light in August', 'isbn13': '9780679642480', 'msrp': 23, 'binding': 'Unknown Binding', 'isbn': '067964248X', 'isbn10': '067964248X', 'other_isbns': [{'isbn': '9780307792174', 'binding': 'print'}]}}