{'book': {'publisher': "Everyman's Library", 'synopsis': 'Introduction by Peter Washington; Translation by William Weaver<br/><br/>Italo Calvino’s masterpiece combines a love story and a detective story into an exhilarating allegory of reading, in which the reader of the book becomes the book’s central character.<br/><br/>Based on a witty analogy between the reader’s desire to finish the story and the lover’s desire to consummate his or her passion, IF ON A WINTER’S NIGHT A TRAVELER is the tale of two bemused readers whose attempts to reach the end of the same book—IF ON A WINTER’S NIGHT A TRAVELER, by Italo Calvino, of course—are constantly and comically frustrated. In between chasing missing chapters of the book, the hapless readers tangle with an international conspiracy, a rogue translator, an elusive novelist, a disintegrating publishing house, and several oppressive governments. The result is a literary labyrinth of storylines that interrupt one another—an Arabian Nights of the postmodern age.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/02/55/9780679420255.jpg', 'title_long': "If on a Winter's Night a Traveler: Introduction by Peter Washington (Everyman's Library Contemporary Classics Series)", 'edition': 'unknown', 'dimensions': 'Height: 8.29 Inches, Length: 5.19 Inches, Weight: 0.925 Pounds, Width: 0.88 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.19}, 'width': {'unit': 'inches', 'value': 0.88}, 'weight': {'unit': 'pounds', 'value': 0.925}, 'height': {'unit': 'inches', 'value': 8.29}}, 'pages': 304, 'date_published': '1993-06-01', 'subjects': ['Literature & Fiction', 'Classics', 'Genre Fiction', 'Psychological', 'Contemporary', 'Literary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Psychological Thrillers', 'Self Service', 'Custom Stores'], 'authors': ['Italo Calvino'], 'title': "If on a Winter's Night a Traveler: Introduction by Peter Washington (Everyman's Library Contemporary Classics Series)", 'isbn13': '9780679420255', 'msrp': '0.00', 'binding': 'Hardcover', 'isbn': '0679420258', 'isbn10': '0679420258'}}