{'book': {'publisher': 'Modern Library', 'synopsis': 'WINNER OF THE PULITZER PRIZE • After more than a quarter of a century and three million copies in print, Michael Shaara’s Civil War classic, The Killer Angels, remains as vivid and powerful as the day it was originally published.<br/><br/>July 1863. The Confederate Army of Northern Virginia is invading the North. General Robert E. Lee has made this daring and massive move with seventy thousand men in a determined effort to draw out the Union Army of the Potomac and mortally wound it. His right hand is General James Longstreet, a brooding man who is loyal to Lee but stubbornly argues against his plan. Opposing them is an unknown factor: General George Meade, who has taken command of the Army only two days before what will be perhaps the crucial battle of the Civil War.<br/><br/>In the four most bloody and courageous days of our nation’s history, two armies fight for two conflicting dreams. One dreams of freedom, the other of a way of life. More than rifles and bullets are carried into battle. The soldiers carry memories. Promises. Love. And more than men fall on those Pennsylvania fields. Bright futures, untested innocence, and pristine beauty are also the casualties of war.<br/><br/>The Killer Angels is unique, sweeping, unforgettable–a dramatic re-creation of the battleground for America’s destiny.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/32/41/9780679643241.jpg', 'title_long': 'The Killer Angels: A Novel of the Civil War', 'edition': 'First Thus', 'dimensions': 'Height: 8.31 Inches, Length: 5.57 Inches, Weight: 1.01192178258 Pounds, Width: 1.11 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.57}, 'width': {'unit': 'inches', 'value': 1.11}, 'weight': {'unit': 'pounds', 'value': 1.01192178258}, 'height': {'unit': 'inches', 'value': 8.31}}, 'pages': 368, 'date_published': '2004-11-02', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'War', 'Action & Adventure', 'War & Military', 'Classics', 'United States'], 'authors': ['Michael Shaara'], 'title': 'The Killer Angels: A Novel of the Civil War', 'isbn13': '9780679643241', 'msrp': 24, 'binding': 'Hardcover', 'isbn': '0679643249', 'isbn10': '0679643249', 'other_isbns': [{'isbn': '9780345513731', 'binding': 'print'}]}}