{'book': {'publisher': 'Vintage', 'synopsis': 'Hailed by Washington Post Book World as “the best [translation] currently available" when it was first published, this second edition of Crime and Punishment has been updated in honor of the 200th anniversary of Dostoevsky’s birth. • ONE OF TIME MAGAZINE\'S 100 BEST MYSTERY AND THRILLER BOOKS OF ALL TIME<br/><br/>With the same suppleness, energy, and range of voices that won their translation of The Brothers Karamazov the PEN/Book-of-the-Month Club Prize, Richard Pevear and Larissa Volokhonsky offer a brilliant translation of Crime and Punishment, Dostoevsky\'s astounding pyschological thriller, newly revised for his bicentenniel.<br/><br/>In Crime and Punishment, when Raskolnikov, an impoverished student living in the St. Petersburg of the tsars, commits an act of murder and theft, he sets into motion a story that is almost unequalled in world literature for its excruciating suspense, its atmospheric vividness, and its depth of characterization and vision. Dostoevsky’s drama of sin, guilt, and redemption transforms the sordid story of an old woman’s murder into the nineteenth century’s profoundest and most compelling philosophical novel.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/45/05/9780679734505.jpg', 'title_long': 'Crime and Punishment (Vintage Classics)', 'edition': 'Reprint', 'dimensions': 'Height: 7.99 Inches, Length: 5.19 Inches, Weight: 0.95 Pounds, Width: 1.03 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.19}, 'width': {'unit': 'inches', 'value': 1.03}, 'weight': {'unit': 'pounds', 'value': 0.95}, 'height': {'unit': 'inches', 'value': 7.99}}, 'pages': 565, 'date_published': '1993-03-02', 'subjects': ['Literature & Fiction', 'Classics', 'History & Criticism', 'Regional & Cultural', 'World Literature', 'Russian & Soviet', 'Literary', 'Self Service', 'Custom Stores'], 'authors': ['Fyodor Dostoevsky'], 'title': 'Crime and Punishment (Vintage Classics)', 'isbn13': '9780679734505', 'msrp': 17.95, 'binding': 'Paperback', 'related': {'ePub': '030782960X'}, 'isbn': '0679734503', 'isbn10': '0679734503', 'other_isbns': [{'isbn': '9780307829603', 'binding': 'printisbn'}]}}