{'book': {'publisher': 'Vintage', 'synopsis': '"Norwich is always on the lookout for the small but revealing details. . . . All of this he recounts in a style that consistently entertains."<br/>--The New York Times Book Review<br/><br/>In this magisterial adaptation of his epic three-volume history of Byzantium, John Julius Norwich chronicles the world\'s longest-lived Christian empire. Beginning with Constantine the Great, who in a.d. 330 made Christianity the religion of his realm and then transferred its capital to the city that would bear his name, Norwich follows the course of eleven centuries of Byzantine statecraft and warfare, politics and theology, manners and art.<br/><br/>In the pages of A Short History of Byzantium we encounter mystics and philosophers, eunuchs and barbarians, and rulers of fantastic erudition, piety, and degeneracy. We enter the life of an empire that could create some of the world\'s most transcendent religious art and then destroy it in the convulsions of fanaticism. Stylishly written and overflowing with drama, pathos, and wit, here is a matchless account of a lost civilization and its magnificent cultural legacy.<br/><br/>"Strange and fascinating . . . filled with drollery and horror."<br/>--Boston Globe', 'language': 'en', 'image': 'https://images.isbndb.com/covers/26/99/9780679772699.jpg', 'title_long': 'A Short History of Byzantium', 'edition': 'Reprint', 'dimensions': 'Height: 7.97 Inches, Length: 5.18 Inches, Weight: 0.9 Pounds, Width: 1.07 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.18}, 'width': {'unit': 'inches', 'value': 1.07}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 7.97}}, 'pages': 496, 'date_published': '1998-12-29', 'subjects': ['Arts & Photography', 'History & Criticism', 'History', 'Ancient Civilizations', 'Rome', 'Asia', 'Europe', 'Military', 'World', 'Civilization & Culture'], 'authors': ['John Julius Norwich'], 'title': 'A Short History of Byzantium', 'isbn13': '9780679772699', 'msrp': 20, 'binding': 'Paperback', 'isbn': '0679772693', 'isbn10': '0679772693'}}