{'book': {'publisher': 'Modern Library', 'synopsis': 'The classic novel of a quest for knowledge that has delighted, inspired, and influenced generations of readers, writers, and thinkers.<br/><br/>Nominated as one of America’s best-loved novels by PBS’s The Great American Read<br/><br/>Though set in a place and time far removed from the Germany of 1922, the year of the book’s debut, the novel is infused with the sensibilities of Hermann Hesse’s time, synthesizing disparate philosophies–Eastern religions, Jungian archetypes, Western individualism–into a unique vision of life as expressed through one man’s search for meaning.<br/><br/>It is the story of the quest of Siddhartha, a wealthy Indian Brahmin who casts off a life of privilege and comfort to seek spiritual fulfillment and wisdom. On his journey, Siddhartha encounters wandering ascetics, Buddhist monks, and successful merchants, as well as a courtesan named Kamala and a simple ferryman who has attained enlightenment. Traveling among these people and experiencing life’s vital passages–love, work, friendship, and fatherhood–Siddhartha discovers that true knowledge is guided from within.<br/><br/>Susan Bernofsky’s magnificent translation brings out Hesse’s inspired lyricism and his elegant, melodious cadences, illuminating the novel’s universal themes and timeless wisdom about the human condition.<br/><br/>This original Modern Library edition includes a lively new Introduction by Tom Robbins and a glossary of Indian terms.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/33/64/9780679643364.jpg', 'title_long': 'Siddhartha (Modern Library)', 'edition': 'Modern Library', 'dimensions': 'Height: 7.25 Inches, Length: 4.75 Inches, Weight: 0.5 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.75}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.5}, 'height': {'unit': 'inches', 'value': 7.25}}, 'pages': 160, 'date_published': '2006-07-18', 'subjects': ['Literature & Fiction', 'Classics', 'Genre Fiction', 'Historical', 'United States', 'Literary', 'Religion & Spirituality'], 'authors': ['Hermann Hesse'], 'title': 'Siddhartha (Modern Library)', 'isbn13': '9780679643364', 'msrp': 16.95, 'binding': 'Hardcover', 'isbn': '0679643362', 'isbn10': '0679643362'}}