{'book': {'publisher': 'Modern Library', 'synopsis': 'NEW YORK TIMES BESTSELLER • Maya Angelou’s classic memoirs have had an enduring impact on American literature and culture. Her life story is told in the documentary film And Still I Rise, as seen on PBS’s American Masters.<br/><br/>This Modern Library edition contains I Know Why the Caged Bird Sings, Gather Together in My Name, Singin’ and Swingin’ and Gettin’ Merry Like Christmas, The Heart of a Woman, All God’s Children Need Traveling Shoes, and A Song Flung Up to Heaven.<br/><br/>When I Know Why the Caged Bird Sings was published to widespread acclaim in 1969, Maya Angelou garnered the attention of an international audience with the triumphs and tragedies of her childhood in the American South. This soul-baring memoir launched a six-book epic spanning the sweep of the author’s incredible life. Now, for the first time, all six celebrated and bestselling autobiographies are available in this handsome one-volume edition.<br/><br/>Dedicated fans and newcomers alike can follow the continually absorbing chronicle of Angelou’s life: her formative childhood in Stamps, Arkansas; the birth of her son, Guy, at the end of World War II; her adventures traveling abroad with the famed cast of Porgy and Bess; her experience living in a black expatriate “colony” in Ghana; her intense involvement with the civil rights movement, including her association with Dr. Martin Luther King, Jr., and Malcolm X; and, finally, the beginning of her writing career.<br/><br/>The Collected Autobiographies of Maya Angelou traces the best and worst of the American experience in an achingly personal way. Angelou has chronicled her remarkable journey and inspired people of every generation and nationality to embrace life with commitment and passion.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/32/58/9780679643258.jpg', 'title_long': 'The Collected Autobiographies of Maya Angelou Modern Library Hardcover', 'edition': 'F First Edition Used', 'dimensions': 'Height: 8.3 Inches, Length: 5.73 Inches, Weight: 2.36335544864 Pounds, Width: 2.2 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.73}, 'width': {'unit': 'inches', 'value': 2.2}, 'weight': {'unit': 'pounds', 'value': 2.36335544864}, 'height': {'unit': 'inches', 'value': 8.3}}, 'pages': 1184, 'date_published': '2004-09-21', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Actors & Entertainers', 'Authors', 'Community & Culture', 'Black & African American', 'Women', 'Historical', 'United States', 'Leaders & Notable People', 'Military', 'Memoirs', 'Regional U.S.', 'South', 'Humor & Entertainment', 'Self Service', 'Custom Stores'], 'authors': ['Maya Angelou'], 'title': 'The Collected Autobiographies of Maya Angelou Modern Library Hardcover', 'isbn13': '9780679643258', 'msrp': 19.99, 'binding': 'Hardcover', 'related': {'Kindle Edition': '030743205X', 'ePub': '030743205X'}, 'isbn': '0679643257', 'isbn10': '0679643257', 'other_isbns': [{'isbn': '9780307432056', 'binding': 'printisbn'}]}}