{'book': {'publisher': 'Scribner', 'synopsis': "Told by the man who kicked off the infamous lawsuit between Oprah and the cattlemen, Mad Cowboy is an impassioned account of the highly dangerous practices of the cattle and dairy industries.<br/><br/>Howard Lyman's testimony on The Oprah Winfrey Show revealed the deadly impact of the livestock industry on our well-being. It not only led to Oprah's declaration that she'd never eat a burger again, it sent shock waves through a concerned and vulnerable public.<br/><br/>A fourth-generation Montana rancher, Lyman investigated the use of chemicals in agriculture after developing a spinal tumor that nearly paralyzed him. Now a vegetarian, he blasts through the propaganda of beef and dairy interests—and the government agencies that protect them—to expose an animal-based diet as the primary cause of cancer, heart disease, and obesity in this country. He warns that the livestock industry is repeating the mistakes that led to Mad Cow disease in England while simultaneously causing serious damage to the environment.<br/><br/>Persuasive, straightforward, and full of the down-home good humor and optimism of a son of the soil, Mad Cowboy is both an inspirational story of personal transformation and a convincing call to action for a plant-based diet—for the good of the planet and the health of us all.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/44/65/9780684854465.jpg', 'title_long': "Mad Cowboy: Plain Truth from the Cattle Rancher Who Won't Eat Meat", 'edition': 'Later Printing', 'dimensions': 'Height: 8.4375 Inches, Length: 5.5 Inches, Weight: 0.47 Pounds, Width: 0.56 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.56}, 'weight': {'unit': 'pounds', 'value': 0.47}, 'height': {'unit': 'inches', 'value': 8.4375}}, 'pages': 224, 'date_published': '2001-08-02', 'subjects': ['Health, Fitness & Dieting', 'Diets & Weight Loss', 'Other Diets', 'Vegetarian', 'Nutrition', 'Medical Books'], 'authors': ['Howard F. Lyman', 'Glen Merzer'], 'title': "Mad Cowboy: Plain Truth from the Cattle Rancher Who Won't Eat Meat", 'isbn13': '9780684854465', 'msrp': 16, 'binding': 'Paperback', 'related': {'ePub': '0743219058'}, 'isbn': '0684854465', 'isbn10': '0684854465', 'other_isbns': [{'isbn': '9780743219051', 'binding': 'print'}]}}