{'book': {'publisher': 'Scribner', 'synopsis': "A master teacher in his own right, Giuliano Hazan learned the art of Italian cooking from the authority on Italian cooking—his mother, Marcella Hazan. When his first bestseller The Classic Pasta Cookbook appeared, Newsday exclaimed: “What a good cook he is, and what a clear and useful book he has made. He learned his mother's lessons well.”<br/><br/>In Every Night Italian, he writes for a new generation, addressing the concerns most often expressed by students in his cooking classes: how to make good, authentic Italian meals, with ingredients from the supermarket, when there's not much time to spend in the kitchen. With a pantry of basic Italian ingredients and detailed line drawings of the essential techniques for cutting a pepper, trimming an artichoke, sharpening a knife, and more, Giuliano Hazan teaches home cooks to prepare real Italian food like never before: quickly and easily. The 120 recipes in this book—from appetizers to desserts—each take less than forty-five minutes to prepare.<br/><br/>In his chapter on menu suggestions—Simple Family Menus, Elegant Sit-Down Menus, Buffet and Picnic Menus—which groups complementary dishes, Hazan also teaches home cooks how to organize their time in the kitchen and how to prepare several dishes simultaneously, making it even easier to produce a satisfying and balanced Italian meal for any occasion.<br/><br/>Americans love Italian food because of its genuine flavors and fresh ingredients. Now with the help of Giuliano Hazan, they will be delighted to learn that it has another wonderful virtue: it can be very simple and quick to prepare.<br/><br/>50 drawings of essential techniques<br/><br/>16 color photographs of finished dishes", 'language': 'en', 'image': 'https://images.isbndb.com/covers/02/88/9780684800288.jpg', 'title_long': 'Every Night Italian: 120 Simple, Delicious Recipes You Can Make in 45 Minutes or Less', 'edition': 'First Edition', 'dimensions': 'Height: 9.4 inches, Length: 8.4 inches, Width: 0.9 inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.4}, 'width': {'unit': 'inches', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 9.4}}, 'pages': 256, 'date_published': '2000-01-12', 'subjects': ['Cookbooks, Food & Wine', 'Beverages & Wine', 'Wine & Spirits', 'Quick & Easy', 'Regional & International', 'European'], 'authors': ['Giuliano Hazan'], 'title': 'Every Night Italian: 120 Simple, Delicious Recipes You Can Make in 45 Minutes or Less', 'isbn13': '9780684800288', 'msrp': '0.00', 'binding': 'Hardcover', 'isbn': '0684800284', 'isbn10': '0684800284'}}