{'book': {'publisher': 'Scribner', 'synopsis': "Does God Exist and Does He Care?<br/>In April 1997 Reynolds Price received an eloquent letter from a reader of his cancer memoir, A Whole New Life. The correspondent, a young medical student diagnosed with cancer himself and facing his own mortality, asked these difficultQuestions. The two began a long-distance correspondence, culminating in Price's thoughtful response, originally delivered as the Jack and Lewis Rudin Lecture at Auburn Theological Seminary, and now expanded onto the printed page as Letter to a Man in the Fire.<br/>Harvesting a variety of sources -- diverse religious traditions, classical and modern texts, and a lifetime of personal experiences, interactions, and spiritual encounters -- Price meditates on God's participation in our fate. With candor and sympathy, he offers the reader such a rich variety of tools to explore these questions as to place this work in the company of other great tetsaments of faith from St. Augustine to C. S. Lewis.<br/>Letter to a Man in the Fire moves as much as it educates. It is a rare combination of deep erudition, vivid prose, and profound humanity.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/62/78/9780684856278.jpg', 'title_long': 'Letter To A Man In The Fire: Does God Exist And Does He Care', 'dimensions': 'Height: 8 Inches, Length: 5 Inches, Weight: 0.24912235606 Pounds, Width: 0.3 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5}, 'width': {'unit': 'inches', 'value': 0.3}, 'weight': {'unit': 'pounds', 'value': 0.24912235606}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 112, 'date_published': '2000-10-17', 'subjects': ['Christian Books & Bibles', 'Christian Living', 'Faith', 'Theology', 'Religion & Spirituality', 'Religious Studies', 'Philosophy', 'Worship & Devotion', 'Inspirational'], 'authors': ['Reynolds Price'], 'title': 'Letter To A Man In The Fire: Does God Exist And Does He Care', 'isbn13': '9780684856278', 'msrp': 9.43, 'binding': 'Paperback', 'related': {'Kindle Edition': '1439105197', 'ePub': '1439105197'}, 'isbn': '0684856271', 'isbn10': '0684856271', 'other_isbns': [{'isbn': '9781439105191', 'binding': 'print'}]}}