{'book': {'publisher': 'Simon & Schuster', 'synopsis': 'An original and groundbreaking examination of the psychological devastation of war through the lens of Homer’s Iliad in this “compassionate book [that] deserves a place in the lasting literature of the Vietnam War” (The New York Times).<br/><br/>In this moving and dazzlingly creative book, Dr. Jonathan Shay examines the psychological devastation of war by comparing the soldiers of Homer’s Iliad with Vietnam veterans suffering from post-traumatic stress disorder. A classic of war literature that has as much relevance as ever in the wake of the wars in Iraq and Afghanistan, Achilles in Vietnam is a “transcendent literary adventure” (The New York Times) and “clearly one of the most original and most important scholarly works to have emerged from the Vietnam War” (Tim O’Brien, author of The Things They Carried).<br/><br/>As a Veterans Affairs psychiatrist, Shay encountered devastating stories of unhealed PTSD and uncovered the painful paradox—that fighting for one’s country can render one unfit to be a citizen. With a sensitive and compassionate examination of the battles many Vietnam veterans continue to fight, Shay offers readers a greater understanding of PTSD and how to alleviate the potential suffering of soldiers. Although the Iliad was written twenty-seven centuries ago, Shay shows how it has much to teach about combat trauma, as do the more recent, compelling voices and experiences of Vietnam vets.<br/><br/>A groundbreaking and provocative monograph, Achilles in Vietnam takes readers on a literary journey that demonstrates how we can learn how war damages the mind and spirit, and work to change those things in our culture that so that we don’t continue repeating the same mistakes.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/32/19/9780684813219.jpg', 'title_long': 'Achilles in Vietnam: Combat Trauma and the Undoing of Character', 'edition': 'First Thus', 'dimensions': 'Height: 8.4375 Inches, Length: 5.5 Inches, Weight: 0.55997414548 Pounds, Width: 0.68 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.68}, 'weight': {'unit': 'pounds', 'value': 0.55997414548}, 'height': {'unit': 'inches', 'value': 8.4375}}, 'pages': 246, 'date_published': '1995-10-01', 'subjects': ['Health, Fitness & Dieting', 'Mental Health', 'Post-traumatic Stress Disorder', 'Psychology & Counseling', 'Counseling', 'Neuropsychology', 'Pathologies', 'Psychotherapy, TA & NLP', 'History', 'Military', 'Naval', 'United States', 'Vietnam War', 'Medical Books', 'Psychology', 'General'], 'authors': ['Jonathan Shay'], 'title': 'Achilles in Vietnam: Combat Trauma and the Undoing of Character', 'isbn13': '9780684813219', 'msrp': 16, 'binding': 'Paperback', 'related': {'Kindle Edition': '1439124922', 'ePub': '1439124922'}, 'isbn': '0684813211', 'isbn10': '0684813211', 'other_isbns': [{'isbn': '9781439124925', 'binding': 'print'}]}}