{'book': {'publisher': 'William Morrow', 'synopsis': 'In clear, simple terms Leadership and the One Minute Manager® teaches managers the art of Situational Leadership®--a simple system that refutes the conventional management mandate of treating all employees equally. Here, you\'ll learn why tailoring management styles to individual employees is so important; why knowing when to delegate, support, or direct is critical; how to identify the leadership style suited to a particular person; and how consistent use of the One Minute techniques will produce better management and enhanced motivation on all levels. This remarkable, easy-to-follow book is a priceless guide to creative, personalized leadership that elicits the best performance from your staff--and the best bottom line for any business.<br/>If your management motto is "everyone should be treated equally," Leadership and the One Minute Manager. will show you why this style not only hinders workplace efficiency, but also frustrates your staff. In clear, simple terms, Ken Blanchard, co-author of the enormously popular The One Minute Manager., coupled with business gurus Patricia and Drea Zigarmi, teach managers the art of Situational Leadership.. You\'ll learn why tailoring management styles to individual employees is so important; when to delegate, support, or direct; how to identify the leadership style suited to a particular person; and how consistent use of the One Minute techniques will produce better management and enhanced motivation on all levels. This remarkable, easy-to-follow book is a priceless guide to creative, personalized leadership that elicits the best performance from your staff and the best bottom line for any business.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/96/91/9780688039691.jpg', 'title_long': 'Leadership and the One Minute Manager: Increasing Effectiveness Through Situational Leadership', 'edition': '1', 'dimensions': 'Height: 8.5 Inches, Length: 5.75 Inches, Weight: 0.6 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.6}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 112, 'date_published': '1985-10-06', 'subjects': ['Business & Money', 'Management & Leadership', 'Leadership & Motivation', 'Management', 'Business Development & Entrepreneurship', 'Entrepreneurship'], 'authors': ['Ken Blanchard', 'Patricia Zigarmi', 'Drea Zigarmi'], 'title': 'Leadership and the One Minute Manager: Increasing Effectiveness Through Situational Leadership', 'isbn13': '9780688039691', 'msrp': 12.49, 'binding': 'Hardcover', 'isbn': '0688039693', 'isbn10': '0688039693'}}