{'book': {'publisher': 'Atheneum/Richard Jackson Books', 'synopsis': 'This award-winning contemporary classic is the survival story with which all others are compared—and a page-turning, heart-stopping adventure, recipient of the Newbery Honor. Hatchet has also been nominated as one of America’s best-loved novels by PBS’s The Great American Read.<br/><br/>Thirteen-year-old Brian Robeson, haunted by his secret knowledge of his mother’s infidelity, is traveling by single-engine plane to visit his father for the first time since the divorce. When the plane crashes, killing the pilot, the sole survivor is Brian. He is alone in the Canadian wilderness with nothing but his clothing, a tattered windbreaker, and the hatchet his mother had given him as a present.<br/><br/>At first consumed by despair and self-pity, Brian slowly learns survival skills—how to make a shelter for himself, how to hunt and fish and forage for food, how to make a fire—and even finds the courage to start over from scratch when a tornado ravages his campsite. When Brian is finally rescued after fifty-four days in the wild, he emerges from his ordeal with new patience and maturity, and a greater understanding of himself and his parents.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/09/20/9780689840920.jpg', 'title_long': 'Hatchet', 'edition': 'Reissue', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.64 Pounds, Width: 0.7 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.7}, 'weight': {'unit': 'pounds', 'value': 0.64}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 208, 'date_published': '2000-04-01', 'subjects': ["Children's Books", 'Teen & Young Adult', 'Literature & Fiction', 'Action & Adventure', 'Social & Family Issues'], 'authors': ['Gary Paulsen'], 'title': 'Hatchet', 'isbn13': '9780689840920', 'msrp': 18.99, 'binding': 'Hardcover', 'isbn': '0689840926', 'isbn10': '0689840926', 'other_isbns': [{'isbn': '9781442403321', 'binding': 'print'}]}}