{'book': {'publisher': 'Princeton University Press', 'synopsis': 'Stephen Greenblatt sets out to explain his longtime fascination with the ghost of Hamlet\'s father, and his daring and ultimately gratifying journey takes him through surprising intellectual territory. It yields an extraordinary account of the rise and fall of Purgatory as both a belief and a lucrative institution--as well as a capacious new reading of the power of Hamlet.<br/><br/>In the mid-sixteenth century, English authorities abruptly changed the relationship between the living and dead. Declaring that Purgatory was a false "poem," they abolished the institutions and banned the practices that Christians relied on to ease the passage to Heaven for themselves and their dead loved ones. Greenblatt explores the fantastic adventure narratives, ghost stories, pilgrimages, and imagery by which a belief in a grisly "prison house of souls" had been shaped and reinforced in the Middle Ages. He probes the psychological benefits as well as the high costs of this belief and of its demolition.<br/><br/>With the doctrine of Purgatory and the elaborate practices that grew up around it, the church had provided a powerful method of negotiating with the dead. The Protestant attack on Purgatory destroyed this method for most people in England, but it did not eradicate the longings and fears that Catholic doctrine had for centuries focused and exploited. In his strikingly original interpretation, Greenblatt argues that the human desires to commune with, assist, and be rid of the dead were transformed by Shakespeare--consummate conjurer that he was--into the substance of several of his plays, above all the weirdly powerful Hamlet. Thus, the space of Purgatory became the stage haunted by literature\'s most famous ghost.<br/><br/>This book constitutes an extraordinary feat that could have been accomplished by only Stephen Greenblatt. It is at once a deeply satisfying reading of medieval religion, an innovative interpretation of the apparitions that trouble Shakespeare\'s tragic heroes, and an exploration of how a culture can be inhabited by its own spectral leftovers.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/25/73/9780691102573.jpg', 'title_long': 'Hamlet in Purgatory', 'edition': 'unknown', 'dimensions': 'Height: 9 Inches, Length: 6.25 Inches, Weight: 1.1 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 1.1}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 344, 'date_published': '2002-09-15', 'subjects': ['Literature & Fiction', 'Dramas & Plays', 'United States', 'History & Criticism', 'Movements & Periods', 'Regional & Cultural'], 'authors': ['Stephen Greenblatt'], 'title': 'Hamlet in Purgatory', 'isbn13': '9780691102573', 'msrp': 27.95, 'binding': 'Paperback', 'related': {'Page Fidelity': '1400830567', 'eBook': '1400830567'}, 'isbn': '0691102570', 'isbn10': '0691102570', 'other_isbns': [{'isbn': '9781400830565', 'binding': 'print'}, {'isbn': '9781400848096', 'binding': 'ebook'}]}}