{'book': {'publisher': 'Princeton University Press', 'synopsis': 'Richard Alley, one of the world\'s leading climate researchers, tells the fascinating history of global climate changes as revealed by reading the annual rings of ice from cores drilled in Greenland. In the 1990s he and his colleagues made headlines with the discovery that the last ice age came to an abrupt end over a period of only three years. Here Alley offers the first popular account of the wildly fluctuating climate that characterized most of prehistory--long deep freezes alternating briefly with mild conditions--and explains that we humans have experienced an unusually temperate climate. But, he warns, our comfortable environment could come to an end in a matter of years.<br/><br/>The Two-Mile Time Machine begins with the story behind the extensive research in Greenland in the early 1990s, when scientists were beginning to discover ancient ice as an archive of critical information about the climate. Drilling down two miles into the ice, they found atmospheric chemicals and dust that enabled them to construct a record of such phenomena as wind patterns and precipitation over the past 110,000 years. The record suggests that "switches" as well as "dials" control the earth\'s climate, affecting, for example, hot ocean currents that today enable roses to grow in Europe farther north than polar bears grow in Canada. Throughout most of history, these currents switched on and off repeatedly (due partly to collapsing ice sheets), throwing much of the world from hot to icy and back again in as little as a few years.<br/><br/>Alley explains the discovery process in terms the general reader can understand, while laying out the issues that require further study: What are the mechanisms that turn these dials and flip these switches? Is the earth due for another drastic change, one that will reconfigure coastlines or send certain regions into severe drought? Will global warming combine with natural variations in Earth\'s orbit to flip the North Atlantic switch again? Predicting the long-term climate is one of the greatest challenges facing scientists in the twenty-first century, and Alley tells us what we need to know in order to understand and perhaps overcome climate changes in the future.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/29/62/9780691102962.jpg', 'title_long': 'The Two-Mile Time Machine: Ice Cores, Abrupt Climate Change, and Our Future', 'edition': 'Reprint', 'dimensions': 'Height: 8.75 inches, Length: 6 inches, Weight: 0.75 Pounds, Width: 0.5 inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.75}, 'height': {'unit': 'inches', 'value': 8.75}}, 'pages': 240, 'date_published': '2002-07-21', 'subjects': ['History', 'Americas', 'Greenland', 'Science & Math', 'Biological Sciences', 'Paleontology', 'Earth Sciences', 'Climatology', 'Rivers', 'Environment', 'Weather'], 'authors': ['Richard B. Alley'], 'title': 'The Two-Mile Time Machine: Ice Cores, Abrupt Climate Change, and Our Future', 'isbn13': '9780691102962', 'msrp': 25.95, 'binding': 'Paperback', 'isbn': '0691102961', 'isbn10': '0691102961', 'other_isbns': [{'isbn': '9781400852246', 'binding': 'ebook'}]}}