{'book': {'publisher': 'Princeton University Press', 'synopsis': 'Presented here in a new translation, with a historical introduction by the translators, Fear and Trembling and Repetition are the most poetic and personal of Søren Kierkegaard\'s pseudonymous writings. Published in 1843 and written under the names Johannes de Silentio and Constantine Constantius, respectively, the books demonstrate Kierkegaard\'s transmutation of the personal into the lyrically religious.<br/><br/>Each work uses as a point of departure Kierkegaard\'s breaking of his engagement to Regine Olsen--his sacrifice of "that single individual." From this beginning Fear and Trembling becomes an exploration of the faith that transcends the ethical, as in Abraham\'s willingness to sacrifice his son Isaac at God\'s command. This faith, which persists in the face of the absurd, is rewarded finally by the return of all that the faithful one is willing to sacrifice. Repetition discusses the most profound implications of unity of personhood and of identity within change, beginning with the ironic story of a young poet who cannot fulfill the ethical claims of his engagement because of the possible consequences of his marriage. The poet finally despairs of repetition (renewal) in the ethical sphere, as does his advisor and friend Constantius in the aesthetic sphere. The book ends with Constantius\' intimation of a third kind of repetition--in the religious sphere.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/02/66/9780691020266.jpg', 'title_long': "Fear and Trembling/Repetition : Kierkegaard's Writings, Vol. 6 (Kierkegaard's Writings, 20)", 'edition': 'Revised ed.', 'dimensions': 'Height: 8.5 Inches, Length: 5.5 Inches, Weight: 1.18829159218 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.18829159218}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 420, 'date_published': '1983-06-01', 'subjects': ['Christian Books & Bibles', 'Health, Fitness & Dieting', 'Mental Health', 'Anxiety Disorders', 'Religion & Spirituality', 'Politics & Social Sciences', 'Philosophy', 'History & Surveys', 'Religious'], 'authors': ['Søren Kierkegaard'], 'title': "Fear and Trembling/Repetition : Kierkegaard's Writings, Vol. 6 (Kierkegaard's Writings, 20)", 'isbn13': '9780691020266', 'msrp': 30.95, 'binding': 'Paperback', 'related': {'Kindle Edition': '1400846951', 'ePub': '1400846951'}, 'isbn': '0691020264', 'isbn10': '0691020264', 'other_isbns': [{'isbn': '9781400846955', 'binding': 'print'}]}}