{'book': {'publisher': 'Princeton University PRess', 'synopsis': "The idea of human cruelty to animals so consumes novelist Elizabeth Costello in her later years that she can no longer look another person in the eye: humans, especially meat-eating ones, seem to her to be conspirators in a crime of stupefying magnitude taking place on farms and in slaughterhouses, factories, and laboratories across the world.<br/><br/>Costello's son, a physics professor, admires her literary achievements, but dreads his mother's lecturing on animal rights at the college where he teaches. His colleagues resist her argument that human reason is overrated and that the inability to reason does not diminish the value of life; his wife denounces his mother's vegetarianism as a form of moral superiority.<br/><br/>At the dinner that follows her first lecture, the guests confront Costello with a range of sympathetic and skeptical reactions to issues of animal rights, touching on broad philosophical, anthropological, and religious perspectives. Painfully for her son, Elizabeth Costello seems offensive and flaky, but--dare he admit it?--strangely on target.<br/><br/>Here the internationally renowned writer J. M. Coetzee uses fiction to present a powerfully moving discussion of animal rights in all their complexity. He draws us into Elizabeth Costello's own sense of mortality, her compassion for animals, and her alienation from humans, even from her own family. In his fable, presented as a Tanner Lecture sponsored by the University Center for Human Values at Princeton University, Coetzee immerses us in a drama reflecting the real-life situation at hand: a writer delivering a lecture on an emotionally charged issue at a prestigious university. Literature, philosophy, performance, and deep human conviction--Coetzee brings all these elements into play.<br/><br/>As in the story of Elizabeth Costello, the Tanner Lecture is followed by responses treating the reader to a variety of perspectives, delivered by leading thinkers in different fields. Coetzee's text is accompanied by an introduction by political philosopher Amy Gutmann and responsive essays by religion scholar Wendy Doniger, primatologist Barbara Smuts, literary theorist Marjorie Garber, and moral philosopher Peter Singer, author of Animal Liberation. Together the lecture-fable and the essays explore the palpable social consequences of uncompromising moral conflict and confrontation.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/08/96/9780691070896.jpg', 'title_long': 'Lives of Animals', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.50044933474 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.50044933474}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 127, 'date_published': '1999', 'subjects': ['Biographies & Memoirs', 'Leaders & Notable People', 'Presidents & Heads of State', 'History', 'Ancient Civilizations', 'Rome', 'Literature & Fiction', 'Dramas & Plays', 'Ancient & Classical'], 'authors': ['J. M. Coetzee'], 'title': 'Lives of Animals', 'isbn13': '9780691070896', 'msrp': 14.82, 'binding': 'Paperback', 'isbn': '069107089X', 'isbn10': '069107089X', 'other_isbns': [{'isbn': '9781400883523', 'binding': 'print'}]}}