{'book': {'publisher': 'Princeton University Press', 'synopsis': "Paris is firing all its ammunition into the August night. Against a vast backdrop of water and stone, on both sides of a river awash with history, freedom's barricades are once again being erected. Once again justice must be redeemed with men's blood.<br/>?<br/><br/>Albert Camus (1913-1960) wrote these words in August 1944, as Paris was being liberated from German occupation. Although best known for his novels including The Stranger and The Plague, it was his vivid descriptions of the horrors of the occupation and his passionate defense of freedom that in fact launched his public fame.<br/><br/>Now, for the first time in English, Camus at 'Combat' presents all of Camus' World War II resistance and early postwar writings published in Combat, the resistance newspaper where he served as editor-in-chief and editorial writer between 1944 and 1947. These 165 articles and editorials show how Camus' thinking evolved from support of a revolutionary transformation of postwar society to a wariness of the radical left alongside his longstanding strident opposition to the reactionary right. These are poignant depictions of issues ranging from the liberation, deportation, justice for collaborators, the return of POWs, and food and housing shortages, to the postwar role of international institutions, colonial injustices, and the situation of a free press in democracies. The ideas that shaped the vision of this Nobel-prize winning novelist and essayist are on abundant display.<br/><br/>More than fifty years after the publication of these writings, they have lost none of their force. They still speak to us about freedom, justice, truth, and democracy.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/00/41/9780691120041.jpg', 'title_long': 'Camus at Combat: Writing 1944-1947', 'dimensions': 'Height: 9.75 Inches, Length: 6.75 Inches, Weight: 1.5 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.75}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.5}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 384, 'date_published': '2006-01-16', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Regional & Cultural', 'Reference', 'Writing, Research & Publishing Guides', 'Writing'], 'authors': ['Albert Camus'], 'title': 'Camus at Combat: Writing 1944-1947', 'isbn13': '9780691120041', 'msrp': 44, 'binding': 'Hardcover', 'isbn': '0691120048', 'isbn10': '0691120048', 'other_isbns': [{'isbn': '9780691263007', 'binding': 'print'}]}}