{'book': {'publisher': 'Caedmon', 'synopsis': "<p>universally Acclaimed As The Maestro Of Horror And The Morbid, Edgar Allan Poe's Dark Gift Has For More Than A Century And A Half Set The Standard For The Genre.<br>now, Caedmon Audio Presents A Classic Collection Of Poe's Most Terrifying Tales Performed By Two Of The Most Brilliant Interpreters Of His Work Ever To Be Recorded&#58; Vincent Price And Basil Rathbone.<p>between Them, They Perform 20 Of Poe's Chilling Stories And Poems, Creating An Unforgettably Intense Listening Experience.</p><h3>publishers Weekly</h3><p>talk About A Match Made In Heaven! It Would Be Hard To Imagine More Fitting Narrators For Poe's Classic Horror Tales Than Price And Rathbone, Two Superb, Classically Trained Actors Who Became Household Names Starring In Movies Of Suspense And Mystery. Poe's Work Is Especially Well-suited To Audio, And These Remastered, Archival Caedmon Recordings, Originally Released On Phonograph Records, Showcase The Two Actors At Their Finest. Both Price And Rathbone Perfectly Convey The Prototypical Poe Narrator Trying To Come To Grips With The Horror He Has Experienced. In Berenice, Price's Voice Sounds Refined Yet Deeply Troubled As He Struggles To Explain The Insidious, Neurotic Obsession Taking Over His Life. The Cask Of Amontillado Finds Rathbone Chuckling With Evil Pleasure At The Well-planned Murder Of One Who Has Slighted Him. Among The Remaining Featured Tales Are The Tell-tale Heart, The Fall Of The House Of Usher, The Raven, Annabel Lee, The Black Cat And The Pit And The Pendulum. This Audio Is An Absolute Must For Poe Fans, And High School And College Students Assigned Poe Stories For English Class Will Find The Literature Takes On New Meaning With This Recording. (jan.) Copyright 2001 Cahners Business Information.</p>", 'language': 'en', 'image': 'https://images.isbndb.com/covers/41/98/9780694524198.jpg', 'title_long': 'Edgar Allan Poe Audio Collection', 'edition': '5', 'date_published': '2000', 'authors': ['Edgar Allan Poe'], 'title': 'Edgar Allan Poe Audio Collection', 'isbn13': '9780694524198', 'msrp': '0.00', 'binding': 'Compact Disc', 'isbn': '0694524190', 'isbn10': '0694524190'}}