{'book': {'publisher': 'Puffin Books', 'synopsis': "Perfect for introductory grammar and language arts lessons!<br/><br/>What is an interjection? What is a conjunction?<br/><br/>Explore language and discover how to identify interjections and conjunctions and the way they work in sentences.<br/><br/>Praise for Fantastic! Wow! And Unreal!:<br/><br/>“Youngsters will delight in the rhyming text, which artistically weaves information through vibrant illustrations. ... This title is a must-have for school media centers as it provides sheer enjoyment and stimulating instruction for both students and teachers.”—School Library Journal<br/><br/>About the Explore! series:<br/><br/>Dedicated to helping children learn a variety of nonfiction subjects, the Explore series uses pitch-perfect rhyming text and brilliantly illustrated images to make learning fun.<br/><br/>Books in the series:<br/><br/>Explore Language<br/>1. Behind the Mask: A Book About Prepositions<br/>2. Cache of Jewels: And Other Collective Nouns<br/>3. Fantastic! Wow! and Unreal!: A Book About Interjections and Conjunctions<br/>4. Kites Sail High: A Book About Verbs<br/>5. Many Luscious Lollipops: A Book About Adjectives<br/>6. Mine, All Mine!: A Book About Pronouns<br/>7. Merry-Go-Round: A Book About Nouns<br/>8. Up, Up and Away: A Book About Adverbs<br/><br/>Explore Nature<br/>1. Animals Born Alive and Well: A Book About Mammals and Their Young<br/>2. Chickens Aren't the Only Ones: A Book About Animals Who Lay Eggs<br/>3. The Reason for a Flower: A Book About Flowers, Pollen, and Seeds<br/>4. Plants that Never Ever Bloom: A Book About Fungi, Ferns, and Other Plants Without Flowers", 'language': 'en', 'image': 'https://images.isbndb.com/covers/87/51/9780698118751.jpg', 'title_long': 'Fantastic! Wow! and Unreal!: A Book About Interjections and Conjunctions (Explore!)', 'edition': 'Illustrated', 'dimensions': 'Height: 9.25 Inches, Length: 8.75 Inches, Weight: 0.24912235606 Pounds, Width: 0.1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.75}, 'width': {'unit': 'inches', 'value': 0.1}, 'weight': {'unit': 'pounds', 'value': 0.24912235606}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 32, 'date_published': '2000-10-23', 'subjects': ["Children's Books", 'Literature & Fiction', 'Education & Reference', 'Reading & Writing', 'Self Service', 'Custom Stores'], 'authors': ['Ruth Heller'], 'title': 'Fantastic! Wow! and Unreal!: A Book About Interjections and Conjunctions (Explore!)', 'isbn13': '9780698118751', 'msrp': 8.99, 'binding': 'Paperback', 'isbn': '0698118758', 'isbn10': '0698118758'}}