{'book': {'publisher': 'Pimlico', 'synopsis': "On the night of 10 February 1567 an explosion devastated the Edinburgh residence of Henry Stewart, Lord Darnley, second husband of Mary, Queen of Scots. The noise was heard as far away as Holyrood Palace, where Queen Mary was attending a wedding masque. Those arriving at the scene of devastation found, in the garden, the naked corpses of Darnley and his valet. Neither had died in the explosion, but both bodies bore marks of strangulation.<br/><br/>It was clear that they had been murdered and the house destroyed in an attempt to obliterate the evidence. Darnley was not a popular king-consort, but he was regarded by many as having a valid claim to the English throne. For this reason Elizabeth I had opposed his family's longstanding wish to marry him to Mary Stuart, who herself claimed to be the rightful queen of England.<br/><br/>Alison Weir's investigation of Darnley's murder is set against one of the most dramatic periods in British history. Her conclusions shed a brilliant new light on the actions and motives of the conspirators and, in particular, the extent of Mary's own involvement.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/45/61/9780712664561.jpg', 'title_long': 'Mary Queen of Scots and the Murder of Lord Darnley', 'dimensions': 'Height: 7.75589 Inches, Length: 5.07873 Inches, Weight: 0.9700339528 Pounds, Width: 1.33858 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.07873}, 'width': {'unit': 'inches', 'value': 1.33858}, 'weight': {'unit': 'pounds', 'value': 0.9700339528}, 'height': {'unit': 'inches', 'value': 7.75589}}, 'pages': 640, 'date_published': '2004', 'subjects': ['Biographies & Memoirs', 'Historical', 'Europe', 'Leaders & Notable People', 'Military', 'Political', 'Royalty', 'History', 'Great Britain'], 'authors': ['Alison Weir'], 'title': 'Mary Queen of Scots and the Murder of Lord Darnley', 'isbn13': '9780712664561', 'msrp': '0.00', 'binding': 'Paperback', 'isbn': '0712664564', 'isbn10': '0712664564'}}