{'book': {'publisher': 'Pimlico', 'synopsis': '\'A hard-nosed history of the rock-music business - the best since Charlie Gillett\'s seminal The Sound of the City.\' Kurt Loder.\'Goodman charts the business of music in America, from humble beginnings to the time when "music no longer drove the business, but the business drove the music". Goodman concentrates particularly on the rise and rise of manipulative, calculating, and utterly ruthless, billionaire music biz Svengali David Geffen, plus Bruce Springsteen manager Jon Landau, with cameos, too, along the way, of Bob Dylan\'s (in himself, legendary) erstwhile manager Albert Grossman, and perhaps most entertainingly of all, the MC5 (and their White Panther party credo, "rock and roll, dope and fucking in the streets"). Goodman posits a powerful and cogent thesis on the increasingly global music business.\' Ross Fortune, Time Out\'The Mansion on the Hill will disabuse you once and for all of the notion that rock \'n\' roll was ever really about changing the world. It is an absolutely essential read for any music aficionado whose curiosity is not satisfied by myth alone.\' Barney Hoskyns, Mojo\'Fascinating- Goodman\'s entertaining evaluation of how musical dreamers learned to dance with musical schemers is both provocative and persuasive.\' Ira Robbins, Rolling Stone\'Well-documented with facts and footnotes, Mr Goodman\'s story is essentially a sophisticated moral fable about the collision and fusion of art and commerce. If The Mansion on the Hill has a moralistic outlook, its tone is calm, its portraits scrupulously balanced. And rare for a book of this kind, the musical analysis is as astute as the business reporting.\' Stephen Holden, New York Times', 'language': 'en', 'image': 'https://images.isbndb.com/covers/56/21/9780712645621.jpg', 'title_long': 'The Mansion on the Hill : Dylan, Young, Geffen, Springsteen and the Head-On Collision of Rock and Commerce', 'dimensions': 'Height: 9.17321 Inches, Length: 6.06298 Inches, Weight: 1.27427187436 Pounds, Width: 1.37795 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.06298}, 'width': {'unit': 'inches', 'value': 1.37795}, 'weight': {'unit': 'pounds', 'value': 1.27427187436}, 'height': {'unit': 'inches', 'value': 9.17321}}, 'pages': 448, 'date_published': '2003', 'subjects': ['Business & Money', 'Economics'], 'authors': ['Fred Goodman'], 'title': 'The Mansion on the Hill : Dylan, Young, Geffen, Springsteen and the Head-On Collision of Rock and Commerce', 'isbn13': '9780712645621', 'msrp': '0.00', 'binding': 'Paperback', 'isbn': '0712645624', 'isbn10': '0712645624'}}