{'book': {'publisher': 'Marion Boyars', 'synopsis': 'These four novels display Oe’s passionate and original vision. Oe was ten when American jeeps first drove into the mountain village where he lived, and his literary work reveals the tension and ambiguity forged by the collapse of values of his childhood on the one hand and the confrontation with American writers on the other. The earliest of his novels included here, Prize Stock, reveals the strange relationship between a Japanese boy and a captured black American pilot in a Japanese village. Teach Us to Outgrow Our Madness tells of the close relationship between an outlandishly fat father and his mentally defective son, Eeyore. Aghwee the Sky Monster is about a young man’s first job — chaperoning a banker’s son who is haunted by the ghost of a baby in a white nightgown. The Day He Himself Shall Wipe My Tears Away is the longest piece in this collection and Oe’s most disturbing work to date. The narrator lies in a hospital bed waiting to die of a liver cancer that he has probably imagined, wearing a pair of underwater goggles covered with dark cellophane.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/04/82/9780714530482.jpg', 'title_long': 'Teach Us to Outgrow Our Madness (Four Short Novels)', 'dimensions': 'Height: 8.27 Inches, Length: 5.39 Inches, Weight: 0.6172943336 Pounds, Width: 0.67 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.39}, 'width': {'unit': 'inches', 'value': 0.67}, 'weight': {'unit': 'pounds', 'value': 0.6172943336}, 'height': {'unit': 'inches', 'value': 8.27}}, 'pages': 264, 'date_published': '1999', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Regional & Cultural', 'Short Stories & Anthologies', 'Anthologies', 'Contemporary', 'Literary'], 'authors': ['Kenzaburo Oe'], 'title': 'Teach Us to Outgrow Our Madness (Four Short Novels)', 'isbn13': '9780714530482', 'msrp': 10.01, 'binding': 'Paperback', 'isbn': '0714530484', 'isbn10': '0714530484'}}