{'book': {'publisher': 'Saunders', 'synopsis': 'This easy-to-use resource helps readers to master the most important principles and facts in pathology. More than 1,000 questions cover everything from the fundamentals of gross and microscopic pathology to the latest findings in molecular biology and genetics. Based on two of the field\'s best-selling, most authoritative textbooks-Kumar et al.: Robbins and Cotran Pathologic Basis of Disease, 7th Edition and Kumar et al.: Basic Pathology, 7th Edition-Robbins and Cotran Review of Pathology, 2nd Edition is an ideal preparatory tool for the classroom, the USMLE Step 1, or the American Board of Pathology exam.<br/>REVIEW OF THE LAST EDITION<br/>"An exceptionally well organized and edited work...Useful for pathologists in training who are seeking a review of basic concepts...Will be particularly invited and valued by medical students seeking clinical correlation as they prepare for both curriculum examinations and national board examinations."-Archives of Pathology and Laboratory Medicine Offers more than 1,000 questions that follow the clinical vignette style, emphasizing problem solving over rote memorization. Presented in both single-best-answer and extended-matching formats, they reflect levels of difficulty that prepare students for both examinations and the practice of medicine. Provides an answer and a detailed explanation for every question at the end of each chapter. Includes page references and a parallel organization to both Robbins and Cotran Pathologic Basis of Disease and Basic Pathology, making additional information easy to locate. Presents correlative laboratory, radiologic, and physical diagnostic data to enhance readers\' understanding of pathophysiology and to integrate pathology with other medical disciplines. Uses numerous full-color illustrations to test readers\' diagnostic skills. Delivers a 73-question chapter covering all subjects that mimics a comprehensive final examination.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/19/46/9780721601946.jpg', 'title_long': 'Robbins and Cotran Review of Pathology, Second Edition', 'edition': '2', 'dimensions': 'Height: 10.5 Inches, Length: 8.5 Inches, Weight: 2.20462262 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.5}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 2.20462262}, 'height': {'unit': 'inches', 'value': 10.5}}, 'pages': 432, 'date_published': '2004-11-26', 'subjects': ['Medical Books', 'Medicine', 'Internal Medicine', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Edward Klatt', 'Vinay Kumar'], 'title': 'Robbins and Cotran Review of Pathology, Second Edition', 'isbn13': '9780721601946', 'msrp': 48.95, 'binding': 'Paperback', 'isbn': '0721601944', 'isbn10': '0721601944'}}