{'book': {'publisher': 'Severn House', 'synopsis': 'Product Description      <br/><br/>Destined to be a multimedia smash hit, this epic SF story is based on an exciting CD-ROM game created by LucasArts. When a mysterious asteroid threatens to collide with Earth, a space shuttle is sent to ""nudge"" it into a safe orbit. The three astronauts who venture to the surface find themselves trapped as the asteroid suddenly leaves orbit, transporting them to a strange planet lightyears away.<br/><br/>      About the Author      <br/><br/>Alan Dean Foster work to date includes excursions into hard science-fiction, fantasy, horror, detective, western, historical, and contemporary fiction. He has also written numerous non-fiction articles on film, science, and scuba diving, as well as having produced the novel versions of many films, including such well-known productions as Star Wars, the first three Alien films, Alien Nation, and The Chronicles of Riddick. Other works include scripts for talking records, radio, computer games, and the story for the first Star Trek movie. His novel Shadowkeep was the first ever book adapation of an original computer game. In addition to publication in English his work has been translated into more than fifty languages and has won awards in Spain and Russia. His novel Cyber Way won the Southwest Book Award for Fiction in 1990, the first work of science-fiction ever to do so.<br/>Foster\'s sometimes humorous, occasionally poignant, but always entertaining short fiction has appeared in all the major SF magazines as well as in original anthologies and several "Best of the Year" compendiums. His published oeurve includes more than 100 books.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/26/63/9780727852663.jpg', 'title_long': 'The Dig', 'dimensions': 'Height: 8.88 Inches, Length: 5.74 Inches, Weight: 1.2676580065 Pounds, Width: 1.23 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.74}, 'width': {'unit': 'inches', 'value': 1.23}, 'weight': {'unit': 'pounds', 'value': 1.2676580065}, 'height': {'unit': 'inches', 'value': 8.88}}, 'pages': 336, 'date_published': '1998-01-01', 'subjects': ['Science Fiction & Fantasy', 'Science Fiction', 'Adventure'], 'authors': ['Alan Dean Foster'], 'title': 'The Dig', 'isbn13': '9780727852663', 'msrp': 25, 'binding': 'Hardcover', 'isbn': '0727852663', 'isbn10': '0727852663'}}