{'book': {'publisher': 'Microsoft Press', 'synopsis': 'In OBJECT THINKING, esteemed object technologist David West contends that the mindset makes the programmer—not the tools and techniques. Delving into the history, philosophy, and even politics of object-oriented programming, West reveals how the best programmers rely on analysis and conceptualization—on thinking—rather than formal process and methods. Both provocative and pragmatic, this book gives form to what’s primarily been an oral tradition among the field’s revolutionary thinkers—and it illustrates specific object-behavior practices that you can adopt for true object design and superior results.<br/>Gain an in-depth understanding of: Prerequisites and principles of object thinking. Object knowledge implicit in eXtreme Programming (XP) and Agile software development. Object conceptualization and modeling. Metaphors, vocabulary, and design for object development.<br/>Learn viable techniques for: Decomposing complex domains in terms of objects. Identifying object relationships, interactions, and constraints. Relating object behavior to internal structure and implementation design. Incorporating object thinking into XP and Agile practice.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/96/54/9780735619654.jpg', 'title_long': 'Object Thinking', 'dimensions': 'Height: 9 Inches, Length: 7.38 Inches, Weight: 1.29190885532 Pounds, Width: 0.82 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.38}, 'width': {'unit': 'inches', 'value': 0.82}, 'weight': {'unit': 'pounds', 'value': 1.29190885532}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 362, 'date_published': '2004-02-11', 'subjects': ['Computers & Technology', 'Business Technology', 'Programming', 'Software Design, Testing & Engineering', 'Software', 'Self Service', 'Custom Stores', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['David West'], 'title': 'Object Thinking', 'isbn13': '9780735619654', 'msrp': 49.99, 'binding': 'Paperback', 'related': {'ePub': '0735637512'}, 'isbn': '0735619654', 'isbn10': '0735619654', 'other_isbns': [{'isbn': '9780735637511', 'binding': 'fpid'}]}}