{'book': {'publisher': 'Random House Audio', 'synopsis': 'Product Description      <br/>From a helicopter high above the empty California desert, a man is sent free-falling into the night…. In Chicago, a woman learns that an elite team of ex–army investigators is being hunted down one by one.... And on the streets of Portland, Jack Reacher—soldier, cop, hero—is pulled out of his wandering life by a code that few other people could understand. From the first shocking scenes in Lee Child’s explosive new novel, Jack Reacher is plunged like a knife into the heart of a conspiracy that is killing old friends…and is on its way to something even worse.<br/><br/>A decade postmilitary, Reacher has an ATM card and the clothes on his back—no phone, no ties, and no address. But now a woman from his old unit has done the impossible. From Chicago, Frances Neagley finds Reacher, using a signal only the eight members of their elite team of army investigators would know. She tells him a terrifying story—about the brutal death of a man they both served with. Soon Reacher is reuniting with the survivors of his old team, scrambling to raise the living, bury the dead, and connect the dots in a mystery that is growing darker by the day. The deeper they dig, the more they don’t know: about two other comrades who have suddenly gone missing—and a trail that leads into the neon of Vegas and the darkness of international terrorism.<br/><br/>For now, Reacher can only react. To every sound. Every suspicion. Every scent and every moment. Then Reacher will trust the people he once trusted with his life—and take this thing all the way to the end. Because in a world of bad luck and trouble, when someone targets Jack Reacher and his team, they’d better be ready for what comes right back at them…<br/><br/><br/><br/>From the Hardcover edition.<br/>      Review      <br/>“Highly recommended ... One of the best books in the series.”—<br/>Library Journal, starred review<br/><br/>"It\'s easy to mock the testosterone of Reacher novels—until you read one. They\'re everything authors like WEB Griffin wish they had the talent to write."—<br/>Rocky Mountain News<br/><br/>“Reacher thinks and acts in nouns and verbs—no adjective need apply. He\'s a human missile; all you have to do is aim him.”—<br/>Palm Beach Post, Florida<br/><br/><br/><br/>From the Hardcover edition.<br/>      Excerpt. © Reprinted by permission. All rights reserved.      <br/>Chapter One<br/><br/>The man was called Calvin Franz and the helicopter was a Bell 222. Franz had two broken legs, so he had to be loaded on board strapped to a stretcher. Not a difficult maneuver. The Bell was a roomy aircraft, twin-engined, designed for corporate travel and police departments, with space for seven passengers. The rear doors were as big as a panel van\'s and they opened wide. The middle row of seats had been removed. There was plenty of room for Franz on the floor.<br/><br/>The helicopter was idling. Two men were carrying the stretcher. They ducked low under the rotor wash and hurried, one backward, one forward. When they reached the open door the guy who had been walking backward got one handle up on the sill and ducked away. The other guy stepped forward and shoved hard and slid the stretcher all the way inside. Franz was awake and hurting. He cried out and jerked around a little, but not much, because the straps across his chest and thighs were buckled tight. The two men climbed in after him and got in their seats behind the missing row and slammed the doors.<br/><br/>Then they waited.<br/><br/>The pilot waited.<br/><br/>A third man came out a gray door and walked across the concrete. He bent low under the rotor and held a hand flat on his chest to stop his necktie whipping in the wind. The gesture made him look like a guilty man proclaiming his innocence. He tracked around the Bell\'s long nose and got in the forward seat, next to the pilot.<br/><br/>"Go," he said, and then he bent his head to concentrate on his harness buckle.<br/><br/>The pilot goosed the turbines and the lazy whop-whop of the idling blade slid up the scale to an urgent centripetal whip-whip-whip and then disappeared behind the treble blast of the exhau', 'language': 'en', 'image': 'https://images.isbndb.com/covers/06/77/9780739340677.jpg', 'title_long': 'Bad Luck and Trouble (Jack Reacher, No. 11)', 'edition': 'Abridged', 'dimensions': 'Height: 6.19 Inches, Length: 5.54 Inches, Weight: 0.3527396192 Pounds, Width: 1.07 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.54}, 'width': {'unit': 'inches', 'value': 1.07}, 'weight': {'unit': 'pounds', 'value': 0.3527396192}, 'height': {'unit': 'inches', 'value': 6.19}}, 'pages': 6, 'date_published': '2007-05-15', 'subjects': ['Literature & Fiction', 'Action & Adventure', 'Contemporary', 'Mystery, Thriller & Suspense', 'Mystery', 'Thrillers & Suspense'], 'authors': ['Lee Child'], 'title': 'Bad Luck and Trouble (Jack Reacher, No. 11)', 'isbn13': '9780739340677', 'msrp': 29.95, 'binding': 'Audio CD', 'isbn': '0739340670', 'isbn10': '0739340670'}}