{'book': {'publisher': 'Simon & Schuster', 'synopsis': "Enriched Classicsoffer readers accessible editions of great works of literature enhanced by helpful notes and commentary. Each book includes educational tools alongside the text, enabling students and readers alike to gain a deeper and more developed understanding of the writer and their work.<br/><br/>Alexandre Dumas's thrilling adventure of one man's quest for freedom and vengeance on those who betrayed him.<br/><br/>This edition includes:<br/>-A concise introduction that gives readers important background information<br/>-A chronology of the author's life and work<br/>-A timeline of significant events that provides the book's historical context<br/>-An outline of key themes and plot points to help readers form their own interpretations<br/>-Detailed explanatory notes<br/>-Critical analysis, including contemporary and modern perspectives on the work<br/>-Discussion questions to promote lively classroom and book group interaction<br/>-A list of recommended related books and films to broaden the reader's experience<br/><br/>Enriched Classics offer readers affordable editions of great works of literature enhanced by helpful notes and insightful commentary. The scholarship provided in Enriched Classics enables readers to appreciate, understand, and enjoy the world's finest books to their full potential.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/75/59/9780743487559.jpg', 'title_long': 'The Count of Monte Cristo (Enriched Classics)', 'edition': 'Enriched Classic', 'dimensions': 'Height: 6.75 Inches, Length: 4.1875 Inches, Weight: 0.95 Pounds, Width: 1.6 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.1875}, 'width': {'unit': 'inches', 'value': 1.6}, 'weight': {'unit': 'pounds', 'value': 0.95}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 688, 'date_published': '2004-05-01', 'subjects': ['Literature & Fiction', 'Classics', 'Literary', 'Self Service', 'Custom Stores'], 'authors': ['Alexandre Dumas père'], 'title': 'The Count of Monte Cristo (Enriched Classics)', 'isbn13': '9780743487559', 'msrp': 6.95, 'binding': 'Mass Market Paperback', 'related': {'ePub': '1476703957'}, 'isbn': '0743487559', 'isbn10': '0743487559', 'other_isbns': [{'isbn': '9781416501800', 'binding': 'print'}, {'isbn': '9781476703954', 'binding': 'print'}]}}