{'book': {'publisher': 'Scribner', 'synopsis': 'A richly textured novel tells a story of sex and longing, love and loss, and of the deceit that can lie at the heart of family relationships. “Each chapter…has the seductive aura of a finely crafted story. Liars and Saints is instructive and bittersweet and yet somehow never nostalgic” (Los Angeles Times).<br/><br/>Set in California, Liars and Saints follows four generations of the Catholic Santerre family from World War II to the present. In a family driven as much by jealousy and propriety as by love, an unspoken tradition of deceit is passed from generation to generation. When tragedy shatters their precarious domestic lives, it takes astonishing courage and compassion to bring them back together.<br/><br/>By turns funny and disturbing, irreverent and profound, Liars and Saints is a masterful display of Maile Meloy’s prodigious gifts and of her penetrating insight into an extraordinary American family and into the nature of human love. “Meloy may be the first great American realist of the twenty-first century: The Santerres aren’t real but they feel like they are, and the reader will not soon forget them” (The Boston Globe).', 'language': 'en', 'image': 'https://images.isbndb.com/covers/19/82/9780743261982.jpg', 'title_long': 'Liars and Saints: A Novel', 'edition': 'Reprint', 'dimensions': 'Height: 8 Inches, Length: 5.25 Inches, Weight: 0.50926782522 Pounds, Width: 0.68 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 0.68}, 'weight': {'unit': 'pounds', 'value': 0.50926782522}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 260, 'date_published': '2004-07-13', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Family Saga', 'Historical', 'Family Life', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors': ['Maile Meloy'], 'title': 'Liars and Saints: A Novel', 'isbn13': '9780743261982', 'msrp': 17, 'binding': 'Paperback', 'related': {'Kindle Edition': '1416583114', 'ePub': '1416583114'}, 'isbn': '0743261984', 'isbn10': '0743261984', 'other_isbns': [{'isbn': '9781416583110', 'binding': 'print'}]}}