{'book': {'publisher': 'Pocket Books', 'synopsis': "Though known throughout the world for his fictional novels The Adventures of Tom Sawyer and Adventures of Huckleberry Finn, Mark Twain was also a skilled chronicler of his own life and experiences. In his youth, Twain traveled extensively throughout the untamed American West with his brother, working his way from town to town in a variety of jobs, including gold prospector, reporter, and lecturer. Roughing It is Twain's personal recollection of his wanderlust years. It is a wildly humorous adventure yarn that combines hard facts with a healthy dose of the author's unique perspective, one that helped define the course of American literature.<br/>Pocket Books' Enriched Classics present the great works of world literature enriched for the contemporary reader. This edition of Roughing It has been prepared by Professor Henry B. Wonham of the University of Oregon. It includes his introduction, notes, selection of critical excerpts, and suggestions for further reading as well as a unique visual essay of period illustrations and photographs.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/65/02/9780743436502.jpg', 'title_long': 'Roughing It (Enriched Classics)', 'edition': 'Enriched Classic', 'dimensions': 'Height: 6.75 Inches, Length: 4.1875 Inches, Weight: 0.57981574906 Pounds, Width: 1.2 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.1875}, 'width': {'unit': 'inches', 'value': 1.2}, 'weight': {'unit': 'pounds', 'value': 0.57981574906}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 560, 'date_published': '2003-05-01', 'subjects': ['Literature & Fiction', 'Classics', 'United States', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors': ['Mark Twain'], 'title': 'Roughing It (Enriched Classics)', 'isbn13': '9780743436502', 'msrp': 6.99, 'binding': 'Mass Market Paperback', 'related': {'ePub': '1451686293'}, 'isbn': '0743436504', 'isbn10': '0743436504', 'other_isbns': [{'isbn': '9781451686296', 'binding': 'print'}]}}