{'book': {'publisher': 'Pocket Star', 'synopsis': "Since the beginning of time, the angelic forces of the High Heavens and the demonic hordes of the Burning Hells have been locked in the Eternal Conflict for the fate of all Creation. That struggle has now spilled over into Sanctuary -- the world of men. Determined to win mankind over to their respective causes, the forces of good and evil wage a secret war for mortal souls. This is the tale of the Sin War -- the conflict that would forever change the destiny of man.<br/><br/>Bent on destroying the evil cult of the Triune, Uldyssian does not yet suspect that Inarius -- secret Prophet of the Cathedral of Light -- has been subtly aiding his quest. Obsessed with restoring Sanctuary to its former glory, Inarius has been playing Uldyssian against the two great religions in a reckless attempt to topple them both. But another player has slipped back into the equation. The demon Lilith, once Inarius's lover, seeks to use Uldyssian as her own pawn in a scheme to turn humans into an army of naphalem -- godlike beings, more powerful than any angel or demon, who could overturn all Creation and elevate Lilith to supreme being.<br/><br/>An original tale of swords, sorcery, and timeless struggle based on the bestselling, award-winning M-rated computer game from Blizzard Entertainment. Intended for mature readers.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/12/37/9780743471237.jpg', 'title_long': 'Scales of the Serpent (Diablo: The Sin War, Book 2)', 'dimensions': 'Height: 6.7499865 Inches, Length: 4.1873932 Inches, Weight: 0.35494424182 Pounds, Width: 0.999998 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.1873932}, 'width': {'unit': 'inches', 'value': 0.999998}, 'weight': {'unit': 'pounds', 'value': 0.35494424182}, 'height': {'unit': 'inches', 'value': 6.7499865}}, 'pages': 336, 'date_published': '2007-03-27', 'subjects': ['Science Fiction & Fantasy', 'Fantasy', 'Science Fiction'], 'authors': ['Richard Knaak'], 'title': 'Scales of the Serpent (Diablo: The Sin War, Book 2)', 'isbn13': '9780743471237', 'msrp': 8.99, 'binding': 'Mass Market Paperback', 'isbn': '0743471237', 'isbn10': '0743471237'}}