{'book': {'publisher': 'Simon & Schuster', 'synopsis': 'From #1 New York Times bestselling author and “queen of royal fiction” (USA TODAY) comes a riveting and scandalous love triangle between a young woman on the brink of greatness, a young man whose ambition far exceeds his means, and the wife who cannot forgive them.<br/><br/>In the autumn of 1558, church bells across England ring out the joyous news that Elizabeth I is the new queen, yet one woman hears the tidings with utter dread. She is Amy Dudley, wife of Sir Robert, and she knows that Elizabeth’s ambitious leap to the throne will draw her husband back to the center of the glamorous Tudor court, where he was born to be.<br/><br/>Elizabeth’s excited triumph is short-lived. She has inherited a bankrupt country where treason is rampant and foreign war a certainty. Her faithful advisors warns her that she will survive only if she marries a strong prince to govern the rebellious country, but the one man Elizabeth desires is her childhood friend, the ambitious Robert Dudley. As the young couple falls back in love, a question hangs in the air: can he really set aside his wife and marry the queen? When Amy is found dead, Elizabeth and Dudley are suddenly plunged into a struggle for survival.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/92/61/9780743269261.jpg', 'title_long': "The Virgin's Lover", 'dimensions': 'Height: 8 Inches, Length: 5.25 Inches, Weight: 0.86 Pounds, Width: 1.16 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 1.16}, 'weight': {'unit': 'pounds', 'value': 0.86}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 441, 'date_published': '2005-09-07', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'History & Criticism', 'Movements & Periods', "Women's Fiction", 'Domestic Life', 'Literary', 'Romance', 'Self Service', 'Custom Stores'], 'authors': ['Philippa Gregory'], 'title': "The Virgin's Lover", 'isbn13': '9780743269261', 'msrp': '0.00', 'binding': 'Paperback', 'related': {'ePub': '0743275349'}, 'isbn': '0743269268', 'isbn10': '0743269268', 'other_isbns': [{'isbn': '9780743275347', 'binding': 'print'}]}}