{'book': {'publisher': 'Simon & Schuster', 'synopsis': 'The hilarious and controversial host of HBO\'s Real Time with Bill Maher\'s debut novel about the wild and crazy life of the stand-up comedian—a bawdy, rowdy tell-all report from the front line.<br/><br/>Set in New York, circa 1979, in the late-night, neon-lit comedy clubs when the comedy boom was just heating up, True Story features five would-be comics, their shticks, their chicks, their rampant egos. These guys are desperate for celebrity, desperate for money, and—what else?—desperate to get laid. Which means they\'re also required to become "road comics," shacking up in low-rent condos provided by sleazy club owners as the comedy scene spreads to the heartland in the early \'80s.<br/><br/>The result is a hilariously funny novel about the peculiar world of stand-up, where the ultimate prizes are fame, fortune, and fornication -- and the ultimate aspiration is, quite simply, to be laughed at. With perfect-pitch delivery, in classic sardonic style, Maher gives us a bona fide look at these resilient comedians and the scumbag promoters, hostile audiences, and die-hard groupies who make up their warped and twisted world.<br/><br/>Only Bill Maher could have written True Story. And lucky for us he did. Because True Story is hilarious. It\'s offensive. At times it\'s even touching. So sit back as Maher puts you stage side at the very birth of the comedy boom. You\'ll laugh in all the right places. Hey, it\'s a True Story.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/13/54/9780743291354.jpg', 'title_long': 'True Story: A Novel', 'edition': 'Reprint', 'dimensions': 'Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.70988848364 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.70988848364}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 304, 'date_published': '2005-10-01', 'subjects': ['Humor & Entertainment', 'Literature & Fiction', 'Genre Fiction', 'Political', 'United States', 'Humor', 'Humor & Satire', 'Satire', 'Humorous', 'Contemporary', 'Self Service', 'Custom Stores'], 'authors': ['Bill Maher'], 'title': 'True Story: A Novel', 'isbn13': '9780743291354', 'msrp': 14, 'binding': 'Paperback', 'related': {'ePub': '074329341X'}, 'isbn': '0743291352', 'isbn10': '0743291352', 'other_isbns': [{'isbn': '9780743293419', 'binding': 'print'}]}}