{'book': {'publisher': 'Washington Square Press', 'synopsis': 'New York Times bestselling author Jodi Picoult tells the story of a girl who decides to sue her parents for the rights to her own body in this riveting story that tackles a controversial subject with grace and explores what it means to be a good person.<br/><br/>Jodi Picoult is widely acclaimed for her keen insights into the hearts and minds of real people. Now she tells the emotionally powerful story of a family torn apart by conflicting needs and a passionate love that triumphs over human weakness.<br/><br/>Anna is not sick, but she might as well be. By age thirteen, she has undergone countless surgeries, transfusions, and shots so that her older sister, Kate, can somehow fight the leukemia that has plagued her since childhood. The product of preimplantation genetic diagnosis, Anna was conceived as a bone marrow match for Kate—a life and a role that she has never challenged...until now. Like most teenagers, Anna is beginning to question who she truly is. But unlike most teenagers, she has always been defined in terms of her sister—and so Anna makes a decision that for most would be unthinkable, a decision that will tear her family apart and have perhaps fatal consequences for the sister she loves.<br/><br/>My Sister’s Keeper examines what it means to be a good parent, a good sister, a good person. Is it morally correct to do whatever it takes to save a child’s life, even if that means infringing upon the rights of another? Is it worth trying to discover who you really are, if that quest makes you like yourself less? Should you follow your own heart, or let others lead you? Once again, in My Sister’s Keeper, Jodi Picoult tackles a controversial real-life subject with grace, wisdom, and sensitivity.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/45/37/9780743454537.jpg', 'title_long': "My Sister's Keeper: A Novel (Wsp Readers Club)", 'edition': 'Reprint', 'dimensions': 'Height: 8.25 Inches, Length: 5.3125 Inches, Weight: 0.81 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.3125}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.81}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 448, 'date_published': '2005-02-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Family Life', "Women's Fiction", 'Divorce', 'Domestic Life', 'Mothers & Children', 'Sisters', 'Contemporary', 'United States', 'Literary', 'Reference', 'Politics & Social Sciences', 'Politics & Government', 'Specific Topics', 'Self Service', 'Custom Stores'], 'authors': ['Jodi Picoult'], 'title': "My Sister's Keeper: A Novel (Wsp Readers Club)", 'isbn13': '9780743454537', 'msrp': 12.65, 'binding': 'Paperback', 'related': {'Kindle Edition': '0743488814'}, 'isbn': '0743454537', 'isbn10': '0743454537', 'other_isbns': [{'isbn': '9780743488815', 'binding': 'print'}]}}