{'book': {'publisher': 'Touchstone', 'synopsis': 'Internationally renowned leadership authority and bestselling author Stephen R. Covey presents a hands-on companion to his landmark book The 7 Habits of Highly Effective People, which has sold more than 10 million copies and has become a touchstone for individuals, families, and businesses around the world.<br/><br/>Stephen Covey’s The 7 Habits of Highly Effective People took the self-help market by storm in 1990 and has enjoyed phenomenal sales ever since. The integrated, principle-centered 7 Habits philosophy has helped readers find solutions to their personal and professional problems and achieve a life characterized by fairness, integrity, honesty, and dignity. Covey’s tried and true step-by-step approach is explored even more fully in this workbook, which leads readers through the 7 Habits and shows them how to put these ideas into action everyday.<br/><br/>With the same clarity and assurance that Covey’s readers have come to know and love, the workbook helps readers further understand, appreciate, and internalize the power of the 7 Habits. These engaging, in-depth exercises allow readers—both devotees and newcomers—to get their hands dirty as they develop a philosophy for success, set personal goals, and improve their relationships. The overwhelming success of Stephen R. Covey’s principle-centered philosophy is a testament to the millions who have benefited from his lessons, and now, with The 7 Habits of Highly Effective People Personal Workbook, they can further explore and understand this tried-and-true approach.<br/><br/>This reference offers solutions to both personal and professional problems by promoting and teaching fairness, integrity, honesty, and dignity. An engaging companion to a bestselling classic, The 7 Habits of Highly Effective People Personal Workbook will help readers set goals, improve relationships, and create a path to life effectiveness.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/09/79/9780743250979.jpg', 'title_long': 'The 7 Habits of Highly Effective People Personal Workbook', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.59965735264 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.59965735264}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 192, 'date_published': '2004-01-06', 'subjects': ['Self-Help', 'Relationships', 'Interpersonal Relations', 'Motivational', 'Personal Transformation', 'Self-Esteem', 'Success', 'Business & Money', 'Job Hunting & Careers', 'Guides', 'Management & Leadership', 'Leadership & Motivation', 'Health, Fitness & Dieting', 'Psychology & Counseling', 'Self Service', 'Custom Stores'], 'authors': ['Stephen R. Covey'], 'title': 'The 7 Habits of Highly Effective People Personal Workbook', 'isbn13': '9780743250979', 'msrp': 16, 'binding': 'Paperback', 'related': {'Kindle Edition': '0743267036', 'ePub': '0743267036'}, 'isbn': '0743250974', 'isbn10': '0743250974', 'other_isbns': [{'isbn': '9780743267038', 'binding': 'print'}]}}