{'book': {'publisher': 'Pimsleur', 'synopsis': 'The Easiest and Fastest Way to Learn German<br/>Whether you want to travel, communicate with friends or colleagues, reconnect with family, or just understand more of what’s going on in the world around you, learning German will expand your horizons and immeasurably enrich your life.<br/><br/>The best part is that it doesn’t have to be difficult or take years to master. Thirty minutes a day is all it takes, and we get you speaking right from the first day. Pimsleur courses use a scientifically-proven method that puts you in control of your learning. If you’ve tried other language learning methods but found they simply didn’t stick, then you owe it to yourself to give Pimsleur a try.<br/><br/>Why Pimsleur?<br/>- Quick + Easy – Only 30 minutes a day.<br/>- Portable + Flexible – Core lessons can be done anytime, anywhere, and easily fit into your busy life.<br/>- Proven Method – Works when other methods fail.<br/>- Self-Paced – Go fast or go slow – it’s up to you.<br/>- Based in Science – Developed using proven research on memory and learning.<br/>- Cost-effective – Less expensive than classes or immersion, and features all native speakers.<br/>- Genius – Triggers your brain’s natural aptitude to learn.<br/>- Works for everyone – Recommended for ages 13 and above.<br/><br/>What’s Included?<br/>- 30, 30-minute audio lessons<br/>- 60 minutes of reading instruction to provide you with an introduction to reading German designed to teach you to sound out words with correct pronunciation and accent<br/>- in total, 16 hours of audio, all featuring native speakers<br/>- a Reading Booklet and a User’s Guide<br/><br/>What You’ll Learn<br/>In the first 10 lessons, you’ll cover the basics: saying hello, asking for or giving information, scheduling a meal or a meeting, asking for or giving basic directions, and much more. You’ll be able to handle minimum courtesy requirements, understand much of what you hear, and be understood at a beginning level, but with near-native pronunciation skills.<br/><br/>In the next 10 lessons, you’ll build on what you’ve learned. Expand your menu, increase your scheduling abilities from general to specific, start to deal with currency and exchanging money, refine your conversations and add over a hundred new vocabulary items. You’ll understand more of what you hear, and be able to participate with speech that is smoother and more confident.<br/><br/>In the final 10 lessons, you’ll be speaking and understanding at an intermediate level. In this phase, more directions are given in the target language, which moves your learning to a whole new plane. Lessons include shopping, visiting friends, going to a restaurant, plans for the evening, car trips, and talking about family. You’ll be able to speak comfortably about things that happened in the past and make plans for the future.<br/><br/>Reading Lessons begin in Lesson 10 to provide you with an introduction to reading German. In addition, the combined Reading Lessons are included after Lesson 30. These Reading Lessons, which total about one hour, are designed to teach you to sound out words with correct pronunciation and accent.<br/><br/>The Pimsleur Method<br/>We make no secret of what makes this powerful method work so well. Paul Pimsleur spent his career researching and perfecting the precise elements anyone can use to learn a language quickly and easily. Here are a few of his “secrets”:<br/><br/>The Principle of Anticipation<br/>In the nanosecond between a cue and your response, your brain has to work to come up with the right word. Having to do this boosts retention, and cements the word in your mind.<br/><br/>Core Vocabulary<br/>Words, phrases, and sentences are selected for their usefulness in everyday conversation. We don’t overwhelm you with too much, but steadily increase your ability with every lesson.<br/><br/>Graduated Interval Recall<br/>Reminders of new words and structures come up at the exact interval for maximum retention and storage into your long-term memory.<br/><br/>Organic Learning<br/>You work on multiple aspects of the language simultaneously. We integrate grammar, vocabulary, rhythm, melody, and intonation int', 'language': 'en', 'image': 'https://images.isbndb.com/covers/83/69/9780743518369.jpg', 'title_long': 'Pimsleur German Level 1 CD: Learn to Speak and Understand German with Pimsleur Language Programs (1) (Comprehensive)', 'edition': '2nd', 'dimensions': 'Height: 11 Inches, Length: 12.5 Inches, Weight: 2.5 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 12.5}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 2.5}, 'height': {'unit': 'inches', 'value': 11}}, 'pages': 16, 'date_published': '2002-03-01', 'subjects': ['Reference', 'Politics & Social Sciences'], 'authors': ['Paul Pimsleur'], 'title': 'Pimsleur German Level 1 CD: Learn to Speak and Understand German with Pimsleur Language Programs (1) (Comprehensive)', 'isbn13': '9780743518369', 'msrp': 345, 'binding': 'Audio CD', 'isbn': '0743518365', 'isbn10': '0743518365'}}