{'book': {'publisher': 'Free Press', 'synopsis': "The # 1 New York Times bestseller A Girl Named Zippy was a rare and welcome treat: a memoir of a happy childhood. Spunky, strong-willed, and too smart for her own good, Zippy Jarvis brought readers delight and joy. In She Got Up Off the Couch, Haven Kimmel invites us to rejoin the quirky and hilarious Jarvis family saga, shining the spotlight now on her remarkable mother, Delonda.<br/><br/>Zippy is growing up and struggling with both her hair and her distaste for shoes. But this memoir strikes a deeper and more emotional chord, as now Kimmel shines the spotlight on her remarkable mother, Delonda. Courageous and steadfast, Delonda finally realized that she could change her life, and she got up off the funky couch in the den, bought a beat-up flower power VW bug (and then learned to drive it), and went back to school, which gave her the chance to gain both financial independence and, at long last, self-respect.<br/><br/>A true pleasure for old fans and new ones alike, She Got Up Off the Couch is a gorgeous encapsulation of an innocent time when a child didn't understand that her mother was depressed or felt stifled, but just noted on her way out the door that Delonda was a fixture in the living room. Kimmel captures the seminal moments of her mother's burgeoning empowerment with the full strength of her distinctive, deft storytelling, and with the overflowing sense of humor that made A Girl Named Zippy a favorite of readers everywhere.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/50/01/9780743285001.jpg', 'title_long': 'She Got Up Off the Couch: And Other Heroic Acts from Mooreland, Indiana', 'edition': 'Reprint', 'dimensions': 'Height: 8.4375 inches, Length: 5.5 inches, Weight: 0.86641668966 Pounds, Width: 0.85 inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.85}, 'weight': {'unit': 'pounds', 'value': 0.86641668966}, 'height': {'unit': 'inches', 'value': 8.4375}}, 'pages': 337, 'date_published': '2007-02-13', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Community & Culture', 'Women', 'Memoirs', 'Regional U.S.', 'Mid Atlantic', 'Midwest', 'Parenting & Relationships', 'Self Service', 'Custom Stores'], 'authors': ['Haven Kimmel'], 'title': 'She Got Up Off the Couch: And Other Heroic Acts from Mooreland, Indiana', 'isbn13': '9780743285001', 'msrp': '0.00', 'binding': 'Paperback', 'related': {'ePub': '0743295978'}, 'isbn': '074328500X', 'isbn10': '074328500X', 'other_isbns': [{'isbn': '9780743295970', 'binding': 'print'}]}}