{'book': {'publisher': 'Scribner', 'synopsis': 'Building on the national bestselling success of Sex, Drugs, and Cocoa Puffs, preeminent pop culture writer Chuck Klosterman unleashes his best book yet—the story of his cross-country tour of sites where rock stars have died and his search for love, excitement, and the meaning of death.<br/><br/>For 6,557 miles, Chuck Klosterman thought about dying. He drove a rental car from New York to Rhode Island to Georgia to Mississippi to Iowa to Minneapolis to Fargo to Seattle, and he chased death and rock ‘n’ roll all the way. Within the span of twenty-one days, Chuck had three relationships end—one by choice, one by chance, and one by exhaustion. He snorted cocaine in a graveyard. He walked a half-mile through a bean field. A man in Dickinson, North Dakota, explained to him why we have fewer windmills than we used to. He listened to the KISS solo albums and the Rod Stewart box set. At one point, poisonous snakes became involved. The road is hard. From the Chelsea Hotel to the swampland where Lynyrd Skynyrd’s plane went down to the site where Kurt Cobain blew his head off, Chuck explored every brand of rock star demise. He wanted to know why the greatest career move any musician can make is to stop breathing...and what this means for the rest of us.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/44/64/9780743264464.jpg', 'title_long': 'Killing Yourself to Live: 85% of a True Story', 'edition': 'Reprint', 'dimensions': 'Height: 8.4375 Inches, Length: 5.5 Inches, Weight: 0.58 Pounds, Width: 0.8 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.8}, 'weight': {'unit': 'pounds', 'value': 0.58}, 'height': {'unit': 'inches', 'value': 8.4375}}, 'pages': 288, 'date_published': '2006-06-13', 'subjects': ['Arts & Photography', 'Music', 'Musical Genres', 'Biographies & Memoirs', 'Arts & Literature', 'Composers & Musicians', 'Memoirs', 'Professionals & Academics', 'Journalists', 'Politics & Social Sciences', 'Social Sciences', 'Popular Culture', 'Sociology', 'Self Service', 'Custom Stores'], 'authors': ['Chuck Klosterman'], 'title': 'Killing Yourself to Live: 85% of a True Story', 'isbn13': '9780743264464', 'msrp': 17, 'binding': 'Paperback', 'related': {'ePub': '0743274482'}, 'isbn': '0743264460', 'isbn10': '0743264460', 'other_isbns': [{'isbn': '9780743274487', 'binding': 'print'}]}}