{'book': {'publisher': 'Atria Books', 'synopsis': "Before The Da Vinci Code there was Angels & Demons, the explosive thriller that introduced the mysterious world of Harvard symbologist Robesrt Langdon. Now Dan Brown's legions of fans can add a breathtaking new dimension to the Angels & Demons reading experience with this Special Illustrated Edition, featuring 150 images of the architectural highlights, religious symbols, paintings, maps, culptures, and locations found in this contemporary classic.<br/><br/>An ancient secret brotherhood. A devastating new weapon of destruction. An unthinkable target. When world-renowned Harvard symbologist Robert Langdon is summoned to a Swiss research facility to analyze a mysterious symbol -- seared into the chest of a murdered physicist -- he discovers evidence of the unimaginable: the resurgence of an ancient secret brotherhood known as the Illuminati...the most powerful underground organization ever to walk the earth. The Illuminati has now surfaced to carry out the final phase of its legendary vendetta against and age-old enemy.<br/><br/>Langdon's worst fears are confirmed on the eve of the Vatican's holy conclave, when a messenger of the Illuminati announces they have hidden an unstoppable time bomb at the very heart of Vatican City. With the countdown under way, Langdon jets to Rome to join forces with Vittoria Vetra, a beautiful and mysterious Italian scientist, to assist the Vatican in a desperate bid for survival.<br/><br/>No Dan Brown library is complete without this lavishly illustrated special edition. No true lover od suspense fiction will be able to resist the exhilarating blend of scholarly intrigue and relentless adventure found in Angels & Demons.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/50/64/9780743275064.jpg', 'title_long': "Angels & Demons: Special Illustrated Collector's Edition (Robert Langdon)", 'edition': 'Illustrated', 'dimensions': 'Height: 10 Inches, Length: 8 Inches, Weight: 3.58 Pounds, Width: 1.4 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8}, 'width': {'unit': 'inches', 'value': 1.4}, 'weight': {'unit': 'pounds', 'value': 3.58}, 'height': {'unit': 'inches', 'value': 10}}, 'pages': 528, 'date_published': '2005-05-03', 'subjects': ['Humor & Entertainment', 'Literature & Fiction', 'United States', 'Contemporary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Spies & Politics', 'Suspense', 'Crime', 'Historical', 'Self Service', 'Custom Stores'], 'authors': ['Dan Brown'], 'title': "Angels & Demons: Special Illustrated Collector's Edition (Robert Langdon)", 'isbn13': '9780743275064', 'msrp': 0, 'binding': 'Hardcover', 'isbn': '0743275063', 'isbn10': '0743275063'}}