{'book': {'publisher': 'Washington Square Press', 'synopsis': "He was neither a mathematician nor a trained physicist and yet Léon Foucault always knew that a mysterious force of nature was among us. Like Newton, Galileo, Copernicus, and others before him, Foucault sensed a dramatic relationship between the rotating skies above and the seemingly motionless ground beneath our feet. But it wasn't until 1851 -- in Paris, inside the Panthéon, and in the company of fellow amateur scientist Napoleon III -- that Foucault swung a pendulum and demonstrated an extraordinary truth about the world: that it turns on its axis.<br/>Pendulum is a fascinating journey through the mind and findings of one of the most important and lesser-known characters in the history of science. Through careful research and lively anecdotes, world-renowned author Amir D. Aczel reveals the astonishing range and breadth of Foucault's discoveries. For, in addition to offering the first unequivocal proof of Earth's rotation, Foucault gave us the modern electric compass and microscope, was a pioneer in photographic technology, and made remarkable deductions about color theory, heat waves, and the speed of light.<br/>At its heart, Pendulum is a story about the illustrious period in France during the Second Empire; the crucial triumph of science over religion; and, most compelling, the life of a struggling, self-made man whose pursuit of knowledge continues to inform our notions about the universe today.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/47/96/9780743464796.jpg', 'title_long': 'Pendulum: Leon Foucault and the Triumph of Science', 'edition': 'Reprint', 'dimensions': 'Height: 8 Inches, Length: 5 Inches, Weight: 0.57540650382 Pounds, Width: 0.8 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5}, 'width': {'unit': 'inches', 'value': 0.8}, 'weight': {'unit': 'pounds', 'value': 0.57540650382}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 288, 'date_published': '2004-09-14', 'subjects': ['Biographies & Memoirs', 'Community & Culture', 'Black & African American', 'Professionals & Academics', 'Scientists', 'Science & Math', 'Astronomy & Space Science', 'Astrophysics & Space Science', 'History & Philosophy', 'Physics', 'Self Service', 'Custom Stores'], 'authors': ['Amir D. Aczel'], 'title': 'Pendulum: Leon Foucault and the Triumph of Science', 'isbn13': '9780743464796', 'msrp': 19.95, 'binding': 'Paperback', 'related': {'ePub': '1416588434'}, 'isbn': '0743464796', 'isbn10': '0743464796', 'other_isbns': [{'isbn': '9781416588436', 'binding': 'print'}]}}