{'book': {'publisher': 'Scribner', 'synopsis': "From the Pulitzer Prize-winning, mega-bestselling author who wore his celebrity with extraordinary grace comes a magnificently appealing book about teaching and about how one great storyteller found his voice.<br/><br/>Frank McCourt became an unlikely star when, at the age of sixty-six, he burst onto the literary scene with Angela's Ashes, the Pulitzer Prize-winning memoir of his childhood in Limerick, Ireland. Then came 'Tis, his glorious account of his early years in New York.<br/><br/>Now, here at last is McCourt's long-awaited book about how his thirty-year teaching career shaped his second act as a writer. Teacher Man is also an urgent tribute to teachers everywhere. In bold and spirited prose featuring his irreverent wit and compelling honesty, McCourt records the trials, triumphs and surprises he faced in the classroom. Teacher Man shows McCourt developing his unparalleled ability to tell a great story as, five days a week, five periods per day, he worked to gain the attention and respect of unruly, hormonally charged or indifferent adolescents.<br/><br/>For McCourt, storytelling itself is the source of salvation, and in Teacher Man the journey to redemption -- and literary fame -- is an exhilarating adventure.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/37/80/9780743243780.jpg', 'title_long': 'Teacher Man: A Memoir', 'edition': 'First Edition', 'dimensions': 'Height: 8.4375 Inches, Length: 5.5 Inches, Weight: 0.5 Pounds, Width: 0.68 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.68}, 'weight': {'unit': 'pounds', 'value': 0.5}, 'height': {'unit': 'inches', 'value': 8.4375}}, 'pages': 258, 'date_published': '2005-09-19', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Community & Culture', 'Women', 'Emigrants & Immigrants', 'Memoirs', 'Professionals & Academics', 'Educators', 'Education & Teaching', 'Schools & Teaching', 'Self Service', 'Custom Stores'], 'authors': ['Frank McCourt'], 'title': 'Teacher Man: A Memoir', 'isbn13': '9780743243780', 'msrp': 17, 'binding': 'Paperback', 'related': {'Kindle Edition': '0743282000', 'ePub': '0743282000'}, 'isbn': '0743243781', 'isbn10': '0743243781', 'other_isbns': [{'isbn': '9780743282000', 'binding': 'print'}]}}