{'book': {'publisher': 'Atria', 'synopsis': 'The experience and quality that I bring to my writing can\'t be faked. I know what I know. Through my novels, I invite readers to journey with me into the streets. Come see what I\'ve seen. Let me show the gritty and grimy undercarriage of society, the "flip side" of the game....<br/>-- Shannon Holmes<br/>Inspired by the events of his own life, the Essence bestselling author of B-More Careful and Bad Girlz presents a vivid, unflinching novel about a young man\'s coming of age in the city streets.<br/>Never Go Home Again is the story of Corey Dixon, a young man whose father tries as best he can to steer him away from the lure of the streets. And yet, like so many others in his neighborhood, Corey finds the lucrative drug trade too tempting to resist. While he makes fast money for a while, ultimately Corey must pay the price for his choice of his profession: his freedom. By the age of sixteen, Corey is sentenced to prison.<br/>Incarcerated at Riker\'s Island, Corey lives through experiences that threaten to destroy his body, his mind, and his spirit. Still, in the midst of his horrific imprisonment, he discovers inner strength and -- against unimaginable odds -- manages to survive. Corey makes a new kind of family for himself in jail, including a teacher who encourages him to "never go home again." In the course of his journey of self-discovery, Corey comes to realize the wisdom in his mentor\'s words.<br/>Unflinching and riveting, Never Go Home Again is a powerful, true-to-life story of redemption that no reader will soon forget.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/61/62/9780743496162.jpg', 'title_long': 'Never Go Home Again: A Novel', 'edition': 'Reprint', 'dimensions': 'Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.6503636729 Pounds, Width: 1.1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.1}, 'weight': {'unit': 'pounds', 'value': 0.6503636729}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 336, 'date_published': '2005-09-27', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Urban Life', 'United States', 'Black & African American', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors': ['Shannon Holmes'], 'title': 'Never Go Home Again: A Novel', 'isbn13': '9780743496162', 'msrp': 20.99, 'binding': 'Paperback', 'related': {'ePub': '1416510001'}, 'isbn': '0743496167', 'isbn10': '0743496167', 'other_isbns': [{'isbn': '9781416510000', 'binding': 'print'}]}}