{'book': {'publisher': 'Simon & Schuster Audio', 'synopsis': "Before he gained wide fame as a novelist, Ernest Hemingway established his literary reputation with his short stories. Set in the varied landscapes of Spain, Africa, and the American Midwest, this definitive audio collection traces the development and maturation of Hemingway's distinct and revolutionary storytelling style -- from the plain bold language of this first story to his mastery of seamless prose that contained a spare, eloquent pathos, as well as a sense of expansive solitude. These stories showcase the singular talent of a master, the most important American writer of the twentieth century.<br/>The Short Stories Volume III features Stacy Keach reading such favorites as: An Alpine Idyll, A Pursuit Race, Today is Friday, Banal Story, Now I Lay Me, After the Storm, A Clean, Well-lighted Place, The Light of the World, God Rest You Merry, Gentlemen, The Sea Change, A Way You'll Never Be, The Mother of the Queen, One Reader Writes, Homage to Switzerland, A Day's Wait, A Natural History of the Dead, Wine of Wyoming, The Gambler, The Nun, and the Radio, and Fathers and Sons.<br/><br/>ALL STORIES ARE UNABRIDGED", 'language': 'en', 'image': 'https://images.isbndb.com/covers/72/93/9780743527293.jpg', 'title_long': 'The Short Stories Volume III (Short Stories (Simon & Schuster Audio))', 'edition': 'Unabridged', 'dimensions': 'Height: 5.92 Inches, Length: 4.94 Inches, Weight: 0.51 Pounds, Width: 1.07 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.94}, 'width': {'unit': 'inches', 'value': 1.07}, 'weight': {'unit': 'pounds', 'value': 0.51}, 'height': {'unit': 'inches', 'value': 5.92}}, 'pages': 5, 'date_published': '2003-03-01', 'subjects': ['Literature & Fiction', 'Classics', 'Short Stories & Anthologies', 'Short Stories', 'Literary', 'Self Service', 'Custom Stores'], 'authors': ['Ernest Hemingway'], 'title': 'The Short Stories Volume III (Short Stories (Simon & Schuster Audio))', 'isbn13': '9780743527293', 'msrp': 30, 'binding': 'Audio CD', 'isbn': '0743527291', 'isbn10': '0743527291'}}