{'book': {'publisher': 'Kaplan Publishing', 'synopsis': "Makes scoring higher so easy, it's scary!<br/>Millions of readers have enjoyed the chilling tale of Frankenstein for its dark and gripping plot. But did you know that it's also packed with words you need to know for the SAT?<br/>Learning words by reading them in context is the most effective way to expand your vocabulary, and this book can help you do just that! This edition of Frankenstein includes:<br/>\x95 629 SAT vocabulary words highlighted throughout the text<br/>\x95 Definitions for each highlighted word on the facing page<br/>\x95 A word pronunciation guide<br/>\x95 Plus a special glossary that defines over 100 additional challenging vocabulary words<br/>\x95 It's a pain-free way to build your vocabulary -- and to score higher on the test!<br/>World Leader in Test Prep and Admissions<br/>Kaplan has been the world leader in test preparation for more than 60 years, helping more than 3 million students achieve their educational and career goals. With 185 centers and more than 1,200 classroom locations throughout the U.S. and abroad, Kaplan provides a full range of services, including test prep courses, admissions consulting, programs for international students, professional licensing preparation, and more.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/57/83/9780743255783.jpg', 'title_long': 'Frankenstein: A Kaplan SAT Score-Raising Classic', 'dimensions': 'Height: 6.8 Inches, Length: 4.3 Inches, Weight: 0.46958461806 Pounds, Width: 1.2 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.3}, 'width': {'unit': 'inches', 'value': 1.2}, 'weight': {'unit': 'pounds', 'value': 0.46958461806}, 'height': {'unit': 'inches', 'value': 6.8}}, 'pages': 448, 'date_published': '2003-12-23', 'subjects': ['Literature & Fiction', 'Classics', 'Test Preparation', 'College & High School', 'SAT', 'Education & Teaching', 'Studying & Workbooks'], 'authors': ['Mary Shelley'], 'title': 'Frankenstein: A Kaplan SAT Score-Raising Classic', 'isbn13': '9780743255783', 'msrp': 6.99, 'binding': 'Mass Market Paperback', 'isbn': '074325578X', 'isbn10': '074325578X'}}