{'book': {'publisher': 'Simon & Schuster', 'synopsis': "By the author of the acclaimed bestseller Benjamin Franklin, this is the first full biography of Albert Einstein since all of his papers have become available.<br/>How did his mind work? What made him a genius? Isaacson's biography shows how the imagination that distinguished his science sprang from the rebellious nature of his personality. His fascinating story, a testament to the connection between creativity and freedom, reflects the triumphs and tumults of the modern era.<br/>Based on the newly-released papers and personal letters, this book explores how an imaginative, impertinent patent clerk - a struggling father in a difficult marriage who couldn't get a teaching job or a doctorate - became the mindreader of the creator of the cosmos, the locksmith of the mysteries of the atom and the universe. His success came from questioning conventional wisdom and marveling at mysteries that struck others as mundane. This led him to embrace a morality and politics based on respect for free minds, free spirits, and free individuals. These traits are just as vital for this new century of globalization, in which our success will depend on our creativity, as they were for the beginning of the last century, when Einstein helped usher in the modern age.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/47/30/9780743264730.jpg', 'title_long': 'Einstein: His Life and Universe', 'edition': 'First Edition', 'dimensions': 'Height: 9.75 Inches, Length: 6.75 Inches, Weight: 2.4 Pounds, Width: 2 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.75}, 'width': {'unit': 'inches', 'value': 2}, 'weight': {'unit': 'pounds', 'value': 2.4}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 675, 'date_published': '2007-04-10', 'subjects': ['Biographies & Memoirs', 'Professionals & Academics', 'Scientists', 'History', 'Science & Math', 'History & Philosophy', 'Physics', 'Relativity'], 'authors': ['Walter Isaacson'], 'title': 'Einstein: His Life and Universe', 'isbn13': '9780743264730', 'msrp': 23.45, 'binding': 'Hardcover', 'isbn': '0743264738', 'isbn10': '0743264738'}}