{'book': {'publisher': 'Atria', 'synopsis': 'From #1 New York Times bestselling author and “queen of royal fiction” (USA TODAY) Philippa Gregory comes the remarkable story of Katherine of Aragon, Princess of Spain, daughter of two great monarchs, and eventual Queen of England when she marries the infamous King Henry VIII.<br/><br/>Daughter of Queen Isabella and King Ferdinand of Spain, Katherine has been fated her whole life to marry Prince Arthur of England. When they meet and are married, the match becomes as passionate as it is politically expedient. The young lovers revel in each other’s company and plan the England they will make together. But tragically, aged only fifteen, Arthur falls ill and extracts from his sixteen-year-old bride a deathbed promise to marry his brother, Henry; become Queen; and fulfill their dreams and her destiny.<br/><br/>Widowed and alone in the avaricious world of the Tudor court, Katherine has to sidestep her father-in-law’s desire for her and convince him, and an incredulous Europe, that her marriage to Arthur was never consummated, that there is no obstacle to marriage with Henry. For seven years, she endures the treachery of spies, the humiliation of poverty, and intense loneliness and despair while she waits for the inevitable moment when she will step into the role she has prepared for all her life. Then, like her warrior mother, Katherine must take to the battlefield and save England when its old enemies the Scots come over the border and there is no one to stand against them but the new Queen.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/24/90/9780743272490.jpg', 'title_long': 'The Constant Princess (The Plantagenet and Tudor Novels)', 'edition': 'Reprint', 'dimensions': 'Height: 8 Inches, Length: 5.25 Inches, Weight: 0.75 Pounds, Width: 1.2 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 1.2}, 'weight': {'unit': 'pounds', 'value': 0.75}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 393, 'date_published': '2006-09-06', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', "Women's Fiction", 'Domestic Life', 'British & Irish', 'Literary', 'Romance', 'Self Service', 'Custom Stores'], 'authors': ['Philippa Gregory'], 'title': 'The Constant Princess (The Plantagenet and Tudor Novels)', 'isbn13': '9780743272490', 'msrp': 17, 'binding': 'Paperback', 'related': {'Kindle Edition': '0743282485'}, 'isbn': '0743272498', 'isbn10': '0743272498', 'other_isbns': [{'isbn': '9780743282482', 'binding': 'print'}]}}