{'book': {'publisher': 'Simon & Schuster', 'synopsis': 'The authoritative edition of Othello from The Folger Shakespeare Library, the trusted and widely used Shakespeare series for students and general readers.<br/><br/>In Othello, Shakespeare creates powerful drama from a marriage between the exotic Moor Othello and the Venetian lady Desdemona that begins with elopement and mutual devotion and ends with jealous rage and death. Shakespeare builds many differences into his hero and heroine, including race, age, and cultural background. Yet most readers and audiences believe the couple’s strong love would overcome these differences were it not for Iago, who sets out to destroy Othello. Iago’s false insinuations about Desdemona’s infidelity draw Othello into his schemes, and Desdemona is subjected to Othello’s horrifying verbal and physical assaults.<br/><br/>This edition includes:<br/>-Freshly edited text based on the best early printed version of the play<br/>-Full explanatory notes conveniently placed on pages facing the text of the play<br/>-Scene-by-scene plot summaries<br/>-A key to the play’s famous lines and phrases<br/>-An introduction to reading Shakespeare’s language<br/>-An essay by a leading Shakespeare scholar providing a modern perspective on the play<br/>-Fresh images from the Folger Shakespeare Library’s vast holdings of rare books<br/>-An annotated guide to further reading<br/><br/>Essay by Susan Snyder<br/><br/>The Folger Shakespeare Library in Washington, DC, is home to the world’s largest collection of Shakespeare’s printed works, and a magnet for Shakespeare scholars from around the globe. In addition to exhibitions open to the public throughout the year, the Folger offers a full calendar of performances and programs. For more information, visit Folger.edu.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/75/50/9780743477550.jpg', 'title_long': 'Othello', 'edition': 'First Edition', 'dimensions': 'Height: 6.75 Inches, Length: 4.1875 Inches, Weight: 0.42549216566 Pounds, Width: 0.9 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.1875}, 'width': {'unit': 'inches', 'value': 0.9}, 'weight': {'unit': 'pounds', 'value': 0.42549216566}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 314, 'date_published': '1993-07', 'subjects': ['Literature & Fiction', 'Classics', 'Dramas & Plays', 'British & Irish', 'Tragedy', 'Shakespeare', 'Self Service', 'Custom Stores'], 'authors': ['William Shakespeare'], 'title': 'Othello', 'isbn13': '9780743477550', 'msrp': 5.99, 'binding': 'Mass Market Paperback', 'related': {'Kindle Edition': '1476788529', 'ePub': '1476788529'}, 'isbn': '0743477553', 'isbn10': '0743477553', 'other_isbns': [{'isbn': '9781476788524', 'binding': 'print'}]}}