{'book': {'publisher': 'BRADY GAMES', 'synopsis': "Let BradyGames Be Your Partner in Crime in San Andreas! BradyGames' Grand Theft Auto: San Andreas Official Strategy Guide features a step-by-step walkthrough. Mission strategies to achieve every objective and detailed maps. Coverage of new character abilities, plus a showroom of all vehicles. Game secrets and hidden packages! Signature Series guide includes bonus content, a premium foldout, and much more! BradyGames is Official and Exclusive on this title. Platform: PlayStation 2<br/>Grand Theft Auto: San Andreas is the latest game in the world-renowned Grand Theft Auto franchise. The game features several new elements and revolves around three cities--Los Santos (based on Los Angeles), San Fierro (based on San Francisco), and Las Venturas (based on Las Vegas). Each city is relatively the size of Vice City--making it clear what the magnitude of the game is. Some of the new elements in this game include four-person drivebys, house break-ins and robberies, character abilities such as eating and swimming and more. The visual effects have also been improved with things like real-time reflections, fully rendered interior environments, and new camera controls. The storyline, set in the early 90s, centers on Carl Johnson, a man who escaped from the pressures of life in Los Santos, San Andreas, five years ago. Now Carl's got to go home, and on his return to the neighborhood, he is framed for homicide. Not Final Cover.<br/>Take Two Interactive Software, Inc., headquartered in New York City, is an integrated global developer, marketer, distributor, and publisher of interactive entertainment software games and accessories for the PC, PlayStation®, PlayStation®2, Xbox¿, Nintendo Game Boy Color, Nintendo GameCube and Nintendo Game Boy Advance. The Company publishes and develops products through various wholly owned subsidiaries including: Rockstar Games, Rockstar North, Gotham Games, Gathering of Developers, TalonSoft, Joytech, PopTop, and Global Star. The Company maintains sales and marketing offices in Cincinnati, New York, Toronto, London, Paris, Munich, Vienna, Copenhagen, Milan, Sydney and Auckland. Take-Two's common stock is publicly traded on NASDAQ under the symbol TTWO. For more corporate and product information please visit our website at www.take2games.com.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/42/98/9780744004298.jpg', 'title_long': 'Grand Theft Auto: San Andreas Official Strategy Guide', 'edition': '1', 'dimensions': 'Height: 10.84 Inches, Length: 8.45 Inches, Weight: 2.00179733896 Pounds, Width: 0.6 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.45}, 'width': {'unit': 'inches', 'value': 0.602}, 'weight': {'unit': 'pounds', 'value': 2.00179733896}, 'height': {'unit': 'inches', 'value': 10.84}}, 'pages': 272, 'date_published': '2004-10-25', 'subjects': ['Computers & Technology', 'Games & Strategy Guides', 'Strategy Guides', 'Reference', 'Foreign Language Study & Reference'], 'authors': ['Rick Barba'], 'title': 'Grand Theft Auto: San Andreas Official Strategy Guide', 'isbn13': '9780744004298', 'msrp': 16.99, 'binding': 'Paperback', 'isbn': '0744004292', 'isbn10': '0744004292'}}