{'book': {'publisher': 'DAW', 'synopsis': "Mercedes Lackey's magical Elemental Masters series recasts familiar fairy tales in a richly-imagined alternate Victorian world<br/><br/>The letter that introduced twelve-year-old Sarah Jane Lyon-White to Isabelle Harton, who ran the Harton School in central London, seemed quite simple and straightforward. But it was what was not written in the letter that resonated to Isabelle’s own finely tuned “extra” senses: “Sarah has gifts we cannot train,” the letter whispered to her, “nor can anyone we know. Those we trust tell us that you can….”<br/><br/>And it was true, for the Harton School was far from ordinary. It was Isabelle’s job to train children who possessed the odd types of magic that could not be trained by London’s powerful Elemental Masters: clairvoyants, telepaths, those with the ability to sense hidden danger, the vision to see into the past, and even that rarest of all talents: the ability to see and communicate with the dead.<br/><br/>But Isabelle was uneasy, for though she knew that Sarah Jane had a touch of telepathy, there seemed to be something else about the girl—something that had not yet manifested.<br/><br/>And Isabelle was right to be worried, for as soon as Sarah’s full talents became evident, there was an attempt made on her life. For Sarah was that rarest of magicians: a true medium, and for some reason, a powerful Elemental Master wanted her dead.<br/><br/>Isabelle knew that to protect her ward she would have to seek help from the Elemental Masters of the city. That meant she would also see Lord David Alderscroft, the man she had once loved, but who had inexplicably chilled toward her and broken her heart long ago—for he was the leader of the city’s Elemental Masters, the man who was now called the Wizard of London.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/36/38/9780756403638.jpg', 'title_long': 'The Wizard of London (Elemental Masters, Book 4)', 'edition': 'Reprint', 'dimensions': 'Height: 6.7 Inches, Length: 4.2 Inches, Weight: 0.525 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.2}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.525}, 'height': {'unit': 'inches', 'value': 6.7}}, 'pages': 384, 'date_published': '2006-10-03', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Horror', 'History & Criticism', 'Movements & Periods', 'Science Fiction & Fantasy', 'Fantasy', 'Historical', 'Paranormal & Urban', 'Romantic'], 'authors': ['Mercedes Lackey'], 'title': 'The Wizard of London (Elemental Masters, Book 4)', 'isbn13': '9780756403638', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'related': {'Kindle Edition': '1101118229', 'ePub': '1101118229'}, 'isbn': '0756403634', 'isbn10': '0756403634', 'other_isbns': [{'isbn': '9781101118221', 'binding': 'print'}]}}