{'book': {'publisher': 'DAW', 'synopsis': "Blending science fiction and fantasy, the first book of the Coldfire Trilogy tells a dark tale of an alien world where nightmares are made manifest.<br/><br/>Over a millennium ago, Erna, a seismically active yet beautiful world was settled by colonists from far-distant Earth. But the seemingly habitable planet was fraught with perils no one could have foretold. The colonists found themselves caught in a desperate battle for survival against the fae, a terrifying natural force with the power to prey upon the human mind itself, drawing forth a person's worst nightmare images or most treasured dreams and indiscriminately giving them life.<br/><br/>Twelve centuries after fate first stranded the colonists on Erna, mankind has achieved an uneasy stalemate, and human sorcerers manipulate the fae for their own profit, little realizing that demonic forces which feed upon such efforts are rapidly gaining in strength.<br/><br/>Now, as the hordes of the dark fae multiply, four people—Priest, Adept, Apprentice, and Sorcerer—are about to be drawn inexorably together for a mission which will force them to confront an evil beyond their imagining, in a conflict which will put not only their own lives but the very fate of humankind in jeopardy.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/31/40/9780756403140.jpg', 'title_long': 'Black Sun Rising (Coldfire)', 'edition': 'Reprint', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.1125 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.1125}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 496, 'date_published': '2005-09-06', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Horror', 'Action & Adventure', 'Fantasy', 'United States', 'Science Fiction & Fantasy', 'Epic', 'Historical', 'Science Fiction'], 'authors': ['C.S. Friedman'], 'title': 'Black Sun Rising (Coldfire)', 'isbn13': '9780756403140', 'msrp': 15, 'binding': 'Paperback', 'isbn': '0756403146', 'isbn10': '0756403146'}}