{'book': {'publisher': 'DAW', 'synopsis': 'From master storyteller and New York Times-bestseller Tad Williams comes the third book in the landmark epic fantasy saga of Memory, Sorrow, and Thorn.<br/><br/>Tad Williams introduced readers to the incredible fantasy world of Osten Ard in his internationally bestselling series Memory, Sorrow, and Thorn. The trilogy inspired a generation of modern fantasy writers, including George R.R. Martin, Patrick Rothfuss, and Christopher Paolini, and defined Tad Williams as one of the most important fantasy writers of our time. \u2028\u2028\u2028\u2028<br/><br/>“One of my favorite fantasy series.” —George R. R. Martin<br/>“Groundbreaking.” —Patrick Rothfuss<br/>“One of the great fantasy epics of all time.” —Christopher Paolini<br/><br/>BOOK THREE: TO GREEN ANGEL TOWER<br/><br/>The evil minions of the undead Sithi Storm King are beginning their final preparations for the kingdom-shattering culmination of their dark sorceries, drawing King Elias ever deeper into their nightmarish, spell-spun world.<br/><br/>As the Storm King’s power grows and the boundaries of time begin to blur, the loyal allies of Prince Josua struggle to rally their forces at the Stone of Farewell. There, too, Simon and the surviving members of the League of the Scroll have gathered for a desperate attempt to unravel mysteries from the forgotten past.<br/><br/>For if the League can reclaim these age-old secrets of magic long-buried beneath the dusts of time, they may be able to reveal to Josua and his army the only means of striking down the unslayable foe....<br/><br/>After the landmark Memory, Sorrow, and Thorn trilogy, the epic saga of Osten Ard continues with The Heart of What Was Lost. Then don’t miss the sequel trilogy, The Last King of Osten Ard, beginning with The Witchwood Crown!', 'language': 'en', 'image': 'https://images.isbndb.com/covers/29/83/9780756402983.jpg', 'title_long': 'To Green Angel Tower (Memory, Sorrow, and Thorn), Packaging May Vary', 'edition': 'Reprint', 'dimensions': 'Height: 8.96 Inches, Length: 5.98 Inches, Weight: 2.21 Pounds, Width: 2.37 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.98}, 'width': {'unit': 'inches', 'value': 2.37}, 'weight': {'unit': 'pounds', 'value': 2.21}, 'height': {'unit': 'inches', 'value': 8.96}}, 'pages': 1104, 'date_published': '2005-05-03', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Horror', 'United States', 'Science Fiction & Fantasy', 'Fantasy', 'Epic', 'Coming of Age', 'Science Fiction'], 'authors': ['Tad Williams'], 'title': 'To Green Angel Tower (Memory, Sorrow, and Thorn), Packaging May Vary', 'isbn13': '9780756402983', 'msrp': 25, 'binding': 'Paperback', 'related': {'ePub': '1101142227'}, 'isbn': '0756402980', 'isbn10': '0756402980', 'other_isbns': [{'isbn': '9781101142226', 'binding': 'print'}]}}