{'book': {'publisher': 'Hci', 'synopsis': '\'Pat Williams reminds us that reading can transform our lives. But for that to happen we have to turn off the TV and pick up the book. Books give us information, remind us we\'re human, and above all challenge our imagination. Pat Williams encourages people not to take this gift for granted.\'<br/>-- Senator Bill Bradley<br/>"Pat Williams does an extraordinary job illustrating the social and educational benefits of reading."<br/>--David Stern , Commissioner of the National Basketball Association<br/>Have you ever thought, \'I need to read more,\' but not known how or where to start? You can start right here! Read for Your Life reignites your love affair with books and shows you how to prioritize reading--no matter how busy you think you are. It\'s not just about filling that hard-to-find \'downtime.\' Books improve your life in every imaginable way and can give you a mental workout guaranteed to keep your brain fit, alert, and active your whole lifetime.<br/>Author Pat Williams is on a mission to help us all fully access and enjoy the power of reading. If Pat--a father of nineteen children, a four-marathon-a-year runner, and the senior vice president of the Orlando Magic--can make time for it, anyone can. With anecdotes and interviews from today\'s greatest icons in business, academia, and sports--including Alex Rodriguez, Grant Hill, Oprah Winfrey, Rick Warren, and Rudy Giuliani-- Read for Your Life shows you how you can:<br/>路 Minimize distractions and maximize your reading time<br/>路 Develop a personalized program for reading more often<br/>路 Discover the many ways that reading can improve your mental well-being, your outlook on life, and your level of success in your career<br/>路 Rediscover and reconnect with the real you by reading regularly<br/>The lifetime gift of literacy is inside this book. Unleash it!', 'language': 'en', 'image': 'https://images.isbndb.com/covers/54/50/9780757305450.jpg', 'title_long': 'Read for Your Life: 11 Ways to Transform Your Life Through Books', 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 1 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 284, 'date_published': '2007', 'subjects': ['Self-Help', 'Personal Transformation', 'Literature & Fiction', 'History & Criticism', 'Books & Reading'], 'authors': ['Pat Williams', 'Peggy Matthews Rose'], 'title': 'Read for Your Life: 11 Ways to Transform Your Life Through Books', 'isbn13': '9780757305450', 'msrp': 10.16, 'binding': 'Paperback', 'isbn': '0757305458', 'isbn10': '0757305458'}}