{'book': {'publisher': 'Candlewick', 'synopsis': '"Forgiveness, light, love, and soup. These essential ingredients combine into a tale that is as soul-stirring as it is delicious." — BOOKLIST (starred review)<br/><br/>Welcome to the story of Despereaux Tilling, a mouse who is in love with music, stories, and a princess named Pea. It is also the story of a rat called Roscuro, who lives in the darkness and covets a world filled with light. And it is the story of Miggery Sow, a slow-witted serving girl who harbors a simple, impossible wish. These three characters are about to embark on a journey that will lead them down into a horrible dungeon, up into a glittering castle, and, ultimately, into each other\'s lives. What happens then? As Kate DiCamillo would say: Reader, it is your destiny to find out.<br/><br/>From the master storyteller who brought us BECAUSE OF WINN-DIXIE comes another classic, a fairy tale full of quirky, unforgettable characters, with twenty-four stunning black-and-white illustrations by Timothy Basil Ering. This paperback edition pays tribute to the book\'s classicdesign, featuring a rough front and elegant gold stamping.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/52/90/9780763625290.jpg', 'title_long': 'The Tale of Despereaux: Being the Story of a Mouse, a Princess, Some Soup and a Spool of Thread', 'dimensions': 'Height: 7.69 Inches, Length: 5.13 Inches, Weight: 0.64 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.13}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.64}, 'height': {'unit': 'inches', 'value': 7.69}}, 'pages': 272, 'date_published': '2006-04-11', 'subjects': ["Children's Books", 'Animals', 'Mice, Hamsters, Guinea Pigs & Squirrels', 'Literature & Fiction', 'Action & Adventure', 'Fairy Tales, Folk Tales & Myths', 'Reference', 'Self Service', 'Custom Stores'], 'authors': ['Kate DiCamillo'], 'title': 'The Tale of Despereaux: Being the Story of a Mouse, a Princess, Some Soup and a Spool of Thread', 'isbn13': '9780763625290', 'msrp': 7.99, 'binding': 'Paperback', 'isbn': '0763625299', 'isbn10': '0763625299'}}