{'book': {'publisher': 'CliffsNotes', 'synopsis': "In the CliffsComplete guides, the novel's complete text and a glossary appear side-by-side with coordinating numbered lines to help you understand unusual words and phrasing. You'll also find all the commentary and resources of a standard CliffsNotes for Literature.<br/>CliffsComplete A Midsummer Night’s Dream has long been one of Shakespeare’s most popular plays. Its magical atmosphere, farcical plot, hilarious play-within-a-play, and general air of celebration have been enjoyed by nearly every generation since it was written.<br/>Everything is not what it seems in this play. Stay on top of what’s really going on — and save valuable studying time — all at once. Enhance your reading of A Midsummer Night’s Dream with these additional features: A summary and insightful commentary for each act Bibliography and historical background on the author, William Shakespeare A look at the historical context and structure of the play Discussions on the play’s symbols and themes A character map that graphically illustrates the relationships among the characters Review questions, a quiz, discussion topics (essay questions), activity ideas A ResourceCenter full of books, articles, films, and Internet sites<br/>Streamline your literature study with all-in-one help from CliffsComplete guides!", 'language': 'en', 'image': 'https://images.isbndb.com/covers/72/52/9780764587252.jpg', 'title_long': "CliffsComplete Shakespeare's A Midsummer Night's Dream", 'edition': 'New edition', 'dimensions': 'Height: 9.25 Inches, Length: 7.38 Inches, Weight: 0.67 Pounds, Width: 0.44 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.38}, 'width': {'unit': 'inches', 'value': 0.44}, 'weight': {'unit': 'pounds', 'value': 0.67}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 192, 'date_published': '2001-04-15', 'subjects': ['Literature & Fiction', 'Dramas & Plays', 'Shakespeare', 'History & Criticism', 'Movements & Periods', 'Reference', 'Encyclopedias & Subject Guides', 'Antiques & Collectibles', 'Education & Teaching', 'Studying & Workbooks', 'Study Guides', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Michael McMahon', 'William Shakespeare'], 'title': "CliffsComplete Shakespeare's A Midsummer Night's Dream", 'isbn13': '9780764587252', 'msrp': 11.99, 'binding': 'Paperback', 'isbn': '0764587250', 'isbn10': '0764587250'}}