{'book': {'publisher': 'CliffsNotes', 'synopsis': "The original CliffsNotes study guides offer a look into critical elements and ideas within classic works of literature. The latest generation of titles in this series also feature glossaries and visual elements that complement the classic, familiar format.<br/>CliffsNotes on Crime and Punishment takes you into a masterpiece of Russian literature, a work published during the time the western world was moving away from romanticism and into a new realistic approach to writing.<br/>Following the story of an impoverished young man who expects to enrich humanity by rising to a level above the law, this study guide provides a character list, character map, and character analyses to explore the personalities within Fyodor Dostoevsky's masterpiece. Other features that help you figure out this important work include Life and background of the author Introduction to and brief synopsis of the novel Summaries and expert commentaries for each chapter within the book Essays that explore aspects of the author's characters and theories A review section that tests your knowledge and suggests essay topics and practice projects A Resource Center full of books, publications, films, and Internet resources<br/>Classic literature or modern-day treasure—you'll understand it all with expert information and insight from CliffsNotes study guides.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/65/52/9780764586552.jpg', 'title_long': "CliffsNotes on Dostoevsky's Crime and Punishment (Cliffsnotes Literature Guides) (CliffsNotes on Literature)", 'edition': '1', 'dimensions': 'Height: 8 Inches, Length: 5.1 Inches, Weight: 0.2866009406 Pounds, Width: 0.32 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.1}, 'width': {'unit': 'inches', 'value': 0.32}, 'weight': {'unit': 'pounds', 'value': 0.2866009406}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 128, 'date_published': '2000-11-07', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Books & Reading', 'Criticism & Theory', 'Movements & Periods', 'Comparative Literature', 'Regional & Cultural', 'Reference', 'Words, Language & Grammar', 'Reading Skills', 'Teen & Young Adult', 'Education & Reference', 'Study Aids', 'Education & Teaching', 'Studying & Workbooks', 'Study Guides', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['James L Roberts'], 'title': "CliffsNotes on Dostoevsky's Crime and Punishment (Cliffsnotes Literature Guides) (CliffsNotes on Literature)", 'isbn13': '9780764586552', 'msrp': 9.95, 'binding': 'Paperback', 'isbn': '0764586556', 'isbn10': '0764586556'}}