{'book': {'publisher': 'John Wiley andamp; Sons Inc', 'synopsis': "The original CliffsNotes study guides offer expert commentary on major themes, plots, characters, literary devices, and historical background. The latest generation of titles in this series also feature glossaries and visual elements that complement the classic, familiar format.<br/>Packed with action and vivid portrayal of human relationships, Shakespeare's Macbeth traces the bloody climb to power and tragic ruin of a fate-plagued king. Count on CliffNotes on Macbeth to carry you through the rise and fall of a cast of characters that includes a cruel and ambitious warrior, his wicked wife, and a trio of witches who have wormed their way into audiences' hearts since William Shakespeare first presented their prophecies about 300 years ago.<br/>Show your classmates—and your grade-granting teacher—that you're in the know with English literature. You can't miss with scene summaries, plot explorations, language simplification, and insights into the author's life and times. Other features that help you study include A brief synopsis of the play A character map to help you see relationships among the characters Critical essays on major themes and stage productions An interactive quiz to test your knowledge Essay topics and practice projects<br/>Classic literature or modern-day treasure—you'll understand it all with expert information and insight from CliffsNotes study guides.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/60/26/9780764586026.jpg', 'title_long': "Notes on Shakespeare's andquot;Macbethandquot;", 'edition': '1', 'dimensions': 'Height: 8.25 Inches, Length: 5.25 Inches, Weight: 0.25 Pounds, Width: 0.28 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 0.28}, 'weight': {'unit': 'pounds', 'value': 0.25}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 112, 'date_published': '2000', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Reference', 'Encyclopedias & Subject Guides', 'Literature'], 'authors': ['Alex Went'], 'title': "Notes on Shakespeare's andquot;Macbethandquot;", 'isbn13': '9780764586026', 'msrp': 5.99, 'binding': 'Paperback', 'isbn': '0764586025', 'isbn10': '0764586025'}}