{'book': {'publisher': 'Wiley', 'synopsis': 'The world\'s most infamous hacker offers an insider\'s view of the low-tech threats to high-tech security<br/>Kevin Mitnick\'s exploits as a cyber-desperado and fugitive form one of the most exhaustive FBI manhunts in history and have spawned dozens of articles, books, films, and documentaries. Since his release from federal prison, in 1998, Mitnick has turned his life around and established himself as one of the most sought-after computer security experts worldwide. Now, in The Art of Deception, the world\'s most notorious hacker gives new meaning to the old adage, "It takes a thief to catch a thief."<br/>Focusing on the human factors involved with information security, Mitnick explains why all the firewalls and encryption protocols in the world will never be enough to stop a savvy grifter intent on rifling a corporate database or an irate employee determined to crash a system. With the help of many fascinating true stories of successful attacks on business and government, he illustrates just how susceptible even the most locked-down information systems are to a slick con artist impersonating an IRS agent. Narrating from the points of view of both the attacker and the victims, he explains why each attack was so successful and how it could have been prevented in an engaging and highly readable style reminiscent of a true-crime novel. And, perhaps most importantly, Mitnick offers advice for preventing these types of social engineering hacks through security protocols, training programs, and manuals that address the human element of security.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/28/00/9780764542800.jpg', 'title_long': 'The Art of Deception: Controlling the Human Element of Security', 'edition': '1', 'dimensions': 'Height: 0.004 Inches, Length: 5.999988 Inches, Weight: 0.95019234922 Pounds, Width: 0.999998 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.999988}, 'width': {'unit': 'inches', 'value': 0.999998}, 'weight': {'unit': 'pounds', 'value': 0.95019234922}, 'height': {'unit': 'inches', 'value': 0.004}}, 'pages': 368, 'date_published': '2003-10-17', 'subjects': ['Business & Money', 'Management & Leadership', 'Information Management', 'Computers & Technology', 'Certification', 'CompTIA', 'Computer Science', 'Networking & Cloud Computing', 'Software', 'Internet & Social Media', 'Hacking', 'Security & Encryption', 'Self Service', 'Custom Stores', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Kevin D. Mitnick', 'William L. Simon'], 'title': 'The Art of Deception: Controlling the Human Element of Security', 'isbn13': '9780764542800', 'msrp': '0.00', 'binding': 'Paperback', 'isbn': '076454280X', 'isbn10': '076454280X', 'other_isbns': [{'isbn': '9780764538391', 'binding': 'ebook'}]}}