{'book': {'publisher': 'IDG Books', 'synopsis': "Discover how to apply ancient wisdom to your everyday life<br/><br/>Philosophy at its best is an activity more than a body of knowledge. In an ancient sense, done right, it is a healing art. It’s intellectual self-defense. It’s a form of therapy. But it’s also much more. Philosophy is map-making for the soul, cartography for the human journey. It’s an important navigational tool for life that too many modern people try to do without.<br/>Philosophy For Dummies is for anyone who has ever entertained a question about life and this world. In a conversational tone, the book's author – a modern-day scholar and lecturer – brings the greatest wisdom of the past into the challenges that we face now. This refreshingly different guide explains philosophical fundamentals and explores some of the strangest and deepest questions ever posed to human beings, such as How do we know anything? What does the word good mean? Are we ever really free? Do human beings have souls? Is there life after death? Is there a God? Is happiness really possible in our world?<br/>This book is chock full of all those questions you may have long wanted to think about and talk with someone about, but have never had the time or opportunity to tackle head on. Philosophy For Dummies invites you to discuss the issues you find in the guide, share perspectives, and compare thoughts and feelings with someone you respect. You'll find lots of material to mull over with your friends or spouse, including thoughts on When to doubt, and when to doubt our doubts The universal demand for evidence and proof The four dimensions of human experience Arguments for materialism Fear of the process of dying Prayers and small miracles Moral justification for allowing evil<br/>The ancient philosopher Socrates (fifth century, B.C.) thought that, when it comes to the Ultimate Questions, we all start off as dummies. But if we are humbly aware of how little we actually know, then we can really begin to learn. Philosophy For Dummies will put you on the path to wising up as you steer through the experience called life.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/15/36/9780764551536.jpg', 'title_long': 'Philosophy For Dummies', 'edition': '1', 'dimensions': 'Height: 9.75 Inches, Length: 7.5 Inches, Weight: 1.4 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.4}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 384, 'date_published': '1999-09-21', 'subjects': ['Politics & Social Sciences', 'Philosophy', 'Reference', 'Education & Teaching', 'Schools & Teaching', 'Education Theory'], 'authors': ['Tom Morris'], 'title': 'Philosophy For Dummies', 'isbn13': '9780764551536', 'msrp': 19.99, 'binding': 'Paperback', 'related': {'eBook': '1118053540'}, 'isbn': '0764551531', 'isbn10': '0764551531', 'other_isbns': [{'isbn': '9781118053546', 'binding': 'ebook'}]}}