{'book': {'publisher': 'CliffsNotes', 'synopsis': "In the CliffsComplete guides, the novel's complete text and a glossary appear side-by-side with coordinating numbered lines to help you understand unusual words and phrasing. You'll also find all the commentary and resources of a standard CliffsNotes for Literature.<br/>CliffsComplete Adventures of Huckleberry Finn offers insight and information into a work that's rich both dramatically and thematically. Every generation since its publication has been able to identify with some of the novel's themes, including freedom, society versus conscience, and greed.<br/>Follow the Mississippi River adventures of this mischief-making Huck Finn and the runaway slave Jim — and save valuable studying time — all at once. Enhance your reading of The Adventures of Huckleberry Finn with these additional features: A summary and insightful commentary for each chapter Bibliography and historical background on the author, Mark Twain A look at 18th-century life and society Coverage of Twain's writing and the reaction to the novel A character map that graphically illustrates the relationships among the characters Review questions, a quiz, discussion guide, and activity ideas A Resource Center full of books, articles, films, and Web sites<br/>Streamline your literature study with all-in-one help from CliffsComplete guides!", 'language': 'en', 'image': 'https://images.isbndb.com/covers/72/76/9780764587276.jpg', 'title_long': "CliffsComplete Mark Twain's The Adventures of Huckleberry Finn", 'dimensions': 'Height: 9.25 Inches, Length: 7.75 Inches, Weight: 0.000625 Pounds, Width: 0.6 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.75}, 'width': {'unit': 'inches', 'value': 0.6}, 'weight': {'unit': 'pounds', 'value': 0.000625}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 266, 'date_published': '2009-11-12', 'subjects': ["Children's Books", 'Classics', 'Literature & Fiction', 'Genre Fiction', 'Coming of Age', 'Contemporary', 'Literary'], 'authors': ['Mark Twain'], 'title': "CliffsComplete Mark Twain's The Adventures of Huckleberry Finn", 'isbn13': '9780764587276', 'msrp': 15.99, 'binding': 'Paperback', 'isbn': '0764587277', 'isbn10': '0764587277'}}