{'book': {'publisher': 'Tor Fantasy', 'synopsis': "Wolfskin is the first of a fantasy duet in The Light Isles series from Juliet Marillier, weaving history and folklore into a saga of adventure, romance, and magic.<br/>All young Eyvind ever wanted was to become a great Viking warrior--a Wolfskin--and carry honor out in the name of his fathergod Thor. He can think of no future more glorious. The chance to make it happen is his when his chieftain Ulf is brought the tale of a magical land across the sea, a place where men with courage could go to conquer a land and bring glory to themselves. They set out to find this fabled land, and discover a windswept and barren place, but one filled with unexpected beauty and hidden treasures... and a people who are willing to share their bounty.<br/>Ulf's new settlement begins in harmony with the natives of the isles led by the gentle king Engus. And Eyvind finds a treasure of his own in the young Nessa, niece of the King, seer and princess. His life will change forever as she claims his heart for her own.<br/>But someone has come along to this new land who is not what he seems. Somerled, a strange and lonely boy that Eyvind befriended long ago has a secret--and his own plans for the future. The blood oath that they swore in childhood binds them in lifelong loyalty, and Somerled is calling in the debt of honor. What he asks of Eyvind might just doom him to kill the only thing that Evyind has ever truly loved.<br/>Will the price of honor create the destruction of all that Eyvind holds dear?", 'language': 'en', 'image': 'https://images.isbndb.com/covers/59/05/9780765345905.jpg', 'title_long': 'Wolfskin (The Light Isles)', 'edition': 'Reprint', 'dimensions': 'Height: 1.1110214 Inches, Length: 1.11 Inches, Weight: 0.61 Pounds, Width: 1.1110214 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 1.11}, 'width': {'unit': 'inches', 'value': 1.1110214}, 'weight': {'unit': 'pounds', 'value': 0.61}, 'height': {'unit': 'inches', 'value': 1.1110214}}, 'pages': 544, 'date_published': '2004', 'subjects': ['Science Fiction & Fantasy', 'Fantasy', 'Epic', 'Historical', 'Myths & Legends'], 'authors': ['Juliet Marillier'], 'title': 'Wolfskin (The Light Isles)', 'isbn13': '9780765345905', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'isbn': '0765345900', 'isbn10': '0765345900'}}