{'book': {'publisher': 'Forge Books', 'synopsis': "Noir contains three long-lost thrillers by Richard Matheson, the grand master of suspense. Originally published in the 1950s, at the very beginning of Matheson's distinguished career, these page-turning classics have been largely out-of-print for decades. Now readers everywhere can savor three unforgettable tales of crime, corruption, and cold-blooded murder. . . .<br/><br/>Someone Is Bleeding--Dave Newton has fallen hard for Peggy, a leggy blonde with a lurid past and a heartbreaking smile. But as bloody corpses begin to litter his path, Dave is forced to confront the terrifying possibility that the woman he loves is a deranged killer!<br/><br/>Fury on Sunday--In the wee hours of one fateful Sunday morning, a homicidal maniac embarks on a rampage of terror and violence that threatens everyone who crosses his path, culminating in a deadly confrontation in a Manhattan apartment building.<br/><br/>Ride the Nightmare--Chris and Helen had the perfect suburban life--until Helen discovers her husband's guilty secret. Overnight, their peaceful existence descends into a vortex of fear and brutality that may cost them the life of their only child!", 'language': 'en', 'image': 'https://images.isbndb.com/covers/14/05/9780765311405.jpg', 'title_long': 'Noir: Three Novels of Suspense', 'edition': 'First Edition', 'dimensions': 'Height: 8.5 Inches, Length: 5.5 Inches, Weight: 1.10010668738 Pounds, Width: 0.85 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.85}, 'weight': {'unit': 'pounds', 'value': 1.10010668738}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 384, 'date_published': '2005-10-01', 'subjects': ['Literature & Fiction', 'Short Stories & Anthologies', 'Short Stories', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Thrillers & Suspense', 'Suspense', 'Self Service', 'Custom Stores'], 'authors': ['Richard Matheson'], 'title': 'Noir: Three Novels of Suspense', 'isbn13': '9780765311405', 'msrp': 15.95, 'binding': 'Paperback', 'isbn': '0765311402', 'isbn10': '0765311402'}}