{'book': {'publisher': 'Routledge', 'synopsis': 'This book traces the origins of a faith--perhaps the faith of the century. Modern revolutionaries are believers, no less committed and intense than were Christians or Muslims of an earlier era. What is new is the belief that a perfect secular order will emerge from forcible overthrow of traditional authority. This inherently implausible idea energized Europe in the nineteenth century, and became the most pronounced ideological export of the West to the rest of the world in the twentieth century. Billington is interested in revolutionaries--the innovative creators of a new tradition. His historical frame extends from the waning of the French Revolution in the late eighteenth century to the beginnings of the Russian Revolution in the early twentieth century.<br/>The theater was Europe of the industrial era; the main stage was the journalistic offices within great cities such as Paris, Berlin, London, and St. Petersburg. Billington claims with considerable evidence that revolutionary ideologies were shaped as much by the occultism and proto-romanticism of Germany as the critical rationalism of the French Enlightenment. The conversion of social theory to political practice was essentially the work of three Russian revolutions: in 1905, March 1917, and November 1917.<br/>Events in the outer rim of the European world brought discussions about revolution out of the school rooms and press rooms of Paris and Berlin into the halls of power.<br/>Despite his hard realism about the adverse practical consequences of revolutionary dogma, Billington appreciates the identity of its best sponsors, people who preached social justice transcending traditional national, ethnic, and gender boundaries. When this book originally appeared The New Republic hailed it as "remarkable, learned and lively," while The New Yorker noted that Billington "pays great attention to the lives and emotions of individuals and this makes his book absorbing." It is an invaluable work of history and contribution to our understanding of political life.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/47/16/9780765804716.jpg', 'title_long': 'Fire in the Minds of Men: Origins of the Revolutionary Faith', 'edition': 'Revised', 'dimensions': 'Height: 9.02 Inches, Length: 5.98 Inches, Weight: 2.8219169536 pounds, Width: 1.56 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.98}, 'width': {'unit': 'inches', 'value': 1.56}, 'weight': {'unit': 'pounds', 'value': 2.8219169536}, 'height': {'unit': 'inches', 'value': 9.02}}, 'pages': 677, 'date_published': '1998-09-30', 'subjects': ['History', 'Europe', 'Germany', 'World', 'Parenting & Relationships', 'Politics & Social Sciences', 'Social Sciences', 'Violence in Society', 'Sociology', 'Politics & Government', 'International & World Politics', 'Political Science', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['James Billington'], 'title': 'Fire in the Minds of Men: Origins of the Revolutionary Faith', 'isbn13': '9780765804716', 'msrp': 49.95, 'binding': 'Paperback', 'related': {'Page Fidelity': '1412814014', 'eBook': '1412814014'}, 'isbn': '0765804719', 'isbn10': '0765804719', 'other_isbns': [{'isbn': '9781351519816', 'binding': 'print'}, {'isbn': '9781412814010', 'binding': 'print'}]}}