{'book': {'publisher': 'Broadway Books', 'synopsis': "The crime-infested intersection of West Fayette and Monroe Streets is well-known--and cautiously avoided--by most of Baltimore. But this notorious corner's 24-hour open-air drug market provides the economic fuel for a dying neighborhood. David Simon, an award-winning author and crime reporter, and Edward Burns, a 20-year veteran of the urban drug war, tell the chilling story of this desolate crossroad.<br/><br/>Through the eyes of one broken family--two drug-addicted adults and their smart, vulnerable 15-year-old son, DeAndre McCollough, Simon and Burns examine the sinister realities of inner cities across the country and unflinchingly assess why law enforcement policies, moral crusades, and the welfare system have accomplished so little. This extraordinary book is a crucial look at the price of the drug culture and the poignant scenes of hope, caring, and love that astonishingly rise in the midst of a place America has abandoned.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/03/17/9780767900317.jpg', 'title_long': 'The Corner: A Year in the Life of an Inner-City Neighborhood', 'edition': 'First Edition', 'dimensions': 'Height: 8.2 Inches, Length: 5.48 Inches, Weight: 1 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.48}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 8.2}}, 'pages': 543, 'date_published': '1998-06-15', 'subjects': ['History', 'Americas', 'United States', 'Science & Math', 'Behavioral Sciences', 'Politics & Social Sciences', 'Social Sciences', 'Poverty', 'Criminology', 'Ethnic Studies', 'Sociology', 'Urban'], 'authors': ['David Simon', 'Edward Burns'], 'title': 'The Corner: A Year in the Life of an Inner-City Neighborhood', 'isbn13': '9780767900317', 'msrp': 18, 'binding': 'Paperback', 'related': {'ePub': '0307833461'}, 'isbn': '0767900316', 'isbn10': '0767900316', 'other_isbns': [{'isbn': '9780307833464', 'binding': 'print'}]}}