{'book': {'publisher': 'Crown', 'synopsis': 'From an award-winning New York Times reporter comes the full, mind-boggling true story of the lies, crimes, and ineptitude behind the Enron scandal that imperiled a presidency, destroyed a marketplace, and changed Washington and Wall Street forever.<br/><br/>It was the corporate collapse that appeared to come out of nowhere. In late 2001, the Enron Corporation—a darling of the financial world, a company whose executives were friends of presidents and the powerful—imploded virtually overnight, leaving vast wreckage in its wake and sparking a criminal investigation that would last for years.<br/><br/>Kurt Eichenwald transforms the unbelievable story of the Enron scandal into a rip-roaring narrative of epic proportions, taking readers behind every closed door—from the Oval Office to the executive suites, from the highest reaches of the Justice Department to the homes and bedrooms of the top officers. It is a tale of global reach—from Houston to Washington, from Bombay to London, from Munich to Sao Paolo—laying out the unbelievable scenes that twisted together to create this shocking true story.<br/><br/>Eichenwald reveals never-disclosed details of a story that features a cast including George W. Bush, Dick Cheney, Paul O’Neill, Harvey Pitt, Colin Powell, Gray Davis, Arnold Schwarzenegger, Alan Greenspan, Ken Lay, Andy Fastow, Jeff Skilling, Bill Clinton, Rupert Murdoch and Sumner Redstone. With its you-are-there glimpse into the secretive worlds of corporate power, Conspiracy of Fools is an all-true financial and political thriller of cinematic proportions.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/17/95/9780767911795.jpg', 'title_long': 'Conspiracy of Fools: A True Story', 'edition': 'Reprint', 'dimensions': 'Height: 9.2 Inches, Length: 6.15 Inches, Weight: 1.78 Pounds, Width: 1.65 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.15}, 'width': {'unit': 'inches', 'value': 1.65}, 'weight': {'unit': 'pounds', 'value': 1.78}, 'height': {'unit': 'inches', 'value': 9.2}}, 'pages': 784, 'date_published': '2005-12-27', 'subjects': ['Biographies & Memoirs', 'True Crime', 'White Collar Crime', 'Business & Money', 'Biography & History', 'Company Profiles', 'Industries', 'Energy & Mining', 'Politics & Social Sciences', 'Social Sciences', 'Criminology', 'Self Service', 'Custom Stores'], 'authors': ['Kurt Eichenwald'], 'title': 'Conspiracy of Fools: A True Story', 'isbn13': '9780767911795', 'msrp': 22, 'binding': 'Paperback', 'isbn': '0767911792', 'isbn10': '0767911792', 'other_isbns': [{'isbn': '9780767911801', 'binding': 'e'}]}}