{'book': {'publisher': 'Crown', 'synopsis': 'One of the world’s most beloved writers and New York Times bestselling author of A Walk in the Woods and The Body takes his ultimate journey—into the most intriguing and intractable questions that science seeks to answer.<br/><br/>In A Walk in the Woods, Bill Bryson trekked the Appalachian Trail—well, most of it. In A Sunburned Country, he confronted some of the most lethal wildlife Australia has to offer. Now, in his biggest book, he confronts his greatest challenge: to understand—and, if possible, answer—the oldest, biggest questions we have posed about the universe and ourselves. Taking as territory everything from the Big Bang to the rise of civilization, Bryson seeks to understand how we got from there being nothing at all to there being us. To that end, he has attached himself to a host of the world’s most advanced (and often obsessed) archaeologists, anthropologists, and mathematicians, travelling to their offices, laboratories, and field camps. He has read (or tried to read) their books, pestered them with questions, apprenticed himself to their powerful minds. A Short History of Nearly Everything is the record of this quest, and it is a sometimes profound, sometimes funny, and always supremely clear and entertaining adventure in the realms of human knowledge, as only Bill Bryson can render it. Science has never been more involving or entertaining.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/81/84/9780767908184.jpg', 'title_long': 'A Short History of Nearly Everything', 'edition': 'First Edition', 'dimensions': 'Height: 9.18 Inches, Length: 6.12 Inches, Weight: 1.3 Pounds, Width: 1.16 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.12}, 'width': {'unit': 'inches', 'value': 1.16}, 'weight': {'unit': 'pounds', 'value': 1.3}, 'height': {'unit': 'inches', 'value': 9.18}}, 'pages': 544, 'date_published': '2004-09-14', 'subjects': ['Humor & Entertainment', 'Humor', 'Science & Scientists', 'History', 'World', 'Reference', 'Science & Math', 'Essays & Commentary', 'Evolution', 'History & Philosophy', 'Nature & Ecology', 'Natural History'], 'authors': ['Bill Bryson'], 'title': 'A Short History of Nearly Everything', 'isbn13': '9780767908184', 'msrp': 18, 'binding': 'Paperback', 'related': {'Kindle Edition': '030788516X'}, 'isbn': '076790818X', 'isbn10': '076790818X', 'other_isbns': [{'isbn': '9780307885166', 'binding': 'print'}]}}