{'book': {'publisher': 'Broadway Books', 'synopsis': 'Spunky, sweet-natured Jessica Monroe is thirty-four years old and perfectly happy being single. Her girlfriends, however, disapprove. And when they secretly place a personal ad on a hot singles website on her behalf, Jess is reluctantly hurtled into the topsy-turvy world of online dating. A laugh-out-loud whirlwind of disastrous dates ensues, from Simon, who seems dreamy over e-mail but ditches her at the dinner table, leaving her with the bill, to Graham, a self-described “Ferrari driver” who turns out to be a car salesman—with several (old, fat, bald, creepy, cheap, stuck-up) men in between. When an unforeseen event turns her world upside down, Jess starts to wonder if the qualities she thinks she wants in a man—gorgeous, wildly successful, with a taste for fun and the finer things—really are what she ultimately needs . . . and whether, as a new mystery suitor appears in her e-mail inbox, Cupid has other possibilities up his sleeve.<br/><br/>Told with Jane Moore’s sparkling wit, wisdom, and sass, Love @ First Site is an irresistible tale about what happens when we start to look for love between the lines on a computer screen—and a winning, unputdownable look at contemporary romance.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/69/12/9780767916912.jpg', 'title_long': 'Love @ First Site: A Novel', 'edition': 'First Trade Paperback Edition', 'dimensions': 'Height: 7.89 Inches, Length: 5.23 Inches, Weight: 0.6 Pounds, Width: 0.82 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.23}, 'width': {'unit': 'inches', 'value': 0.82}, 'weight': {'unit': 'pounds', 'value': 0.6}, 'height': {'unit': 'inches', 'value': 7.89}}, 'pages': 368, 'date_published': '2006-05-09', 'subjects': ['Literature & Fiction', "Women's Fiction", 'Contemporary', 'Humor & Satire', 'Humorous', 'Romance', 'Romantic Comedy'], 'authors': ['Jane Moore'], 'title': 'Love @ First Site: A Novel', 'isbn13': '9780767916912', 'msrp': 11.95, 'binding': 'Paperback', 'isbn': '0767916913', 'isbn10': '0767916913'}}