{'book': {'publisher': 'Crown', 'synopsis': 'In her twenties, journalist Sarah Macdonald backpacked around India and came away with a lasting impression of heat, pollution and poverty. So when an airport beggar read her palm and told her she would return to India—and for love—she screamed, “Never!” and gave the country, and him, the finger.<br/><br/>But eleven years later, the prophecy comes true. When the love of Sarah’s life is posted to India, she quits her dream job to move to the most polluted city on earth, New Delhi. For Sarah this seems like the ultimate sacrifice for love, and it almost kills her, literally. Just settled, she falls dangerously ill with double pneumonia, an experience that compels her to face some serious questions about her own fragile mortality and inner spiritual void. “I must find peace in the only place possible in India,” she concludes. “Within.” Thus begins her journey of discovery through India in search of the meaning of life and death.<br/><br/>Holy Cow is Macdonald’s often hilarious chronicle of her adventures in a land of chaos and contradiction, of encounters with Hinduism, Islam and Jainism, Sufis, Sikhs, Parsis and Christians and a kaleidoscope of yogis, swamis and Bollywood stars. From spiritual retreats and crumbling nirvanas to war zones and New Delhi nightclubs, it is a journey that only a woman on a mission to save her soul, her love life—and her sanity—can survive.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/57/48/9780767915748.jpg', 'title_long': 'Holy Cow: An Indian Adventure', 'edition': 'unknown', 'dimensions': 'Height: 7.95 Inches, Length: 5.23 Inches, Weight: 0.56 Pounds, Width: 0.68 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.23}, 'width': {'unit': 'inches', 'value': 0.68}, 'weight': {'unit': 'pounds', 'value': 0.56}, 'height': {'unit': 'inches', 'value': 7.95}}, 'pages': 291, 'date_published': '2004-04-13', 'subjects': ['Biographies & Memoirs', 'Memoirs', 'Professionals & Academics', 'Culinary', 'Travelers & Explorers', 'Reference', 'Writing, Research & Publishing Guides', 'Writing', 'Travel', 'Asia', 'India', 'Travel Writing', 'Self Service', 'Custom Stores'], 'authors': ['Sarah Macdonald'], 'title': 'Holy Cow: An Indian Adventure', 'isbn13': '9780767915748', 'msrp': 11.99, 'binding': 'Paperback', 'related': {'ePub': '0767918142'}, 'isbn': '0767915747', 'isbn10': '0767915747', 'other_isbns': [{'isbn': '9780767918145', 'binding': 'printisbn'}]}}