{'book': {'publisher': 'Broadway Books', 'synopsis': 'Every brain begins as a female brain. It only becomes male eight weeks after conception, when excess testosterone shrinks the communications center, reduces the hearing cortex, and makes the part of the brain that processes sex twice as large.<br/><br/>Louann Brizendine, M.D. is a pioneering neuropsychiatrist who brings together the latest findings to show how the unique structure of the female brain determines how women think, what they value, how they communicate, and whom they’ll love. Brizendine reveals the neurological explanations behind why<br/><br/>• A woman remembers fights that a man insists never happened<br/><br/>• A teen girl is so obsessed with her looks and talking on the phone<br/><br/>• Thoughts about sex enter a woman’s brain once every couple of days but enter a man’s brain about once every minute<br/><br/>• A woman knows what people are feeling, while a man can’t spot an emotion unless somebody cries or threatens bodily harm<br/><br/>• A woman over 50 is more likely to initiate divorce than a man<br/><br/>Women will come away from this book knowing that they have a lean, mean communicating machine. Men will develop a serious case of brain envy.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/00/94/9780767920094.jpg', 'title_long': 'The Female Brain', 'edition': '1', 'dimensions': 'Height: 9.5 Inches, Length: 6.37 Inches, Weight: 1.25 Pounds, Width: 1.07 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.37}, 'width': {'unit': 'inches', 'value': 1.07}, 'weight': {'unit': 'pounds', 'value': 1.25}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 304, 'date_published': '2006-08-01', 'subjects': ['Health, Fitness & Dieting', 'Mental Health', 'Psychology & Counseling', 'Personality', "Women's Health", 'General', 'Science & Math'], 'authors': ['Louann Brizendine M.D.'], 'title': 'The Female Brain', 'isbn13': '9780767920094', 'msrp': 24.95, 'binding': 'Hardcover', 'isbn': '0767920090', 'isbn10': '0767920090'}}