{'book': {'publisher': 'Crown', 'synopsis': 'A beloved, bestselling classic of humorous and nostalgic Americana—the book that inspired the equally classic Yuletide film and the live musical on Fox.<br/><br/>The holiday film A Christmas Story, first released in 1983, has become a bona fide Christmas perennial, gaining in stature and fame with each succeeding year. Its affectionate, wacky, and wryly realistic portrayal of an American family’s typical Christmas joys and travails in small-town Depression-era Indiana has entered our imagination and our hearts with a force equal to It’s a Wonderful Life and Miracle on 34th Street.<br/><br/>This edition of A Christmas Story gathers together in one hilarious volume the gems of autobiographical humor that Jean Shepherd drew upon to create this enduring film. Here is young Ralphie Parker’s shocking discovery that his decoder ring is really a device to promote Ovaltine; his mother and father’s pitched battle over the fate of a lascivious leg lamp; the unleashed and unnerving savagery of Ralphie’s duel in the show with the odious bullies Scut Farkas and Grover Dill; and, most crucially, Ralphie’s unstoppable campaign to get Santa—or anyone else—to give him a Red Ryder carbine action 200-shot range model air rifle. Who cares that the whole adult world is telling him, “You’ll shoot your eye out, kid”?<br/><br/>The pieces that comprise A Christmas Story, previously published in the larger collections In God We Trust, All Others Pay Cash and Wanda Hickey’s Night of Golden Memories, coalesce in a magical fashion to become an irresistible piece of Americana, quite the equal of the film in its ability to warm the heart and tickle the funny bone.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/62/26/9780767916226.jpg', 'title_long': 'A Christmas Story: The Book That Inspired the Hilarious Classic Film', 'edition': 'Edition Unstated', 'dimensions': 'Height: 7.82 Inches, Length: 5.17 Inches, Weight: 0.4739938633 Pounds, Width: 0.63 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.17}, 'width': {'unit': 'inches', 'value': 0.63}, 'weight': {'unit': 'pounds', 'value': 0.4739938633}, 'height': {'unit': 'inches', 'value': 7.82}}, 'pages': 144, 'date_published': '2003-10-28', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Holidays', 'Family Life', 'Short Stories & Anthologies', 'Anthologies', 'Humor & Satire', 'Humorous', 'Self Service', 'Custom Stores'], 'authors': ['Jean Shepherd'], 'title': 'A Christmas Story: The Book That Inspired the Hilarious Classic Film', 'isbn13': '9780767916226', 'msrp': 16, 'binding': 'Hardcover', 'related': {'ePub': '0307768732'}, 'isbn': '0767916220', 'isbn10': '0767916220', 'other_isbns': [{'isbn': '9780307768735', 'binding': 'printisbn'}]}}