{'book': {'publisher': 'Seal Books', 'synopsis': "Read P.D. James in Large Print!<br/><br/>It begins, dramatically enough, with a trial for murder. The distinguished criminal lawyer Venetia Aldridge is defending Garry Ashe on charges of having brutally killed his aunt. For Aldridge the trial is mainly a test of her courtroom skills, one more opportunity to succeed--and she does. But now murder is in the air. The next victim will be Aldridge herself, stabbed to death at her desk in her Chambers in the Middle Temple, a bloodstained wig on her head. Enter Commander Adam Dalgliesh and his team, whose struggle to investigate and understand the shocking events cannot halt the spiral into more horrors, more murders...<br/><br/>A Certain Justice is P.D. James at her strongest. In her first foray into the strange closed world of the Law Courts and the London legal community, she has created a fascinating tale of interwoven passion and terror. As each character leaps into unforgettable life, as each scene draws us forward into new complexities of plot, she proves yet again that no other writer can match her skill in combining the excitement of the classic detective story with the richness of a fine novel. In its subtle portrayal of morality and human behavior, A Certain Justice will stand alongside Devices and Desires and A Taste for Death as one of P.D. James's most important, accomplished and entertaining works.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/99/11/9780770429911.jpg', 'title_long': 'A Certain Justice', 'edition': 'First Edition', 'dimensions': 'Height: 6.89 Inches, Length: 4.24 Inches, Weight: 0.8819 Pounds, Width: 1.48 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.24}, 'width': {'unit': 'inches', 'value': 1.48}, 'weight': {'unit': 'pounds', 'value': 0.8819}, 'height': {'unit': 'inches', 'value': 6.89}}, 'pages': 688, 'date_published': '2006-03-28', 'subjects': ['Mystery, Thriller & Suspense', 'Mystery', 'Police Procedurals'], 'authors': ['P. D. James'], 'title': 'A Certain Justice', 'isbn13': '9780770429911', 'msrp': '0.00', 'binding': 'Mass Market Paperback', 'isbn': '0770429912', 'isbn10': '0770429912'}}