{'book': {'publisher': 'MIRA', 'synopsis': 'Celebrate the 20th Anniversary of The Beach House! The most fulfilling journey is one that leads back home…<br/><br/>"Mary Alice Monroe is helping to redefine the beauty and magic of the Carolina Lowcountry. Every book she has written has felt like a homecoming to me."<br/>—Pat Conroy<br/><br/>Twenty years ago, Caretta Rutledge left her Southern roots far behind for a successful career as a businesswoman in Chicago. But an unusual request from her mother—coming just as her own life is spinning out of control—has Cara heading back to the scenic Lowcountry of her childhood summers.<br/><br/>Before long, the rhythms of the island open her heart as she repairs the family beach house, becomes a bona fide “turtle lady” and renews old acquaintances long thought lost. But it is in reconnecting with her mother that she will learn life’s most precious lessons—true love involves sacrifice, family is forever and the mistakes of the past can be forgiven.<br/><br/>Known for her moving characters and emotional honesty, Mary Alice Monroe brings readers a beautifully rendered story that explores the fragile yet enduring bond between mothers and daughters.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/29/48/9780778322948.jpg', 'title_long': 'The Beach House (The Beach House, 1)', 'edition': 'Reissue', 'dimensions': 'Height: 8 Inches, Length: 5.129911 Inches, Weight: 0.85 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.129911}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 0.85}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 496, 'date_published': '2006-04-25', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Family Life', 'Friendship', "Women's Fiction", 'Domestic Life', 'Contemporary', 'United States', 'Romance'], 'authors': ['Mary Alice Monroe'], 'title': 'The Beach House (The Beach House, 1)', 'isbn13': '9780778322948', 'msrp': 13.95, 'binding': 'Paperback', 'isbn': '0778322947', 'isbn10': '0778322947'}}