{'book': {'publisher': 'Marvel Comics', 'synopsis': "This deluxe hardcover completes the collection of Waid and Ringo's run, re-presenting the stories from Fantastic Four Vol. 5: Disassembled and Fantastic Four Vol. 6: Rising Storm! In Disassembled, Manhattan is cut off from the rest of the world by a fleet of miles-high alien spacecraft - and that's just the beginning! With the Avengers in disarray, New York reluctantly turns to the disenfranchised Fantastic Four, the only heroes in town, to save them - but where to even start? And which member of the team will make a decision that will radically change the Fantastic Four for some time to come? Also: Witness the genesis of an all-new, all-twisted Frightful Four! And in Rising Storm, Galactus' worst Herald ever is running out of time! So far, Johnny Storm has been able to stall Galactus from sating his cosmic hunger - but that luck won't hold forever. What planet will be chosen as Galactus' next victim? The reintroduction of a fan-favorite Marvel Universe hero into the battle may have caused more problems than it solved, because not even he can save the Fantastic Three from Johnny's newfound might! Who will live, who will die and how will Johnny ever be the same now that he's tasted the Power Cosmic? Collects Fantastic Four #514-524.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/01/17/9780785120117.jpg', 'title_long': 'Fantastic Four, Vol. 3', 'dimensions': 'Height: 10 Inches, Length: 7.25 Inches, Weight: 2.0502990366 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.25}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 2.0502990366}, 'height': {'unit': 'inches', 'value': 10}}, 'pages': 256, 'date_published': '2005-12-07', 'subjects': ['Comics & Graphic Novels', 'Graphic Novels', 'Superheroes', 'Publishers', 'Marvel', 'Science Fiction & Fantasy'], 'authors': ['Mark Waid'], 'title': 'Fantastic Four, Vol. 3', 'isbn13': '9780785120117', 'msrp': 14.53, 'binding': 'Hardcover', 'isbn': '0785120114', 'isbn10': '0785120114'}}