{'book': {'publisher': 'Nelson Books', 'synopsis': 'Every little girl has dreams of being swept up into a great adventure, of being the beautiful princess. Sadly, when women grow up, they are often swept up into a life filled merely with duty and demands. Many Christian women are tired, struggling under the weight of the pressure to be a "good servant," a nurturing caregiver, or a capable home manager.<br/>What Wild at Heart did for men, Captivating is doing for women. Setting their hearts free. This groundbreaking book shows readers the glorious design of women before the fall, describes how the feminine heart can be restored, and casts a vision for the power, freedom, and beauty of a woman released to be all she was meant to be. By revealing the core desires every woman shares-to be romanced, to play an irreplaceable role in a grand adventure, and to unveil beauty-John and Stasi Eldredge invite women to recover their feminine hearts, created in the image of an intimate and passionate God. Further, they encourage men to discover the secret of a woman\'s soul and to delight in the beauty and strength women were created to offer.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/46/99/9780785264699.jpg', 'title_long': "Captivating: Unveiling The Mystery Of A Woman's Soul", 'dimensions': 'Height: 8.25 Inches, Length: 5.5 Inches, Weight: 0.82 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.82}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 243, 'date_published': '2005', 'subjects': ['Religion & Spirituality'], 'authors': ['John Eldredge', 'Stasi Eldredge'], 'title': "Captivating: Unveiling The Mystery Of A Woman's Soul", 'isbn13': '9780785264699', 'msrp': 22.99, 'binding': 'Hardcover', 'isbn': '0785264698', 'isbn10': '0785264698', 'other_isbns': [{'isbn': '9781400225293', 'binding': 'print'}, {'isbn': '9781418578466', 'binding': 'print'}]}}