{'book': {'publisher': 'Hachette Books', 'synopsis': "The new novel that fans of the bestselling author have been waiting for, about three sexy, powerful career women who will do anything to stay at the top of their fields<br/><br/>Victory Ford is the darling of the fashion world. Single, attractive, and iconoclastic, she has worked for years to create her own signature line. As Victory struggles to keep her company afloat, she learns crucial lessons about what she really wants in a relationship.<br/><br/>Nico O'Neilly is the glamorous, brilliant editor of Bonfire Magazine -- the pop-culture bible for fashion, show business, and politics. Considered one of the most powerful women in publishing, she seems to have it all. But in a mid-life crisis, she suddenly realizes this isn't enough.<br/><br/>Wendy Healy's chutzpah has propelled her to the very top of the cut-throat movie industry. When it becomes clear that a competitor is trying to oust her, something has to give--and Wendy must decide between her career and her marriage.<br/><br/>In Lipstick Jungle, Bushnell once again delivers an addictive page-turner of sex and scandal that will keep readers enthralled and guessing to the very last page.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/39/66/9780786893966.jpg', 'title_long': 'Lipstick Jungle: A Novel', 'edition': 'REV', 'dimensions': 'Height: 6.75 Inches, Length: 4.25 Inches, Weight: 0.6 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.25}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 0.6}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 544, 'date_published': '2007-04-01', 'subjects': ['Literature & Fiction', "Women's Fiction", 'Contemporary', 'United States', 'Romance'], 'authors': ['Candace Bushnell'], 'title': 'Lipstick Jungle: A Novel', 'isbn13': '9780786893966', 'msrp': 8.99, 'binding': 'Mass Market Paperback', 'isbn': '0786893966', 'isbn10': '0786893966'}}