{'book': {'publisher': 'Little, Brown Books for Young Readers', 'synopsis': "This wholesome, award-winning classic that has sold more than 1 million copies is written by bestselling authors and illustrated by a Caldecott-winning artist, telling the story of a 100-year-old china doll who discovers surprising friendships and thrilling adventures.<br/><br/>Annabelle Doll and Tiffany Funcraft are two dolls who have been best friends since they met in Kate Palmer's house at 26 Wetherby Lane. In this sequel to The Doll People, they hitch a ride in Kate's backpack and find themselves in the biggest adventure of their lives, a day at school! But when an attempt to return home lands them in the wrong house, they're in far deeper trouble than they imagined. Along with a host of new doll friends, they also encounter Mean Mimi, the wickedest doll of all. Mean Mimi is mean-really mean-and she's determined to rule all of Dollkind or else destroy it. Will the world ever be safe for dolls again?<br/><br/>This fresh twist on the beloved genre of doll stories will spark imagination and a sense of wonder in young readers and will send them on a search for the third book in the series, The Runaway Dolls.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/29/70/9780786852970.jpg', 'title_long': 'The Meanest Doll in the World (The Doll People, 2)', 'edition': 'Reprint', 'dimensions': 'Height: 9.125 Inches, Length: 6.25 Inches, Weight: 0.9 Pounds, Width: 0.875 inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 0.875}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 9.125}}, 'pages': 304, 'date_published': '2005-05-15', 'subjects': ["Children's Books", 'Growing Up & Facts of Life', 'Friendship, Social Skills & School Life', 'Literature & Fiction', 'Chapter Books & Readers', 'Action & Adventure', 'Science Fiction & Fantasy', 'Fantasy & Magic', 'Self Service', 'Custom Stores'], 'authors': ['Ann M. Martin', 'Laura Godwin', 'Brian Selznick'], 'title': 'The Meanest Doll in the World (The Doll People, 2)', 'isbn13': '9780786852970', 'msrp': 7.99, 'binding': 'Paperback', 'isbn': '0786852976', 'isbn10': '0786852976'}}