{'book': {'publisher': 'Carroll & Graf', 'synopsis': 'This vivid biography, written by John Dickson Carr, a giant in the field of mystery fiction, benefits from his full access to the archives of the eminent Sir Arthur Conan Doyle\x97to his notebooks, diaries, press clippings, and voluminous correspondence. Like his creation Sherlock Holmes, Doyle had "a horror of destroying documents," and until his death in 1930, they accumulated to vast amount throughout his house at Windlesham. They provide many of the words incorporated by Carr in this lively portrayal of Doyle\'s forays into politics, his infatuation with spiritualism, his literary ambitions, and dinner-table conversations with friends like H. G. Wells and King Edward VII. Carr, then, in a sense collaborates with his subject to unfold a colorful narrative that takes Doyle from his school days at Stonyhurst to Edinburgh University and a medical practice at Southsea, where he conceived the idea of wedding scientific study to criminal investigation in the fictive person of Sherlock Holmes. It also explores the private tragedy of Doyle\'s first marriage and long-delayed second as it follows him into the arena of public activity, propaganda, and literary output that would win him not only celebrity but also knighthood. 8 pages of black-and-white photographs are featured.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/23/42/9780786712342.jpg', 'title_long': 'The Life of Sir Arthur Conan Doyle', 'edition': 'Reprint', 'dimensions': 'Height: 8.38 Inches, Length: 5.5 Inches, Weight: 0.84657508608 Pounds, Width: 0.83 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.83}, 'weight': {'unit': 'pounds', 'value': 0.84657508608}, 'height': {'unit': 'inches', 'value': 8.38}}, 'pages': 320, 'date_published': '2003-11-11', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Literature & Fiction', 'History & Criticism', 'Regional & Cultural'], 'authors': ['John Dickson Carr'], 'title': 'The Life of Sir Arthur Conan Doyle', 'isbn13': '9780786712342', 'msrp': 17.99, 'binding': 'Paperback', 'isbn': '0786712341', 'isbn10': '0786712341'}}