{'book': {'publisher': 'Da Capo Press', 'synopsis': "Teena Maguire should not have tried to shortcut her way home that Fourth of July. Not after midnight, not through Rocky Point Park. Not the way she was dressed: tank top, denim cut-offs, high-heeled sandals. Not with her twelve-year-old daughter, Bethie. Not with packs of local guys running loose on hormones, rage, and alcohol. A victim of gang rape, left for dead in the park boathouse, the once vital and sexy Teena Maguire can now only regret that she has survived. And Bethie can barely remember a childhood uncolored by fear. For they're not even a neighborhood away, the men that she identified for the Niagara Falls Police Department: the wide-browed, sandy-haired Pick brothers; the sneering Jimmy DeLucca; Fritz Haaber with his moustache and stubbled jaw. They've killed her grandmother's longhaired orange cat. At a relentless, compelling pace punctuated by lonely cries in the night and the whisper of terror in the afternoon, National Book Award-winner Joyce Carol Oates unfolds the story of Teena and Bethie, their assailants, and their unexpected, silent champion, a man who knows the meaning of justice. And love.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/48/27/9780786714827.jpg', 'title_long': 'Rape: A Love Story (Otto Penzler Books)', 'edition': 'Reprint', 'dimensions': 'Height: 8 Inches, Length: 5.25 Inches, Weight: 0.31 Pounds, Width: 0.41 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 0.41}, 'weight': {'unit': 'pounds', 'value': 0.31}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 156, 'date_published': '2004-12-21', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Psychological', 'Contemporary', 'Literary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Psychological Thrillers'], 'authors': ['Joyce Carol Oates'], 'title': 'Rape: A Love Story (Otto Penzler Books)', 'isbn13': '9780786714827', 'msrp': 13.95, 'binding': 'Paperback', 'isbn': '0786714824', 'isbn10': '0786714824'}}