{'book': {'publisher': 'Hachette Books', 'synopsis': 'The book that sparked a marketing revolution.<br/><br/>"This is a subversive book. It says that the marketer is not--and ought not to be--at the center of successful marketing. The customer should be. Are you ready for that?" --From the Foreword by Malcolm Gladwell, author of The Tipping Point.<br/><br/>Counter to traditional marketing wisdom, which tries to count, measure, and manipulate the spread of information, Seth Godin argues that the information can spread most effectively from customer to customer, rather than from business to customer. Godin calls this powerful customer-to-customer dialogue the ideavirus, and cheerfully eggs marketers on to create an environment where their ideas can replicate and spread.<br/><br/>In lively detail, Godin looks at the ways companies such as PayPal, Hotmail, GeoCities, even Volkswagen have successfully launched ideaviruses. He offers a "recipe" for creating your own ideavirus, identifies the key factors in the successful spread of an ideavirus (powerful sneezers, hives, a clear vector, a smooth, friction-free transmission), and shows how any business, large or small, can use ideavirus marketing to succeed in a world that just doesn\'t want to hear it anymore from the traditional marketers.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/71/70/9780786887170.jpg', 'title_long': 'Unleashing the Ideavirus: Stop Marketing AT People! Turn Your Ideas into Epidemics by Helping Your Customers Do the Marketing thing for You.', 'edition': 'Reprint', 'dimensions': 'Height: 7.5 Inches, Length: 5.25 Inches, Weight: 0.220462262 Pounds, Width: 0.625 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 0.625}, 'weight': {'unit': 'pounds', 'value': 0.220462262}, 'height': {'unit': 'inches', 'value': 7.5}}, 'pages': 234, 'date_published': '2001-10-10', 'subjects': ['Self-Help', 'Stress Management', 'Success', 'Business & Money', 'Marketing & Sales', 'Marketing', 'Education & Reference', 'Reference', 'Encyclopedias & Subject Guides', 'Business'], 'authors': ['Seth Godin', 'Malcolm Gladwell'], 'title': 'Unleashing the Ideavirus: Stop Marketing AT People! Turn Your Ideas into Epidemics by Helping Your Customers Do the Marketing thing for You.', 'isbn13': '9780786887170', 'msrp': 10.66, 'binding': 'Paperback', 'related': {'ePub': '0786870451'}, 'isbn': '0786887176', 'isbn10': '0786887176', 'other_isbns': [{'isbn': '9780786870455', 'binding': 'print'}]}}