{'book': {'publisher': 'Jossey-Bass', 'synopsis': 'Practical and hands-on strategies for breaking down silos and minimizing workplace politics<br/>In yet another page-turner, New York Times best-selling author and acclaimed management expert Patrick Lencioni addresses the costly and maddening issue of silos: the barriers that create organizational politics. Silos devastate organizations, kill productivity, push good people out the door, and jeopardize the achievement of corporate goals.<br/>As with his other books, Lencioni writes Silos, Politics, and Turf Wars as a fictional―but eerily familiar―story. The story is about Jude Cousins, an eager young management consultant struggling to launch his practice by solving one of the more universal and frustrating problems faced by his clients. Through trial and error, he develops a simple yet ground-breaking approach for helping them transform confusion and infighting into clarity and alignment.<br/>In the book, you’ll find: Ways to recognize the devastating–and destructive–power of silos How to create an overarching thematic goal or rallying cry for your organization Strategies for employees to avoid the confusion that often accompanies working in matrix organizations<br/>Perfect for executives, managers, and other business leaders, Silos, Politics, and Turf Wars will also earn a place in the libraries of consultants and other professionals who serve organizations of all sizes.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/63/85/9780787976385.jpg', 'title_long': 'Silos, Politics and Turf Wars: A Leadership Fable About Destroying the Barriers That Turn Colleagues Into Competitors', 'edition': '1', 'dimensions': 'Height: 8.401558 Inches, Length: 5.799201 Inches, Weight: 0.80027801106 Pounds, Width: 0.999998 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.799201}, 'width': {'unit': 'inches', 'value': 0.999998}, 'weight': {'unit': 'pounds', 'value': 0.80027801106}, 'height': {'unit': 'inches', 'value': 8.401558}}, 'pages': 224, 'date_published': '2006-02-17', 'subjects': ['Business & Money', 'Business Culture', 'Workplace Culture', 'Management & Leadership', 'Leadership & Motivation', 'Management', 'Processes & Infrastructure', 'Self Service', 'Custom Stores'], 'authors': ['Patrick Lencioni'], 'title': 'Silos, Politics and Turf Wars: A Leadership Fable About Destroying the Barriers That Turn Colleagues Into Competitors', 'isbn13': '9780787976385', 'msrp': 24.95, 'binding': 'Hardcover', 'related': {'eBook': '0470893893'}, 'isbn': '0787976385', 'isbn10': '0787976385', 'other_isbns': [{'isbn': '9780470893890', 'binding': 'ebook'}]}}