{'book': {'publisher': 'Cornell University Press', 'synopsis': "China's spectacular economic growth over the past two decades has dramatically depleted the country\x92s natural resources and produced skyrocketing rates of pollution. Environmental degradation in China has also contributed to significant public health problems, mass migration, economic loss, and social unrest. In The River Runs Black, Elizabeth C. Economy examines China\x92s growing environmental crisis and its implications for the country\x92s future development.<br/>Drawing on historical research, case studies, and interviews with officials, scholars, and activists in China, Economy traces the economic and political roots of China\x92s environmental challenge and the evolution of the leadership's response. She argues that China\x92s current approach to environmental protection mirrors the one embraced for economic development: devolving authority to local officials, opening the door to private actors, and inviting participation from the international community, while retaining only weak central control. The result has been a patchwork of environmental protection in which a few wealthy regions with strong leaders and international ties improve their local environments, while most of the country continues to deteriorate, sometimes suffering irrevocable damage. Economy compares China\x92s response with the experience of other societies and sketches out several possible futures for the country.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/97/85/9780801489785.jpg', 'title_long': "The River Runs Black: The Environmental Challenge to China's Future", 'edition': '1', 'dimensions': 'Height: 8.75 Inches, Length: 5.75 Inches, Weight: 1.13317602668 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 1.13317602668}, 'height': {'unit': 'inches', 'value': 8.75}}, 'pages': 368, 'date_published': '2005-02-24', 'subjects': ['Business & Money', 'Economics', 'Economic Policy & Development', 'Environmental Economics', 'History', 'Asia', 'China', 'Science & Math', 'Biological Sciences', 'Biology', 'Earth Sciences', 'Environmental Science', 'Politics & Social Sciences', 'Politics & Government', 'International & World Politics', 'Public Affairs & Policy', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Elizabeth C. Economy'], 'title': "The River Runs Black: The Environmental Challenge to China's Future", 'isbn13': '9780801489785', 'msrp': 19.95, 'binding': 'Paperback', 'isbn': '0801489784', 'isbn10': '0801489784'}}