{'book': {'publisher': 'Grove Press', 'synopsis': 'In her first book since the cultural phenomenon Sex and the City, Candace Bushnell triumphantly returned with the national best-seller Four Blondes, which The New York Times says "chronicles the glittering lives of semicelebrities, social aspirants, and moneyed folk ... [with] withering precision." Now her collection of novellas is available in paperback -- just in time to pack in your handbag for that summer weekend getaway to the Hamptons or that romantic rendezvous on Martha\'s Vineyard. Four Blondes tells the stories of four women facing up to the limitations of their rapidly approaching middle age in an era that worships youth. From the former "It-girl" heroine of "Nice N\'Easy," who each summer looks for a rich man who\'ll provide her with a house in the Hamptons, to the writer-narrator of "Single Process," who goes to London on a hunt for love and a good magazine story, Bushnell brings to life contemporary women in search of something more -- when the world is pushing for them to settle for less. Sexy, funny, and wonderfully lush with gossip and scandal, Four Blondes will keep you turning pages long into the night.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/82/55/9780802138255.jpg', 'title_long': 'Four Blondes', 'edition': '1 PBK ED', 'dimensions': 'Height: 8.28 Inches, Length: 5.54 Inches, Weight: 0.66 Pounds, Width: 0.66 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.54}, 'width': {'unit': 'inches', 'value': 0.66}, 'weight': {'unit': 'pounds', 'value': 0.66}, 'height': {'unit': 'inches', 'value': 8.28}}, 'pages': 256, 'date_published': '2001-07-01', 'subjects': ['Literature & Fiction', 'Literary'], 'authors': ['Candace Bushnell'], 'title': 'Four Blondes', 'isbn13': '9780802138255', 'msrp': 14, 'binding': 'Paperback', 'related': {'ePub': '1555846173'}, 'isbn': '080213825X', 'isbn10': '080213825X', 'other_isbns': [{'isbn': '9781555846176', 'binding': 'print'}]}}