{'book': {'publisher': 'Bloomsbury Publishing', 'synopsis': "The Illustrated Longitude recounts in words and images the epic quest to solve the greatest scientific problem of the eighteenth and three prior centuries: determining how a captain could pinpoint his ship's location at sea. All too often throughout the ages of exploration, voyages ended in disaster when crew and cargo were either lost at sea or destroyed upon the rocks of an unexpected landfall. Thousands of lives and the fortunes of nations hung on a resolution to the longitude problem.<br/>To encourage a solution, governments established prizes for anyone whose method or device proved successful. The largest reward of £20,000 - truly a king's ransom - was offered by Britain's Parliament in 1714. The scientific establishment - from Galileo to Sir Isaac Newton - had been certain that a celestial answer would be found and invested untold effort in this pursuit. By contrast, John Harrison imagined and built the unimaginable: a clock that told perfect time at sea, known today as the chronometer. Harrison's trials and tribulations during his forty-year quest to win the prize are the culmination of this remarkable story.<br/>The Illustrated Longitude brings a new and important dimension to Dava Sobel's celebrated story. It contains the entire original narrative of Longitude, redesigned to accompany 183 images chosen by William Andrewes - from portraints of every important figure in the story to maps and diagrams, scientifc instruments, and John Harrison's remarkable sea clocks themselves. Andrewes's elegant captions and sidebars on scientific and historical events tell their own story of longitude.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/59/31/9780802775931.jpg', 'title_long': 'The Illustrated Longitude: The True Story of a Lone Genius Who Solved the Greatest Scientific Problem of His Time', 'edition': 'unknown', 'dimensions': 'Height: 9.9200589 Inches, Length: 8.9700608 Inches, Weight: 1.95329564132 Pounds, Width: 0.5051171 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.9700608}, 'width': {'unit': 'inches', 'value': 0.5051171}, 'weight': {'unit': 'pounds', 'value': 1.95329564132}, 'height': {'unit': 'inches', 'value': 9.9200589}}, 'pages': 216, 'date_published': '2003-10-01', 'subjects': ['Biographies & Memoirs', 'Professionals & Academics', 'Scientists', 'History', 'Science & Math', 'History & Philosophy'], 'authors': ['Dava Sobel', 'William J. H. Andrewes'], 'title': 'The Illustrated Longitude: The True Story of a Lone Genius Who Solved the Greatest Scientific Problem of His Time', 'isbn13': '9780802775931', 'msrp': 35, 'binding': 'Paperback', 'isbn': '0802775934', 'isbn10': '0802775934'}}