{'book': {'publisher': 'Walker Publishing Company', 'synopsis': 'New York Times Bestseller * The inspiration for the TV series starring Dan Aykroyd<br/><br/>“There aren’t many books this entertaining that also provide a cogent crash course in ancient, classical and modern history.” ―Los Angeles Times<br/><br/>Beer, wine, spirits, coffee, tea, and Coca-Cola: In Tom Standage’s deft, innovative account of world history, these six beverages turn out to be much more than just ways to quench thirst. They also represent six eras that span the course of civilization―from the adoption of agriculture, to the birth of cities, to the advent of globalization. A History of the World in 6 Glasses tells the story of humanity from the Stone Age to the twenty-first century through each epoch’s signature refreshment. As Standage persuasively argues, each drink is in fact a kind of technology, advancing culture and catalyzing the intricate interplay of different societies. After reading this enlightening book, you may never look at your favorite drink in quite the same way again.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/55/24/9780802715524.jpg', 'title_long': 'A History of the World in 6 Glasses', 'edition': 'Annotated', 'dimensions': 'Height: 8.25 Inches, Length: 5.4499891 Inches, Weight: 0.7 Pounds, Width: 0.9 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.4499891}, 'width': {'unit': 'inches', 'value': 0.9}, 'weight': {'unit': 'pounds', 'value': 0.7}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 336, 'date_published': '2006-05-16', 'subjects': ['Cookbooks, Food & Wine', 'Beverages & Wine', 'Coffee & Tea', 'Wine & Spirits', 'Homebrewing, Distilling & Wine Making', 'Cooking Education & Reference', 'History', 'World'], 'authors': ['Tom Standage'], 'title': 'A History of the World in 6 Glasses', 'isbn13': '9780802715524', 'msrp': 18, 'binding': 'Paperback', 'related': {'Kindle Edition': '0802718590', 'ePub': '0802718590'}, 'isbn': '0802715524', 'isbn10': '0802715524', 'other_isbns': [{'isbn': '9780802718594', 'binding': 'print'}]}}