{'book': {'publisher': 'Grove Press', 'synopsis': '"Winterson is a master of her material, a writer in whom great talent deeply abides." — Vanity Fair<br/>First published to great acclaim in 1987, this arresting, elegant novel from Jeanette Winterson uses Napolean’s Europe as the setting for a tantalizing surrealistic romance between an observer of history and a creature of fantasy. Jeanette Winterson’s novels have established her as one of the most important young writers in world literature. The Passion is perhaps her most highly acclaimed work, a modern classic that confirms her special claim on the novel. Set during the tumultuous years of the Napoleonic Wars, The Passion intertwines the destinies of two remarkable people: Henri, a simple French soldier, who follows Napoleon from glory to Russian ruin; and Villanelle, the red-haired, web-footed daughter of a Venetian boatman, whose husband has gambled away her heart. In Venice’s compound of carnival, chance, and darkness, the pair meet their singular destiny.<br/><br/>In her unique and mesmerizing voice, Winterson blends reality with fantasy, dream, and imagination to weave a hypnotic tale with stunning effects.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/52/23/9780802135223.jpg', 'title_long': 'The Passion', 'dimensions': 'Height: 8.5 Inches, Length: 5.75 Inches, Weight: 0.44974301448 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.44974301448}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 176, 'date_published': '1997-08-07', 'subjects': ['LGBTQ+ Books', 'Literature & Fiction', 'Genre Fiction', 'Historical', 'British & Irish', 'Literary', 'Romance'], 'authors': ['Jeanette Winterson'], 'title': 'The Passion', 'isbn13': '9780802135223', 'msrp': 16, 'binding': 'Paperback', 'related': {'ePub': '0802198716'}, 'isbn': '0802135226', 'isbn10': '0802135226', 'other_isbns': [{'isbn': '9780802198716', 'binding': 'print'}]}}