{'book': {'publisher': 'Bison Books', 'synopsis': 'The shimmering, cloud-covered planet of Venus conceals a wondrous secret: the strikingly beautiful yet deadly world of Amtor. In Amtor, cities of immortal beings flourish in giant trees reaching thousands of feet into the sky; ferocious beasts stalk the wilderness below; rare flashes of sunlight precipitate devastating storms; and the inhabitants believe their world is saucer-shaped with a fiery center and an icy rim. Stranded on Amtor after his spaceship crashes, astronaut Carson Napier is swept into a world where revolution is ripe, the love of a princess carries a dear price, and death can come as easily from the blade of a sword as from the ray of a futuristic gun.<br/><br/>Pirates of Venus is the exciting inaugural volume in the last series imagined and penned by Edgar Rice Burroughs. This commemorative edition features new illustrations by Thomas Floyd, the original frontispiece by J. Allen St. John, an afterword by Phillip Burger, a glossary of Amtor terms by Scott Tracy Griffin, a map of Amtor drawn by Edgar Rice Burroughs that appeared in the first edition, and an introduction by acclaimed science fiction and horror novelist F. Paul Wilson.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/18/39/9780803261839.jpg', 'title_long': 'Pirates of Venus (Bison Frontiers of Imagination)', 'edition': 'Commemorative', 'dimensions': 'Height: 8 Inches, Length: 5.25 Inches, Weight: 0.43871990138 Pounds, Width: 0.45 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 0.45}, 'weight': {'unit': 'pounds', 'value': 0.43871990138}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 179, 'date_published': '2001-09-01', 'subjects': ['Literature & Fiction', 'Classics', 'United States', 'Science Fiction & Fantasy', 'Science Fiction', 'Adventure'], 'authors': ['Edgar Rice Burroughs', 'Thomas Floyd', 'Phillip R. Burger'], 'title': 'Pirates of Venus (Bison Frontiers of Imagination)', 'isbn13': '9780803261839', 'msrp': 15.95, 'binding': 'Paperback', 'isbn': '0803261837', 'isbn10': '0803261837'}}