{'book': {'publisher': 'University of Nebraska Press', 'synopsis': "A strange and repugnant mystery of the twentieth century is the durability of the Protocols of the Elders of Zion, a clumsy forgery purporting to be evidence of the supposed Jewish plot to rule the world. Though it has been exposed as a forgery, some apprentice brownshirt is always rediscovering it, the latest in a line of gullibility that includes, most famously, Henry Ford. Recently it has been translated into Japanese and circulates once again with renewed virulence in the former Soviet Union and Eastern Europe.<br/>In 1924 in Germany the Jewish author and journalist Binjamin Segel wrote a major historical exposé of the fraud and later edited his work into a shorter form, published as Welt-Krieg, Welt-Revolution, Welf-Verschwörung, Welt-Oberregierung (Berlin 1926). Translator Richard S. Levy, a specialist on the history of anti-semitism, provides an extensive introduction on the circumstances of Segel's work and the story of the Protocols up to the 1990s, including an explanation of its continuing psychological appeal and political function.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/24/51/9780803292451.jpg', 'title_long': 'A Lie and a Libel: The History of the Protocols of the Elders of Zion', 'edition': 'New edition', 'dimensions': 'Height: 8 Inches, Length: 5 Inches, Weight: 0.4078551847 Pounds, Width: 0.39 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5}, 'width': {'unit': 'inches', 'value': 0.39}, 'weight': {'unit': 'pounds', 'value': 0.4078551847}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 148, 'date_published': '1996-08-01', 'subjects': ['History', 'Europe', 'World', 'Jewish', 'Politics & Social Sciences', 'Anthropology', 'Cultural'], 'authors': ['Binjamin W. Segel'], 'title': 'A Lie and a Libel: The History of the Protocols of the Elders of Zion', 'isbn13': '9780803292451', 'msrp': 12.95, 'binding': 'Paperback', 'isbn': '0803292457', 'isbn10': '0803292457'}}