{'book': {'publisher': 'Stanford University Press', 'synopsis': 'This is the third volume to appear in an edition that will be the first complete, critical, and annotated English translation of all of Nietzsche\'s work. Volume 2: Unfashionable Observations, translated by Richard T. Gray, was published in 1995; Volume 3: Human, All Too Human (I), translated by Gary Handwerk, was published in 1997. The edition is a new English translation, by various hands, of the celebrated Colli-Montinari edition, which has been acclaimed as one of the most important works of scholarship in the humanities in the last half century.<br/>The present volume provides for the first time English translations of all of Nietzsche\'s unpublished notebooks from the summer of 1872 to the end of 1874. The major works published in this period were the first three Unfashionable Observations: "David Strauss the Confessor and the Writer," "On the Utility and Liability of History for Life," and "Schopenhauer as Educator." Translations of the preliminary notes for these pieces are coordinated with the translations of the published texts printed in Volume 2: Unfashionable Observations.<br/>The content of these notebooks goes far beyond the notes and plans for published and unpublished Unfashionable Observations, encompassing numerous sketches related to Nietzsche\'s major philological project from this period, a book on the pre-Platonic Greek philosophers. The ideas that emerged from Nietzsche\'s deliberations on these early Greek thinkers are absolutely central to his thought from this period and contribute in significant ways to the development of several of his major themes: the role of the philosopher vis-à-vis his age and the surrounding culture; the relationships among philosophy, art, and culture; the metaphorical nature of language and its relationship to knowledge; the unmasking of the modern drive for absolute "truth" as a palliative against the horror of existence; and Nietzsche\'s "unfashionable" attack on modern science and modern culture, especially on the Germany of the Bismarck Reich. These notebooks represent important transitional documents in Nietzsche\'s intellectual development, marking, among other things, the shift away from philological studies toward unabashed cultural criticism.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/88/43/9780804728843.jpg', 'title_long': 'Unpublished Writings from the Period of Unfashionable Observations: Volume 11 (The Complete Works of Friedrich Nietzsche)', 'edition': '1', 'dimensions': 'Height: 7.25 Inches, Length: 4.75 Inches, Weight: 1.04058187664 Pounds, Width: 1.2 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.75}, 'width': {'unit': 'inches', 'value': 1.2}, 'weight': {'unit': 'pounds', 'value': 1.04058187664}, 'height': {'unit': 'inches', 'value': 7.25}}, 'pages': 536, 'date_published': '2000-01-01', 'subjects': ['Politics & Social Sciences', 'Philosophy', 'Ethics & Morality', 'Good & Evil', 'History & Surveys', 'Modern', 'Movements', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Friedrich Nietzsche'], 'title': 'Unpublished Writings from the Period of Unfashionable Observations: Volume 11 (The Complete Works of Friedrich Nietzsche)', 'isbn13': '9780804728843', 'msrp': 80, 'binding': 'Hardcover', 'isbn': '0804728844', 'isbn10': '0804728844'}}