{'book': {'publisher': 'Metropolitan Books', 'synopsis': 'From the author of the prophetic national bestseller Blowback, a startling look at militarism, American style, and its consequences abroad and at home<br/><br/>In the years after the Soviet Union imploded, the United States was described first as the globe\'s "lone superpower," then as a "reluctant sheriff," next as the "indispensable nation," and now, in the wake of 9/11, as a "New Rome." Here, Chalmers Johnson thoroughly explores the new militarism that is transforming America and compelling its people to pick up the burden of empire.<br/><br/>Reminding us of the classic warnings against militarism―from George Washington\'s farewell address to Dwight Eisenhower\'s denunciation of the military-industrial complex―Johnson uncovers its roots deep in our past. Turning to the present, he maps America\'s expanding empire of military bases and the vast web of services that supports them. He offers a vivid look at the new caste of professional warriors who have infiltrated multiple branches of government, who classify as "secret" everything they do, and for whom the manipulation of the military budget is of vital interest.<br/><br/>Among Johnson\'s provocative conclusions is that American militarism is putting an end to the age of globalization and bankrupting the United States, even as it creates the conditions for a new century of virulent blowback. The Sorrows of Empire suggests that the former American republic has already crossed its Rubicon―with the Pentagon leading the way.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/79/71/9780805077971.jpg', 'title_long': 'The Sorrows of Empire: Militarism, Secrecy, and the End of the Republic (The American Empire Project)', 'edition': 'First Edition', 'dimensions': 'Height: 8.5 Inches, Length: 5.5 Inches, Weight: 1.05 Pounds, Width: 0.89 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.89}, 'weight': {'unit': 'pounds', 'value': 1.05}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 400, 'date_published': '2005-01-06', 'subjects': ['History', 'Americas', 'United States', 'Politics & Social Sciences', 'Politics & Government', 'International & World Politics', 'Political Science'], 'authors': ['Chalmers Johnson'], 'title': 'The Sorrows of Empire: Militarism, Secrecy, and the End of the Republic (The American Empire Project)', 'isbn13': '9780805077971', 'msrp': 30, 'binding': 'Paperback', 'isbn': '0805077979', 'isbn10': '0805077979', 'other_isbns': [{'isbn': '9781429900515', 'binding': 'printisbncanonical'}]}}