{'book': {'publisher': 'Schocken / Nextbook', 'synopsis': 'Part of the Jewish Encounter series<br/><br/>In 1656, Amsterdam’s Jewish community excommunicated Baruch Spinoza, and, at the age of twenty–three, he became the most famous heretic in Judaism. He was already germinating a secularist challenge to religion that would be as radical as it was original. He went on to produce one of the most ambitious systems in the history of Western philosophy, so ahead of its time that scientists today, from string theorists to neurobiologists, count themselves among Spinoza’s progeny.<br/><br/>In Betraying Spinoza, Rebecca Goldstein sets out to rediscover the flesh-and-blood man often hidden beneath the veneer of rigorous rationality, and to crack the mystery of the breach between the philosopher and his Jewish past. Goldstein argues that the trauma of the Inquisition’ s persecution of its forced Jewish converts plays itself out in Spinoza’s philosophy. The excommunicated Spinoza, no less than his excommunicators, was responding to Europe’ s first experiment with racial anti-Semitism.<br/><br/>Here is a Spinoza both hauntingly emblematic and deeply human, both heretic and hero—a surprisingly contemporary figure ripe for our own uncertain age.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/20/96/9780805242096.jpg', 'title_long': 'Betraying Spinoza: The Renegade Jew Who Gave Us Modernity (Jewish Encounters)', 'dimensions': 'Height: 8 Inches, Length: 5.5 Inches, Weight: 0.85 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 0.85}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 287, 'date_published': '2006-05-30', 'subjects': ['Biographies & Memoirs', 'Professionals & Academics', 'Philosophers', 'History', 'World', 'Jewish', 'Politics & Social Sciences', 'Social Sciences', 'Religious Groups Studies', 'Self Service', 'Custom Stores'], 'authors': ['Rebecca Goldstein'], 'title': 'Betraying Spinoza: The Renegade Jew Who Gave Us Modernity (Jewish Encounters)', 'isbn13': '9780805242096', 'msrp': 22, 'binding': 'Hardcover', 'isbn': '0805242090', 'isbn10': '0805242090'}}