{'book': {'publisher': 'Henry Holt and Co.', 'synopsis': 'The story of an ancient sea turtle and what its survival says about our future, from the award-winning writer and naturalist<br/><br/>Though nature is indifferent to the struggles of her creatures, the human effect on them is often premeditated. The distressing decline of sea turtles in Pacific waters and their surprising recovery in the Atlantic illuminate what can go both wrong and right from our interventions, and teach us the lessons that can be applied to restore health to the world\'s oceans and its creatures. As Carl Safina\'s compelling natural history adventure makes clear, the fate of the astonishing leatherback turtle, whose ancestry can be traced back 125 million years, is in our hands.<br/><br/>Writing with verve and color, Safina describes how he and his colleagues track giant pelagic turtles across the world\'s oceans and onto remote beaches of every continent. As scientists apply lessons learned in the Atlantic and Caribbean to other endangered seas, Safina follows leatherback migrations, including a thrilling journey from Monterey, California, to nesting grounds on the most remote beaches of Papua, New Guinea. The only surviving species of its genus, family, and suborder, the leatherback is an evolutionary marvel: a "reptile" that behaves like a warm-blooded dinosaur, an ocean animal able to withstand colder water than most fishes and dive deeper than any whale.<br/><br/>In his peerless prose, Safina captures the delicate interaction between these gentle giants and the humans who are finally playing a significant role in their survival.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/89/16/9780805078916.jpg', 'title_long': "Voyage of the Turtle: In Pursuit of the Earth's Last Dinosaur", 'edition': 'First Edition', 'dimensions': 'Height: 9.51 Inches, Length: 6.38 Inches, Weight: 1.7 Pounds, Width: 1.505 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.38}, 'width': {'unit': 'inches', 'value': 1.505}, 'weight': {'unit': 'pounds', 'value': 1.7}, 'height': {'unit': 'inches', 'value': 9.51}}, 'pages': 400, 'date_published': '2006-05-30', 'subjects': ['Science & Math', 'Biological Sciences', 'Animals', 'Biology', 'Nature & Ecology', 'Oceans & Seas'], 'authors': ['Carl Safina'], 'title': "Voyage of the Turtle: In Pursuit of the Earth's Last Dinosaur", 'isbn13': '9780805078916', 'msrp': '0.00', 'binding': 'Hardcover', 'isbn': '0805078916', 'isbn10': '0805078916', 'other_isbns': [{'isbn': '9781429900867', 'binding': 'print'}]}}