{'book': {'publisher': 'Schocken', 'synopsis': 'Winner of the National Jewish Book Award<br/><br/>The definitive biography of the poet whose sonnet "The New Colossus" appears on the base of the Statue of Liberty, welcoming immigrants to their new home.<br/><br/>Emma Lazarus’s most famous poem gave a voice to the Statue of Liberty, but her remarkable life has remained a mystery until now. She was a woman so far ahead of her time that we are still scrambling to catch up with her–-a feminist, a Zionist, and an internationally famous Jewish American writer before these categories even existed.<br/><br/>Drawing upon a cache of personal letters undiscovered until the 1980s, Esther Schor brings this vital woman to life in all her complexity. Born into a wealthy Sephardic family in 1849, Lazarus published her first volume of verse at seventeen and gained entrée into New York’s elite literary circles. Although she once referred to her family as “outlaw” Jews, she felt a deep attachment to Jewish history and peoplehood. Her compassion for the downtrodden Jews of Eastern Europe–-refugees whose lives had little in common with her own–-helped redefine the meaning of America itself.<br/><br/>In this groundbreaking biography, Schor argues persuasively for Lazarus’s place in history as a poet, an activist, and a prophet of the world we all inhabit today–a world that she helped to invent.<br/><br/>Jewish Encounters Series', 'language': 'en', 'image': 'https://images.isbndb.com/covers/21/64/9780805242164.jpg', 'title_long': 'Emma Lazarus (Jewish Encounters Series)', 'edition': 'Illustrated', 'dimensions': 'Height: 7.91 inches, Length: 5.36 inches, Weight: 0.87523518014 Pounds, Width: 1.22 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.36}, 'width': {'unit': 'inches', 'value': 1.22}, 'weight': {'unit': 'pounds', 'value': 0.87523518014}, 'height': {'unit': 'inches', 'value': 7.91}}, 'pages': 368, 'date_published': '2006-09-05', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Community & Culture', 'Women', 'Emigrants & Immigrants', 'History', 'World', 'Jewish', 'Women in History', 'Self Service', 'Custom Stores'], 'authors': ['Esther Schor'], 'title': 'Emma Lazarus (Jewish Encounters Series)', 'isbn13': '9780805242164', 'msrp': 27.95, 'binding': 'Hardcover', 'related': {'ePub': '0805242759'}, 'isbn': '0805242163', 'isbn10': '0805242163', 'other_isbns': [{'isbn': '9780805242751', 'binding': 'print'}]}}