{'book': {'publisher': 'Schocken', 'synopsis': 'How can I make the holidays interesting and meaningful to my child?<br/>Should I send my child to a Jewish day school? A Jewish summer camp?<br/>What kind of synagogue is best for my family?<br/>How do I plan a family trip to Israel or add Jewish heritage sites when traveling around the country or around the world?<br/><br/>If you are, or hope to be, a Jewish parent in more than name, you have a lot of decisions to make. So many choices! But you can have no better guide to this wealth of opportunity than Anita Diamant.<br/><br/>The author of popular books on Jewish weddings and baby rituals, Diamant now joins with family therapist Karen Kushner to help you through the next steps. They give creative, practical answers to these and many other questions, provide guidance on how to foster Jewish decision making for children of all ages, describe how to make your home a "Jewish space," and explain the importance of synagogue membership, holiday celebrations, community service, and other family activities.<br/><br/>Diamant and Kushner draw from many sources to describe the practices, customs, and values that go into creating a Jewish home. They combine insights from Jewish tradition with contemporary developmental thinking about how children learn and grow. They provide addresses (including Web sites) where you can find specific information and other resources. And since experience may be the best of all teachers, they share their own and other parents\' stories and observations. For Diamant and Kushner, the number-one goal of How to Be a Jewish Parent is to give parents (and grandparents) guideposts to raising joyful children within the rich tradition of the Jewish faith and culture. No Jewish family should be without it.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/11/60/9780805211160.jpg', 'title_long': 'How to Be a Jewish Parent: A Practical Handbook for Family Life', 'edition': 'Uncorrected Bound Galleys', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 320, 'date_published': '2000-09-05', 'subjects': ['Crafts, Hobbies & Home', 'Home Improvement & Design', 'How-to & Home Improvements', 'Parenting & Relationships', 'Parenting', 'Religion & Spirituality', 'Judaism', 'Jewish Life'], 'authors': ['Anita Diamant', 'Karen Kushner'], 'title': 'How to Be a Jewish Parent: A Practical Handbook for Family Life', 'isbn13': '9780805211160', 'msrp': 16.95, 'binding': 'Paperback', 'isbn': '0805211160', 'isbn10': '0805211160'}}