{'book': {'publisher': "St. Martin's Griffin", 'synopsis': 'From the inventor of the PalmPilot comes a new and compelling theory of intelligence, brain function, and the future of intelligent machines<br/><br/>Jeff Hawkins, the man who created the PalmPilot, Treo smart phone, and other handheld devices, has reshaped our relationship to computers. Now he stands ready to revolutionize both neuroscience and computing in one stroke, with a new understanding of intelligence itself.<br/><br/>Hawkins develops a powerful theory of how the human brain works, explaining why computers are not intelligent and how, based on this new theory, we can finally build intelligent machines.<br/><br/>The brain is not a computer, but a memory system that stores experiences in a way that reflects the true structure of the world, remembering sequences of events and their nested relationships and making predictions based on those memories. It is this memory-prediction system that forms the basis of intelligence, perception, creativity, and even consciousness.<br/><br/>In an engaging style that will captivate audiences from the merely curious to the professional scientist, Hawkins shows how a clear understanding of how the brain works will make it possible for us to build intelligent machines, in silicon, that will exceed our human ability in surprising ways.<br/><br/>Written with acclaimed science writer Sandra Blakeslee, On Intelligence promises to completely transfigure the possibilities of the technology age. It is a landmark book in its scope and clarity.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/85/34/9780805078534.jpg', 'title_long': 'On Intelligence: How a New Understanding of the Brain Will Lead to the Creation of Truly Intelligent Machines', 'edition': 'Reprint', 'dimensions': 'Height: 8.25 Inches, Length: 5.3999892 Inches, Weight: 0.54 Pounds, Width: 1.2 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.3999892}, 'width': {'unit': 'inches', 'value': 1.2}, 'weight': {'unit': 'pounds', 'value': 0.54}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 272, 'date_published': '2005-08-01', 'subjects': ['Computers & Technology', 'Computer Science', 'AI & Machine Learning', 'Science & Math', 'Behavioral Sciences', 'Cognitive Psychology', 'Biological Sciences', 'Biology', 'Physics', 'Molecular Physics', 'Medical Books', 'Psychology', 'Cognitive', 'Self Service', 'Custom Stores'], 'authors': ['Jeff Hawkins', 'Sandra Blakeslee'], 'title': 'On Intelligence: How a New Understanding of the Brain Will Lead to the Creation of Truly Intelligent Machines', 'isbn13': '9780805078534', 'msrp': 11.6, 'binding': 'Paperback', 'isbn': '0805078533', 'isbn10': '0805078533', 'other_isbns': [{'isbn': '9781429900454', 'binding': 'printisbncanonical'}]}}