{'book': {'publisher': 'University of Oklahoma Press', 'synopsis': '"Besides Homer, there is Hesiod." These words still contain much truth today. Hesiod is a very important poet, and for this reason his two surviving poems, Theogony and Works and Days, deserve to be presented as accurately and attractively as possible. R. M. Frazer has done this: His new translations are faithful to the matter and spirit of the originals, and his commentary makes the poems understandable and enjoyable.<br/>Hesiod is the first Greek and, therefore, the first European we can know as a real person, for, unlike Homer, he tells us about himself in his poems. Hesiod seems to have been a successful farmer and a rather gloomy though not humorless man. One suspects from his concern for the bachelor\'s lot and some rather unflattering remarks about women that he was never married. A close study of both poems reveals the same personality -that of a deeply religious man concerned with the problems of justice and fate.<br/>The Theogony represents the first codification of the Greek pantheon. Hesiod, of course, did not invent the gods, but he gave the Greeks a clear picture of their forms, functions, and relationships. Thus, the poem deals with the high epic theme of the creation of the divine order of the world under the direction of Zeus. Works and Days, by contrast, considers justice and work in the context of Hesiod\'s own life. The difference in subject matter produces a difference in style: Theogony is strongly influenced by the epic conventions; Works and Days is more modern and freewheeling.<br/>To get a fuller picture of Hesiod and his poems, we must try to understand him in relation to his times. The eighth century, when Hesiod lived, was the time of the great Greek awakening after the period of relative darkness ushered in by the fall of the old Mycenaean kingdoms around 1125 B.C. Hesiod thus lived at the beginning of the Greek classical period, and his poems influenced not only that age but also Western culture in our day.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/84/68/9780806118468.jpg', 'title_long': 'The Poems of Hesiod', 'edition': '1', 'dimensions': 'Height: 7.5 Inches, Length: 5 Inches, Weight: 0.4 Pounds, Width: 0.42 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5}, 'width': {'unit': 'inches', 'value': 0.42}, 'weight': {'unit': 'pounds', 'value': 0.4}, 'height': {'unit': 'inches', 'value': 7.5}}, 'pages': 160, 'date_published': '1983-05-15', 'subjects': ['Literature & Fiction', 'Poetry', 'Ancient, Classical & Medieval'], 'authors': ['R. M. Frazer', 'Hesiod'], 'title': 'The Poems of Hesiod', 'isbn13': '9780806118468', 'msrp': 24.95, 'binding': 'Paperback', 'isbn': '0806118466', 'isbn10': '0806118466'}}