{'book': {'publisher': 'Citadel', 'synopsis': 'Many thousands of readers worldwide consider Philip K. Dick to have been the greatest science fiction writer on any planet. Since his untimely death in 1982, interest in Dick’s work has continued to mount and his reputation has been enhanced by a growing body of critical attention. The Philip K. Dick Award is now presented annually to a distinguished work of science fiction, and the Philip K. Dick Society is devoted to the study and promulgation of his works.<br/>This collection includes all of the writer’s earliest short and medium-length fiction (including several previously unpublished stories) covering the years 1954 – 1964, and featuring such fascinating tales as The Minority Report (the inspiration for Steven Spielberg’s film), Service Call, Stand By, The Days of Perky Pat, and many others. Here, readers will find Dick’s initial explorations of the themes he so brilliantly brought to life in his later work.<br/>Dick won the prestigious Hugo Award for best novel of 1963 for The Man in the High Castle and in the last year of his life, the now-classic film Blade Runner was made from his novel Do Androids Dream of Electric Sheep?<br/>The classic stories of Philip K. Dick offer an intriguing glimpse into the early imagination of one of science fiction’s most enduring and respected names.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/37/98/9780806523798.jpg', 'title_long': 'The Minority Report and Other Classic Stories', 'edition': 'Reprint', 'dimensions': 'Height: 8.94 Inches, Length: 6.08 Inches, Weight: 0.96121546232 Pounds, Width: 1.1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.08}, 'width': {'unit': 'inches', 'value': 1.1}, 'weight': {'unit': 'pounds', 'value': 0.96121546232}, 'height': {'unit': 'inches', 'value': 8.94}}, 'pages': 380, 'date_published': '2002-05-01', 'subjects': ['Science Fiction & Fantasy', 'Science Fiction', 'Anthologies'], 'authors': ['Philip K. Dick'], 'title': 'The Minority Report and Other Classic Stories', 'isbn13': '9780806523798', 'msrp': 10.99, 'binding': 'Paperback', 'isbn': '0806523794', 'isbn10': '0806523794'}}