{'book': {'publisher': 'Beacon Press', 'synopsis': 'This classic work of comparative history explores why some countries have developed as democracies and others as fascist or communist dictatorships<br/><br/>Originally published in 1966, this classic text is a comparative survey of some of what Barrington Moore considers the major and most indicative world economies as they evolved out of pre-modern political systems into industrialism. But Moore is not ultimately concerned with explaining economic development so much as exploring why modes of development produced different political forms that managed the transition to industrialism and modernization. Why did one society modernize into a "relatively free," democratic society (by which Moore means England)? Why did others metamorphose into fascist or communist states? His core thesis is that in each country, the relationship between the landlord class and the peasants was a primary influence on the ultimate form of government the society arrived at upon arrival in its modern age.<br/><br/>“Throughout the book, there is the constant play of a mind that is scholarly, original, and imbued with the rarest gift of all, a deep sense of human reality . . . This book will influence a whole generation of young American historians and lead them to problems of the greatest significance.”<br/>—The New York Review of Books', 'language': 'en', 'image': 'https://images.isbndb.com/covers/07/36/9780807050736.jpg', 'title_long': 'Social Origins of Dictatorship and Democracy: Lord and Peasant in the Making of the Modern World', 'edition': 'Reprint', 'dimensions': 'Height: 8 Inches, Length: 5.4 Inches, Weight: 1.35 Pounds, Width: 1.55 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.4}, 'width': {'unit': 'inches', 'value': 1.55}, 'weight': {'unit': 'pounds', 'value': 1.35}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 592, 'date_published': '1993-09-01', 'subjects': ['History', 'Americas', 'Asia', 'World', 'Politics & Social Sciences', 'Philosophy', 'Social Sciences', 'Sociology', 'Class', 'Politics & Government', 'Ideologies & Doctrines', 'International & World Politics'], 'authors': ['Barrington Moore'], 'title': 'Social Origins of Dictatorship and Democracy: Lord and Peasant in the Making of the Modern World', 'isbn13': '9780807050736', 'msrp': 30, 'binding': 'Paperback', 'related': {'ePub': '0807097047'}, 'isbn': '0807050733', 'isbn10': '0807050733', 'other_isbns': [{'isbn': '9780807097045', 'binding': 'printisbn'}]}}