{'book': {'publisher': 'Albert Whitman & Company', 'synopsis': 'Product Description<br/><br/>Everyone feels angry sometimes, but there are always ways to feel better! Join a bunny rabbit and her family as she learns to manage angry feelings. With a focus on identifying the causes of an emotional reaction, and coming up with ways to start feeling calm and happy again, this book explains simple strategies to help kids understand and take care of their emotions.<br/><br/>Review<br/><br/>"This gentle book puts an adorable bunny in a variety of situations that preschool or grade-school children can relate to."―Booklist<br/><br/>"Cote\'s vibrant paintings skillfully convey the feelings of the characters and add significantly to the child appeal."―School Library Journal<br/><br/>About the Author<br/><br/>Cornelia Maude Spelman, a former therapist who worked with children and families, now devotes her time to writing. She lives with her husband in Illinois.<br/><br/>Nancy Cote feels like the luckiest person in the world because she can write and illustrate children\'s books. Her unique art style has garnered international attention and numerous awards. She lives in Massachusetts.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/89/70/9780807588970.jpg', 'title_long': 'When I Feel Angry (The Way I Feel Books)', 'edition': 'Reprint', 'dimensions': 'Height: 10 Inches, Length: 8 Inches, Weight: 0.25 Pounds, Width: 0.1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8}, 'width': {'unit': 'inches', 'value': 0.1}, 'weight': {'unit': 'pounds', 'value': 0.25}, 'height': {'unit': 'inches', 'value': 10}}, 'pages': 24, 'date_published': '2000-01-01', 'subjects': ["Children's Books", 'Animals', 'Rabbits', 'Growing Up & Facts of Life', 'Friendship, Social Skills & School Life', 'Education & Teaching', 'Schools & Teaching', 'Self Service', 'Custom Stores'], 'authors': ['Cornelia Maude Spelman'], 'title': 'When I Feel Angry (The Way I Feel Books)', 'isbn13': '9780807588970', 'msrp': 6.95, 'binding': 'Paperback', 'isbn': '0807588970', 'isbn10': '0807588970'}}