{'book': {'publisher': 'LSU Press', 'synopsis': 'Winner of the C. Hugh Holman Award<br/><br/>A central figure in twentieth-century American literature, Robert Penn Warren (1905–1989) was appointed by the Library of Congress as the first Poet Laureate of the United States in 1985. Although better known for his fiction, especially his novel All the King’s Men, it is mainly his poetry―spanning sixty years, fifteen volumes of verse, and a wide range of styles―that reveals Warren to be one of America’s foremost men of letters.<br/><br/>In this indispensable volume, John Burt, Warren’s literary executor, has assembled every poem Warren ever published (with the exception of Brother to Dragons), including the many poems he published in The Fugitive and other magazines, as well as those that appeared in his small press works and broadsides. Burt has also exhaustively collated all of the published versions of Warren’s poems―which, in some cases, appeared as many as six different times with substantive revisions in every line―as well as his typescripts and proofs. And since Warren never seemed to reread any of his books without a pencil in his hand, Burt has referred to Warren’s personal library copies. This comprehensive edition also contains textual notes, lists of emendations, and explanatory notes.<br/><br/>Warren was born and raised in Guthrie, Kentucky, where southern agrarian values and a predilection for storytelling were ingrained in him as a young boy. By 1925, when he graduated from Vanderbilt University, he was already the most promising of that exceptional set of poets and intellectuals known as the Fugitives. Warren devoted most of the 1940s and 1950s to writing prose and literary criticism, but from the late 1950s he composed primarily poetry, with each successive volume of verse that he penned demonstrating his rigorous and growing commitment to that genre. The mature visionary power and technical virtuosity of his work in the 1970s and early 1980s emanated from his strongly held belief that “only insofar as the work [of art] establishes and expresses a self can it engage us.” Many of Warren’s later poems, which he deemed “some of my best,” rejoice in the possibilities of old age and the poet’s ability for “continually expanding in a vital process of definition, affirmation, revision, and growth, a process that is the image, we may say, of the life process.”', 'language': 'en', 'image': 'https://images.isbndb.com/covers/33/31/9780807123331.jpg', 'title_long': 'The Collected Poems of Robert Penn Warren', 'edition': 'Illustrated', 'dimensions': 'Height: 9.21 Inches, Length: 6.14 Inches, Weight: 3.01 Pounds, Width: 2.06 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.14}, 'width': {'unit': 'inches', 'value': 2.06}, 'weight': {'unit': 'pounds', 'value': 3.01}, 'height': {'unit': 'inches', 'value': 9.21}}, 'pages': 838, 'date_published': '1998-10-01', 'subjects': ['Literature & Fiction', 'Poetry', 'Regional & Cultural'], 'authors': ['Robert Penn Warren'], 'title': 'The Collected Poems of Robert Penn Warren', 'isbn13': '9780807123331', 'msrp': 79.95, 'binding': 'Hardcover', 'isbn': '0807123331', 'isbn10': '0807123331'}}