{'book': {'publisher': 'Beacon Press', 'synopsis': 'We needed to stop asking about the meaning of life, and instead to think of ourselves as those who were being questioned by life-daily and hourly. Our answer must consist not in talk and meditation, but in right action and in right conduct. Life ultimately means taking the responsibility to find the right answer to its problems and to fulfill the tasks which it constantly sets for each individual.<br/><br/>When Man\'s Search for Meaning was first published in 1959, it was hailed by Carl Rogers as "one of the outstanding contributions to psychological thought in the last fifty years." Now, more than forty years and 4 million copies later, this tribute to hope in the face of unimaginable loss has emerged as a true classic. Man\'s Search for Meaning--at once a memoir, a self-help book, and a psychology manual-is the story of psychiatrist Viktor Frankl\'s struggle for survival during his three years in Auschwitz and other Nazi concentration camps. Yet rather than "a tale concerned with the great horrors," Frankl focuses in on the "hard fight for existence" waged by "the great army of unknown and unrecorded."<br/><br/>Viktor Frankl\'s training as a psychiatrist allowed him a remarkable perspective on the psychology of survival. In these inspired pages, he asserts that the "the will to meaning" is the basic motivation for human life. This simple and yet profound statement became the basis of his psychological theory, logotherapy, and forever changed the way we understand our humanity in the face of suffering. As Nietzsche put it, "He who has a why to live for can bear almost any how." Frankl\'s seminal work offers us all an avenue to greater meaning and purpose in our own lives-a way to transcend suffering and find significance in the act of living.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/42/64/9780807014264.jpg', 'title_long': "Man's Search for Meaning", 'edition': '4th', 'dimensions': 'Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.75 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 0.75}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 196, 'date_published': '2000-03-30', 'subjects': ['Health, Fitness & Dieting', 'Psychology & Counseling', 'Psychotherapy, TA & NLP', 'History', 'World', 'Jewish', 'Reference', 'Religion & Spirituality', 'Judaism', 'Medical Books', 'Psychology', 'Movements'], 'authors': ['Viktor E. Frankl'], 'title': "Man's Search for Meaning", 'isbn13': '9780807014264', 'msrp': 19.95, 'binding': 'Hardcover', 'isbn': '0807014265', 'isbn10': '0807014265'}}