{'book': {'publisher': 'Univ of North Carolina Pr', 'synopsis': 'In a direct, frank, and intimate exploration of Iranian literature and society, scholar, teacher, and poet Fatemeh Keshavarz challenges popular perceptions of Iran as a society bereft of vitality and joy. Her fresh perspective on present-day Iran provides a rare insight into this rich culture alive with artistic expression but virtually unknown to most Americans.<br/><br/>Keshavarz introduces readers to two modern Iranian women writers whose strong and articulate voices belie the stereotypical perception of Iranian women as voiceless victims in a country of villains. She follows with a lively critique of the recent best-sellerReading Lolita in Tehran: A Memoir in Books, which epitomizes what Keshavarz calls the "New Orientalist narrative," a view marred by stereotype and prejudice more often tied to current geopolitical conflicts than to an understanding of Iran.<br/><br/>Blending in firsthand glimpses of her own life--from childhood memories in 1960s Shiraz to her present life as a professor in America--Keshavarz paints a portrait of Iran depicting both cultural depth and intellectual complexity. With a scholar\'s expertise and a poet\'s hand, she helps amplify the powerful voices of contemporary Iranians and leads readers toward a deeper understanding of the country\'s past and present.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/10/90/9780807831090.jpg', 'title_long': 'Jasmine and Stars: Reading More Than Lolita in Tehran (Islamic Civilization and Muslim Networks)', 'edition': 'SECOND PRINTING', 'dimensions': 'Height: 9.5 Inches, Length: 6.25 Inches, Weight: 0.9 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 174, 'date_published': '2007', 'subjects': ['Biographies & Memoirs', 'Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Movements & Periods', 'Regional & Cultural', 'Politics & Social Sciences', "Women's Studies", 'Women Writers'], 'authors': ['Fatemeh Keshavarz'], 'title': 'Jasmine and Stars: Reading More Than Lolita in Tehran (Islamic Civilization and Muslim Networks)', 'isbn13': '9780807831090', 'msrp': '0.00', 'binding': 'Hardcover', 'related': {'eBook': '0807883751', 'ePub': '0807883751'}, 'isbn': '0807831093', 'isbn10': '0807831093', 'other_isbns': [{'isbn': '9780807883754', 'binding': 'ebook'}]}}