{'book': {'publisher': 'New Directions', 'synopsis': 'Only a pataphysician nurtured lovingly on surrealist excess could have come up with The Blue Flowers, Queneau\'s 1964 novel. At his death in 1976, Raymond Queneau was one of France\'s most eminent men of letters––novelist, poet, essayist, editor, scientist, mathematician, and, more to the point, pataphysician. And only a pataphysician nurtured lovingly on surrealist excess could have come up with The Blue Flowers, Queneau\'s 1964 novel, now reissued as a New Directions Paperbook. To a pataphysician all things are equal, there is no improvement or progress in the human condition, and a "message" is an invention of the benighted reader, certainly not the author or his perplexing creations––the sweet, fennel-drinking Cidrolin and the rampaging Duke d\'Auge. History is mostly what the duke rampages through––700 years of it at 175-year clips. He refuses to crusade, clobbers his king with the "in" toy of 1439––the cannon––dabbles in alchemy, and decides that those musty caves down at Altamira need a bit of sprucing up. Meanwhile, Cidrolin in the 1960s lolls on his barge moored along the Seine, sips essence of fennel, and ineffectually tries to catch the graffitist who nightly defiles his fence. But mostly he naps. Is it just a coincidence that the duke appears only when Cidrolin is dozing? And vice versa? In the tradition of Villon and Céline, Queneau attempted to bring the language of the French streets into common literary usage, and his mad word-plays, bad puns, bawdy jokes, and anachronistic wackiness have been kept amazingly and glitteringly intact by the incomparable translator Barbara Wright.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/94/58/9780811209458.jpg', 'title_long': 'The Blue Flowers', 'dimensions': 'Height: 8 Inches, Length: 5.3 Inches, Weight: 0.57099725858 Pounds, Width: 0.7 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.3}, 'width': {'unit': 'inches', 'value': 0.7}, 'weight': {'unit': 'pounds', 'value': 0.57099725858}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 232, 'date_published': '1985-04-17', 'subjects': ['Literature & Fiction', 'Poetry'], 'authors': ['Raymond Queneau'], 'title': 'The Blue Flowers', 'isbn13': '9780811209458', 'msrp': 17.95, 'binding': 'Paperback', 'isbn': '0811209458', 'isbn10': '0811209458', 'other_isbns': [{'isbn': '9780811220859', 'binding': 'saleableprint'}]}}