{'book': {'publisher': 'New Directions', 'synopsis': 'Experimental in its category, Boris Pasternak’s first autobiography, originally published after the great success of his Dr. Zhivago. The awarding of the 1958 Nobel Prize for Literature to Boris Pasternak and the subsequent calumny of his fellow citizens in Soviet Russia focused unusual attention on Pasternak\'s great novel, Dr. Zhivago, and the small body of his other work. At the time, the latter was only available (in any language, as far as is known) in New Directions\' Selected Writings of Pasternak, first published in 1949. The 1958 edition was issued with a new introduction by Babette Deutsch under the title of the book\'s main component, Pasternak\'s autobiography.<br/><br/>Written when he was forty, Safe Conduct puzzled many readers in Russia and when it appeared in English, because its isolated sharp impressions and juxtapositions seem to deny chronology, but at least one critic recognized it as "the most original of autobiographies, employing a new technique of great important."<br/><br/>Also included is a group of remarkable short stories, translated by Robert Payne, dealing with the mysteries of life and art, and a selection of the poems that have made Pasternak known, to the few at last, as the "outstanding Russian poet of the century." these are translated by the British Critic and poet C. M. Bowra, and by Miss Deutsch.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/13/53/9780811201353.jpg', 'title_long': 'Safe Conduct: An Autobiography and Other Writings', 'edition': '1', 'dimensions': 'Height: 8 Inches, Length: 5.2 Inches, Weight: 0.6 Pounds, Width: 0.7 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.2}, 'width': {'unit': 'inches', 'value': 0.7}, 'weight': {'unit': 'pounds', 'value': 0.6}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 256, 'date_published': '2009-04-14', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Regional & Cultural'], 'authors': ['Boris Pasternak'], 'title': 'Safe Conduct: An Autobiography and Other Writings', 'isbn13': '9780811201353', 'msrp': '0.00', 'binding': 'Paperback', 'isbn': '081120135X', 'isbn10': '081120135X'}}