{'book': {'publisher': 'Chronicle Books', 'synopsis': '<p>Model, film star, socialite, friend, lover, addict, Edie Sedgwick was the first "it" girl of the Andy Warhol Factory scene and later muse to Bob Dylan. The arc of Edie\'s life traced the rise and fall of the 1960s from idyllic experimentation to dissolute recklessness. After being toasted by the whole of New York City, Edie died alone of a drug overdose in California at the age of 28. David Weisman (with John Palmer) filmed Edie for the last five years of her life in his cult film <i>Ciao! Manhattan</i>. When he recently uncovered lost footage of Edie, David was inspired to create <i>Edie: Girl on Fire</i>, a book and a documentary film that explores Edie\'s true story. He and coauthor Melissa Painter have tracked down and interviewed many of Edie Sedgwick\'s surviving intimates, including Danny Fields, Baby Jane Holzer, and Ultra Violet. They also unearthed hundreds of never-before-published photos portraits, professional ad shoots, and heartbreaking snapshots of the girl who won New York\'s heart and nearly burned down the Chelsea hotel. The book also features a CD with Edie\'s last interview ever, a riveting account of a rollercoaster life. Sure to be seen as a rebuttal to Hollywood\'s highly fictionalized film <i>Factory Girl</i> (coming this fall), <i>Edie: Girl on Fire</i> creates an insightful and startling portrait of a woman that nobody quite knew.</p>', 'language': 'en', 'image': 'https://images.isbndb.com/covers/52/66/9780811855266.jpg', 'title_long': 'Edie: Girl on Fire', 'edition': 'Har/Com', 'dimensions': 'Height: 11.4 Inches, Length: 9.3 Inches, Weight: 2.9982867632 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 9.3}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 2.9982867632}, 'height': {'unit': 'inches', 'value': 11.4}}, 'pages': 192, 'date_published': '2006', 'subjects': ['Arts & Photography', 'Fashion', 'Photography & Video', 'Music', 'Biographies & Memoirs', 'Arts & Literature', 'Actors & Entertainers', 'Specific Groups', 'Women', 'Humor & Entertainment', 'Religion & Spirituality', 'New Age & Spirituality'], 'authors': ['Melissa Painter', 'David Weisman'], 'title': 'Edie: Girl on Fire', 'isbn13': '9780811855266', 'msrp': 25.9, 'binding': 'Hardcover', 'isbn': '0811855260', 'isbn10': '0811855260'}}