{'book': {'publisher': 'New Directions', 'synopsis': 'The Pulitzer Prize and Drama Critics Circle Award winning play―reissued with an introduction by Arthur Miller (Death of a Salesman and The Crucible), and Williams\' essay "The World I Live In." It is a very short list of 20th-century American plays that continue to have the same power and impact as when they first appeared―57 years after its Broadway premiere, Tennessee Williams\' A Streetcar Named Desire is one of those plays. The story famously recounts how the faded and promiscuous Blanche DuBois is pushed over the edge by her sexy and brutal brother-in-law, Stanley Kowalski. Streetcar launched the careers of Marlon Brando, Jessica Tandy, Kim Hunter and Karl Malden, and solidified the position of Tennessee Williams as one of the most important young playwrights of his generation, as well as that of Elia Kazan as the greatest American stage director of the \'40s and \'50s.<br/><br/>Who better than America\'s elder statesman of the theater, Williams\' contemporary Arthur Miller, to write as a witness to the lightning that struck American culture in the form of A Streetcar Named Desire? Miller\'s rich perspective on Williams\' singular style of poetic dialogue, sensitive characters, and dramatic violence makes this a unique and valuable new edition of A Streetcar Named Desire. This definitive new edition will also include Williams\' essay "The World I Live In," and a brief chronology of the author\'s life.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/60/29/9780811216029.jpg', 'title_long': 'A Streetcar Named Desire (New Directions Paperbook)', 'edition': 'unknown', 'dimensions': 'Height: 8 Inches, Length: 5.2 Inches, Weight: 0.44 Pounds, Width: 0.6 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.2}, 'width': {'unit': 'inches', 'value': 0.6}, 'weight': {'unit': 'pounds', 'value': 0.44}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 224, 'date_published': '2004-09', 'subjects': ['Literature & Fiction', 'Classics', 'Dramas & Plays', 'United States', 'History & Criticism', 'Criticism & Theory', 'Genres & Styles', 'Literary', 'Reference'], 'authors': ['Tennessee Williams'], 'title': 'A Streetcar Named Desire (New Directions Paperbook)', 'isbn13': '9780811216029', 'msrp': 11.14, 'binding': 'Paperback', 'related': {'Kindle Edition': '0811220761', 'ePub': '0811220761'}, 'isbn': '0811216020', 'isbn10': '0811216020', 'other_isbns': [{'isbn': '9780811220767', 'binding': 'print'}]}}