{'book': {'publisher': 'New Directions', 'synopsis': 'The classic novel from the author of Lolita, brilliantly portraying one man\'s ruin through love and betrayal. "Once upon a time there lived in Berlin, Germany, a man called Albinus. He was rich, respectable, happy; one day he abandoned his wife for the sake of a youthful mistress; he loved; was not loved; and his life ended in disaster." Thus begins Vladimir Nabokov\'s Laughter in the Dark; this, the author tells us, is the whole story―except that he starts from here, with his characteristic dazzling skill and irony, and brilliantly turns a fable into a chilling, original novel of folly and destruction. Amidst a Weimar-era milieu of silent film stars, artists, and aspirants, Nabokov creates a merciless masterpiece as Albinus, an aging critic, falls prey to his own desires, to his teenage mistress, and to Axel Rex, the scheming rival for her affections who finds his greatest joy in the downfall of others.<br/><br/>Published first in Russian as Kamera Obskura in 1932, this book appeared in Nabokov\'s own English translation six years later. This New Directions edition, based on the text as Nabokov revised it in 1960, features a new introduction by Booker Prize-winner John Banville.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/67/46/9780811216746.jpg', 'title_long': 'Laughter in the Dark', 'edition': '60148th', 'dimensions': 'Height: 8 Inches, Length: 5.2 Inches, Weight: 0.60186197526 Pounds, Width: 0.9 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.2}, 'width': {'unit': 'inches', 'value': 0.9}, 'weight': {'unit': 'pounds', 'value': 0.60186197526}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 308, 'date_published': '2006-09-17', 'subjects': ['Literature & Fiction', 'Classics', 'Literary'], 'authors': ['Vladimir Nabokov'], 'title': 'Laughter in the Dark', 'isbn13': '9780811216746', 'msrp': 14.95, 'binding': 'Paperback', 'isbn': '0811216748', 'isbn10': '0811216748'}}