{'book': {'publisher': 'Random House Trade Paperbacks', 'synopsis': 'An insightful, achingly funny coming-of-age story as well as a brilliant dissection of class, race, and gender in a hothouse of adolescent angst and ambition.<br/><br/>Lee Fiora is an intelligent, observant fourteen-year-old when her father drops her off in front of her dorm at the prestigious Ault School in Massachusetts. She leaves her animated, affectionate family in South Bend, Indiana, at least in part because of the boarding school’s glossy brochure, in which boys in sweaters chat in front of old brick buildings, girls in kilts hold lacrosse sticks on pristinely mown athletic fields, and everyone sings hymns in chapel.<br/><br/>As Lee soon learns, Ault is a cloistered world of jaded, attractive teenagers who spend summers on Nantucket and speak in their own clever shorthand. Both intimidated and fascinated by her classmates, Lee becomes a shrewd observer of—and, ultimately, a participant in—their rituals and mores. As a scholarship student, she constantly feels like an outsider and is both drawn to and repelled by other loners. By the time she’s a senior, Lee has created a hard-won place for herself at Ault. But when her behavior takes a self-destructive and highly public turn, her carefully crafted identity within the community is shattered.<br/><br/>Ultimately, Lee’s experiences—complicated relationships with teachers; intense friendships with other girls; an all-consuming preoccupation with a classmate who is less than a boyfriend and more than a crush; conflicts with her parents, from whom Lee feels increasingly distant—coalesce into a singular portrait of the painful and thrilling adolescence universal to us all.<br/><br/>Praise for Prep<br/><br/>“Curtis Sittenfeld is a young writer with a crazy amount of talent. Her sharp and economical prose reminds us of Joan Didion and Tobias Wolff. Like them, she has a sly and potent wit, which cuts unexpectedly—but often—through the placid surface of her prose. Her voice is strong and clear, her moral compass steady; I’d believe anything she told me.”—Dave Eggers, author of A Heartbreaking Work of Staggering Genius<br/><br/>“Speaking in a voice as authentic as Salinger’s Holden Caulfield and McCullers’ Mick Kelly, Curtis Sittenfeld’s Lee Fiora tells unsugared truths about adolescence, alienation, and the sociology of privilege. Prep’s every sentence rings true. Sittenfeld is a rising star.”—Wally Lamb, author of She’s Come Undone and I Know This Much Is True', 'language': 'en', 'image': 'https://images.isbndb.com/covers/23/51/9780812972351.jpg', 'title_long': 'Prep: A Novel', 'edition': 'First Edition', 'dimensions': 'Height: 7.9 Inches, Length: 5.2 Inches, Weight: 0.75 Pounds, Width: 0.93 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.2}, 'width': {'unit': 'inches', 'value': 0.93}, 'weight': {'unit': 'pounds', 'value': 0.75}, 'height': {'unit': 'inches', 'value': 7.9}}, 'pages': 406, 'date_published': '2005-11-22', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Family Saga', 'Coming of Age', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors': ['Curtis Sittenfeld'], 'title': 'Prep: A Novel', 'isbn13': '9780812972351', 'msrp': 3.99, 'binding': 'Paperback', 'isbn': '081297235X', 'isbn10': '081297235X', 'other_isbns': [{'isbn': '9781588364500', 'binding': 'e'}]}}