{'book': {'publisher': 'Modern Library', 'synopsis': 'In this splendid new translation of Voltaire’s satiric masterpiece, all the celebrated wit, irony, and trenchant social commentary of one of the great works of the Enlightenment is restored and refreshed.<br/><br/>Voltaire may have cast a jaundiced eye on eighteenth-century Europe–a place that was definitely not the “best of all possible worlds.” But amid its decadent society, despotic rulers, civil and religious wars, and other ills, Voltaire found a mother lode of comic material. And this is why Peter Constantine’s thoughtful translation is such a pleasure, presenting all the book’s subtlety and ribald joys precisely as Voltaire had intended.<br/><br/>The globe-trotting misadventures of the youthful Candide; his tutor, Dr. Pangloss; Martin, and the exceptionally trouble-prone object of Candide’s affections, Cunégonde, as they brave exile, destitution, cannibals, and numerous deprivation, provoke both belly laughs and deep contemplation about the roles of hope and suffering in human life.<br/><br/>The transformation of Candide’s outlook from panglossian optimism to realism neatly lays out Voltaire’s philosophy–that even in Utopia, life is less about happiness than survival–but not before providing us with one of literature’s great and rare pleasures.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/20/16/9780812972016.jpg', 'title_long': 'Candide: or, Optimism (Modern Library Classics)', 'dimensions': 'Height: 7.94 Inches, Length: 5.2 inches, Weight: 0.2755778275 Pounds, Width: 0.33 inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.2}, 'width': {'unit': 'inches', 'value': 0.33}, 'weight': {'unit': 'pounds', 'value': 0.2755778275}, 'height': {'unit': 'inches', 'value': 7.94}}, 'pages': 144, 'date_published': '2005-10-11', 'subjects': ['Humor & Entertainment', 'Humor', 'Lawyers & Criminals', 'Self-Help & Psychology', 'Literature & Fiction', 'Classics', 'Dramas & Plays', 'Comedy', 'Genre Fiction', 'Psychological', 'United States', 'Humor & Satire', 'Satire', 'Literary', 'Self Service', 'Custom Stores'], 'authors': ['Voltaire'], 'title': 'Candide: or, Optimism (Modern Library Classics)', 'isbn13': '9780812972016', 'msrp': 12, 'binding': 'Paperback', 'isbn': '0812972015', 'isbn10': '0812972015', 'other_isbns': [{'isbn': '9780553897999', 'binding': 'print'}]}}