{'book': {'publisher': 'Tor Books', 'synopsis': "The masterpiece from Terry Goodkind that started the New York Times bestselling epic Sword of Truth and became the inspiration behind the TV show Legend of the Seeker. This boxed set includes the first three books: Wizard's First Rule, Stone of Tears, and Blood of the Fold<br/><br/>Book 1: Wizard's First Rule<br/><br/>In the aftermath of the brutal murder of his father, a mysterious woman, Kahlan Amnell, appears in Richard Cypher's forest sanctuary seeking help. Richard’s world, his very beliefs, are shattered when ancient debts come due with thundering violence.<br/><br/>This is the beginning. One book. One Rule. Witness the birth of a legend.<br/><br/>Book 2: Stone of Tears<br/><br/>Kahlan has at last gained the one goal she had always thought was beyond her grasp ... love. Against all odds, the ancient bonds of secret oaths, and the dark talents of men long dead, Richard has won her heart.<br/><br/>Amid sudden and disastrous events, Richard's life is called due to satisfy those treacherous oaths. To save his life, Kahlan must forsake Richard's love and cast him into the chains of slavery, knowing there could be no sin worse than such a betrayal.<br/><br/>Book 3: Blood of the Fold<br/><br/>In a world as rich and real as our own, Richard Rahl and Kahlan Amnell stand against the ancient forces which besiege the New World--forces so terrible that when last they threatened, they could only be withstood by sealing off the Old World from whence they came. Now the barrier has been breached, and the New World is again beset by their evil power.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/56/06/9780812575606.jpg', 'title_long': "The Sword of Truth, Boxed Set I, Books 1-3: Wizard's First Rule, Blood of the Fold ,Stone of Tears", 'edition': 'Boxed Set', 'dimensions': 'Height: 6.78 Inches, Length: 4.26 Inches, Weight: 2.7998707274 Pounds, Width: 5.6 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.26}, 'width': {'unit': 'inches', 'value': 5.6}, 'weight': {'unit': 'pounds', 'value': 2.7998707274}, 'height': {'unit': 'inches', 'value': 6.78}}, 'pages': 2480, 'date_published': '1998-11', 'subjects': ['Literature & Fiction', 'Action & Adventure', 'Fantasy', 'United States', 'Science Fiction & Fantasy', 'Epic', 'Sword & Sorcery'], 'authors': ['Terry Goodkind'], 'title': "The Sword of Truth, Boxed Set I, Books 1-3: Wizard's First Rule, Blood of the Fold ,Stone of Tears", 'isbn13': '9780812575606', 'msrp': 27.97, 'binding': 'Mass Market Paperback', 'isbn': '0812575601', 'isbn10': '0812575601'}}