{'book': {'publisher': 'Broadway Books', 'synopsis': 'For almost three decades, President Carter has regularly spent part of each Sunday reading from scripture and sharing his personal faith with neighbors, friends, and visitors at his Baptist church in Plains, Georgia. In Living Faith, he draws on this experience, exploring the values closest to his heart and the personal beliefs that have nurtured and sustained him.<br/><br/>For President Carter, faith finds its deepest expression in a life of compassion, reconciliation, and service to others. Living Faith is filled with stories of people whose lives have touched his--some from the world stage, more from modest walks of life. We see how President Carter learned about other faiths from Prime Minister Menachim Begin and President Anwar Sadat; learned a lesson in forgiveness from a clash with commentator George Will; how he was inspired by the simple theology of preacher Ely Cruz, "Love God and the person in front of you"; and how the cheerful strength of family friend Annie Mae Rhodes taught him the meaning of "patient faith."<br/><br/>Rooted in scripture and infused with a vision of how a dynamic faith can enrich our public and private lives, this is the most personal book yet by one of our most admired Americans--a warmly inspirational volume to give and to share.<br/><br/>From the Hardcover edition.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/03/44/9780812930344.jpg', 'title_long': 'Living Faith', 'edition': '1', 'dimensions': 'Height: 8.2 Inches, Length: 5.5 Inches, Weight: 0.8 Pounds, Width: 0.8 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.8}, 'weight': {'unit': 'pounds', 'value': 0.8}, 'height': {'unit': 'inches', 'value': 8.2}}, 'pages': 288, 'date_published': '1998-09-14', 'subjects': ['Christian Books & Bibles', 'Christian Living', 'Biographies & Memoirs', 'Leaders & Notable People', 'Presidents & Heads of State', 'Religious', 'Religion & Spirituality', 'Worship & Devotion', 'Inspirational'], 'authors': ['Jimmy Carter'], 'title': 'Living Faith', 'isbn13': '9780812930344', 'msrp': 15, 'binding': 'Paperback', 'isbn': '0812930347', 'isbn10': '0812930347'}}