{'book': {'publisher': 'Random House Trade Paperbacks', 'synopsis': 'A fascinating, accessible introduction to Islam from the author of the #1 New York Times bestseller Zealot<br/><br/>Though it is the fastest-growing religion in the world, Islam remains shrouded in ignorance and fear for much of the West. In No god but God, Reza Aslan, an internationally acclaimed scholar of religions, explains this faith in all its beauty and complexity. Beginning with a vivid account of the social and religious milieu in which the Prophet Muhammad forged his message, Aslan paints a portrait of the first Muslim community as a radical experiment in religious pluralism and social egalitarianism. He demonstrates how, after the Prophet’s death, his successors attempted to interpret his message for future generations–an overwhelming task that fractured the Muslim community into competing sects. Finally, Aslan examines how, in the shadow of European colonialism, Muslims developed conflicting strategies to reconcile traditional Islamic values with the realities of the modern world, thus launching what Aslan terms the Islamic Reformation. Timely and persuasive, No god but God is an elegantly written account of a magnificent yet misunderstood faith.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/18/97/9780812971897.jpg', 'title_long': 'No god but God: The Origins, Evolution, and Future of Islam', 'edition': 'Reprint', 'dimensions': 'Height: 8 Inches, Length: 5.18 Inches, Weight: 0.55 Pounds, Width: 0.77 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5}, 'width': {'unit': 'inches', 'value': 0.25}, 'weight': {'unit': 'pounds', 'value': 0.55}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 310, 'date_published': '2006-01-10', 'subjects': ['Religion & Spirituality', 'Islam', 'History', 'Politics & Social Sciences', 'Social Sciences'], 'authors': ['Reza Aslan'], 'title': 'No god but God: The Origins, Evolution, and Future of Islam', 'isbn13': '9780812971897', 'msrp': 16, 'binding': 'Paperback', 'isbn': '0812971892', 'isbn10': '0812971892'}}