{'book': {'publisher': 'Random House Trade Paperbacks', 'synopsis': 'One of our most provocative military historians, Victor Davis Hanson has given us painstakingly researched and pathbreaking accounts of wars ranging from classical antiquity to the twenty-first century. Now he juxtaposes an ancient conflict with our most urgent modern concerns to create his most engrossing work to date, A War Like No Other.<br/><br/>Over the course of a generation, the Hellenic city-states of Athens and Sparta fought a bloody conflict that resulted in the collapse of Athens and the end of its golden age. Thucydides wrote the standard history of the Peloponnesian War, which has given readers throughout the ages a vivid and authoritative narrative. But Hanson offers readers something new: a complete chronological account that reflects the political background of the time, the strategic thinking of the combatants, the misery of battle in multifaceted theaters, and important insight into how these events echo in the present.<br/><br/>Hanson compellingly portrays the ways Athens and Sparta fought on land and sea, in city and countryside, and details their employment of the full scope of conventional and nonconventional tactics, from sieges to targeted assassinations, torture, and terrorism. He also assesses the crucial roles played by warriors such as Pericles and Lysander, artists, among them Aristophanes, and thinkers including Sophocles and Plato.<br/><br/>Hanson’s perceptive analysis of events and personalities raises many thought-provoking questions: Were Athens and Sparta like America and Russia, two superpowers battling to the death? Is the Peloponnesian War echoed in the endless, frustrating conflicts of Vietnam, Northern Ireland, and the current Middle East? Or was it more like America’s own Civil War, a brutal rift that rent the fabric of a glorious society, or even this century’s “red state—blue state” schism between liberals and conservatives, a cultural war that manifestly controls military policies? Hanson daringly brings the facts to life and unearths the often surprising ways in which the past informs the present.<br/><br/>Brilliantly researched, dynamically written, A War Like No Other is like no other history of this important war.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/97/02/9780812969702.jpg', 'title_long': 'A War Like No Other: How the Athenians and Spartans Fought the Peloponnesian War', 'edition': 'Reprint', 'dimensions': 'Height: 9.21 Inches, Length: 6.17 Inches, Weight: 1.0251495183 Pounds, Width: 0.91 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.17}, 'width': {'unit': 'inches', 'value': 0.91}, 'weight': {'unit': 'pounds', 'value': 1.0251495183}, 'height': {'unit': 'inches', 'value': 9.21}}, 'pages': 416, 'date_published': '2006-09-12', 'subjects': ['History', 'Ancient Civilizations', 'Greece', 'Military', 'World', 'Civilization & Culture'], 'authors': ['Victor Davis Hanson'], 'title': 'A War Like No Other: How the Athenians and Spartans Fought the Peloponnesian War', 'isbn13': '9780812969702', 'msrp': 18, 'binding': 'Paperback', 'isbn': '0812969707', 'isbn10': '0812969707', 'other_isbns': [{'isbn': '9781588364906', 'binding': 'e'}]}}