{'book': {'publisher': 'Open Court', 'synopsis': 'The most popular musical group of all time, the Beatles also brought serious thought to the bubble gum-scented world of pop and rock music, with adventurous, profound, and sometimes mysterious lyrics that veered from the deliberate absurdity of \x93I Am the Walrus” to the rosy Rousseau-like fantasy of \x93When I’m 64” to the darkly existential/nihilist visions of \x93Eleanor Rigby” and \x93A Day in the Life.” In this lively new book, 20 Beatles-loving philosophers offer fresh insight into the lives and words of the Fab Four. Among the topics investigated are the groups’ critique of consumer culture; John Lennon and the Cold War; Paul McCartney’s philosophy of love, community, and politics; the Beatles’ struggle against the inauthentic; the ethics of chemically changed states of consciousness; the metaphysical standing of popularized Eastern meditation; and skepticism in the Beatles’ worldview. Like earlier titles in this popular series, The Beatles and Philosophy discusses complex issues in an enjoyable, highly readable fashion.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/60/66/9780812696066.jpg', 'title_long': "The Beatles and Philosophy: Nothing You Can Think that Can't Be Thunk (Popular Culture and Philosophy, 25)", 'edition': '1', 'dimensions': 'Height: 8.75 Inches, Length: 6 Inches, Weight: 0.96782933018 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.96782933018}, 'height': {'unit': 'inches', 'value': 8.75}}, 'pages': 288, 'date_published': '2006-10-25', 'subjects': ['Humor & Entertainment', 'Pop Culture', 'Beatles', 'Politics & Social Sciences', 'Philosophy', 'Modern', 'Movements', 'Social Sciences', 'Popular Culture'], 'authors': [], 'title': "The Beatles and Philosophy: Nothing You Can Think that Can't Be Thunk (Popular Culture and Philosophy, 25)", 'isbn13': '9780812696066', 'msrp': 17.95, 'binding': 'Paperback', 'isbn': '0812696069', 'isbn10': '0812696069'}}