{'book': {'publisher': 'Random House Trade Paperbacks', 'synopsis': 'In this exquisite book, Alice Walker’s first new collection of poetry since 1991, are poems that reaffirm her as “one of the best American writers of today” (The Washington Post). The forces of nature and the strength of the human spirit inspire the poems in Absolute Trust in the Goodness of the Earth. Alice Walker opens us to feeling and understanding, with poems that cover a broad spectrum of emotions. With profound artistry, Walker searches for, discovers, and declares the<br/>fundamental beauty of existence, as she explores what it means to experience life fully, to learn from it, and to grow both as an individual and as part of a greater spiritual community.<br/><br/>About Walker’s Horses Make a Landscape Look More Beautiful,America said, “In the tradition of Whitman, Walker sings, celebrates and agonizes over the ordinary vicissitudes that link and separate all of humankind,” and the same can be said about this astonishing new collection, Absolute Trust in the Goodness of the Earth.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/10/57/9780812971057.jpg', 'title_long': 'Absolute Trust in the Goodness of the Earth: New Poems', 'edition': 'Reprint', 'dimensions': 'Height: 7.98 Inches, Length: 5.18 Inches, Weight: 0.65 Pounds, Width: 0.55 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.18}, 'width': {'unit': 'inches', 'value': 0.55}, 'weight': {'unit': 'pounds', 'value': 0.65}, 'height': {'unit': 'inches', 'value': 7.98}}, 'pages': 256, 'date_published': '2004-03-09', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Poetry', 'Regional & Cultural', 'Themes & Styles', 'Women Authors', 'Self Service', 'Custom Stores'], 'authors': ['Alice Walker'], 'title': 'Absolute Trust in the Goodness of the Earth: New Poems', 'isbn13': '9780812971057', 'msrp': 13.99, 'binding': 'Paperback', 'related': {'Kindle Edition': '0307430561', 'ePub': '0307430561'}, 'isbn': '0812971051', 'isbn10': '0812971051', 'other_isbns': [{'isbn': '9780307430564', 'binding': 'printisbn'}]}}