{'book': {'publisher': 'University Press of Florida', 'synopsis': '"Absolutely spellbinding: ballerina Farrell\'s autobiography is the story of someone doing exactly what she wanted in life, and loving every minute of it. Through her work with George Balanchine, it is also the story of one of the greatest artistic collaborations in dance. . . . An uplifting, splendid memoir."--Kirkus<br/>"An extraordinarily moving story."--New York Times Book Review<br/>"Farrell\'s story is not only that of a great dancer but of a great star. . . . this book is important. The subject is great, the views of Balanchine are real and unique."--Washington Post Book World<br/>Suzanne Farrell, world-renowned ballerina, was one of George Balanchine\'s most celebrated muses and remains a legendary figure in the ballet world. This memoir, first published in 1990 and reissued with a new preface by the author, recounts Farrell\'s transformation from a young girl in Ohio dreaming of greatness to the realization of that dream on stages all over the world. Central to this transformation was her relationship with George Balanchine, who invited her to join the New York City Ballet in the fall of 1961 and was in turn inspired by her unique combination of musical, physical, and dramatic gifts. He created masterpieces for her in which the limits of ballet technique were expanded to a degree not seen before. By the time she retired from the stage in 1989, Farrell had achieved a career that is without precedent in the history of ballet. One third of her repertory of more than 100 ballets were composed expressly for her by such notable choreographers as Balanchine, Jerome Robbins, and Maurice Bejart. Farrell recalls professional and personal attachments and their attendant controversies with a down-to-earth frankness and common sense that complements the glories and mysteries of her artistic achievement.<br/>Suzanne Farrell has staged Balanchine’s ballets in New York, Boston, Seattle, and Miami and for the Vienna Opera Ballet, the Kirov, and the Bolshoi. She is the subject of an Academy Award nominated documentary, Suzanne Farrell--Elusive Muse. A professor of dance at Florida State University in Tallahassee, she also teaches a summer ballet course at the Kennedy Center for the Performing Arts in Washington, D.C. In the fall of 2000, the Suzanne Farrell Ballet was launched as an ongoing partnership with the Kennedy Center.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/59/33/9780813025933.jpg', 'title_long': 'Holding On to the Air: An Autobiography', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.1904962148 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.1904962148}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 352, 'date_published': '2002-09-25', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Actors & Entertainers', 'Dancers', 'Television Performers', 'Community & Culture', 'Women', 'Humor & Entertainment'], 'authors': ['Suzanne Farrell', 'Toni Bentley'], 'title': 'Holding On to the Air: An Autobiography', 'isbn13': '9780813025933', 'msrp': 24.95, 'binding': 'Paperback', 'isbn': '0813025931', 'isbn10': '0813025931'}}