{'book': {'publisher': 'Univ Of Minnesota Press', 'synopsis': 'In September 1947, long before mass tourism and with no knowledge of Spanish, Christopher Isherwood and his lover Bill Caskey left for a six-month tour of Colombia, Ecuador, Peru, Bolivia, and Argentina. Isherwood\'s account of this journey, The Condor and the Cows, is one of very few classic travel books on South America and was among the books Isherwood considered his best.<br/>Based on his trip journal and loosely structured by the vagaries of his travels, these pages give us an Isherwood who dreams of voluntary exile in the tropical paradise of Curaçao and dines out on stories of Nazis in Berlin, missionaries in China, and movie stars in Hollywood. He describes the surprising and sometimes unnerving people and places he encounters through telling, cinematic details-of Inca drinking vessels, the Spanish colonial city of Cuzco (which he calls "one of the most beautiful monuments to bigotry and sheer brutal stupidity in the whole world"), a bullfight in Bogotá, the towering ruins of Machu Picchu. Unsentimental, rich, and wonderfully rendered, this expanded edition includes additional photographs by Bill Caskey and a new foreword by Jeffrey Meyers.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/98/23/9780816639823.jpg', 'title_long': 'Condor And The Cows: A South American Travel Diary', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 5.875 Inches, Weight: 0.85 Pounds, Width: 0.6 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.875}, 'width': {'unit': 'inches', 'value': 0.6}, 'weight': {'unit': 'pounds', 'value': 0.85}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 248, 'date_published': '2003-11-10', 'subjects': ['Biographies & Memoirs', 'Memoirs', 'Travelers & Explorers', 'Travel', 'South America', 'General', 'Politics & Social Sciences', 'Politics & Government', 'International & World Politics'], 'authors': ['Christopher Isherwood'], 'title': 'Condor And The Cows: A South American Travel Diary', 'isbn13': '9780816639823', 'msrp': 17.95, 'binding': 'Paperback', 'isbn': '0816639825', 'isbn10': '0816639825'}}