{'book': {'publisher': 'University of Minnesota Press', 'synopsis': 'Village Voice Favorite Books of 2000<br/><br/>The popular book challenging the idea of a model minority, now in paperback!<br/>“How does it feel to be a problem?” asked W. E. B. Du Bois of black Americans in his classic The Souls of Black Folk. A hundred years later, Vijay Prashad asks South Asians “How does it feel to be a solution?” In this kaleidoscopic critique, Prashad looks into the complexities faced by the members of a “model minority”-one, he claims, that is consistently deployed as "a weapon in the war against black America."<br/>On a vast canvas, The Karma of Brown Folk attacks the two pillars of the “model minority” image, that South Asians are both inherently successful and pliant, and analyzes the ways in which U.S. immigration policy and American Orientalism have perpetuated these stereotypes. Prashad uses irony, humor, razor-sharp criticism, personal reflections, and historical research to challenge the arguments made by Dinesh D’Souza, who heralds South Asian success in the U.S., and to question the quiet accommodation to racism made by many South Asians. A look at Deepak Chopra and others whom Prashad terms “Godmen” shows us how some South Asians exploit the stereotype of inherent spirituality, much to the chagrin of other South Asians. Following the long engagement of American culture with South Asia, Prashad traces India’s effect on thinkers like Cotton Mather and Henry David Thoreau, Ravi Shankar’s influence on John Coltrane, and such essential issues as race versus caste and the connection between antiracism activism and anticolonial resistance.<br/>The Karma of Brown Folk locates the birth of the “model minority” myth, placing it firmly in the context of reaction to the struggle for Black Liberation. Prashad reclaims the long history of black and South Asian solidarity, discussing joint struggles in the U.S., the Caribbean, South Africa, and elsewhere, and exposes how these powerful moments of alliance faded from historical memory and were replaced by Indian support for antiblack racism. Ultimately, Prashad writes not just about South Asians in America but about America itself, in the tradition of Tocqueville, Du Bois, Richard Wright, and others. He explores the place of collective struggle and multiracial alliances in the transformation of self and community-in short, how Americans define themselves.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/43/92/9780816634392.jpg', 'title_long': 'The Karma of Brown Folk', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 5.875 Inches, Weight: 0.79 Pounds, Width: 0.6 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.875}, 'width': {'unit': 'inches', 'value': 0.6}, 'weight': {'unit': 'pounds', 'value': 0.79}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 272, 'date_published': '2001-03-12', 'subjects': ['Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies', 'Anthropology', 'Cultural'], 'authors': ['Vijay Prashad'], 'title': 'The Karma of Brown Folk', 'isbn13': '9780816634392', 'msrp': 19.5, 'binding': 'Paperback', 'isbn': '0816634394', 'isbn10': '0816634394'}}