{'book': {'publisher': 'Zebra', 'synopsis': 'In the second book of the powerful new series that reunites the beloved Coleman and Thornton families, New York Times bestselling author Fern Michaels brings readers into the turbulent lives of a Kentucky horseracing clan headed by the incomparable Nealy Coleman Diamond. A woman of substance, Nealy rides fast, loves hard, and lives with an appetite for winning no one can match. Now in Kentucky Heat, she tests her deepest beliefs with one shocking decision and one daring last race. . ..<br/><br/>Kentucky Heat<br/><br/>With Nealy, horses come first. So when her two grown children\'s irresponsible acts nearly cost her Shufly, the foal that carries all her hopes for the Triple Crown, she throws them both off Blue Diamond Farm, a decision that changes their future--and her own.<br/><br/>To the world, Nealy looks unbreakable. Inside, her heart has shattered. Estranged from her daughter Emmie and son Nick, she struggles alone to build her racing stables into the best in Kentucky--and Shufly into the horse of the century.<br/><br/>When Hatch Littletree, her ex-husband\'s law partner, pays an unexpected visit, he brings Nealy much-needed comfort. But he also brings turmoil. A tough Native American and a brilliant attorney, Hatch is determined to see Nealy heal the painful rift with her children. He\'s also a man Nealy cannot resist.<br/><br/>Raw with emotion, and yet filled with an unstoppable energy, Nealy will face bitter disappointments, exhilarating triumphs, and a night of bloodcurdling terror--one that could mean the end of her dreams. . .and maybe her life.<br/><br/>In Kentucky Heat Fern Michaels keeps readers enthralled, as the power of a woman\'s indomitable spirit leaps off the page. . .and rushes like a thoroughbred toward a finish you will never forget.<br/><br/>Fern Michaels is the New York Times bestselling author of Kentucky Rich, Plain Jane, Finders Keepers, Yesterday, and many other novels. Surrounded by five children, three grandchildren, and six dogs, she shares her 300-year-old South Carolina plantation home with a resident ghost named Mary Margaret who leaves messages on her computer.<br/><br/>Includes a teaser from the concluding novel in the trilogy, Kentucky Sunrise<br/><br/>"It\'s a tribute to the author\'s skill that she can keep so many plot pots stirred at once."--People on Plain Jane<br/><br/>"He\'s magnificent, isn\'t he?" Nealy said.<br/>Hatch nodded, his gaze never leaving the colt. "I have to say, Nealy, he\'s the finest piece of horseflesh I\'ve ever seen." Shufly whinnied and would have broken away if the grooms hadn\'t kept a tight hold. "Careful, Nealy," Hatch warned. "Something\'s got him spooked." Nealy reached for Shufly\'s halter, brought his head down to hers and whispered in his ear. He immediately calmed, nuzzling his massive head against her arm. Awed at what he had just seen, Hatch walked over to the now calm Shufly and rubbed his muzzle.<br/>"Just out of curiosity, what did you whisper in his ear?"<br/>Nealy tilted her head to the side. "I simply told him if he didn\'t behave himself, I wouldn\'t take him out to the track. I told him he had to behave like a gentleman."<br/>Hatch grimaced. "And you\'re telling me he understood what you said?"<br/>Nealy laughed. "He calmed down, didn\'t he?" Hatch\'s eyes narrowed with disbelief. Was she putting him on? She certainly looked serious. Something in him clicked. Suddenly he had the overwhelming desire to know everything there was to know about Nealy Clay. He smiled. Nealy smiled back.<br/>She\'s in her element, Hatch thought. This is her life, her love. He was beginning to understand why Hunt had been so in love with her and why her children were so in awe of her. She was special, from the top of her head to the tip of her toes. It was going to take a team of wild horses to keep him away from her.<br/><br/>"Prose so natural that it seems you are witnessing a story rather than reading about it." --Los Angeles Sunday Times on Kentucky Rich', 'language': 'en', 'image': 'https://images.isbndb.com/covers/36/80/9780821773680.jpg', 'title_long': 'Kentucky Heat', 'dimensions': 'Height: 6.8 Inches, Length: 4.4 Inches, Weight: 0.40124131684 Pounds, Width: 1.03 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.4}, 'width': {'unit': 'inches', 'value': 1.03}, 'weight': {'unit': 'pounds', 'value': 0.40124131684}, 'height': {'unit': 'inches', 'value': 6.8}}, 'pages': 383, 'date_published': '2002-09-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Family Life', "Women's Fiction", 'Domestic Life', 'Contemporary', 'United States', 'Romance', 'Romantic Suspense'], 'authors': ['Fern Michaels'], 'title': 'Kentucky Heat', 'isbn13': '9780821773680', 'msrp': 7.99, 'binding': 'Mass Market Paperback', 'isbn': '0821773682', 'isbn10': '0821773682'}}