{'book': {'publisher': 'Cliff Notes', 'synopsis': "The original CliffsNotes study guides offer expert commentary on major themes, plots, characters, literary devices, and historical background \x97 all to help you gain greater insight into great works you're bound to study for school or pleasure.<br/>In CliffsNotes on Euripides' Electra & Medea, you explore two classic Greek tragedies by Euripides and discover how the playwright introduced many innovations into the drama of his time. Electra and Medea present enlightening psychological examinations of characters under extreme stress \x97 namely the title characters: Electra, the daughter of Agamemnon who seeks revenge on her mother and uncle for murdering her father and forcing her to live in poverty; and Media, who seeks revenge against her husband Jason for betraying her and marrying another woman.<br/>In this study guide, you'll find Life of the Playwright, as well as character lists and Summaries and Commentaries of each play. You'll also find critical essays on the following topics: The background of the Greek tragedy Aristotle on tragedy Other works by Euripides Notes on the main characters of each play<br/>Classic literature or modern-day treasure \x97 you'll understand it all with expert information and insight from CliffsNotes study guides.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/42/40/9780822004240.jpg', 'title_long': "Euripides' Electra and Medea", 'dimensions': 'Height: 8.25 Inches, Length: 5.25 Inches, Weight: 0.17416518698 Pounds, Width: 0.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 0.25}, 'weight': {'unit': 'pounds', 'value': 0.17416518698}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 72, 'date_published': '1965', 'subjects': ['Education & Teaching', 'Studying & Workbooks', 'Study Guides', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Euripides'], 'title': "Euripides' Electra and Medea", 'isbn13': '9780822004240', 'msrp': 4.95, 'binding': 'Paperback', 'isbn': '0822004240', 'isbn10': '0822004240'}}