{'book': {'publisher': 'CliffsNotes', 'synopsis': "The original CliffsNotes study guides offer expert commentary on major themes, plots, characters, literary devices, and historical background.<br/>CliffsNotes on Candide explores the best known philosophic tale from Voltaire. The tale is a vehicle for his profoundest views on politics, religion, and philosophy. At the same time, it is an adventure tale about a young hero who travels far and wide and experiences great dangers.<br/>With this study guide, you’ll see why Voltaire is considered among the greatest satirists in literature. Along with detailed explanations of the plot, your understanding will increase with insight into the life and times of the author. Other features that help you study include Background on Voltaire’s contemporaries and influences Character analyses of major players A character map that graphically illustrates the relationships among the characters Critical essays Review questions<br/>Classic literature or modern modern-day treasure — you'll understand it all with expert information and insight from CliffsNotes study guides.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/28/33/9780822002833.jpg', 'title_long': 'Candide (Cliffs Notes)', 'edition': 'Reissue', 'dimensions': 'Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.22 Pounds, Width: 0.19 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.19}, 'weight': {'unit': 'pounds', 'value': 0.22}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 82, 'date_published': '1965-03-29', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Movements & Periods', 'Regional & Cultural', 'Teen & Young Adult', 'Education & Reference', 'Study Aids', 'Education & Teaching', 'Studying & Workbooks', 'Study Guides', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['James K. Lowers'], 'title': 'Candide (Cliffs Notes)', 'isbn13': '9780822002833', 'msrp': 7.49, 'binding': 'Paperback', 'isbn': '0822002833', 'isbn10': '0822002833'}}