{'book': {'publisher': 'CliffsNotes', 'synopsis': 'The original CliffsNotes study guides offer expert commentary on major themes, plots, characters, literary devices, and historical background. The latest generation of titles in this series also feature glossaries and visual elements that complement the classic, familiar format.<br/>In CliffsNotes on Les Miserables, you examine two themes from Victor Hugo\'s epic: the struggle between good and evil in the soul of one man, and society\'s struggle toward a greater good. Addressing many of the social issues of his day, Hugo wrote this novel, which traces the path of Jean Valjean as he changes from convict to saint. Hugo believed in the spiritual possibilities of human beings and has chosen the story of the poor and outcast to illustrate this "perfectibility of man."<br/>With expert commentaries and critical analyses, this study guide helps you explore the profound social problems of the early 1800s, which influenced Hugo\'s work. You\'ll also gain insight into the author\'s life and other major works. Other features that help you study include Introduction to the novel A brief synopsis of the novel Chapter summaries and analyses An Interactive quiz to test your knowledge Essay topics and review questions<br/>Classic literature or modern-day treasure—you\'ll understand it all with expert information and insight from CliffsNotes study guides.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/73/57/9780822007357.jpg', 'title_long': "Hugo's Les Miserables (Cliffs Notes)", 'edition': 'Student Edition', 'dimensions': 'Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.45 Pounds, Width: 0.28 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.28}, 'weight': {'unit': 'pounds', 'value': 0.45}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 122, 'date_published': '1968-11-01', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Movements & Periods', 'Regional & Cultural', 'Teen & Young Adult', 'Education & Reference', 'Study Aids', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Amy L. Marsland Ph.D'], 'title': "Hugo's Les Miserables (Cliffs Notes)", 'isbn13': '9780822007357', 'msrp': 5.99, 'binding': 'Paperback', 'related': {'eBook': '0544182529'}, 'isbn': '0822007355', 'isbn10': '0822007355', 'other_isbns': [{'isbn': '9780544182523', 'binding': 'print'}]}}