{'book': {'publisher': 'Cliffs Notes', 'synopsis': "The original CliffsNotes study guides offer expert commentary on major themes, plots, characters, literary devices, and historical background.<br/>In CliffsNotes on Night, you follow the humanistic first-person account of a teenage boy's incarceration by the Nazi Secret Service in World War II; his experiences in the Auschwitz and Buchenwald death camps; and his struggle to find meaning among the horror.<br/>Covering little more than a year of the young narrator's life, this study guide shares a story about endurance, loyalty, and faith — all nurtured by the strength of love. Other features that help you figure out this important work include Life and background of the author, Dr. Elie Wiesel A list of characters A historical timeline of Nazi Germany A review section that tests your knowledge and suggests essay topics A selected bibliography that leads you to more great resources<br/>Classic literature or modern-day treasure — you'll understand it all with expert information and insight from CliffsNotes study guides.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/89/34/9780822008934.jpg', 'title_long': "Wiesel's Night (Cliffs Notes)", 'edition': '1', 'dimensions': 'Height: 8.25 Inches, Length: 5.25 Inches, Weight: 0.15 Pounds, Width: 0.175 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 0.175}, 'weight': {'unit': 'pounds', 'value': 0.15}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 80, 'date_published': '1996-08-22', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Movements & Periods', 'Regional & Cultural', 'Religion & Spirituality', 'Judaism', 'Teen & Young Adult', 'Education & Reference', 'Study Aids', 'Education & Teaching', 'Studying & Workbooks', 'Study Guides'], 'authors': ['Maryam Riess'], 'title': "Wiesel's Night (Cliffs Notes)", 'isbn13': '9780822008934', 'msrp': 5.99, 'binding': 'Paperback', 'related': {'eBook': '0544182936'}, 'isbn': '0822008939', 'isbn10': '0822008939', 'other_isbns': [{'isbn': '9780544182936', 'binding': 'printisbn'}]}}