{'book': {'publisher': 'Continuum', 'synopsis': 'Continuum Contemporaries will be a wonderful source of ideas and inspiration for members of book clubs and readings groups, as well as for literature students.The aim of the series is to give readers accessible and informative introductions to 30 of the most popular, most acclaimed, and most influential novels of recent years. A team of contemporary fiction scholars from both sides of the Atlantic has been assembled to provide a thorough and readable analysis of each of the novels in question. The books in the series will all follow the same structure:a biography of the novelist, including other works, influences, and, in some cases, an interview; a full-length study of the novel, drawing out the most important themes and ideas; a summary of how the novel was received upon publication; a summary of how the novel has performed since publication, including film or TV adaptations, literary prizes, etc.; a wide range of suggestions for further reading, including websites and discussion forums; and a list of questions for reading groups to discuss.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/23/20/9780826452320.jpg', 'title_long': "J.K. Rowling's Harry Potter Novels: A Reader's Guide (Continuum Contemporaries) - Unauthorized", 'edition': 'First Edition', 'dimensions': 'Height: 8 Inches, Length: 5.25 Inches, Weight: 0.25573622392 Pounds, Width: 0.2031492 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 0.2031492}, 'weight': {'unit': 'pounds', 'value': 0.25573622392}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 96, 'date_published': '2001-09-26', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Movements & Periods', 'Genres & Styles', 'Regional & Cultural', 'British & Irish', 'Science Fiction & Fantasy', 'Fantasy', 'Science Fiction', 'Teen & Young Adult', 'Education & Teaching', 'Schools & Teaching', 'Studying & Workbooks', 'Study Guides'], 'authors': ['Philip Nel'], 'title': "J.K. Rowling's Harry Potter Novels: A Reader's Guide (Continuum Contemporaries) - Unauthorized", 'isbn13': '9780826452320', 'msrp': 17.95, 'binding': 'Paperback', 'isbn': '0826452329', 'isbn10': '0826452329'}}