{'book': {'publisher': 'Vanderbilt University Press', 'synopsis': "Returning to Spain after fighting in the Battle of Lepanto and other Mediterranean campaigns against the Turks, the soldier Miguel de Cervantes was captured by Barbary pirates and taken captive to Algiers. The five years he spent in the Algerian bagnios or prison-houses (1575-1580) made an indelible impression on his works. From the first plays and narratives written after his release to his posthumous novel, the story of Cervantes's traumatic experience continuously speaks through his writings. Cervantes in Algiers offers a comprehensive view of his life as a slave and, particularly, of the lingering effects this traumatic experience had on his literary production.<br/>No work has documented in such vivid and illuminating detail the socio-political world of sixteenth-century Algiers, Cervantes's life in the prison-house, his four escape attempts, and the conditions of his final ransom. Garces's portrait of a sophisticated multi-ethnic culture in Algiers, moreover, is likely to open up new discussions about early modern encounters between Christians and Muslims. By bringing together evidence from many different sources, historical and literary, Garces reconstructs the relations between Christians, Muslims, and renegades in a number of Cervantes's writings.<br/>The idea that survivors of captivity need to repeat their story in order to survive (an insight invoked from Coleridge to Primo Levi to Dori Laub) explains not only Cervantes's storytelling but also the book that theorizes it so compellingly. As a former captive herself (a hostage of Colombian guerrillas), the author reads and listens to Cervantes with another ear.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/47/07/9780826514707.jpg', 'title_long': "Cervantes in Algiers: A Captive's Tale", 'edition': 'Revised', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.30513659104 Pounds, Width: 0.82 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.82}, 'weight': {'unit': 'pounds', 'value': 1.30513659104}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 368, 'date_published': '2005-03-01', 'subjects': ['Health, Fitness & Dieting', 'Diseases & Physical Ailments', 'Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Regional & Cultural'], 'authors': ['Maria Antonia Garces'], 'title': "Cervantes in Algiers: A Captive's Tale", 'isbn13': '9780826514707', 'msrp': 23.39, 'binding': 'Paperback', 'related': {'eBook': '0826591558'}, 'isbn': '0826514707', 'isbn10': '0826514707', 'other_isbns': [{'isbn': '9780826591555', 'binding': 'print'}]}}