{'book': {'publisher': 'Continuum', 'synopsis': 'Fear has become an ever-expanding part of life in the West in the twenty-first century. We live in terror of disease, abuse, stranger danger, environmental devastation and terrorist onslaught. We are bombarded with reports of new concerns for our safety and that of our children, and urged to take greater precautions and seek more protection. But compared to the past, or to the developing world, people in contemporary Western societies have much less familiarity with pain, suffering, debilitating disease and death. We actually enjoy an unprecedented level of personal safety.<br/><br/>When confronted with events like the destruction of the World Trade Centre, fear for the future is inevitable. But what happened on September 11th 2001 was in many ways an old fashioned act of terror, representing the destructive side of the human passions. Frank Furedi argues that the greater danger in our culture is the tendency to fear achievements representing a more constructive side of humanity. We panic about GM food, about genetic research, about the health dangers of mobile phones. The facts often fail to support the scare stories about new or growing risks to our health and safefy. Our obsession with theoretical risks is in danger of distracting society from dealing with the old-fashioned dangers that have always threatened our lives. In this new edition Furedi relates his own thinking on the sociology of fear to the thought of earlier thinkers such as Darwin and Fred and to the sociological tradition of Durkheim, C. Wright Mills, Anthony Giddens and others.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/39/58/9780826493958.jpg', 'title_long': 'Culture of Fear Revisited', 'edition': '2', 'dimensions': 'Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.67020527648 Pounds, Width: 0.4968494 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.4968494}, 'weight': {'unit': 'pounds', 'value': 0.67020527648}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 236, 'date_published': '2006-12-26', 'subjects': ['Politics & Social Sciences', 'Social Sciences', 'Sociology'], 'authors': ['Frank Furedi'], 'title': 'Culture of Fear Revisited', 'isbn13': '9780826493958', 'msrp': 26.95, 'binding': 'Paperback', 'related': {'eBook': '1441107061'}, 'isbn': '0826493955', 'isbn10': '0826493955', 'other_isbns': [{'isbn': '9781441107060', 'binding': 'print'}]}}