{'book': {'publisher': 'University of New Mexico Press', 'synopsis': 'Quito has always been one of the most enigmatic of colonial Spanish American cities. The history of its enormous hinterland, only a fraction of which forms the modern Republic of Ecuador, is even less known. This engaging book takes the watershed year 1599 as a starting point for a provocative reinterpretation of the history of Quito, city and colony. The result is a lively narrative that is also an original inquiry into the driving forces behind sixteenth-century Spanish colonialism. In six overlapping topical narratives Lane brings to life a place wracked by civil disturbances, shipwrecks, indigenous uprisings, pirate attacks, maroon intransigence, urban decadence, failed missionary endeavors, sharp economic reorientations, and wily and unpredictable subaltern adaptation and resistance.<br/>Drawing from a wealth of recent research on the colonial north Andes and on more than seven years of study in the archives of Ecuador, Colombia, and Spain, Lane presents rich discoveries of interest to economic historians, including a previously unknown gold boom; however, his primary interest is people. He explores the ways both individuals and groups--shipwreck victims, slaves, laborers, merchants, traders--faced obstacles and seized (or missed) opportunities, showing readers not only the basic facts and major themes of colonial life but also the influence and outcome of individual hopes and fears among people from a multitude of races and ethnicities.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/35/76/9780826323576.jpg', 'title_long': 'Quito 1599: City and Colony in Transition (Diálogos Series)', 'edition': '49822nd', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.11 Pounds, Width: 0.7 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.7}, 'weight': {'unit': 'pounds', 'value': 1.11}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 312, 'date_published': '2002-07-26', 'subjects': ['History', 'Americas', 'Canada', 'South America'], 'authors': ['Kris Lane'], 'title': 'Quito 1599: City and Colony in Transition (Diálogos Series)', 'isbn13': '9780826323576', 'msrp': 25.22, 'binding': 'Paperback', 'isbn': '082632357X', 'isbn10': '082632357X'}}