{'book': {'publisher': 'Rizzoli', 'synopsis': 'What would you see if you could peek inside the mind of Clive Barker, creator of such classics as Weaveworld, Hellraiser, and Candyman? Would you dare look? Crack open Visions of Heaven and Hell, and you have unlocked a Pandora\'s box of images that are certain to stay inside your head. For more than twenty-five years, Barker has awed fans and critics alike with his groundbreaking works of fiction, but what few know is that the heart of his fantastic worlds lies in pictures. Now, for the first time, this book brings out from the dark depths more than 300 of Barker\'s most stunning drawings and oil paintings. Illuminated with new writings by Barker, this artwork renders with expressionist fervor some of our most primal passions-good, evil, and all that\'s between. From the graphically terrifying to the ecstatically sensual, Visions of Heaven and Hell takes the reader on a journey through unexplored and forbidden realms. Designed in a luxurious package that recalls a devotional medieval manuscript or the works of Blake and Cocteau, this volume itself has the feel of a talisman from one of Barker\'s stories. Providing the true key to the mysteries of his imagination, it is a must-have collectible for the legion of Barker\'s fiction fans. But it also reaches out to an even greater audience of those who follow his films. "Barker has an unparalleled talent for envisioning other worlds." -Washington Post Book World', 'language': 'en', 'image': 'https://images.isbndb.com/covers/73/74/9780847827374.jpg', 'title_long': 'Clive Barker Visions of Heaven and Hell', 'dimensions': 'Height: 12.25 Inches, Length: 9.5 Inches, Weight: 4.2 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 9.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 4.2}, 'height': {'unit': 'inches', 'value': 12.25}}, 'pages': 352, 'date_published': '2005-09-27', 'subjects': ['Arts & Photography', 'Individual Artists'], 'authors': ['Clive Barker'], 'title': 'Clive Barker Visions of Heaven and Hell', 'isbn13': '9780847827374', 'msrp': 50, 'binding': 'Hardcover', 'isbn': '0847827372', 'isbn10': '0847827372'}}