{'book': {'publisher': 'Aris & Phillips', 'synopsis': "Product Description      Lady Cornelia tells the story of two Spanish gentlemen, Don Juan de Gamboa and Don Antonio de Isunza, who become students in Bologna where, through chance events, Don Juan harbous a recently born child and aids an individual against a group of attackers. Don Antonio, meanwhile, whelters a lady who has sought his protection. As they relate these experiences to each other, events link up: the lady is beautiful Cornelia Bentibolli, the child her secret son by the Duke of Ferrara who is the victim of the attackers led by Lorenzo, Cornelia's brother, seeking revenge on the Duke. Eventually, Cornelia, the Duke and their son are united, Lorenzo and the Duke reconciled, and Don Juan and Don Antonio earn everyone's gratitude and friendship. The Deceitful Marriage is the story of a soldier who enters into marriage for wrong and selfish motives and who recieves is hust reward at the hands of his wife, who proves to be equally decietful. The Dialogue of the Dogs recounts an overheard conversation between two dogs Cipion and Berganza, in which one of them tells of his life in picaresque fashion, in a narrative which is interspersed with moral and philisophical insights while providing a critical perspective on contemporary Spanish society. Spanish text with facing-translation, introduction and notes.       About the Author      John Macklin is Professor of Hispanic Studies at the University of Glasgow and Head of the School of Modern Languages and Cultures, and a Visiting Professor at the University of Ulster. In 1994, he was made a Commandor of the Order of Isabella the Catholic by King Juan Carlos for his services to Spanish studies. His many publications include an edition of Unamuno Abel Sanchez in this series.", 'language': 'es', 'image': 'https://images.isbndb.com/covers/49/82/9780856684982.jpg', 'title_long': 'Cervantes: Exemplary Novels 4 Lady Cornelia, The Deceitful Marriage, The Dialogue of the Dogs Lady Cornelia, The Deceitful Marriage, The Dialogue of the Dogs (Spanish Edition)', 'dimensions': 'Height: 8.2677 Inches, Length: 5.9055 Inches, Weight: 0.75 Pounds, Width: 0.59055 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.9055}, 'width': {'unit': 'inches', 'value': 0.59055}, 'weight': {'unit': 'pounds', 'value': 0.75}, 'height': {'unit': 'inches', 'value': 8.2677}}, 'pages': 167, 'date_published': '1992-01-01', 'subjects': ['Literature & Fiction', 'Classics', 'Short Stories & Anthologies', 'Anthologies', 'World Literature', 'European', 'Contemporary', 'Literary'], 'authors': ['John Jones', 'John Macklin'], 'title': 'Cervantes: Exemplary Novels 4 Lady Cornelia, The Deceitful Marriage, The Dialogue of the Dogs Lady Cornelia, The Deceitful Marriage, The Dialogue of the Dogs (Spanish Edition)', 'isbn13': '9780856684982', 'msrp': 22, 'binding': 'Paperback', 'isbn': '0856684988', 'isbn10': '0856684988'}}