{'book': {'publisher': 'North Point Press', 'synopsis': "A manifesto by America's most controversial and celebrated town planners, proposing an alternative model for community design.<br/><br/>There is a growing movement in North America to put an end to suburban sprawl and to replace the automobile-based settlement patterns of the past fifty years with a return to more traditional planning principles. This movement stems not only from the realization that sprawl is ecologically and economically unsustainable but also from a growing awareness of sprawl's many victims: children, utterly dependent on parental transportation if they wish to escape the cul-de-sac; the elderly, warehoused in institutions once they lose their driver's licenses; the middle class, stuck in traffic for two or more hours each day.<br/><br/>Founders of the Congress for the New Urbanism, Andres Duany and Elizabeth Plater-Zyberk are at the forefront of this movement, and in Suburban Nation they assess sprawl's costs to society, be they ecological, economic, aesthetic, or social. It is a lively, thorough, critical lament, and an entertaining lesson on the distinctions between postwar suburbia-characterized by housing clusters, strip shopping centers, office parks, and parking lots-and the traditional neighborhoods that were built as a matter of course until mid-century. It is an indictment of the entire development community, including governments, for the fact that America no longer builds towns. Most important, though, it is that rare book that also offers solutions.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/60/66/9780865476066.jpg', 'title_long': 'Suburban Nation: The Rise of Sprawl and the Decline of the American Dream', 'edition': 'First Edition', 'dimensions': 'Height: 8.02 Inches, Length: 8.08 Inches, Weight: 1.35 Pounds, Width: 0.83 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.08}, 'width': {'unit': 'inches', 'value': 0.83}, 'weight': {'unit': 'pounds', 'value': 1.35}, 'height': {'unit': 'inches', 'value': 8.02}}, 'pages': 320, 'date_published': '2001-04-16', 'subjects': ['Arts & Photography', 'Architecture', 'Buildings', 'Urban & Land Use Planning', 'Politics & Social Sciences', 'Social Sciences', 'Urban Planning & Development', 'Sociology', 'Urban', 'Politics & Government', 'Public Affairs & Policy'], 'authors': ['Andres Duany', 'Elizabeth Plater-Zyberk', 'Jeff Speck'], 'title': 'Suburban Nation: The Rise of Sprawl and the Decline of the American Dream', 'isbn13': '9780865476066', 'msrp': 19, 'binding': 'Paperback', 'isbn': '0865476063', 'isbn10': '0865476063'}}