{'book': {'publisher': 'Bolchazy-Carducci Publishers', 'synopsis': "One of the first books for countless children, this story of a free-spirited Cat who, with his high jinks and mischievous friends (Things One and Two) turns the house upside-down for two bored children on a rainy day is retold in Latin in Cattus Petasatus.<br/>This edition features the original artwork of Dr. Seuss and a translation in rhyming verse that echoes the sound of the original Cat in the Hat.<br/>The wonderful, whimsical, and thought-provoking stories of Dr. Seuss have been published in twenty languages. An excellent addition to Seuss collections the world over, this Latin-language edition of Seuss' timeless first reader is a welcome, all-occasion gift, a delightful way to revisit a treasured tale, and an enjoyable way to refresh your high school Latin.<br/>Also available:<br/>Quomodo Invidiosulus Nomine Grinchus Christi Natalem Abrogaverit: How the Grinch Stole Christmas in Latin - ISBN 0865164193<br/>Green Eggs and Ham In Latin: Virent Ova! Viret Perna!! - ISBN 0865165556<br/>For over 30 years Bolchazy-Carducci Publishers has produced the highest quality Latin and ancient Greek books. From Dr. Seuss books in Latin to Plato's Apology, Bolchazy-Carducci's titles help readers learn about ancient Rome and Greece; the Latin and ancient Greek languages are alive and well with titles like Cicero's De Amicitia and Kaegi's Greek Grammar. We also feature a line of contemporary eastern European and WWII books.<br/>Some of the areas we publish in include:<br/>Selections From The Aeneid<br/>Latin Grammar & Pronunciation<br/>Greek Grammar & Pronunciation<br/>Texts Supporting Wheelock's Latin<br/>Classical author workbooks: Vergil, Ovid, Horace, Catullus, Cicero<br/>Vocabulary Cards For AP Selections: Vergil, Ovid, Catullus, Horace<br/>Greek Mythology<br/>Greek Lexicon<br/>Slovak Culture And History", 'language': 'la', 'image': 'https://images.isbndb.com/covers/47/10/9780865164710.jpg', 'title_long': 'Cattus Petasatus: The Cat in the Hat in Latin (Latin Edition)', 'edition': 'Latin language', 'dimensions': 'Height: 9.5 Inches, Length: 7 Inches, Weight: 0.80027801106 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.80027801106}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 75, 'date_published': '2000-06-01', 'subjects': ["Children's Books", 'Literature & Fiction', 'Chapter Books & Readers', 'Humor', 'Self Service', 'Custom Stores'], 'authors': ['Dr. Seuss', 'Jennifer Morrish Tunberg', 'Terence Tunberg'], 'title': 'Cattus Petasatus: The Cat in the Hat in Latin (Latin Edition)', 'isbn13': '9780865164710', 'msrp': 31, 'binding': 'Hardcover', 'isbn': '0865164711', 'isbn10': '0865164711'}}