{'book': {'publisher': 'Sunstone Press', 'synopsis': "They killed and dismembered their victims, one after the other, and then vanished. These were horrific crimes committed by a group of thrill killers. Fear gripped the city. When would they strike again? Hundreds of policemen thought they had sifted through every shred of evidence, but subtle clues and corroborating evidence left behind by the real killers were overlooked. Seventeen-year-old William Heirens was eventually arrested for three of the murders. He confessed and was sentenced to three consecutive life sentences in 1946. Heirens is the longest-serving living inmate in the Illinois penal system. Now after fifty-nine years the author has uncovered evidence that will show, with reasonable certainty, not only that someone else may have committed the murders but also the culprits' identities. This is an intriguing true story that is both fascinating and convincing. The pieces and history of this true crime puzzle will surprise even the most seasoned detective. This edition includes a First Revised Epilogue containing new clues and evidence supporting the connections between the Cleveland Torso Murders, the murder of Suzanne Degnan and the murder of the Black Dahlia. The author shows how Jack Anderson Wilson's DNA may still be available for comparison even though his charred remains were cremated following the 1982 fire at the Holland Hotel in Los Angeles. Now there is proof beyond a reasonable doubt that William Heirens did not kill and dismember six-year-old Suzanne Degnan on January 7, 1946, in Chicago. In the interests of justice, law enforcement should reopen these cold cases and William Heirens should be set free from his incarceration. WILLIAM T. RASMUSSEN, attorney at law, was born and raised in northern Michigan. He graduated from Central Michigan University and the Detroit College of Law. After graduating from law school, he attended George Washington University in Washington, D.C.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/49/21/9780865344921.jpg', 'title_long': 'Corroborating Evidence (Revised Edition)', 'edition': 'Revised', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.8 Pounds, Width: 0.54 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.54}, 'weight': {'unit': 'pounds', 'value': 0.8}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 236, 'date_published': '2005-10-15', 'subjects': ['Biographies & Memoirs', 'True Crime', 'Murder & Mayhem', 'Serial Killers'], 'authors': ['William T. Rasmussen'], 'title': 'Corroborating Evidence (Revised Edition)', 'isbn13': '9780865344921', 'msrp': 22.95, 'binding': 'Paperback', 'isbn': '0865344922', 'isbn10': '0865344922'}}