{'book': {'publisher': 'Atlantic Monthly Press', 'synopsis': 'He has been called a genius and a fraud, a hero and an addict. He advised kings in their glittering palaces, then disappeared into the darkest alleys of London’s criminal underworld. He was (and remains) a global icon, but he could pass his most ardent fan on the street without a flicker of recognition. Who was this Sherlock Holmes? With an attention to detail that would make his subject envious, Nick Rennison gathers the clues of a life lived among the stars of the late nineteenth and early twentieth centuries, from Oscar Wilde to Sigmund Freud, and uncovers startling, previously unknown information. How did a Cambridge drop-out and bit player on the London stage transform himself into a renowned “consulting detective”? Did he know the identity of “Jack the Ripper”? When did Holmes and his nemesis Professor Moriarty first cross paths? To where did Sherlock Holmes disappear after his presumed “death” in 1891? Sherlock Holmes answers these questions and many more as it careens through the most infamous crimes and historic events of the era, all in pursuit of the real man behind the greatest detective in modern fiction—and, just perhaps, non-fiction.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/94/74/9780871139474.jpg', 'title_long': 'Sherlock Holmes: The Unauthorized Biography', 'edition': 'First Edition', 'dimensions': 'Height: 8.5 Inches, Length: 5.75 Inches, Weight: 1 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 280, 'date_published': '2005', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'Contemporary'], 'authors': ['Nick Rennison'], 'title': 'Sherlock Holmes: The Unauthorized Biography', 'isbn13': '9780871139474', 'msrp': '0.00', 'binding': 'Hardcover', 'isbn': '0871139472', 'isbn10': '0871139472'}}