{'book': {'publisher': 'City Lights Publishers', 'synopsis': 'This bilingual collection of Neruda\'s most essential poems is indispensable.<br/>Selected by a team of poets and prominent Neruda scholars in both Chile and the U.S., this is a definitive selection that draws from the entire breadth and width of Neruda\'s various styles and themes.<br/>An impressive group of translators that includes Alistair Reid, Stephen Mitchell, Robert Hass, Stephen Kessler and Jack Hirschman, have come together to revisit or completely retranslate the poems; and a handful of previously untranslated works are included as well.<br/>This selection sets the standard for a general, high-quality introduction to Neruda\'s complete oeuvre.<br/>"...The Essential Neruda will prove to be, for most readers, the best introduction to Neruda available in English. In fact, I can think of few other books that have given me so much delight so easily. "--The Austin Chronicle<br/>"This book is a must-have for any reader interested in a definitive sampling of the most essential poems by one whom many consider one of the best poets of the 20th century."--Mike Nobles,Tulsa World<br/>"A splendid way to begin a love affair with our Pablo or, having already succumbed to his infinite charms, revisit him passionately again and again and yet again."--Ariel Dorfman, author of Death and the Maiden<br/>"The editors and translators know how to extract gold from a lifetime of prolific writing. If you want a handy Neruda companion and don\'t know where to begin, this is it."--The Bloomsbury Review', 'language': 'en', 'image': 'https://images.isbndb.com/covers/42/83/9780872864283.jpg', 'title_long': 'The Essential Neruda: Selected Poems (Bilingual Edition) (English and Spanish Edition)', 'edition': 'Abridged', 'dimensions': 'Height: 8.4 Inches, Length: 5.5 Inches, Weight: 0.65477291814 Pounds, Width: 0.7 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.7}, 'weight': {'unit': 'pounds', 'value': 0.65477291814}, 'height': {'unit': 'inches', 'value': 8.4}}, 'pages': 200, 'date_published': '2004-04-01', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Regional & Cultural', 'Poetry', 'Themes & Styles', 'Reference', 'Foreign Language Study & Reference'], 'authors': ['Pablo Neruda'], 'title': 'The Essential Neruda: Selected Poems (Bilingual Edition) (English and Spanish Edition)', 'isbn13': '9780872864283', 'msrp': 12.35, 'binding': 'Paperback', 'isbn': '0872864286', 'isbn10': '0872864286'}}