{'book': {'publisher': 'The Kent State University Press', 'synopsis': 'In his brief but distinguished life, Anton Chekhov was a doctor, a documentary essayist, an admired dramatist, and a humanitarian. He remains a nineteenth-century Russian literary giant whose prose continues to offer moral insight and to resonate with readers across the world.<br/>Chekhov experienced no conflict between art and science or art and medicine. He believed that knowledge of one complemented the other. Chekhov brought medical knowledge and sensitivity to his creative writing―he had an intimate knowledge of the world of medicine and the skills of doctoring, and he utilized this information in his approach to his characters. His sensibility as a medical insider gave special poignancy to his physician characters. The doctors in his engaging tales demonstrate a wide spectrum of behavior, personality, and character. At their best, they demonstrate courage, altruism, and tenderness, qualities that lie at the heart of good medical practice. At their worst, they display insensitivity and incompetency.<br/>The stories in Chekhov’s Doctors are powerful portraits of doctors in their everyday lives, struggling with their own personal problems as well as trying to serve their patients. The fifth volume in the acclaimed Literature and Medicine Series, Chekhov’s Doctors will serve as a rich text for professional health care educators as well as for general readers.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/78/04/9780873387804.jpg', 'title_long': "Chekhov's Doctors: A Collection Of Chekhov's Medical Tales (Literature & Medicine)", 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.88 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.88}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 232, 'date_published': '2003-09-12', 'subjects': ['Literature & Fiction', 'World Literature', 'European', 'Literary', 'Medical Books', 'Medicine', 'Reference'], 'authors': ['Jack Coulehan'], 'title': "Chekhov's Doctors: A Collection Of Chekhov's Medical Tales (Literature & Medicine)", 'isbn13': '9780873387804', 'msrp': '0.00', 'binding': 'Paperback', 'isbn': '0873387805', 'isbn10': '0873387805'}}