{'book': {'publisher': 'TarcherPerigee', 'synopsis': 'The Search for the Beloved, one of the most important books written on the creative and inventive mind, explains the theories that helped form the foundation of the human potential movement. In what has been called “an intellectual and spiritual feast,” Jean Houston explores the nature of spiritual yearning and teaches readers how to facilitate a personal quest by focusing on the four aspects of Sacred Psychology—the Great Wound, the Mythic Journey of Transformation, the Discovery of the Larger Story, and the Union with the Beloved of the Soul.<br/><br/>W. B. Yeats wrote, “There is but one history and that is the soul’s.” It is this great known and unknowable homeland of the human spirit that The Search for the Beloved tours. In an itinerary that leads readers to the sacred sites of the soul, Dr. Houston’s classic book is a passport for those who yearn to attune their spirits with psychological depths and spiritual heights. Probing our tragic dimensions for their deeper, more mythic meanings, so that our wounds can become the sources of spiritual grace, this book will guide readers to a larger and more sacred dimension of life. Includes a new foreword by the author.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/87/17/9780874778717.jpg', 'title_long': 'The Search for the Beloved: Journeys in Mythology and Sacred Psychology', 'edition': '2nd', 'dimensions': 'Height: 9.05 Inches, Length: 7.55 Inches, Weight: 0.82452885988 Pounds, Width: 0.7 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.55}, 'width': {'unit': 'inches', 'value': 0.7}, 'weight': {'unit': 'pounds', 'value': 0.82452885988}, 'height': {'unit': 'inches', 'value': 9.05}}, 'pages': 272, 'date_published': '1997-06-30', 'subjects': ['Self-Help', 'Personal Transformation', 'Spiritual', 'Religion & Spirituality', 'Science & Math', 'Behavioral Sciences', 'Cognitive Psychology'], 'authors': ['Jean Houston'], 'title': 'The Search for the Beloved: Journeys in Mythology and Sacred Psychology', 'isbn13': '9780874778717', 'msrp': 18.95, 'binding': 'Paperback', 'isbn': '0874778719', 'isbn10': '0874778719'}}