{'book': {'publisher': 'Siloam', 'synopsis': 'New Hope for Diabetics!<br/><br/>Diabetes is not a hopeless life sentence to deteorating health! The Good News is that you can battle it-and win, for a long, productive life! Are you suffering from diabetes?<br/><br/>In this concise, easy-to-read booklet you\'ll discover a wealth of usable information to help you win the fight over diabetes. Learn biblical secrets on health and the latest medical research on how to break free from the grip of diabetes.<br/><br/>This book contains findings that your own doctor may never have told you!<br/>•warning symptoms you must not ignore •how to fight back-and win over diabetes •a weight-loss diet you can live with •gain important information about the use of natural supplements You want to be healthy. God wants you to be healthy. Now at last here\'s a source of information that will help you get healthy-body, mind and spirit.<br/><br/>About the author:<br/><br/>Dr. Don Colbert is a board-certified family practice medical doctor who specializes in nutritional medicine, treating over 17,000 patients. Since 1984, Dr. Colbert has helped thousands of patients regain good health and live pain free after years of suffering. A graduate of Oral Roberts School of Medicine, he has received extensive training in nutritional medicine. As a result, he has founded and developed his own nutritional supplement line, Divine Health Nutritional Products. Dr. Colbert also co-hosts Golden Eagle Network\'s "Your Health Matters" with his wife, Mary. They frequently lead health seminars at home and abroad, the address health and nutrition issues as guests on national talk shows and news broadcasts. Don and Mary make their home in Central Florida.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/64/88/9780884196488.jpg', 'title_long': 'The Bible Cure For Diabetes (Health and Fitness)', 'edition': 'English Language', 'dimensions': 'Height: 6.499987 Inches, Length: 3.999992 Inches, Weight: 0.14991433816 pounds, Width: 0.25259792 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 3.999992}, 'width': {'unit': 'inches', 'value': 0.25259792}, 'weight': {'unit': 'pounds', 'value': 0.14991433816}, 'height': {'unit': 'inches', 'value': 6.499987}}, 'pages': 96, 'date_published': '1999-08-19', 'subjects': ['Health, Fitness & Dieting', 'Diseases & Physical Ailments', 'Diabetes'], 'authors': ['Don Colbert MD'], 'title': 'The Bible Cure For Diabetes (Health and Fitness)', 'isbn13': '9780884196488', 'msrp': 6.99, 'binding': 'Paperback', 'isbn': '0884196488', 'isbn10': '0884196488'}}