{'book': {'publisher': 'Daw Books', 'synopsis': 'Groundbreaking epic fantasy series in Mercedes Lackey’s Valdemar universe • Lambda-Award winning novels with heartfelt high adventure and magic<br/><br/>Though Vanyel has been born with near-legendary abilities to work both Herald and Mage magic, he wanted no part in such things. Nor does he seek a warrior’s path, wishing instead to become a Bard.<br/><br/>Yet such talent as his, if left untrained, may prove a menace not only to Vanyel but to others as well. So he is sent to be fostered with his aunt, Savil, one of the fame Herald-Mages of Valdemar.<br/><br/>But, strong-willed and self-centered, Vanyel is a challenge which even Savil cannot master alone. For soon he will become the focus of frightening forces, lending his raw magic to a spell that unleashes terrifying wyr-hunters on the land.<br/><br/>And by the time Savil seeks the assistance of a Shin’a’in Adept, Vanyel’s wild talent may have already grown beyond anyone’s ability to contain, placing Vanyel, Savil, and Valdemar itself in desperate peril.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/35/26/9780886773526.jpg', 'title_long': "Magic's Pawn Book One of the Last Herald-Mage", 'edition': 'reissue', 'dimensions': 'Height: 6.83 Inches, Length: 4.2 Inches, Weight: 0.45 Pounds, Width: 0.94 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.2}, 'width': {'unit': 'inches', 'value': 0.94}, 'weight': {'unit': 'pounds', 'value': 0.45}, 'height': {'unit': 'inches', 'value': 6.83}}, 'pages': 352, 'date_published': '1991', 'subjects': ['Lesbian, Gay, Bisexual & Transgender Books', 'Science Fiction & Fantasy', 'Fantasy', 'Epic', 'Sword & Sorcery', 'Paranormal & Urban', 'Romantic'], 'authors': ['Mercedes Lackey'], 'title': "Magic's Pawn Book One of the Last Herald-Mage", 'isbn13': '9780886773526', 'msrp': '0.00', 'binding': 'Mass Market Paperback', 'related': {'Kindle Edition': '1101127252', 'ePub': '1101127252'}, 'isbn': '0886773520', 'isbn10': '0886773520', 'other_isbns': [{'isbn': '9781101127254', 'binding': 'print'}]}}