{'book': {'publisher': 'Harper Business', 'synopsis': "Computer manufacturing is--after cars, energy production and illegal drugs--the largest industry in the world, and it's one of the last great success stories in American business. Accidental Empires is the trenchant, vastly readable history of that industry, focusing as much on the astoundingly odd personalities at its core--Steve Jobs, Bill Gates, Mitch Kapor, etc. and the hacker culture they spawned as it does on the remarkable technology they created. Cringely reveals the manias and foibles of these men (they are always men) with deadpan hilarity and cogently demonstrates how their neuroses have shaped the computer business. But Cringely gives us much more than high-tech voyeurism and insider gossip. From the birth of the transistor to the mid-life crisis of the computer industry, he spins a sweeping, uniquely American saga of creativity and ego that is at once uproarious, shocking and inspiring.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/85/50/9780887308550.jpg', 'title_long': "Accidental Empires: How the Boys of Silicon Valley Make Their Millions, Battle Foreign Competition, and Still Can't Get a Date", 'edition': 'Reprint', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 0.74 Pounds, Width: 0.87 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 0.87}, 'weight': {'unit': 'pounds', 'value': 0.74}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 384, 'date_published': '1996-09-13', 'subjects': ['Business & Money', 'Biography & History', 'Company Profiles', 'Industries', 'Computers & Technology', 'History & Culture', 'History', 'Americas', 'United States', 'Engineering & Transportation', 'Engineering', 'Reference', 'Science & Math', 'Technology', 'History of Technology'], 'authors': ['Robert X. Cringely'], 'title': "Accidental Empires: How the Boys of Silicon Valley Make Their Millions, Battle Foreign Competition, and Still Can't Get a Date", 'isbn13': '9780887308550', 'msrp': 16.99, 'binding': 'Paperback', 'isbn': '0887308554', 'isbn10': '0887308554'}}