{'book': {'publisher': 'House of Anansi Press', 'synopsis': 'As humanity enters the 21st century, globalization and modernization promise to make for more consumption of grains, beef, and fish than ever before. The 2 billion inhabitants of India and China are set to purchase at unprecedented levels, and sub-Saharan Africa will need to overcome its many torturous famines. What kinds of fixes can ensure the stability of the food supply throughout the 21st century and beyond? Feeding the Future provides pragmatic, learned solutions to the issues that loom large. Nine chapters, each penned by a different expert, examine issues ranging from food safety to the business of food to conservation. "Fish or Cut Bait" examines overfishing and other practices that threaten to ruin the world\'s seas, while "Between Feast and Famine" takes on the issue of global trade, showing how globalization can be made to work for all. Combining social ingenuity, emerging technologies, and smart business models, Feeding the Future offers real solutions for a world that needs them now more than ever.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/74/48/9780887847448.jpg', 'title_long': "Feeding the Future: From Fat to Famine, How to Solve the World's Food Crises (The Ingenuity Project)", 'dimensions': 'Height: 8.25 Inches, Length: 6.25 Inches, Weight: 1.09 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.09}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 336, 'date_published': '2006-09-20', 'subjects': ['Business & Money', 'Industries', 'Agriculture', 'Engineering & Transportation', 'Engineering', 'Science & Math', 'Agricultural Sciences', 'Food Science', 'Politics & Social Sciences', 'Social Sciences', 'Poverty'], 'authors': [], 'title': "Feeding the Future: From Fat to Famine, How to Solve the World's Food Crises (The Ingenuity Project)", 'isbn13': '9780887847448', 'msrp': 18.95, 'binding': 'Paperback', 'isbn': '0887847447', 'isbn10': '0887847447'}}