{'book': {'publisher': 'Harper Business', 'synopsis': 'The true story behind the rise of a tyrannical genius, how he<br/>transformed an industry, and why everyone is out to get him.<br/>In this fascinating exposé, two investigative reporters trace the hugely successful career of Microsoft founder Bill Gates. Part entrepreneur, part enfant terrible, Gates has become the most powerful -- and feared -- player in the computer industry, and arguably the richest man in America. In Hard Drive, investigative reporters Wallace and Erickson follow Gates from his days as an unkempt thirteen-year-old computer hacker to his present-day status as a ruthless billionaire CEO. More than simply a "revenge of the nerds" story though, this is a balanced analysis of a business triumph, and a stunningly driven personality. The authors have spoken to everyone who knows anything about Bill Gates and Microsoft -- from childhood friends to employees and business rivals who reveal the heights, and limits, of his wizardry. From Gates\'s singular accomplishments to his equally extraordinary brattiness, arrogance, and hostility (the atmosphere is so intense at Microsoft that stressed-out programmers have been known to ease the tension of their eighty-hour workweeks by exploding homemade bombs), this is a uniquely revealing glimpse of the person who has emerged as the undisputed king of a notoriously brutal industry.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/62/97/9780887306297.jpg', 'title_long': 'Hard Drive: Bill Gates and the Making of the Microsoft Empire', 'edition': 'Reprint', 'dimensions': 'Height: 8 Inches, Length: 5.31 Inches, Weight: 0.8 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.31}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 0.8}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 426, 'date_published': '1993-06-01', 'subjects': ['Business & Money'], 'authors': ['James Wallace', 'Jim Erickson'], 'title': 'Hard Drive: Bill Gates and the Making of the Microsoft Empire', 'isbn13': '9780887306297', 'msrp': 17.99, 'binding': 'Paperback', 'isbn': '0887306292', 'isbn10': '0887306292'}}