{'book': {'publisher': 'Inner Traditions', 'synopsis': "The highly regarded translation that honors the authentic Chinese spirit of the Book of Changes<br/><br/>. Places new emphasis on the intricate web of interrelations among the names and sequence of the sixty-four hexagrams<br/><br/>. Includes historical information on the events out of which the I Ching was born<br/><br/>. Introduces several new methods of divination<br/><br/>For more than 3,000 years the I Ching has been the most important book of divination in the world. Revered by billions of Chinese as the Classic of Classics and consulted as a source of ancient wisdom, it has been embraced by the West in the last 50 years but has always been translated by Westerners who brought their own cultural biases to the work, distorting or misunderstanding its true meaning.<br/><br/>In The Complete I Ching Master Alfred Huang has restored the true essence of the I Ching by emphasizing the unity of Heaven and humanity and the Tao of Change, and, even more important, by including translations of the Ten Wings, the commentaries by Confucius, that are essential to the I Ching's insights. Previous English translations have either given these commentaries a minor place in the book or have left them out altogether. But the Chinese say that the I Ching needs the Ten Wings to fly. Restored to their central place in the book by Master Huang, the I Ching at last flies in English.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/14/58/9780892811458.jpg', 'title_long': 'The Complete I Ching: The Definitive Translation by the Taoist Master Alfred Huang', 'edition': 'Now in Paperback', 'dimensions': 'Height: 9 Inches, Length: 6.25 Inches, Weight: 0.00220462262 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 0.00220462262}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 576, 'date_published': '2004-04-15', 'subjects': ['Religion & Spirituality', 'Occult & Paranormal', 'Other Eastern Religions & Sacred Texts', 'I Ching', 'Politics & Social Sciences', 'Philosophy', 'Eastern'], 'authors': ['Taoist Master Alfred Huang'], 'title': 'The Complete I Ching: The Definitive Translation by the Taoist Master Alfred Huang', 'isbn13': '9780892811458', 'msrp': 19.95, 'binding': 'Paperback', 'isbn': '0892811455', 'isbn10': '0892811455'}}