{'book': {'publisher': 'Ignatius Press', 'synopsis': 'J. R. R. Tolkien\'s The Lord of the Rings took first place in several nationwide British polls on the "greatest book of the century". He may be the most popular writer of our age, but Tolkien is often misunderstood. This major new study of his life, his character, and his work reveals the facts and confronts the myths. It explores the man\'s background and the culture in which he wrote.<br/>Tolkien: Man and Myth observes the relationships that the master writer had with his closest literary colleagues. It sheds light on his unique relationship with C. S. Lewis, the writer of the Narnia books, and the roots of their eventual estrangement.<br/>In this original book about a leading literary life, Joseph Pearce enters the world that Tolkien created in the seven books published during his lifetime. He explores the significance of Middle Earth and what it represented in Tolkien\'s thinking. Myth, to this legendary author, was not a leap from reality but a leap into reality.<br/>The impact of Tolkien\'s great notoriety, his relationship with material possessions, and his deep religious faith are all examined at length in this biography, making it possible to understand both the man and the myth that he created.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/82/57/9780898708257.jpg', 'title_long': 'Tolkien: Man and Myth', 'edition': 'A Literary Life', 'dimensions': 'Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.7495716908 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.7495716908}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 257, 'date_published': '2001-12-01', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Authors'], 'authors': ['Joseph Pearce'], 'title': 'Tolkien: Man and Myth', 'isbn13': '9780898708257', 'msrp': 15.95, 'binding': 'Paperback', 'isbn': '0898708257', 'isbn10': '0898708257'}}