{'book': {'publisher': 'Hackett Publishing Company, Inc.', 'synopsis': 'From the Introduction: "Stoic philosophy, of which Epictetus (c. a.d. 50–130) is a representative, began as a recognizable movement around 300 b.c. Its founder was Zeno of Cytium (not to be confused with Zeno of Elea, who discovered the famous paradoxes). He was born in Cyprus about 336 b.c., but all of his philosophical activity took place in Athens. For more than 500 years Stoicism was one of the most influential and fruitful philosophical movements in the Graeco-Roman world. The works of the earlier Stoics survive only in fragmentary quotations from other authors, but from the Renaissance until well into the nineteenth century, Stoic ethical thought was one of the most important ancient influences on European ethics, particularly because of the descriptions of it by Cicero, through surviving works by the Stoics Seneca, Marcus Aurelius, and also Epictetus--and also because of the effect that it had had in antiquity, and continued to have into the nineteenth century, on Christian ethical views. Nowadays an undergraduate or graduate student learning about ancient philosophy in a university course may well hear only about Plato and Aristotle, along perhaps with the presocratics; but in the history of Western thought and education this situation is somewhat atypical, and in most periods a comparable student would have learned as much or more about Stoicism, as well as two other major ancient philosophical movements, Epicureanism and Scepticism. In spite of this lack of explicit acquaintance with Stoic philosophers and their works, however, most students will recognize in Epictetus various ideas that are familiar through their effects on other thinkers, notably Spinoza, in our intellectual tradition."', 'language': 'en', 'image': 'https://images.isbndb.com/covers/56/90/9780915145690.jpg', 'title_long': 'The Handbook (The Encheiridion) (Hackett Classics)', 'edition': 'Later Printing Used', 'dimensions': 'Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.12566348934 Pounds, Width: 0.0938 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.0938}, 'weight': {'unit': 'pounds', 'value': 0.12566348934}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 35, 'date_published': '1983-06-01', 'subjects': ['Politics & Social Sciences', 'Philosophy', 'Ethics & Morality', 'Greek & Roman', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Epictetus'], 'title': 'The Handbook (The Encheiridion) (Hackett Classics)', 'isbn13': '9780915145690', 'msrp': '0.00', 'binding': 'Paperback', 'related': {'Page Fidelity': '1603845593', 'ePub': '1603845313'}, 'isbn': '0915145693', 'isbn10': '0915145693', 'other_isbns': [{'isbn': '9781603845311', 'binding': 'print'}, {'isbn': '9781603845595', 'binding': 'print'}]}}