{'book': {'publisher': 'Hackett Publishing Company, Inc.', 'synopsis': 'TABLE OF CONTENTS:<br/><br/>Foreword to the Second Edition.<br/><br/>I. THE MAN AND HIS WRITINGS:<br/>How Augustine Came to the Episcopacy (Sermon 355, 2); Augustine Chooses Eraclius as His Successor (Letter 213, 1, 5, & 6); Augustine on His Own Writings (Retractations Prol. I, 1-3).<br/><br/>II. FAITH AND REASON:<br/>Belief is Volitional Consent (On the Spirit and Letter 21, 54; 34, 60); To Believe Is to Think with Assent (Predestination of the Saints 5); Believing and Understanding (On Free Choice II, 2, 4-6); Authority and Reason (Against the Academics III, 20, 43); Two Ways to Knowledge (On Order II, 9, 26-27); Reason and Authority in Manicheism (Value of Believing 1-4); The Relation of Authority to Reason (True Religion 24, 45 -- 25, 47); If I Am Deceived, I Am Alive (City of God XI, 26); I Know that I Am Alive (The Trinity XV, 12, 21-22); Knowledge and Wisdom (The Trinity XII, 14, 21 -- 15, 25); Error and Ignorance (Enchiridion 17).<br/><br/>III. THREE LEVELS OF REALITY:<br/>Creator, Human Soul, Body (Questions for Simplicianus I, 2, 18); Natures on Three Levels (Letter 18, 2); Soul, Ruled by God, Rules Its Body (On Music VI, 5, 12-13); Soul: Above the Sensible, Below God (True Religion 3. 3); God, Mutable Spirits, and Bodies (Nature of the Good 1-25); Divine, Psychic and Bodily Nature (City of God VIII, 5-6); Causality: Divine, Psychic and Bodily (City of God V, 9); Divine Ideas as Prototypes (Eighty-Three Different Questions 46, 1-2); God Set Spiritual Creation Above the Corporeal (Literal Commentary on Genesis VIII, 20, 39; 25, 46; 26, 48); Evil: the Privation of the Good (Enchiridion 10-12).<br/><br/>IV. MAN’S SOUL:<br/>Existence, Life, Sense and Reason (On Free Choice II, 3, 7-8, 10); Sensation as an Activity of the Soul (On Music VI, 5, 9-10); Memory, Understanding and Will (The Trinity X, 11, 17-18); The Wonders of Memory (Confessions X, 8-26); Three Levels of Vision (Literal Commentary on Genesis XII, 6, 15 -- 11, 22; 30, 58 -- 31, 59).<br/><br/>V. THE WORLD OF BODIES:<br/>All Bodily Natures Are Good (City of God XII, 4); Invisible Seeds in the Elements (The Trinity III, 8, 13); The Elements Contain Seminal Reasons (Literal Commentary on Genesis IX, 17, 32); Measure, Number, and Weight (Literal Commentary on Genesis IV, 3, 7); Concerning Formless Matter (Confessions XII, 3. 3 -- 9, 9); Place, Time and the Physical World (City of God XI, 5-6); The Wonders of Nature (City of God XXI, 4-5); God Works Throughout Nature (The Trinty III, 5, 11 -- 6, 11); Man’s Natural Endowments (City of God XXII, 24); The Physical World and the Christian (Enchiridion 9).<br/><br/>VI. APPROACHING GOD THROUGH UNDERSTANDING:<br/>Creation is a Great Book (Sermon, Mai 126, 6); The Journey of the Soul to God (On Free Choice II, 12, 33-34; 15, 39-40; 16, 41-42); The Soul’s Ascent to God (Confessions VII, 10, 16 -- 17, 23); The Whole World Proclaims Its Maker (On Psalm 26, Serm. 2, 12); Ascending to the Supreme Truth (True Religion 29, 52 -- 31, 58); Plato’s View of God (City of God VII, 4); How to Think About God (The Trinity V, 1, 2 -- 2, 3); The Problem of Speaking About God (The Trinity VII, 4, 7-9); God Is the Selfsame (On Psalm 121, 3, 5); A Divine Invocation (Soliloquies I, 2-6); Late Have I Loved Thee (Confessions X, 27, 38 -- 28, 39).<br/><br/>VII. MORAL AND RELIGIOUS LIFE:<br/>All Men Desire Happiness (On Psalm 32, Serm. 3, 15-16); Man’s Greatest Good (Moral Behavior of the Catholic Church 3-8); Good Love and Bad Love (City of God XIV, 6-7); Moral Evil Stems from Bad Will (City of God XII, 6); Two Precepts of Love (City of God XIX, 14); On Diversities of Local Customs (Letter 54, 1-4); Doing Good to Body and Soul (Moral Behavior of the Catholic Church 27-28); The Evil of Telling a Lie (Enchiridion 18, 19, 22); Lying and Concealing the Truth (On Psalm 5, 7); Faith, Hope and Charity (Enchiridion 8); No Virtues Apart from God (City of God XIX, 25); Our Reward Is Not in This Life (On Psalm 48, Serm. 2).<br/><br/>VIII. DIMENSIONS OF GRACE:<br/>What the Grace of God Is (On Admonition and Grace 2, 3); Augustine Was Never a Pelagian (Retracta', 'language': 'en', 'image': 'https://images.isbndb.com/covers/40/75/9780915144075.jpg', 'title_long': 'The Essential Augustine', 'edition': '2', 'dimensions': 'Height: 8.75 Inches, Length: 5.75 Inches, Weight: 0.43871990138 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.43871990138}, 'height': {'unit': 'inches', 'value': 8.75}}, 'pages': 268, 'date_published': '1974', 'subjects': ['Politics & Social Sciences', 'Philosophy', 'Medieval Thought', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Saint Augustine of Hippo'], 'title': 'The Essential Augustine', 'isbn13': '9780915144075', 'msrp': 14, 'binding': 'Paperback', 'isbn': '0915144077', 'isbn10': '0915144077'}}