{'book': {'publisher': 'Library of America', 'synopsis': 'This first volume of The Library of America\'s three-volume edition of the complete prose works of Herman Melville includes three romances of the South Seas. Typee and Omoo, based on the young Melville\'s experiences on a whaling ship, are exuberant accounts of the idyllic life among the "cannibals" in Polynesia. They remained his most popular works well into the 20th century. Mardi ("the world" in Polynesian) is a mixture of love story, adventure, and political allegory, set on a mythical Pacific island, that looks forward to the complexities of Moby-Dick. Together, these three romances give early evidence of the genius and daring that make Melville the master novelist of the sea and a precursor of modernist literature. Two companion volumes--Herman Melville: Redburn, White-Jacket, Moby-Dick and Herman Melville: Pierre, Israel Potter, The Piazza Tales, The Confidence Man, Uncollected Prose, and Billy Budd complete this edition of Melville\'s prose.<br/><br/>LIBRARY OF AMERICA is an independent nonprofit cultural organization founded in 1979 to preserve our nation’s literary heritage by publishing, and keeping permanently in print, America’s best and most significant writing. The Library of America series includes more than 300 volumes to date, authoritative editions that average 1,000 pages in length, feature cloth covers, sewn bindings, and ribbon markers, and are printed on premium acid-free paper that will last for centuries.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/00/04/9780940450004.jpg', 'title_long': 'Herman Melville : Typee, Omoo, Mardi (Library of America)', 'edition': 'First Edition', 'dimensions': 'Height: 8.16 Inches, Length: 5.13 Inches, Weight: 1.80999517102 Pounds, Width: 1.55 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.13}, 'width': {'unit': 'inches', 'value': 1.55}, 'weight': {'unit': 'pounds', 'value': 1.80999517102}, 'height': {'unit': 'inches', 'value': 8.16}}, 'pages': 1333, 'date_published': '1982-05-06', 'subjects': ['Literature & Fiction', 'Classics', 'Genre Fiction', 'Sea Stories', 'United States', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors': ['Herman Melville'], 'title': 'Herman Melville : Typee, Omoo, Mardi (Library of America)', 'isbn13': '9780940450004', 'msrp': 45, 'binding': 'Hardcover', 'related': {'eBook': '1598533460', 'ePub': '1598533452'}, 'isbn': '0940450003', 'isbn10': '0940450003', 'other_isbns': [{'isbn': '9781598533453', 'binding': 'printisbn'}, {'isbn': '9781598533460', 'binding': 'print'}]}}