{'book': {'publisher': 'Macmillan Audio', 'synopsis': 'Discover and Live a Life of Spiritual Fulfillment<br/><br/>With wisdom gained from his personal 30-year search for enlightenment, Ram Dass speaks from the heart about the often rocky yet profoundly transforming road to living the spiritual life.<br/><br/>With personal anecdotes and commentary, Ram Dass illuminates a wide variety of ancient and contemporary philosophies, drawing from such sources as the Buddha, Russian philosopher Gurdjieff, Mahatma Ghandi, Zen master and many others. Here is down-to-earth advice from both the East and West on the experiences awaiting those on the path to spiritual fulfillment.<br/><br/>The stages along the spiritual journey<br/><br/>The pleasures and pitfalls you might encounter en route<br/><br/>The value and potential dangers of teachers and gurus<br/><br/>The importance of following your intuitive heart<br/><br/>If you are a serious seeker of the spiritual path, here is advice and encouragment on finding the one that is right for you. If your interest lies in the people and ideas that shape the way we think, here is an introduction to one of the most influential contemporary philosophers.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/75/61/9780940687561.jpg', 'title_long': 'Finding and Exploring Your Spiritual Path: An Exploration of the Pleasures and Perils of Seeking Personal Enlightenment', 'edition': 'Unabridged', 'dimensions': 'Height: 6.94 Inches, Length: 6.46 Inches, Width: 0.875 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.46}, 'width': {'unit': 'inches', 'value': 0.875}, 'height': {'unit': 'inches', 'value': 6.94}}, 'date_published': '1989', 'subjects': ['Religion & Spirituality', 'Religious Studies', 'Comparative Religion', 'Worship & Devotion', 'Inspirational', 'Politics & Social Sciences', 'Philosophy'], 'authors': ['Ram Dass'], 'title': 'Finding and Exploring Your Spiritual Path: An Exploration of the Pleasures and Perils of Seeking Personal Enlightenment', 'isbn13': '9780940687561', 'msrp': 9.95, 'binding': 'Audio Cassette', 'isbn': '0940687569', 'isbn10': '0940687569'}}