{'book': {'publisher': 'Library of America', 'synopsis': 'Forgoing the narratives of the sea that prevailed in his earlier works, Melville’s later fiction contains some of the finest and many of his keenest and bleakest observations of life, not on the high seas, but at home in America. With the publication of this Library of America volume, the third of three volumes, all Melville’s fiction has now been restored to print for the first time.<br/><br/>Pierre; or, The Ambiguities, published in 1852 (the year after Moby-Dick), moves between the idyllic Berkshire countryside and the nightmare landscape of early New York City. Its hero, a young American patrician trying to redeem the secret sins of his father, elopes to the city, discovers Bohemian life, attempts a literary epic, and struggles his way through incest, murder, and madness. Long a controversial work, it is Melville’s darkest satire of American life and letters and one of his most powerful books.<br/><br/>A pivotal work, both for Melville’s career and for American literature, Pierre was followed by Israel Potter, the story of a veteran of the Revolution, victim of a thousand mischances, and a long-suffering exile in England. Along the way are memorable episodes of war and intrigue, with personal portraits of Benjamin Franklin, John Paul Jones, and George III. In the exploits of this touchingly optimistic soldier, Melville offers a scathing image of the collapse of revolutionary hopes.<br/><br/>The Piazza Tales demonstrates Melville’s dazzling mastery of many styles, including “The Encantadas,” about nature’s two faces—enchanting and horrific; the famous “Bartleby the Scrivener,” about a Wall Street copyist who “would prefer not to”; and the enigmatic “Benito Cereno,” about a credulous Yankee sea captain who stumbles into an intricately plotted mutiny aboard a disabled slave ship.<br/><br/>The Confidence-Man, Melville’s last published novel, is in many ways a forerunner of modernist American fiction. An extended meditation on faith, hope, and charity as these are manifested on board a Mississippi riverboat one April Fools’ Day, it presents a menagerie of Americans buying and selling, borrowing and lending, believing and mistrusting, as they are carried toward the auction blocks of New Orleans.<br/><br/>Many pieces never before collected are also included: the “Authentic Anecdotes of Old Zack” (burlesque sketches of Zachary Taylor’s Mexican campaign), “Fragments from a Writing-Desk” (Melville’s earliest surviving prose), reviews of Hawthorne, Parkman, and Cooper, and all the tales Melville published in magazines during the 1850s.<br/><br/>Finally, there is the posthumously published masterpiece Billy Budd, Sailor, the haunting story of a beautiful, innocent sailor who is pressed into naval service, slandered, provoked to murder, and sacrificed to military justice. While encouraging questions for which there are no answers, it invites us to meditate on the conflicts central to all Melville’s work: between freedom and fate, innocence and civilized corruption.<br/><br/>LIBRARY OF AMERICA is an independent nonprofit cultural organization founded in 1979 to preserve our nation’s literary heritage by publishing, and keeping permanently in print, America’s best and most significant writing. The Library of America series includes more than 300 volumes to date, authoritative editions that average 1,000 pages in length, feature cloth covers, sewn bindings, and ribbon markers, and are printed on premium acid-free paper that will last for centuries.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/02/40/9780940450240.jpg', 'title_long': 'Melville: Pierre, Israel Potter, the Piazza Talesthe Confidence-Man, Uncollected Prose, Billy Budd Erica Series/Novels and Tales, Vol 3', 'edition': 'First Edition', 'dimensions': 'Weight: 2.05 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 2.05}}, 'pages': 1478, 'date_published': '1984', 'subjects': ['Literature & Fiction', 'Classics', 'Genre Fiction', 'Historical', 'Sea Stories', 'Psychological', 'Action & Adventure', 'Sea Adventures', 'United States', 'Contemporary', 'Literary'], 'authors': ['Herman Melville'], 'title': 'Melville: Pierre, Israel Potter, the Piazza Talesthe Confidence-Man, Uncollected Prose, Billy Budd Erica Series/Novels and Tales, Vol 3', 'isbn13': '9780940450240', 'msrp': 45, 'binding': 'Hardcover', 'isbn': '0940450240', 'isbn10': '0940450240'}}