{'book': {'publisher': 'Library of America', 'synopsis': 'Native Son and Black Boy are classics of twentieth-century American literature—and yet the novel and memoir known to millions of readers are in fact revised and abbreviated versions of the books Richard Wright wrote. The two-volume Library of America edition presents for the first time Wright’s major works in the form in which he intended them to be read. The authoritative new texts, based on Wright’s original typescripts and proofs, reveal the full range and power of this achievement as an experimental stylist and as a fiery prophet of the tragic consequences of racism in American society.<br/><br/>Wright’s wrenching memoir Black Boy, an eloquent account of his struggle to escape a life of poverty, ignorance and fear in his native South, was an immediate bestseller when it appeared in 1945. But Wright’s complete autobiography, published for the first time in this volume as Black Boy (American Hunger), is a far more complex and probing work. Its original second section, in which Wright chronicled his encounter with racism in the North, his apprenticeship as a writer, and his disillusionment with the Communist Party, was cut at the insistence of book club editors and was only published posthumously as a separate work. Now that the two parts of Wright’s autobiography are finally printed together, Black Boy (American Hunger) appears as a new and different work—a unique contribution to the literature of self-discovery and a searing vision of racism in Northern slums as well as Southern shanties.<br/><br/>Richard Wright’s novel The Outsider (1953) appears here in a text that restores the many stylistic changes and long cuts made by his editors without his knowledge. This text, based on Wright’s final, corrected typescript, casts new light on his development of the style he called “poetic realism.” The “outsider” of Wright’s story is Cross Damon, a black man who works in the Chicago post office. When Damon is mistakenly believed to have died in a subway accident, he seizes the opportunity to invent a new life for himself. In this, his most philosophical novel, Wright reconsiders the existentialist themes of man’s freedom and responsibility as he traces Damon’s doomed attempts to lead a free life.<br/><br/>Richard Wright was “forged in injustice as a sword is forged,” wrote Ernest Hemingway. With passionate honesty and courage, he confronted the terrible effects of prejudice and intolerance and created works that explore the deepest conflicts of the human heart.<br/><br/>This volume includes notes on significant changes in Wright’s texts and a detailed chronology of his life.<br/><br/>LIBRARY OF AMERICA is an independent nonprofit cultural organization founded in 1979 to preserve our nation’s literary heritage by publishing, and keeping permanently in print, America’s best and most significant writing. The Library of America series includes more than 300 volumes to date, authoritative editions that average 1,000 pages in length, feature cloth covers, sewn bindings, and ribbon markers, and are printed on premium acid-free paper that will last for centuries.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/06/77/9780940450677.jpg', 'title_long': 'Richard Wright : Later Works: Black Boy (American Hunger), The Outsider', 'edition': '1', 'dimensions': 'Height: 8.2 Inches, Length: 5.15 Inches, Weight: 1.27427187436 Pounds, Width: 1.1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.15}, 'width': {'unit': 'inches', 'value': 1.1}, 'weight': {'unit': 'pounds', 'value': 1.27427187436}, 'height': {'unit': 'inches', 'value': 8.2}}, 'pages': 887, 'date_published': '1991-10-01', 'subjects': ['Biographies & Memoirs', 'Arts & Literature', 'Authors', 'Community & Culture', 'Black & African American', 'Literature & Fiction', 'Genre Fiction', 'Short Stories & Anthologies', 'Anthologies', 'United States', 'Politics & Social Sciences', 'Politics & Government', 'Specific Topics', 'Self Service', 'Custom Stores'], 'authors': ['Richard Wright'], 'title': 'Richard Wright : Later Works: Black Boy (American Hunger), The Outsider', 'isbn13': '9780940450677', 'msrp': 40, 'binding': 'Hardcover', 'isbn': '0940450674', 'isbn10': '0940450674'}}