{'book': {'publisher': 'Library of America', 'synopsis': 'Philosopher and psychologist William James was the best known and most influential American thinker of his time. The five books and nineteen essays collected in this Library of America volume represent all his major work from 1902 until his death in 1910. Most were originally written as lectures addressed to general audiences as well as philosophers and were received with great enthusiasm. His writing is clear, energetic, and unpretentious, and is marked by the devotion to literary excellence he shared with his brother, Henry James. In these works William James champions the value of individual experience with an eloquence and enthusiasm that has placed him alongside Emerson and Whitman as a classic exponent of American democratic culture.<br/><br/>In The Varieties of Religious Experience (1902) James explores “the very inner citadel of human life” by focusing on intensely religious individuals of different cultures and eras. With insight, compassion, and open-mindedness, he examines and assesses their beliefs, seeking to measure religion’s value by its contributions to individual human lives.<br/><br/>In Pragmatism (1907) James suggests that the conflicting metaphysical positions of “tender-minded” rationalism and “tough-minded” empiricism be judged by examining their actual consequences. Philosophy, James argues, should free itself from unexamined principles and closed systems and confront reality with complete openness.<br/><br/>In A Pluralistic Universe (1909) James rejects the concept of the absolute and calls on philosophers to respond to “the real concrete sensible flux of life.” Through his discussion of Kant, Hegel, Henri Bergson, and religion, James explores a universe viewed not as an abstract “block” but as a rich “manyness-in-oneness,” full of independent yet connected events.<br/><br/>The Meaning of Truth (1909) is a polemical collection of essays asserting that ideas are made true not by inherent qualities but by events. James delights in intellectual combat, stating his positions with vigor while remaining open to opposing ideas.<br/><br/>Some Problems of Philosophy (1910) was intended by James to serve both as a historical overview of metaphysics and as a systematic statement of his philosophical beliefs. Though unfinished at his death, it fully demonstrates the psychological insight and literary vividness James brought to philosophy.<br/><br/>Among the essays included are the anti-imperialist “Address on the Philippine Question,” “On Some Mental Effects of the Earthquake,” a candid personal account of the 1906 California disaster, and “The Moral Equivalent of War,” a call for the redirection of martial energies to peaceful ends, as well as essays on Emerson, the role of university in intellectual life, and psychic research.<br/><br/>LIBRARY OF AMERICA is an independent nonprofit cultural organization founded in 1979 to preserve our nation’s literary heritage by publishing, and keeping permanently in print, America’s best and most significant writing. The Library of America series includes more than 300 volumes to date, authoritative editions that average 1,000 pages in length, feature cloth covers, sewn bindings, and ribbon markers, and are printed on premium acid-free paper that will last for centuries.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/03/87/9780940450387.jpg', 'title_long': 'William James : Writings 1902-1910 : The Varieties of Religious Experience / Pragmatism / A Pluralistic Universe / The Meaning of Truth / Some Problems of Philosophy / Essays (Library of America)', 'dimensions': 'Height: 8.17 Inches, Length: 5.24 Inches, Weight: 1.92463554726 Pounds, Width: 1.7 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.24}, 'width': {'unit': 'inches', 'value': 1.7}, 'weight': {'unit': 'pounds', 'value': 1.92463554726}, 'height': {'unit': 'inches', 'value': 8.17}}, 'pages': 1379, 'date_published': '1988-02-01', 'subjects': ['Health, Fitness & Dieting', 'Psychology & Counseling', 'Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Short Stories & Anthologies', 'Anthologies', 'United States', 'Religion & Spirituality', 'Medical Books', 'Psychology', 'General', 'Politics & Social Sciences', 'Philosophy', 'Modern', 'Movements', 'Religious'], 'authors': ['William James'], 'title': 'William James : Writings 1902-1910 : The Varieties of Religious Experience / Pragmatism / A Pluralistic Universe / The Meaning of Truth / Some Problems of Philosophy / Essays (Library of America)', 'isbn13': '9780940450387', 'msrp': 26.46, 'binding': 'Hardcover', 'isbn': '0940450380', 'isbn10': '0940450380'}}