{'book': {'publisher': 'Library of America', 'synopsis': 'The Library of America’s collection of Eugene O’Neill’s plays “displays O’Neill more thoroughly than any playhouse ever could,” according to Time magazine. This volume, the second of three, contains thirteen plays written between 1920 and 1931, years in which O’Neill achieved his greatest popularity while experimenting with a wide variety of subjects and styles.<br/><br/>In Diff’rent, The First Man, and Welded, egotistical characters have their illusions about love shaken by the force of other people’s desires. All God’s Chillun Got Wings depicts the web of racial hatreds and spiritual longings that surround the marriage of a black man and a white woman.<br/><br/>The Fountain tells of Ponce de Leon’s search for the fountain of youth. Marco Millions satirizes American materialism by portraying Marco Polo as a hustling businessman blind to the riches of Eastern culture. Lazarus Laughed shows its Biblical hero preaching love, laughter, and the defeat of death.<br/><br/>The stoker Yank in The Hairy Ape, the architect Dion Anthony in The Great God Brown, and the minister’s son Reuben Light in Dynamo all try to find a place for themselves in an increasingly soulless and mechanistic world. Yank believes that he “belongs” in his stokehold until a terrified heiress calls him a “filthy beast.” His rage turns to despair as he encounters a brutally indifferent society onshore. The Great God Brown uses masks to depict the divided souls of its hero, his wife, and his alter ego, the successful businessman William Brown. Betrayed by his mother, Reuben Light forsakes the God of his father for the new electrical god of the dynamo but finds no escape from the sexual conflicts that O’Neill characteristically intertwines with his hero’s religious doubts.<br/><br/>Strange Interlude follows its heroine Nina Leeds through nine acts and twenty-five years of passionate and painful involvement with three men. Inspired by contemporary psychology, the novels of James Joyce, and the soliloquies of the Elizabethan theater, O’Neill uses spoken asides to reveal the shifting flow of his character’s inner thoughts. His most commercially successful play, it won him his third Pulitzer Prize.<br/><br/>Ephraim Cabot, the patriarchal farmer in Desire Under the Elms, believes in a God as hard as the stony ground he works. He takes as his third wife sensual Abbie Putnam, who covets both his land and his resentful son Eben, unleashing passions that move with stark inexorability toward their fulfillment. In Mourning Becomes Electra, murderous lusts and hatreds wreak havoc upon the proud Mannon family, leaving the survivors pursued not by the avenging Furies of Greek myth but by their own scourging consciences. Searching desperately for peace, they repeatedly confront the temptation to choose oblivion that will haunt many of O’Neill’s last plays.<br/><br/>LIBRARY OF AMERICA is an independent nonprofit cultural organization founded in 1979 to preserve our nation’s literary heritage by publishing, and keeping permanently in print, America’s best and most significant writing. The Library of America series includes more than 300 volumes to date, authoritative editions that average 1,000 pages in length, feature cloth covers, sewn bindings, and ribbon markers, and are printed on premium acid-free paper that will last for centuries.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/04/93/9780940450493.jpg', 'title_long': "Eugene O'Neill : Complete Plays 1920-1931 (Library of America)", 'edition': '1', 'dimensions': 'Height: 8.16 Inches, Length: 5.18 Inches, Weight: 0.00220462262 Pounds, Width: 1.38 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.18}, 'width': {'unit': 'inches', 'value': 1.38}, 'weight': {'unit': 'pounds', 'value': 0.00220462262}, 'height': {'unit': 'inches', 'value': 8.16}}, 'pages': 1092, 'date_published': '1988-10-01', 'subjects': ['Arts & Photography', 'Performing Arts', 'Theater', 'Literature & Fiction', 'Dramas & Plays', 'United States', 'Short Stories & Anthologies', 'Anthologies', 'Reference', 'Writing, Research & Publishing Guides', 'Writing', 'Self Service', 'Custom Stores'], 'authors': ["Eugene O'Neill"], 'title': "Eugene O'Neill : Complete Plays 1920-1931 (Library of America)", 'isbn13': '9780940450493', 'msrp': 40, 'binding': 'Hardcover', 'isbn': '0940450496', 'isbn10': '0940450496'}}