{'book': {'publisher': 'Library of America', 'synopsis': 'When Cooper\'s most memorable hero, Leatherstocking, started an American tradition by setting off into the sunset in The Pioneers, one early reader said of his departure, "I longed to go with him."<br/><br/>American readers couldn\'t get enough of the Leatherstocking saga (collected in two Library of America volumes) and, fourteen years after he portrayed the death of Natty Bumppo in The Prairie, Cooper brought him back in The Pathfinder, or The Inland Sea (1841). During the Seven Years War, just after the events narrated in The Last of the Mohicans, Natty brings the daughter of a British sergeant to her father\'s station on the Great Lakes, where the French and their Indian allies are plotting a treacherous ambush. Here, for the first time, he falls in love with a woman, before Cooper manages bring off Leatherstocking\'s most poignant, and perhaps his most revealing, escape.<br/><br/>The Deerslayer (1842) brings the saga full circle and follows the young Natty on his first warpath. Instinctively gifted in the arts of the forest, pious in his respect for the unspoiled wilderness on which he loves to gaze, honorable to friend and foe alike, stoic under torture, and cool under fire, the young Leatherstocking emerges as Cooper\'s noblest figure of the American frontier. Enacting a rite of passage both for its hero and for the culture he comes to represent, this last book in the series glows with a timelessness that readers everywhere will find enchanting.<br/><br/>LIBRARY OF AMERICA is an independent nonprofit cultural organization founded in 1979 to preserve our nation’s literary heritage by publishing, and keeping permanently in print, America’s best and most significant writing. The Library of America series includes more than 300 volumes to date, authoritative editions that average 1,000 pages in length, feature cloth covers, sewn bindings, and ribbon markers, and are printed on premium acid-free paper that will last for centuries.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/02/19/9780940450219.jpg', 'title_long': 'The Leatherstocking Tales, Vol. 2: The Pathfinder / The Deerslayer', 'dimensions': 'Height: 8.14 Inches, Length: 5.07 Inches, Weight: 1.52559885304 Pounds, Width: 1.3 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.07}, 'width': {'unit': 'inches', 'value': 1.3}, 'weight': {'unit': 'pounds', 'value': 1.52559885304}, 'height': {'unit': 'inches', 'value': 8.14}}, 'pages': 1051, 'date_published': '1985-07-01', 'subjects': ['Literature & Fiction', 'Classics', 'Genre Fiction', 'Historical', 'Westerns', 'Action & Adventure', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors': ['James Fenimore Cooper'], 'title': 'The Leatherstocking Tales, Vol. 2: The Pathfinder / The Deerslayer', 'isbn13': '9780940450219', 'msrp': 40, 'binding': 'Hardcover', 'related': {'ePub': '1598532235'}, 'isbn': '0940450216', 'isbn10': '0940450216', 'other_isbns': [{'isbn': '9781598532234', 'binding': 'printisbn'}]}}