{'book': {'publisher': 'Library of America', 'synopsis': 'In the three novels collected in this Library of America volume, Mark Twain turned his comic genius to a period that fascinated and repelled him in equal measure: medieval and Renaissance Europe. This lost world of stately pomp and unspeakable cruelty, artistic splendor and abysmal ignorance—the seeming opposite of brashly optimistic, commercial, democratic nineteenth-century America—engaged Twain’s imagination, inspiring a children’s classic, and astonishing fantasy of comedy and violence, and an unusual fictional biography.<br/><br/>Twain drew on his fascination with impersonation and the theme of the double in The Prince and the Pauper (1882), which brilliantly uses the device of identical boys from opposite ends of the social hierarchy to evoke the tumultuous contrasts of Henry VIII’s England. As the pauper Tom Canty is raised to the throne, while the rightful heir is cast out among thieves and beggars, Twain sustains one of his most compelling narratives. A perennial children’s favorite, the novel brings an impassioned American point of view to the injustices of traditional European society.<br/><br/>A Connecticut Yankee in King Arthur’s Court (1889) finds Twain in high satiric form. When hard-headed Yankee mechanic Hank Morgan is knocked out in a fight, he wakes up in Camelot in A.D. 528—and finds himself pitted against the medieval rituals and superstitions of King Arthur and his knights. In a hilarious burlesque of the age of chivalry and of its cult in the nineteenth-century American South, Twain demolishes knighthood’s romantic aura to reveal a brutish, violent society beset by ignorance. But the comic mood gives way to a darker questioning of both ancient and modern society, culminating in an astonishing apocalyptic conclusion that questions both American progress and Yankee “ingenuity” as Camelot is undone by the introduction of advanced technology.<br/><br/>“Taking into account . . . her origin, youth, sex, illiteracy, early environment, and the obstructing conditions under which she exploited her high gifts and made her conquest in the field and before the courts that tried her for her life—she is easily and by far the most extraordinary person the human race has ever known.” So Twain wrote of the heroine of Personal Recollections of Joan of Arc (1896), his most elaborate work of historical reconstruction. A respectful and richly detailed chronicle, by turns admiring and indignant, Joan of Arc opens a fascinating window onto the moral imagination of America’s greatest comic writer.<br/><br/>LIBRARY OF AMERICA is an independent nonprofit cultural organization founded in 1979 to preserve our nation’s literary heritage by publishing, and keeping permanently in print, America’s best and most significant writing. The Library of America series includes more than 300 volumes to date, authoritative editions that average 1,000 pages in length, feature cloth covers, sewn bindings, and ribbon markers, and are printed on premium acid-free paper that will last for centuries.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/08/20/9780940450820.jpg', 'title_long': "Mark Twain : Historical Romances : Prince & the Pauper / Connecticut Yankee in King Arthur's Court / Personal Recollections of Joan of Arc (Library of America)", 'edition': 'New Edition', 'dimensions': 'Height: 8.16 Inches, Length: 5.13 Inches, Weight: 1.46166479706 Pounds, Width: 1.34 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.13}, 'width': {'unit': 'inches', 'value': 1.34}, 'weight': {'unit': 'pounds', 'value': 1.46166479706}, 'height': {'unit': 'inches', 'value': 8.16}}, 'pages': 1050, 'date_published': '1994-08-01', 'subjects': ['Christian Books & Bibles', 'Literature & Fiction', 'Romance', 'Dramas & Plays', 'Comedy', 'Genre Fiction', 'Historical', 'Short Stories & Anthologies', 'Anthologies', 'United States', 'Humor', 'Humor & Satire', 'Satire', 'Humorous', 'Literary'], 'authors': ['Mark Twain'], 'title': "Mark Twain : Historical Romances : Prince & the Pauper / Connecticut Yankee in King Arthur's Court / Personal Recollections of Joan of Arc (Library of America)", 'isbn13': '9780940450820', 'msrp': 35, 'binding': 'Hardcover', 'isbn': '0940450828', 'isbn10': '0940450828'}}