{'book': {'publisher': 'Library of America', 'synopsis': 'In this Library of America volume are the brilliant, engagingly written works of the early and middle years of William James, a member of America’s most illustrious intellectual family. Widely acclaimed as the country’s foremost philosopher, the first of its psychologists, and a champion of religious pluralism, his influence on American thought is as strong now as it has ever been.<br/><br/>James’s emphasis on the creative power of faith, will, and action, his opening up of philosophy to the fresh air of ordinary experience, his fascination with alternative forms of belief and states of consciousness, and his impatience with dogmas of any kind all make him a defender of individual experience and earn him a place beside Emerson and Whitman as an exponent of American democratic culture.<br/><br/>Psychology: Briefer Course (1892) is far more than a shortened version of his monumental Principles of Psychology. It significantly revises parts of the earlier work and adds important new materials. (Students liked to call the longer book “James” and the shorter one “Jimmy.”) James’s new psychology moved away from discussions of the soul, morality, and logic, and focused instead on instinct, will, and the importance of action and habit. Passages comparing human consciousness to “a wonderful stream” inspired the “stream of consciousness” in the future work of Joyce, Woolf, and Gertrude Stein, a student of James’s at Harvard.<br/><br/>The Will to Believe and Other Essays in Popular Philosophy (1897) advances the argument that each of us has the right to believe in hypotheses that are not susceptible to proof, and that such beliefs might actually change the world. The conversational style of theses essays reflects their origin in public lectures, as well as James’s conviction that truth can be discovered as much in the course of everyday life as in the activities of science or of philosophical speculation.<br/><br/>Talks to Teachers and to Students (1899), also drawn from lectures, helped transform the emerging science of education. Here James applies his new psychology to classroom theory and conduct, especially for the primary grades. This immensely influential book has never gone out of print. It emphasizes the role in learning of instinct, play, and habit, along with the importance of engaging the voluntary interests of students. James’s warm and sympathetic nature informs his treatment of children, who can best be taught by those who respect the child’s autonomy and who avoid what he calls “hammering in.”<br/><br/>“Human Immortality” (1897) defends the possibility of life after death; eight more of James’s most important essays round out this volume devoted to a writer called by John Dewey, “almost a Columbus of the inner world.”<br/><br/>LIBRARY OF AMERICA is an independent nonprofit cultural organization founded in 1979 to preserve our nation’s literary heritage by publishing, and keeping permanently in print, America’s best and most significant writing. The Library of America series includes more than 300 volumes to date, authoritative editions that average 1,000 pages in length, feature cloth covers, sewn bindings, and ribbon markers, and are printed on premium acid-free paper that will last for centuries.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/07/21/9780940450721.jpg', 'title_long': 'Writings 1878 - 1899, Writings 1902 - 1910 (2 volumes)', 'edition': 'First Edition', 'dimensions': 'Height: 8.15 Inches, Length: 5.14 Inches, Weight: 0.00220462262 Pounds, Width: 1.48 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.14}, 'width': {'unit': 'inches', 'value': 1.48}, 'weight': {'unit': 'pounds', 'value': 0.00220462262}, 'height': {'unit': 'inches', 'value': 8.15}}, 'pages': 1212, 'date_published': '1992', 'subjects': ['Christian Books & Bibles', 'Christian Living', 'Self Help', 'Theology', 'Literature & Fiction', 'Essays & Correspondence', 'Essays', 'Short Stories & Anthologies', 'Anthologies', 'United States', 'Religion & Spirituality', 'Politics & Social Sciences', 'Philosophy', 'Movements', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['William James'], 'title': 'Writings 1878 - 1899, Writings 1902 - 1910 (2 volumes)', 'isbn13': '9780940450721', 'msrp': 25.9, 'binding': 'Hardcover', 'isbn': '0940450720', 'isbn10': '0940450720'}}