{'book': {'publisher': 'Pragmatic Bookshelf', 'synopsis': 'Rails is a full-stack, open source web framework that enables you to create full-featured, sophisticated web-based applications, but with a twist... A full Rails application probably has less total code than the XML you\'d need to configure the same application in other frameworks.With this book you\'ll learn how to use ActiveRecord to connect business objects and database tables. No more painful object-relational mapping. Just create your business objects and let Rails do the rest. You\'ll learn how to use the Action Pack framework to route incoming requests and render pages using easy-to-write templates and components. See how to exploit the Rails service frameworks to send emails, implement web services, and create dynamic, user-centric web-pages using built-in Javascript and Ajax support. There are extensive chapters on testing, deployment, and scaling.You\'ll see how easy it is to install Rails using your web server of choice (such as Apache or lighttpd) or using its own included web server. You\'ll be writing applications that work with your favorite database (MySQL, Oracle, Postgres, and more) in no time at all.You\'ll create a complete online store application in the extended tutorial section, so you\'ll see how a full Rails application is developed---iteratively and rapidly.Rails strives to honor the Pragmatic Programmer\'s "DRY Principle" by avoiding the extra work of configuration files and code annotations. You can develop in real-time: make a change, and watch it work immediately.Forget XML. Everything in Rails, from templates to control flow to business logic, is written in Ruby, the language of choice for programmers who like to get the job done well (and leave work on time for a change).Rails is the framework of choice for the new generation of Web 2.0 developers. Agile Web Development with Rails is the book for that generation, written by Dave Thomas (Pragmatic Programmer and author of Programming Ruby) and David Heinemeier Hansson, who created Rails.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/40/07/9780976694007.jpg', 'title_long': 'Agile Web Development with Rails: A Pragmatic Guide (Pragmatic Programmers)', 'edition': '1', 'dimensions': 'Height: 9 Inches, Length: 7.5 Inches, Weight: 1.873929227 Pounds, Width: 1.05 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.5}, 'width': {'unit': 'inches', 'value': 1.05}, 'weight': {'unit': 'pounds', 'value': 1.873929227}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 450, 'date_published': '2005-08-07', 'subjects': ['Computers & Technology', 'Business Technology', 'Networking & Cloud Computing', 'Data in the Enterprise', 'Internet, Groupware, & Telecommunications', 'Intranets & Extranets', 'Programming', 'Software Design, Testing & Engineering', 'Microsoft Programming', 'Web Development & Design', 'Web Design', 'Internet & Social Media', 'Security & Encryption', 'Privacy & Online Safety', 'Self Service', 'Custom Stores', 'Specialty Boutique', 'New, Used & Rental Textbooks'], 'authors': ['Dave Thomas', 'David Heinemeier Hansson', 'Leon Breedt', 'Mike Clark', 'Thomas Fuchs', 'Andrea Schwarz'], 'title': 'Agile Web Development with Rails: A Pragmatic Guide (Pragmatic Programmers)', 'isbn13': '9780976694007', 'msrp': 34.95, 'binding': 'Paperback', 'isbn': '097669400X', 'isbn10': '097669400X'}}