{'book': {'publisher': 'Vintage', 'synopsis': "From the Nobel Prize winner and acclaimed author of My Name is Red—a brilliantly unconventional mystery of a missing wife, and a provocative meditation on identity.<br/><br/>“A glorious flight of dark, fantastic invention.” —The Washington Post<br/><br/>Galip is a lawyer living in Istanbul. His wife, the detective novel–loving Ruya, has disappeared. Could she have left him for her ex-husband or Celâl, a popular newspaper columnist? But Celâl, too, seems to have vanished. As Galip investigates, he finds himself assuming the enviable Celâl's identity, wearing his clothes, answering his phone calls, even writing his columns. Galip pursues every conceivable clue, but the nature of the mystery keeps changing, and when he receives a death threat, he begins to fear the worst.<br/><br/>With its cascade of beguiling stories about Istanbul, The Black Book is a brilliantly unconventional mystery, and a provocative meditation on identity. For Turkish literary readers it is the cherished cult novel in which Orhan Pamuk found his original voice, but it has largely been neglected by English-language readers. Now, in Maureen Freely’s beautiful translation, they, too, may encounter all its riches.<br/><br/>A Translation and Afterword by Maureen Freely", 'language': 'en', 'image': 'https://images.isbndb.com/covers/86/53/9781400078653.jpg', 'title_long': 'The Black Book', 'edition': 'Reprint,Translation', 'dimensions': 'Height: 7.97 Inches, Length: 5.18 Inches, Weight: 0.78 Pounds, Width: 0.98 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.18}, 'width': {'unit': 'inches', 'value': 0.98}, 'weight': {'unit': 'pounds', 'value': 0.78}, 'height': {'unit': 'inches', 'value': 7.97}}, 'pages': 466, 'date_published': '2006-07-11', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Psychological', 'Contemporary', 'Literary', 'Mystery, Thriller & Suspense', 'Mystery', 'International Mystery & Crime', 'Thrillers & Suspense', 'Psychological Thrillers', 'Crime', 'Self Service', 'Custom Stores'], 'authors': ['Orhan Pamuk'], 'title': 'The Black Book', 'isbn13': '9781400078653', 'msrp': 16.95, 'binding': 'Paperback', 'isbn': '1400078652', 'isbn10': '1400078652'}}