{'book': {'publisher': 'Random House', 'synopsis': 'Warrior, statesman, peacemaker–few world leaders have had as dramatic and pivotal a life story as Ariel Sharon. And as this riveting new biography shows, perhaps no modern leader’s life has been as tightly woven into the history of his nation.<br/><br/>Born in 1928 and raised in spartan circumstances on a kibbutz, Ariel Sharon was taught by his parents to take principled stands and then to plow ahead, to “always go see what lies over the next hill.” And for decades to come, Sharon would do just that, forging a life of strength, resilience, and sometimes, according to his detractors, reckless and embittered action, indifferent to the violence it unleashed on his enemies.<br/><br/>Based on unprecedented access to many of the key players in Sharon’s life, hundreds of interviews, and thousands of pages of documents, Ariel Sharon presents a leader who was first and foremost a military man. Sharon fought in Israel’s War of Independence (in which he was left for dead on the battlefield); assembled Israel’s first special forces brigade, the wild Unit 101; and led the Lebanon War, the most controversial campaign in Israel’s history. As a general, he directed military campaigns that are still studied in military academies across the world.<br/><br/>Yet Sharon was also a political animal. This book explores his fraught relationships with prime ministers David Ben-Gurion and Yitzhak Rabin, as well as with legendary minister of defense Moshe Dayan; Sharon’s removal as defense minister after the massacre in the Palestinian refugee camps in Sabra and Shatila; his thirty-year championing of the settlement movement in Gaza and the West Bank; his visit to the Temple Mount in 2000, which lit the fuse for the second Intifada; and his startling decision as prime minister to initiate “disengagement,” uprooting settlers, destroying settlements, and dividing his country.<br/><br/>Sharon’s personal life has been equally tumultuous and dramatic, as this book grippingly recounts–his first wife, Margalit, was killed in a car accident; his eldest son, Gur, wounded by an accidental rifle discharge, died in his arms. His second wife, Lily (Margalit’s younger sister), died of cancer, concluding one of the great love stories of Israeli public life. And ultimately came the stroke that felled Sharon, removing him from power at a time when the Israeli people needed his leadership most.<br/><br/>Often mired in controversy and scandal, Sharon was a man of inscrutable character, and his epochal life and elusive personality are both vividly portrayed in this book. Sharon was fueled by a rare combination of qualities: courage, love of power, unbridled tenacity, pragmatism, and, above all, a creed that never changed–complete and uncondtional security for Jews.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/58/75/9781400065875.jpg', 'title_long': 'Ariel Sharon: A Life', 'edition': 'First Edition', 'dimensions': 'Height: 9.5 Inches, Length: 6.55 Inches, Weight: 2.14 Pounds, Width: 1.61 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.55}, 'width': {'unit': 'inches', 'value': 1.61}, 'weight': {'unit': 'pounds', 'value': 2.14}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 512, 'date_published': '2006-10-03', 'subjects': ['Biographies & Memoirs', 'Leaders & Notable People', 'Presidents & Heads of State'], 'authors': ['Nir Hefez', 'Gadi Bloom'], 'title': 'Ariel Sharon: A Life', 'isbn13': '9781400065875', 'msrp': 29.95, 'binding': 'Hardcover', 'isbn': '1400065879', 'isbn10': '1400065879'}}