{'book': {'publisher': 'Vintage Crime/Black Lizard', 'synopsis': 'Miami homicide detective Hoke Moseley is called to a posh Miami neighborhood to investigate a lethal overdose. There he meets the alluring stepmother of the decedant, and begins to wonder about dating a witness. Meanwile, he has been threatened with suspension by his ambitious new chief unless he leaves his beloved, if squalid, suite at the El Dorado Hotel, and moves downtown. With free housing hard to come by, Hoke is desperate to find a new place to live. His difficulties are only amplified by an assignment to re-investigate fifty unsolved murders, the unexpected arrival of his two teenage daughters, and a partner struggling with an unwanted pregnancy. With few options and even fewer dollars, he decides that the suspicious and beautiful stepmother of the dead junkie might be a compromised solution to all of his problems.<br/><br/>Packed with atmosphere and humor, New Hope for the Dead is a classic murder mystery by one of the true masters of the genre. Now back in print, Charles Willeford’s tour de force is an irresistible invitation to become acquainted with one of the greatest detective characters of all time.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/24/95/9781400032495.jpg', 'title_long': 'New Hope for the Dead', 'edition': 'Reprint', 'dimensions': 'Height: 7.9 Inches, Length: 5.24 Inches, Weight: 0.44 Pounds, Width: 0.6 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.24}, 'width': {'unit': 'inches', 'value': 0.6}, 'weight': {'unit': 'pounds', 'value': 0.44}, 'height': {'unit': 'inches', 'value': 7.9}}, 'pages': 256, 'date_published': '2004-08-10', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Literary', 'Mystery, Thriller & Suspense', 'Mystery', 'Hard-Boiled', 'Thrillers & Suspense', 'Suspense', 'Teen & Young Adult', 'Self Service', 'Custom Stores'], 'authors': ['Charles Willeford'], 'title': 'New Hope for the Dead', 'isbn13': '9781400032495', 'msrp': 1.99, 'binding': 'Paperback', 'related': {'ePub': '0307488705'}, 'isbn': '1400032490', 'isbn10': '1400032490', 'other_isbns': [{'isbn': '9780307488701', 'binding': 'printisbn'}]}}