{'book': {'publisher': 'Random House Inc', 'synopsis': "From Publishers Weekly      Humorist Notaro (The Idiot Girls' Action-Adventure Club, etc.) transitions to fiction with a comic mix of wife lit and smalltown suspense. When Maye Roberts's husband, Charlie, gets a tenure-track job at prestigious Spaulding University, childless, 30-something Maye leaves her tight-knit group of friends and job as a Phoenix reporter to move to the school's eponymous Washington State burg. While Charlie fits in easily, Maye, after a faculty dinner run-in with Dean Spaulding's wife, Rowena, feels lonely and bored. When she learns about the Sewer Pipe Queen pageant, a local tradition that guarantees the winner a town full of friends, she enters with her singing dog, inflaming Rowena further. As tensions thicken, Maye's rather notorious pageant sponsor, Ruby, may hold the key to Rowena's continuing rage and to the decades-old incident that sparked it. Though some of the plot falls flat, Notaro makes Maye's perspective strong enough to hold the story together, and the book is filled with the same winningly acerbic riffs that drive Notaro's popular essays. (June) Copyright © Reed Business Information, a division of Reed Elsevier Inc. All rights reserved.      Product Description      Following her academic husband to a new job in a small college town in Washington, Maye is confronted by the challenges of making new friends and, after a series of missteps, decides to enter the annual Sewer Pipe Queen pageant, a popular local tradition.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/50/11/9781400065011.jpg', 'title_long': "There's a Slight Chance I Might Be Going to Hell", 'dimensions': 'Weight: 1 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 1}}, 'pages': 304, 'date_published': '2007-05-29', 'subjects': ['Literature & Fiction'], 'authors': ['Laurie Notaro'], 'title': "There's a Slight Chance I Might Be Going to Hell", 'isbn13': '9781400065011', 'msrp': '0.00', 'binding': 'Hardcover', 'isbn': '1400065011', 'isbn10': '1400065011'}}