{'book': {'publisher': 'Knopf', 'synopsis': 'Attention bread lovers!In the first of his famous books about Provence, Peter Mayle shared with us news of a bakery in the town of Cavaillon where the baking and appreciation of breads “had been elevated to the status of a minor religion.” Its name: Chez Auzet.Now, several hundred visits later, Mayle has joined forces with Gerard Auzet, the proprietor of this most glorious of Provençal bakeries, to tell us about breadmaking at its finest.Mayle takes us into the baking room to witness the birth of a loaf. We see the master at work–slapping, rolling, squeezing, folding, and twisting dough as he sculpts it into fougasses, bâtards, and boules. Auzet then gives us precise, beautifully illustrated instructions for making sixteen kinds of bread, from the classic baguette to loaves made with such ingredients as bacon, apricots, hazelnuts, garlic, and green and black olives. There are tips galore, the tricks of the trade are revealed, and along the way Mayle relates the delightful history of four generations of Auzet bakers. One of Provence’s oldest and most delicious pleasures is now available at a kitchen near you, thanks to this charming guide. Read, bake, and enjoy.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/47/40/9781400044740.jpg', 'title_long': 'Confessions of a French Baker: Breadmaking Secrets, Tips, and Recipes', 'edition': 'First Edition', 'dimensions': 'Height: 7 Inches, Length: 5.75 Inches, Weight: 0.45 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.45}, 'height': {'unit': 'inches', 'value': 7}}, 'pages': 91, 'date_published': '2005-10-25', 'subjects': ['Cookbooks, Food & Wine', 'Baking', 'Bread', 'Cooking Education & Reference', 'Regional & International', 'European'], 'authors': ['Peter Mayle', 'Gerard Auzet'], 'title': 'Confessions of a French Baker: Breadmaking Secrets, Tips, and Recipes', 'isbn13': '9781400044740', 'msrp': '0.00', 'binding': 'Hardcover', 'isbn': '140004474X', 'isbn10': '140004474X', 'other_isbns': [{'isbn': '9780307494566', 'binding': 'printisbn'}]}}