{'book': {'publisher': 'Crown', 'synopsis': "The fast-paced and gripping true account of the extraordinary construction and spectacular demise of the Key West Railroad—one of the greatest engineering feats ever undertaken, destroyed in one fell swoop by the strongest storm ever to hit U.S. shores.<br/><br/>In 1904, the brilliant and driven entrepreneur Henry Flagler, partner to John D. Rockefeller, dreamed of a railway connecting the island of Key West to the Florida mainland, crossing a staggering 153 miles of open ocean—an engineering challenge beyond even that of the Panama Canal. Many considered the project impossible, but build it they did. The railroad stood as a magnificent achievement for more than twenty-two years, heralded as “the Eighth Wonder of the World,” until its total destruction in 1935's deadly storm of the century.<br/><br/>In Last Train to Paradise, Standiford celebrates this crowning achievement of Gilded Age ambition, bringing to life a sweeping tale of the powerful forces of human ingenuity colliding with the even greater forces of nature’s wrath.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/94/79/9781400049479.jpg', 'title_long': 'Last Train to Paradise: Henry Flagler and the Spectacular Rise and Fall of the Railroad that Crossed an Ocean', 'edition': '41652nd', 'dimensions': 'Height: 7.96 Inches, Length: 5.21 Inches, Weight: 0.55 Pounds, Width: 0.66 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.21}, 'width': {'unit': 'inches', 'value': 0.66}, 'weight': {'unit': 'pounds', 'value': 0.55}, 'height': {'unit': 'inches', 'value': 7.96}}, 'pages': 320, 'date_published': '2003-08-05', 'subjects': ['History', 'Americas', 'United States', 'World', 'Engineering & Transportation', 'Transportation', 'Railroads', 'Science & Math', 'Earth Sciences', 'Atmospheric Sciences', 'Natural Disasters'], 'authors': ['Les Standiford'], 'title': 'Last Train to Paradise: Henry Flagler and the Spectacular Rise and Fall of the Railroad that Crossed an Ocean', 'isbn13': '9781400049479', 'msrp': 12.98, 'binding': 'Paperback', 'isbn': '1400049474', 'isbn10': '1400049474'}}