{'book': {'publisher': 'Anchor', 'synopsis': '"Widely regarded as the nation’s most prestigious awards for short fiction" (The Atlantic Monthly), an exciting selection of the twenty best short stories, with brief essays from each of the three distinguished judges—David Guterson, Diane Johnson, and Jennifer Egan—on their favorite story.<br/><br/>Since its establishment in 1919, the O. Henry Prize stories collection has offered an exciting selection of the best stories published in hundreds of literary magazines every year. Such classic works of American literature as Ernest Hemingway’s The Killers (1927); William Faulkner’s Barn Burning (1939); Carson McCuller’s A Tree. A Rock. A Cloud (1943); Shirley Jackson’s The Lottery (1949); J.D. Salinger’s For Esme with Love and Squalor (1963); John Cheever’s The Country Husband (1956) ; and Flannery O’Conner’s Everything that Rises Must Converge (1963) all were O. Henry Prize stories.<br/><br/>An accomplished new series editor—novelist and short story writer Laura Furman—has read more than a thousand stories to identify the 20 winners, each one a pleasure to read today, each one a potential classic. The O. Henry Prize Stories 2003 also contains brief essays from each of the three distinguished judges on their favorite story, and comments from the prize-winning writers on what inspired their stories. There is nothing like the ever rich, surprising, and original O. Henry collection for enjoying the contemporary short story.<br/><br/>The Thing in the Forest A. S. Byatt<br/>The Shell Collector Anthony Doerr<br/>Burn Your Maps Robyn Jay Leff<br/>Lush Bradford Morrow<br/>God’s Goodness Marjorie Kemper<br/>Bleed Blue in Indonesia Adam Desnoyers<br/>The Story Edith Pearlman<br/>Swept Away T. Coraghessan Boyle<br/>Meanwhile Ann Harleman<br/>Three Days. A Month. More. Douglas Light<br/>The High Road Joan Silber<br/>Election Eve Evan S. Connell<br/>Irish Girl Tim Johnston<br/>What Went Wrong Tim O’Brien<br/>The American Embassy Chimamanda Ngozi Adichie<br/>Kissing William Kittredge<br/>Sacred Statues William Trevor<br/>Two Words Molly Giles<br/>Fathers Alice Munro<br/>Train Dreams Denis Johnson', 'language': 'en', 'image': 'https://images.isbndb.com/covers/13/13/9781400031313.jpg', 'title_long': 'The O. Henry Prize Stories 2003 (The O. Henry Prize Collection)', 'edition': 'First Edition', 'dimensions': 'Height: 8.5 Inches, Length: 5.5 Inches, Weight: 1.00089866948 Pounds, Width: 0.88 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.88}, 'weight': {'unit': 'pounds', 'value': 1.00089866948}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 384, 'date_published': '2003-09-09', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'History & Criticism', 'Criticism & Theory', 'Movements & Periods', 'Genres & Styles', 'Short Stories & Anthologies', 'Anthologies', 'United States', 'Literary', 'Reference', 'Writing, Research & Publishing Guides', 'Writing', 'Self Service', 'Custom Stores'], 'authors': [], 'title': 'The O. Henry Prize Stories 2003 (The O. Henry Prize Collection)', 'isbn13': '9781400031313', 'msrp': 15, 'binding': 'Paperback', 'isbn': '1400031311', 'isbn10': '1400031311'}}