{'book': {'publisher': 'Tantor Audio', 'synopsis': 'Following the best-selling triumph of Kafka on the Shore-"daringly original," wrote Steven Moore in The Washington Post Book World, "and compulsively readable"-comes a collection that generously expresses Murakami\'s mastery. From the surreal to the mundane, these stories exhibit his ability to transform the full range of human experience in ways that are instructive, surprising, and relentlessly entertaining. As Richard Eder has written in the Los Angeles Times Book Review, "He addresses the fantastic and the natural, each with the same mix of gravity and lightness." Here are animated crows, a criminal monkey, and an iceman, as well as the dreams that shape us and the things we might wish for. Whether during a chance reunion in Italy, a romantic exile in Greece, a holiday in Hawaii, or in the grip of everyday life, Murakami\'s characters confront grievous loss, or sexuality, or the glow of a firefly, or the impossible distances between those who ought to be the closest of all. "While anyone can tell a story that resembles a dream," Laura Miller wrote in The New York Times Book Review, "it\'s the rare artist, like this one, who can make us feel that we are dreaming it ourselves"-a feat performed anew twenty-four times in this career-spanning book.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/29/52/9781400102952.jpg', 'title_long': 'Blind Willow, Sleeping Woman: 24 Stories', 'edition': 'Unabridged', 'dimensions': 'Height: 5.48 Inches, Length: 6.54 Inches, Weight: 0.59083886216 Pounds, Width: 1.1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.54}, 'width': {'unit': 'inches', 'value': 1.1}, 'weight': {'unit': 'pounds', 'value': 0.59083886216}, 'height': {'unit': 'inches', 'value': 5.48}}, 'date_published': '2006-10-15', 'subjects': ['Literature & Fiction', 'Short Stories & Anthologies', 'Short Stories', 'Contemporary'], 'authors': ['Haruki Murakami'], 'title': 'Blind Willow, Sleeping Woman: 24 Stories', 'isbn13': '9781400102952', 'msrp': 37.99, 'binding': 'Audio CD', 'isbn': '1400102952', 'isbn10': '1400102952'}}