{'book': {'publisher': 'Random House', 'synopsis': 'The American Gospel–literally, the good news about America–is that religion shapes our public life without controlling it. In this vivid book, New York Times bestselling author Jon Meacham tells the human story of how the Founding Fathers viewed faith, and how they ultimately created a nation in which belief in God is a matter of choice.<br/><br/>At a time when our country seems divided by extremism, American Gospel draws on the past to offer a new perspective. Meacham re-creates the fascinating history of a nation grappling with religion and politics–from John Winthrop’s “city on a hill” sermon to Thomas Jefferson’s Declaration of Independence; from the Revolution to the Civil War; from a proposed nineteenth-century Christian Amendment to the Constitution to Martin Luther King, Jr.’s call for civil rights; from George Washington to Ronald Reagan.<br/><br/>Debates about religion and politics are often more divisive than illuminating. Secularists point to a “wall of separation between church and state,” while many conservatives act as though the Founding Fathers were apostles in knee britches. As Meacham shows in this brisk narrative, neither extreme has it right. At the heart of the American experiment lies the God of what Benjamin Franklin called “public religion,” a God who invests all human beings with inalienable rights while protecting private religion from government interference. It is a great American balancing act, and it has served us well.<br/><br/>Meacham has written and spoken extensively about religion and politics, and he brings historical authority and a sense of hope to the issue. American Gospel makes it compellingly clear that the nation’s best chance of summoning what Lincoln called “the better angels of our nature” lies in recovering the spirit and sense of the Founding. In looking back, we may find the light to lead us forward.<br/><br/>“In his American Gospel, Jon Meacham provides a refreshingly clear, balanced, and wise historical portrait of religion and American politics at exactly the moment when such fairness and understanding are much needed. Anyone who doubts the relevance of history to our own time has only to read this exceptional book.”–David McCullough, author of 1776<br/><br/>“Jon Meacham has given us an insightful and eloquent account of the spiritual foundation of the early days of the American republic. It is especially instructive reading at a time when the nation is at once engaged in and deeply divided on the question of religion and its place in public life.”–Tom Brokaw, author of The Greatest Generation<br/><br/>“An absorbing narrative full of vivid characters and fresh thinking, American Gospel tells how the Founding Fathers–and their successors–struggled with their own religious and political convictions to work out the basic structure for freedom of religion. For me this book was nonstop reading.”–Elaine Pagels, professor of religion, Princeton University, author of Beyond Belief: The Secret Gospel of Thomas<br/><br/>“Jon Meacham is one of our country’s most brilliant thinkers about religion’s impact on American society. In this scintillating and provocative book, Meacham reveals the often-hidden influence of religious belief on the Founding Fathers and on later generations of American citizens and leaders up to our own. Today, as we argue more strenuously than ever about the proper place of religion in our politics and the rest of American life, Meacham’s important book should serve as the touchstone of the debate.”<br/>–Michael Beschloss, author of The Conquerors<br/><br/>“At a time when faith and freedom seem increasingly polarized, American Gospel recovers our vital center–the middle ground where, historically, religion and public life strike a delicate balance. Well researched, well written, inspiring, and persuasive, this is a welcome addition to the literature.”–Jonathan D. Sarna, Joseph H. & Belle R. Braun Professor of American Jewish History, Brandeis University, author of American Judaism: A History', 'language': 'en', 'image': 'https://images.isbndb.com/covers/55/54/9781400065554.jpg', 'title_long': 'American Gospel: God, the Founding Fathers, and the Making of a Nation', 'dimensions': 'Height: 8.54 Inches, Length: 5.95 Inches, Weight: 1.27 Pounds, Width: 1.21 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.95}, 'width': {'unit': 'inches', 'value': 1.21}, 'weight': {'unit': 'pounds', 'value': 1.27}, 'height': {'unit': 'inches', 'value': 8.54}}, 'pages': 416, 'date_published': '2006-04-04', 'subjects': ['History', 'Americas', 'United States', 'World', 'Religious', 'Religion & Spirituality', 'Religious Studies', 'Church & State'], 'authors': ['Jon Meacham'], 'title': 'American Gospel: God, the Founding Fathers, and the Making of a Nation', 'isbn13': '9781400065554', 'msrp': 23.95, 'binding': 'Hardcover', 'isbn': '1400065550', 'isbn10': '1400065550', 'other_isbns': [{'isbn': '9781588365774', 'binding': 'e'}]}}