{'book': {'publisher': 'WaterBrook', 'synopsis': 'Unique insights from an atheist’s Sunday-morning odyssey<br/><br/>When Hemant Mehta was a teenager he stopped believing in God, but he never lost his interest in religion. Mehta is “the eBay atheist,” the nonbeliever who auctioned off the opportunity for the winning bidder to send him to church. The auction winner was Jim Henderson, a former pastor and author of Evangelism Without Additives. Since then, Mehta has visited a variety of church services–posting his insightful critiques on the Internet and spawning a positive, ongoing dialogue between atheists and believers.<br/><br/>I Sold My Soul on eBay tells how and why Mehta became an atheist and features his latest church critiques, including descriptions of his visits to some of the best-known churches in the country. His observations will surprise and challenge you, revealing how the church comes across to those outside the faith. Who better than a nonbeliever to offer an eye-opening assessment of how the gospel is being presented–and the elements that enhance or detract from the presentation.<br/><br/>Mehta announced prior to his churchgoing odyssey that he would watch for any signs of God’s existence. After spending Sunday mornings in some of the nation’s leading churches, what happened to the man who sold his soul on eBay? Did attending church change his lack of belief? The answers can be found inside.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/34/74/9781400073474.jpg', 'title_long': "I Sold My Soul on eBay: Viewing Faith through an Atheist's Eyes", 'edition': 'First Edition', 'dimensions': 'Height: 8.2 Inches, Length: 5.5 Inches, Weight: 0.52029093832 Pounds, Width: 0.53 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.53}, 'weight': {'unit': 'pounds', 'value': 0.52029093832}, 'height': {'unit': 'inches', 'value': 8.2}}, 'pages': 224, 'date_published': '2007-04-17', 'subjects': ['Christian Books & Bibles', 'Christian Living', 'Faith', 'Ministry & Evangelism', 'Evangelism', 'Theology', 'Apologetics', 'Religion & Spirituality', 'New Age & Spirituality', 'Worship & Devotion', 'Atheism'], 'authors': ['Hemant Mehta'], 'title': "I Sold My Soul on eBay: Viewing Faith through an Atheist's Eyes", 'isbn13': '9781400073474', 'msrp': 13.99, 'binding': 'Paperback', 'related': {'ePub': '0307499499'}, 'isbn': '1400073472', 'isbn10': '1400073472', 'other_isbns': [{'isbn': '9780307499493', 'binding': 'printisbn'}]}}