{'book': {'publisher': 'Alfred A. Knopf', 'synopsis': 'A masterly, haunting new novel from a writer heralded by The Washington Post Book World as “the 21st-century daughter of Chinua Achebe,” Half of a Yellow Sun re-creates a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed.<br/><br/>With astonishing empathy and the effortless grace of a natural storyteller, Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of the decade. Thirteen-year-old Ugwu is employed as a houseboy for a university professor full of revolutionary zeal. Olanna is the professor’s beautiful mistress, who has abandoned her life of privilege in Lagos for a dusty university town and the charisma of her new lover. And Richard is a shy young Englishman in thrall to Olanna’s twin sister, an enigmatic figure who refuses to belong to anyone. As Nigerian troops advance and the three must run for their lives, their ideals are severely tested, as are their loyalties to one another.<br/><br/>Epic, ambitious, and triumphantly realized, Half of a Yellow Sun is a remarkable novel about moral responsibility, about the end of colonialism, about ethnic allegiances, about class and race—and the ways in which love can complicate them all. Adichie brilliantly evokes the promise and the devastating disappointments that marked this time and place, bringing us one of the most powerful, dramatic, and intensely emotional pictures of modern Africa that we have ever had.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/41/60/9781400044160.jpg', 'title_long': 'Half of a Yellow Sun', 'edition': 'First Edition', 'dimensions': 'Height: 9.5 Inches, Length: 6.6 Inches, Weight: 1.73 Pounds, Width: 1.37 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.6}, 'width': {'unit': 'inches', 'value': 1.37}, 'weight': {'unit': 'pounds', 'value': 1.73}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 448, 'date_published': '2006-09-12', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Historical', 'Political', 'War', 'World Literature', 'African', 'United States', 'Contemporary', 'Literary'], 'authors': ['Chimamanda Ngozi Adichie'], 'title': 'Half of a Yellow Sun', 'isbn13': '9781400044160', 'msrp': 29.95, 'binding': 'Hardcover', 'isbn': '1400044162', 'isbn10': '1400044162'}}