{'book': {'publisher': "Everyman's Library", 'synopsis': 'From one of the most brilliant and influential thinkers of the twentieth century and a Nobel Prize-winning author: two novels, six short stories, and a pair of essays in a single volume that deploy his lyric eloquence in defense against despair.<br/><br/>In both his essays and his fiction, Albert Camus (1913—1960) provides an affirmation of the brave assertion of humanity in the face of a universe devoid of order or meaning.<br/><br/>The Plague—written in 1947 and still profoundly relevant—is a riveting tale of horror, survival, and resilience in the face of a devastating epidemic. The Fall (1956), which takes the form of an astonishing confession by a French lawyer in a seedy Amsterdam bar, is a haunting parable of modern conscience in the face of evil. The six stories of Exile and the Kingdom (1957) represent Camus at the height of his narrative powers, masterfully depicting his characters—from a renegade missionary to an adulterous wife—at decisive moments of revelation. Set beside their fictional counterparts, Camus’s famous essays “The Myth of Sisyphus” and “Reflections on the Guillotine” are all the more powerful and philosophically daring, confirming his towering place in twentieth-century thought.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/25/55/9781400042555.jpg', 'title_long': "The Plague, The Fall, Exile and the Kingdom, and Selected Essays (Everyman's Library)", 'edition': 'First Edition', 'dimensions': 'Height: 8.3 Inches, Length: 5.4 Inches, Weight: 1.5652820602 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.4}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 1.5652820602}, 'height': {'unit': 'inches', 'value': 8.3}}, 'pages': 696, 'date_published': '2004-08-17', 'subjects': ['Literature & Fiction', 'Classics', 'Genre Fiction', 'Short Stories & Anthologies', 'Anthologies', 'Short Stories', 'World Literature', 'European', 'Contemporary', 'Literary', 'Self Service', 'Custom Stores'], 'authors': ['Albert Camus'], 'title': "The Plague, The Fall, Exile and the Kingdom, and Selected Essays (Everyman's Library)", 'isbn13': '9781400042555', 'msrp': 26, 'binding': 'Hardcover', 'isbn': '1400042550', 'isbn10': '1400042550'}}