{'book': {'publisher': 'Knopf', 'synopsis': 'From the author of the classic study of the aviation industry, The Sporty Game, a new book that chronicles the high-stakes rivalry between the world’s two largest aircraft manufacturers—companies that will bet the house on a single airplane.<br/><br/>Long one of America’s most successful and admired corporations—and its biggest exporter—Boeing struggled to maintain 50 percent of the market share for commercial aircraft after being overtaken by the European upstart Airbus in the late 1990s. But Airbus did not remain on top for long. By 2006, the company suffered from mismanagement and had adopted the kind of complacent, risk-averse culture that had once characterized its competitor.<br/><br/>Incorporating interviews he conducted throughout the industry—with everyone from company leaders, past and present, and Wall Street analysts to design engineers and factory workers—John Newhouse takes us inside these two firms to help us understand their struggle for supremacy in a business based as much on instinct as on economics. He examines the critical issues that Boeing has faced in recent years, including its difficult merger with McDonnell Douglas, its controversial move from Seattle to Chicago, and a series of corporate scandals that made front-page news. And he analyzes the troubles that have beset a once ascendant Airbus, notably an institutional structure aimed at satisfying the narrowly focused interests of its European stakeholders. Newhouse also explores the problems that now face Boeing and Airbus alike: potential competition from China and Japan, the challenge of serving burgeoning Asian markets, and the need to undo years of mismanagement.<br/><br/>Boeing Versus Airbus is a fascinating, informed, and insightful tale of success, and failure, in the turbulent, do-or-die world of the aircraft industry.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/33/61/9781400043361.jpg', 'title_long': 'Boeing Versus Airbus: The Inside Story of the Greatest International Competition in Business', 'edition': 'First Edition', 'dimensions': 'Height: 9.5 Inches, Length: 6.25 Inches, Weight: 1.2 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.2}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 272, 'date_published': '2007-01-16', 'subjects': ['Business & Money', 'Industries', 'Transportation', 'Engineering & Transportation', 'Aviation'], 'authors': ['John Newhouse'], 'title': 'Boeing Versus Airbus: The Inside Story of the Greatest International Competition in Business', 'isbn13': '9781400043361', 'msrp': '0.00', 'binding': 'Hardcover', 'related': {'ePub': '0307267261'}, 'isbn': '1400043360', 'isbn10': '1400043360', 'other_isbns': [{'isbn': '9780307267269', 'binding': 'printisbn'}]}}