{'book': {'publisher': 'Forum Books', 'synopsis': '“Admirers of FDR credit his New Deal with restoring the American economy after the disastrous contraction of 1929—33. Truth to tell–as Powell demonstrates without a shadow of a doubt–the New Deal hampered recovery from the contraction, prolonged and added to unemployment, and set the stage for ever more intrusive and costly government. Powell’s analysis is thoroughly documented, relying on an impressive variety of popular and academic literature both contemporary and historical.”<br/>–Milton Friedman, Nobel Laureate, Hoover Institution<br/><br/>“There is a critical and often forgotten difference between disaster and tragedy. Disasters happen to us all, no matter what we do. Tragedies are brought upon ourselves by hubris. The Depression of the 1930s would have been a brief disaster if it hadn’t been for the national tragedy of the New Deal. Jim Powell has proven this.”<br/>–P.J. O’Rourke, author of Parliament of Whores and Eat the Rich<br/><br/>“The material laid out in this book desperately needs to be available to a much wider audience than the ranks of professional economists and economic historians, if policy confusion similar to the New Deal is to be avoided in the future.”<br/>–James M. Buchanan, Nobel Laureate, George Mason University<br/><br/>“I found Jim Powell’s book fascinating. I think he has written an important story, one that definitely needs telling.”<br/>–Thomas Fleming, author of The New Dealers’ War<br/><br/>“Jim Powell is one tough-minded historian, willing to let the chips fall where they may. That’s a rare quality these days, hence more valuable than ever. He lets the history do the talking.”<br/>–David Landes, Professor of History Emeritus, Harvard University<br/><br/>“Jim Powell draws together voluminous economic research on the effects of all of Roosevelt’s major policies. Along the way, Powell gives fascinating thumbnail sketches of the major players. The result is a devastating indictment, compellingly told. Those who think that government intervention helped get the U.S. economy out of the depression should read this book.”<br/>–David R. Henderson, editor of The Fortune Encyclopedia of Economics and author of The Joy of Freedom<br/><br/>The Great Depression and the New Deal. For generations, the collective American consciousness has believed that the former ruined the country and the latter saved it. Endless praise has been heaped upon President Franklin Delano Roosevelt for masterfully reining in the Depression’s destructive effects and propping up the<br/>country on his New Deal platform. In fact, FDR has achieved mythical status in American history and is considered to be, along with Washington, Jefferson, and Lincoln, one of the greatest presidents of all time. But would the Great Depression have been so catastrophic had the New Deal never been implemented?<br/><br/>In FDR’s Folly, historian Jim Powell argues that it was in fact the New Deal itself, with its shortsighted programs, that deepened the Great Depression, swelled the federal government, and prevented the country from turning around quickly. You’ll discover in alarming detail how FDR’s federal programs hurt America more than helped it, with effects we still feel today, including:<br/><br/>• How Social Security actually increased unemployment<br/>• How higher taxes undermined good businesses<br/>• How new labor laws threw people out of work<br/>• And much more<br/><br/>This groundbreaking book pulls back the shroud of awe and the cloak of time enveloping FDR to prove convincingly how flawed his economic policies actually were, despite his good intentions and the astounding intellect of his circle of advisers. In today’s turbulent domestic and global environment, eerily similar to that of the 1930s, it’s more important than ever before to uncover and understand the truth of our history, lest we be doomed to repeat it.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/47/70/9781400054770.jpg', 'title_long': "FDR's Folly: How Roosevelt and His New Deal Prolonged the Great Depression", 'edition': 'Reprint', 'dimensions': 'Height: 8 Inches, Length: 5.2 Inches, Weight: 0.6503636729 Pounds, Width: 0.8 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.2}, 'width': {'unit': 'inches', 'value': 0.8}, 'weight': {'unit': 'pounds', 'value': 0.6503636729}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 352, 'date_published': '2004-09-28', 'subjects': ['Biographies & Memoirs', 'Historical', 'United States', 'Leaders & Notable People', 'Military', 'Presidents & Heads of State', 'Business & Money', 'Economics', 'Economic History', 'History', 'Americas'], 'authors': ['Jim Powell'], 'title': "FDR's Folly: How Roosevelt and His New Deal Prolonged the Great Depression", 'isbn13': '9781400054770', 'msrp': 11.99, 'binding': 'Paperback', 'related': {'ePub': '030742071X'}, 'isbn': '140005477X', 'isbn10': '140005477X', 'other_isbns': [{'isbn': '9780307420718', 'binding': 'printisbn'}]}}