{'book': {'publisher': 'Dc Comics', 'synopsis': "The inmates of Arkham Asylum have taken over Gotham's detention center for the criminally insane on April Fool's Day, demanding Batman in exchange for their hostages. Accepting their demented challenge, Batman is forced to endure the personal hells of the Joker, Scarecrow, Poison Ivy, Two-Face and many other sworn enemies in order to save the innocents and retake the prison. During his run through this absurd gauntlet, the Dark Knight's must face down both his most dangerous foes and his inner demons.This is the critically acclaimed Batman story that helped launch the U.S. careers of Grant Morrison and Dave McKean. The classic confrontation between the Dark Knight and his archnemeses, this story is well known for its psychological intensity and probing portraits of Batman and the Joker.ARKHAM ASYLUM includes groundbreaking art that influenced scores of artists by introducing a new school of storytelling and technique to comics. This special edition also includes Morrison's complete original script, annotated by Morrison and editor Karen Berger, many of his original thumbnail breakdowns, step-by-step samples of how the story and art came together and much more.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/42/59/9781401204259.jpg', 'title_long': 'Batman: Arkham Asylum Anniversary Edition', 'edition': '15th Anniversary Edition', 'dimensions': 'Height: 10.11 Inches, Length: 6.66 Inches, Weight: 0.825 Pounds, Width: 0.3 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.66}, 'width': {'unit': 'inches', 'value': 0.3}, 'weight': {'unit': 'pounds', 'value': 0.825}, 'height': {'unit': 'inches', 'value': 10.11}}, 'pages': 216, 'date_published': '2005-11-01', 'subjects': ['Comics & Graphic Novels', 'Graphic Novels', 'Superheroes', 'Publishers', 'DC', 'Science Fiction & Fantasy'], 'authors': ['Grant Morrison'], 'title': 'Batman: Arkham Asylum Anniversary Edition', 'isbn13': '9781401204259', 'msrp': 17.99, 'binding': 'Paperback', 'isbn': '1401204252', 'isbn10': '1401204252'}}