{'book': {'publisher': 'Workman Publishing Company', 'synopsis': "In the beginning there was the Holy Bible<br/>2 Which was a very good book indeed, but so many things happened since the beginning,<br/>3 That Maybe it was time for another bible,<br/>4 So a punk from Philadelphia wrote a new one,<br/>5 And so it is called The Boomer Bible,<br/>6 So there.<br/>7 And Its Past Testament tells the history of the world, including the Book of Greeks, Book of Brits, Book of Yanks, Book of Russkies, and all the other self-proclaimed Chosen Nations,<br/>8 And people sticking each other with pointed sticks, and acting up, which is called civilization,<br/>9 And also about religion and art and movies and literature, and TV, and so forth, which is why there are also the Books of Pnowlege,<br/>10 Including Psongs, Psayings, and Psomethings,<br/>11 Written just like the other Bible but without any big unpronounceable words,<br/>12 So that you and I might truly understand it,<br/>13 For a change.<br/>14 And Its Present Testament tells about the coming of Harry, and The Way of Harry,<br/>15 Who may be the messiah everybody has been waiting for,<br/>16 Unless he really isn't,<br/>17 Which is hard to say,<br/>18 So there.<br/>19 And there is also The Book of Harrier Brayer together with the Harrier Hymnal,<br/>20 And another Testament too,<br/>21 And Concordance, and a lenticular hand on the cover.<br/>22 And It is not for the faint of heart,<br/>23 Or the easily offended,<br/>24 Or the priggish or the prudish,<br/>25 But who cares,<br/>26 Because neither was Candide, or Swift's A Modest Proposal, or Rabelais, or Lenny Bruce<br/>28 Or all the other satires and satirists who felt the need to warn us when we have gone astray,<br/>29 Which we have,<br/>29 Which you'll know all about,<br/>31 If you read your Boomer Bible,<br/>32 Or there.<br/><br/>Over 87,000 copies in print.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/07/56/9781563050756.jpg', 'title_long': 'The Boomer Bible', 'edition': 'Uncorrected Proof', 'dimensions': 'Height: 8.9401396 Inches, Length: 5.999988 Inches, Weight: 1 Pounds, Width: 1.999996 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.999988}, 'width': {'unit': 'inches', 'value': 1.999996}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 8.9401396}}, 'pages': 880, 'date_published': '1991-01-10', 'subjects': ['Humor & Entertainment', 'Humor', 'Parodies'], 'authors': ['R. F. Laird'], 'title': 'The Boomer Bible', 'isbn13': '9781563050756', 'msrp': 14.95, 'binding': 'Paperback', 'isbn': '1563050757', 'isbn10': '1563050757'}}