{'book': {'publisher': 'New City Press', 'synopsis': "'Maria Boulding's version is of a different level of excellence from practically anything else on the market. She has perfected an elegant and flowing style.'<br/>Rowan Williams<br/>Archbishop of Canterbury<br/><br/>The Confessions of Saint Augustine is considered the all time number one Christian classic. It is an extended poetic, passionate, intimate prayer. Augustine was probably forty-three when he began this endeavor. He had been a baptized Catholic for ten years, a priest for six, and a bishop for only two. His pre-baptismal life raised questions in the community. Was his conversion genuine? The first hearers were captivated, as many millions have been over the following sixteen centuries. His experience of God speaks to us across time with little need of transpositions. This new translation masterfully captures his experience.<br/><br/>'So old and yet so new! This contemporary translation of Augustine's Confessions was like meeting an old friend and touching perennial truth, despite the passing years. Augustine was surely larger than life--and this translation matches it.'<br/>Richard Rohr, o.f.m.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/08/41/9781565480841.jpg', 'title_long': 'The Confessions: Works of Saint Augustine, a Translation for the 21st Century: Part 1- Books', 'edition': 'First Edition', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 1.04940036712 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.04940036712}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 416, 'date_published': '2002-12-25', 'subjects': ['Christian Books & Bibles', 'Churches & Church Leadership', 'Church History', 'History', 'World', 'Religious', 'Religion & Spirituality'], 'authors': ['Maria Boulding'], 'title': 'The Confessions: Works of Saint Augustine, a Translation for the 21st Century: Part 1- Books', 'isbn13': '9781565480841', 'msrp': 24.95, 'binding': 'Paperback', 'isbn': '1565480848', 'isbn10': '1565480848'}}