{'book': {'publisher': 'Rowman & Littlefield Publishers', 'synopsis': 'In The Practicing Congregation (Alban, 2004), Diana Butler Bass explored the phenomenon of "intentional congregations," an emerging style of congregational vitality in which churches creatively and intentionally re-appropriate traditional Christian practices such as hospitality, discernment, contemplative prayer, and testimony. Against the steady flow of stories highlighting "mainline decline," The Practicing Congregation suggested that there is a new and often overlooked renaissance occurring in mainline Protestant churches. The success of The Practicing Congregation made it clear that the next step was to provide examples that would illustrate the concepts laid out in that initial work. In From Nomads to Pilgrims, the editors continue to build this narrative, gathering specific stories of congregational vitality and transformation from participants in their research at the Project on Congregations of Intentional Practice, a Lilly Endowment Inc. funded study at Virginia Theological Seminary. Including stories from a variety of faith traditions across the U.S., From Nomads to Pilgrims explores: how intentional congregations develop ; how they negotiate the demands of interpreting traditional Christian practices in a postmodern culture ; how these practices lead to congregational and personal transformation. Each chapter is an instructive case study, illustrating a unique expression of the vitality experienced by a congregation that intentionally reclaims a traditional Christian practice. The pastors who have been involved in these congregations’ stories share their practical wisdom gained through the experience of leading these churches. - how intentional congregations develop - how they negotiate the demands of interpreting traditional Christian practices in a postmodern culture - how these practices lead to congregational and personal transformation.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/32/34/9781566993234.jpg', 'title_long': 'From Nomads to Pilgrims: Stories from Practicing Congregations', 'dimensions': 'Height: 8.51 Inches, Length: 5.54 Inches, Weight: 0.5401325419 Pounds, Width: 0.45 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.54}, 'width': {'unit': 'inches', 'value': 0.45}, 'weight': {'unit': 'pounds', 'value': 0.5401325419}, 'height': {'unit': 'inches', 'value': 8.51}}, 'pages': 179, 'date_published': '2005-12-30', 'subjects': ['Christian Books & Bibles', 'Churches & Church Leadership', 'Church History', 'Church Institutions & Organizations', 'Worship & Devotion', 'History', 'World', 'Religious', 'Religion & Spirituality', 'Ritual'], 'authors': ['Diana Butler Bass', 'J. Stewart-Sicking'], 'title': 'From Nomads to Pilgrims: Stories from Practicing Congregations', 'isbn13': '9781566993234', 'msrp': 23, 'binding': 'Paperback', 'related': {'Page Fidelity': '1566995299', 'eBook': '1566995299'}, 'isbn': '1566993237', 'isbn10': '1566993237', 'other_isbns': [{'isbn': '9781566995290', 'binding': 'print'}]}}