{'book': {'publisher': 'David R. Godine, Publisher', 'synopsis': "An internationally acclaimed and haunting ghost story. “One of the strongest stories of supernatural horror…the work bursts into life and does not flag until the end.”―The Washington Post<br/><br/>Arthur Kipps, a young solicitor, has come north from London to attend the funeral and settle the affairs of Mrs. Alice Drablow of Eel Marsh House. The townspeople are reluctant to share any information about Mrs. Drablow but Kipps soon realizes that there is more to Alice Drablow than he originally thought. At the funeral, he sees a woman dressed in black, with a pale face and dark eyes, whom a group of children are silently watching.<br/><br/>While sorting through Mrs. Drablow’s papers at Eel Marsh House over the course of several days, the routine formalities Kipps anticipates give way to a tumble of events and secrets more sinister and terrifying than any nightmare: the rocking chair in the deserted nursery, the eerie sound of a pony and trap, a child's scream in the fog, and most dreadfully and most tragically for Kipps, the woman in black herself.<br/><br/>First published in 1983, and written in the style of a traditional Gothic novel, The Woman in Black has become a classic novel of supernatural horror.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/18/92/9781567921892.jpg', 'title_long': 'The Woman in Black: A Ghost Story', 'edition': 'Fourth softcover printing', 'dimensions': 'Height: 8.58 Inches, Length: 5.58 Inches, Weight: 0.4 Pounds, Width: 0.41 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.58}, 'width': {'unit': 'inches', 'value': 0.41}, 'weight': {'unit': 'pounds', 'value': 0.4}, 'height': {'unit': 'inches', 'value': 8.58}}, 'pages': 144, 'date_published': '2001-12-01', 'subjects': ["Children's Books", 'Literature & Fiction', 'Genre Fiction', 'Horror', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Supernatural', 'Science Fiction & Fantasy', 'Fantasy', 'Paranormal & Urban', 'Teen & Young Adult'], 'authors': ['Susan Hill'], 'title': 'The Woman in Black: A Ghost Story', 'isbn13': '9781567921892', 'msrp': 15.95, 'binding': 'Paperback', 'isbn': '1567921892', 'isbn10': '1567921892'}}