{'book': {'publisher': 'Verba Mundi', 'synopsis': 'Two thematically-related novellas by Georges Perec in one volume. In each, Perec probes our obsession with society’s trappings―the seductive mass of things that masquerade as stability and meaning.<br/><br/>In Things: A Story of the Sixties, Jerome and Sylvie, a young, upwardly mobile couple lust for the good life, caught between the fantasy of “the film they would have liked to live” and the reality of life’s daily mundanities.<br/><br/>The nameless student in A Man Asleep attempts to purify himself entirely of material desires and ambition. He longs “to want nothing. Just to wait, until there is nothing left to wait for. Just to wander, and to sleep.” Yearning to exist on neutral ground as “a blessed parenthesis,” he discovers something unexpected.<br/><br/>With the American publication of Life: A User’s Manual in 1987, Georges Perec was recognized in the United States as one of this century’s most innovative writers. Things: A Story of the Sixties is accessible, sobering, and deeply involving. Each novel distills Perec’s unerring grasp of the human condition and displays his rare comic talent, detachment, and compassion.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/15/71/9781567921571.jpg', 'title_long': 'Things: A Story of the Sixties and A Man Asleep (Verba Mundi (Paperback))', 'edition': 'Reprint', 'dimensions': 'Height: 8.42 Inches, Length: 5.54 Inches, Weight: 0.57981574906 Pounds, Width: 0.61 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.54}, 'width': {'unit': 'inches', 'value': 0.61}, 'weight': {'unit': 'pounds', 'value': 0.57981574906}, 'height': {'unit': 'inches', 'value': 8.42}}, 'pages': 224, 'date_published': '2010-07-16', 'subjects': ['Comics & Graphic Novels', 'Graphic Novels', 'Literature & Fiction', 'Literary'], 'authors': ['Georges Perec'], 'title': 'Things: A Story of the Sixties and A Man Asleep (Verba Mundi (Paperback))', 'isbn13': '9781567921571', 'msrp': 17.95, 'binding': 'Paperback', 'isbn': '1567921574', 'isbn10': '1567921574'}}