{'book': {'publisher': 'Chaosium Inc.', 'synopsis': 'The Silver Twilight is a secretive, international order dedicated to the destruction of the human race. As brave investigators, you must piece together passages from esoteric books, shards of strange artifacts, and puzzling letters to discover the Silver Twilight s loathsome goals.<br/>Shadows of Yog-Sothoth is a modestly-sized campaign of seven scenarios. During the course of play the investigators penetrate the outer layers of a secret sinister occult organization led by the lords of the Silver Twilight. Beginning in Boston they investigate an organization in New York, run afoul of a coven in Scotland, roam the desert of the American southwest, vacation off the coast of Maine, and explore the mysteries of the South Pacific.<br/>In addition to the campaign, this book includes two bonus scenarios. The People of the Monolith introduces the mysteries of the Cthulhu Mythos, and no harm can come to the investigators except through insanity. As such, is perfect for introducing new players to the wonders of Call of Cthulhu.<br/>The other bonus scenario, The Warren, presents an unsettling challenge for even experienced players.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/17/40/9781568821740.jpg', 'title_long': 'Shadows of Yog-Sothoth: A Global Campaign to Save Mankind (Call of Cthulhu Horror Roleplaying)', 'edition': '2nd', 'dimensions': 'Height: 11 Inches, Length: 8.25 Inches, Weight: 1.10892517786 Pounds, Width: 0.38 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.25}, 'width': {'unit': 'inches', 'value': 0.38}, 'weight': {'unit': 'pounds', 'value': 1.10892517786}, 'height': {'unit': 'inches', 'value': 11}}, 'pages': 144, 'date_published': '2004-08-15', 'subjects': ['Science Fiction & Fantasy', 'Gaming', 'Call of Cthulhu'], 'authors': ['Chaosium Inc', 'Sandy Petersen'], 'title': 'Shadows of Yog-Sothoth: A Global Campaign to Save Mankind (Call of Cthulhu Horror Roleplaying)', 'isbn13': '9781568821740', 'msrp': 23.95, 'binding': 'Paperback', 'isbn': '1568821743', 'isbn10': '1568821743'}}