{'book': {'publisher': 'University of South Carolina Press', 'synopsis': "Assembling letters and notebook entries with articles and reviews written for publication, F. Scott Fitzgerald on Authorship provides Fitzgerald's public and private writings on his trade and craft. The forty-six selections in this volume construct an autobiographical account of Fitzgerald's twenty-year endeavor to maintain careers as a commercial writer and as a literary artist. Offering a clear sense of his seriousness about writing, they correct misconceptions that have impeded a proper assessment of Fitzgerald's professional authorship and distorted his reputation as a man of letters.<br/>In a substantial introduction to the volume, Matthew J. Bruccoli positions Fitzgerald as a case history for the profession-of-authorship approach to American literary history formulated by William Charvat. Bruccoli notes that more is known about the professional life of Fitzgerald than about that of any other major American author, and, drawing on that wealth of information, he challenges familiar myths about Fitzgerald's squandering of fortunes and literary genius. Bruccoli exposes the error of segregating Fitzgerald's magazine and movie work from his novels, suggesting instead that a symbiotic relationship exists among these works and ties them together.<br/>In his own words, Fitzgerald corrects the most condescending and irksome notion about him - that he was a literary ignoramus who wrote brilliantly without knowing what he was doing. As these letters, notebook entries, book reviews, and articles clearly indicate, Fitzgerald reached usable conclusions about the craft of writing, the discipline of authorship, and the obligations of literature.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/14/65/9781570031465.jpg', 'title_long': 'F. Scott Fitzgerald on Authorship', 'edition': 'First Edition', 'dimensions': 'Height: 9.25 Inches, Length: 6.25 Inches, Weight: 1.1 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 1.1}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 203, 'date_published': '1996-09-01', 'subjects': ['Literature & Fiction', 'Essays & Correspondence', 'Essays', 'History & Criticism', 'Regional & Cultural', 'Reference', 'Writing, Research & Publishing Guides', 'Publishing & Books'], 'authors': ['F. Scott Fitzgerald'], 'title': 'F. Scott Fitzgerald on Authorship', 'isbn13': '9781570031465', 'msrp': 29.95, 'binding': 'Hardcover', 'isbn': '1570031460', 'isbn10': '1570031460'}}