{'book': {'publisher': 'Shambhala', 'synopsis': "A druid-turned-nun writes of faith, love, and loss in this “beautifully written and thought-provoking book” set at the dawn of Ireland’s Christian era (Library Journal)<br/><br/>Cloistered in a stone cell at the monastery of Saint Brigit, a sixth-century Irish nun secretly records the memories of her Pagan youth, interrupting her assigned task of transcribing Augustine and Patrick. She revisits her past, piece by piece—her fiercely independent mother, whose skill with healing plants and inner strength she inherited; her druid teacher, the brusque and magnetic Giannon, who introduced her to the mysteries of the written language.<br/><br/>But disturbing events at the cloister keep intervening. As the monastery is rent by vague and fantastic accusations, Gwynneve's words become the one force that can save her from annihilation.<br/><br/>“As a slant of sunlight illuminates jewels long buried, Kate Horsley's novel brings words to an ancient silence and a living, vivid presence to people who lived in that time of great changes and estrangements we call the Dark Ages.” —Ursula K. Le Guin", 'language': 'en', 'image': 'https://images.isbndb.com/covers/91/36/9781570629136.jpg', 'title_long': 'Confessions of a Pagan Nun: A Novel', 'edition': '60512th', 'dimensions': 'Height: 7.25 inches, Length: 5.06 inches, Weight: 0.43651527876 Pounds, Width: 0.54 inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.06}, 'width': {'unit': 'inches', 'value': 0.54}, 'weight': {'unit': 'pounds', 'value': 0.43651527876}, 'height': {'unit': 'inches', 'value': 7.25}}, 'pages': 208, 'date_published': '2002-09-10', 'subjects': ['Christian Books & Bibles', 'Literature & Fiction', 'Genre Fiction', 'Historical', 'Literary', 'Religion & Spirituality', 'Science Fiction & Fantasy', 'Fantasy'], 'authors': ['Kate Horsley'], 'title': 'Confessions of a Pagan Nun: A Novel', 'isbn13': '9781570629136', 'msrp': 10.91, 'binding': 'Paperback', 'related': {'ePub': '0834823756'}, 'isbn': '1570629137', 'isbn10': '1570629137', 'other_isbns': [{'isbn': '9780834823754', 'binding': 'printisbn'}]}}