{'book': {'publisher': 'Riverhead Books', 'synopsis': 'From activist, spiritual leader, New York Times-bestselling author, and 2020 presidential candidate Marianne Williamson comes a prayer for healing America<br/><br/>Prayer is practical, Williamson tells us. “To look to God is to look to the realm of consciousness that can deliver us from the pain of living.” Illuminata delivers prayer into our daily lives with prayers on topics from releasing anger to finding forgiveness, from finding great love to achieving intimacy. There are prayers for couples, for parents, and for children, prayers to mend broken relationships and prayers to overcome obsessive and compulsive love. There are prayers to heal the soul, prayers to heal the body, and prayers for work and creativity.<br/><br/>Williamson also gives us prayers for the healing of America, including a prayer of amends on behalf of European Americans to African Americans and one to Native Americans. How, Williamson asks, can we expect anyone to forgive when we have made no formal apology?<br/><br/>“Read my prayers or someone else’s,” Williamson says. “By all means, create your own.” Illuminata brings prayer into practical use, creating a sweeter, more abundant life. “No conventional therapy,” she says, “can release us from a deep and abiding psychic pain. Through prayer we find what we cannot find elsewhere: a peace that is not of this world.”', 'language': 'en', 'image': 'https://images.isbndb.com/covers/52/05/9781573225205.jpg', 'title_long': 'Illuminata: A Return to Prayer', 'edition': 'Reprint', 'dimensions': 'Height: 7.45 Inches, Length: 4.64 Inches, Weight: 0.55 Pounds, Width: 0.84 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.64}, 'width': {'unit': 'inches', 'value': 0.84}, 'weight': {'unit': 'pounds', 'value': 0.55}, 'height': {'unit': 'inches', 'value': 7.45}}, 'pages': 300, 'date_published': '1995-11-01', 'subjects': ['Self-Help', 'Christian Books & Bibles', 'Christian Living', 'Self Help', 'Literature & Fiction', 'Poetry', 'Bible Study & Reference', 'Meditations', 'Worship & Devotion', 'Health, Fitness & Dieting', 'Alternative Medicine', 'Meditation', 'Religion & Spirituality'], 'authors': ['Marianne Williamson'], 'title': 'Illuminata: A Return to Prayer', 'isbn13': '9781573225205', 'msrp': 17, 'binding': 'Paperback', 'isbn': '1573225207', 'isbn10': '1573225207'}}