{'book': {'publisher': 'Potomac Books', 'synopsis': '“Shattered Sword [is] a necessary read for anyone interested in the Pacific War.”—NYMAS Review<br/>Shattered Sword is the winner of the 2005 John Lyman Book Award for the "Best Book in U.S. Naval History" and was cited by Proceedings as one of its "Notable Naval Books" for 2005.<br/>Many consider the Battle of Midway to have turned the tide of the Pacific War. It is without question one of the most famous battles in history. Now, for the first time since Gordon W. Prange’s bestselling Miracle at Midway, Jonathan Parshall and Anthony Tully offer a new interpretation of this great naval engagement. Unlike previous accounts, Shattered Sword makes extensive use of Japanese primary sources. It also corrects the many errors of Mitsuo Fuchida’s Midway: The Battle That Doomed Japan, an uncritical reliance upon which has tainted every previous Western account. It thus forces a major, potentially controversial reevaluation of the great battle.<br/><br/>Parshall and Tully examine the battle in detail and effortlessly place it within the context of the Imperial Navy’s doctrine and technology. With a foreword by leading World War II naval historian John Lundstrom, Shattered Sword is an indispensable part of any military buff’s library.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/92/39/9781574889239.jpg', 'title_long': 'Shattered Sword: The Untold Story of the Battle of Midway', 'edition': 'First Edition', 'dimensions': 'Height: 10 Inches, Length: 7.4 Inches, Weight: 3.35 Pounds, Width: 1.8 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.4}, 'width': {'unit': 'inches', 'value': 1.8}, 'weight': {'unit': 'pounds', 'value': 3.35}, 'height': {'unit': 'inches', 'value': 10}}, 'pages': 640, 'date_published': '2005-11-01', 'subjects': ['History', 'Asia', 'Japan', 'Military', 'Aviation', 'Naval', 'World War II'], 'authors': ['Jonathan Parshall', 'Anthony Tully'], 'title': 'Shattered Sword: The Untold Story of the Battle of Midway', 'isbn13': '9781574889239', 'msrp': 35, 'binding': 'Hardcover', 'related': {'Page Fidelity': '1597973092', 'eBook': '1597973092'}, 'isbn': '1574889230', 'isbn10': '1574889230', 'other_isbns': [{'isbn': '9781597973090', 'binding': 'print'}]}}