{'book': {'publisher': 'New World Library', 'synopsis': 'It\'s no wonder that The Power of Now has sold over 2 million copies worldwide and has been translated into over 30 foreign languages. Much more than simple principles and platitudes, the book takes readers on an inspiring spiritual journey to find their true and deepest self and reach the ultimate in personal growth and spirituality: the discovery of truth and light.<br/><br/>In the first chapter, Tolle introduces readers to enlightenment and its natural enemy, the mind. He awakens readers to their role as a creator of pain and shows them how to have a pain-free identity by living fully in the present. The journey is thrilling, and along the way, the author shows how to connect to the indestructible essence of our Being, "the eternal, ever-present One Life beyond the myriad forms of life that are subject to birth and death."<br/><br/>Featuring a new preface by the author, this paperback shows that only after regaining awareness of Being, liberated from Mind and intensely in the Now, is there Enlightenment.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/48/06/9781577314806.jpg', 'title_long': 'The Power of Now: A Guide to Spiritual Enlightenment', 'edition': 'First Trade Paper Edition', 'dimensions': 'Height: 8.5 Inches, Length: 6 Inches, Weight: 0.75 Pounds, Width: 0.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.5}, 'weight': {'unit': 'pounds', 'value': 0.75}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 236, 'date_published': '2004-08-19', 'subjects': ['Self-Help', 'Personal Transformation', 'Spiritual', 'Health, Fitness & Dieting', 'Alternative Medicine', 'Meditation', 'Reference', 'Religion & Spirituality'], 'authors': ['Eckhart Tolle'], 'title': 'The Power of Now: A Guide to Spiritual Enlightenment', 'isbn13': '9781577314806', 'msrp': 16, 'binding': 'Paperback', 'related': {'Kindle Edition': '1577313119'}, 'isbn': '1577314808', 'isbn10': '1577314808', 'other_isbns': [{'isbn': '9781577313113', 'binding': 'print'}]}}