{'book': {'publisher': 'WaterBrook Press', 'synopsis': 'Put your flawed foot forward.<br/><br/>Pick up most leadership books and you’ll find strategies for leveraging your power and minimizing your areas of weakness. But think about the leaders whose names have gone down in history. Most of them were so messed up that, if they were looking for work today, no executive placement service would give them the time of day.<br/><br/>God’s criteria for choosing leaders runs counter to the conventional wisdom. Our culture equates strength with effectiveness, but God favors leaders who know the value of brokenness.<br/><br/>In Leading With a Limp, you’ll discover what makes flawed leaders so successful. They’re not preoccupied with protecting their image, they are undaunted by chaos and complexity, they are ready to risk failure in moving an organization from what is to what should be. God chooses leaders who aren’t deceived by the myths of power and control, but who realize that God’s power is found in brokenness.<br/><br/>If you are a leader–or if you have been making excuses to avoid leading–find out how you can take full advantage of your weakness. A limping leader is the person God uses to accomplish amazing things.<br/><br/>To go deeper, check out the Leading With a Limp Workbook.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/95/02/9781578569502.jpg', 'title_long': 'Leading with a Limp: Turning Your Struggles into Strengths', 'edition': 'First Edition', 'dimensions': 'Height: 9.5 Inches, Length: 6.75 Inches, Weight: 0.9 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.75}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 9.5}}, 'pages': 224, 'date_published': '2006-05-16', 'subjects': ['Christian Books & Bibles', 'Christian Living', 'Leadership', 'Health, Fitness & Dieting', 'Psychology & Counseling', 'Religion & Spirituality', 'Religious Studies', 'Medical Books', 'Psychology', 'General'], 'authors': ['Dan B. Allender'], 'title': 'Leading with a Limp: Turning Your Struggles into Strengths', 'isbn13': '9781578569502', 'msrp': 19.99, 'binding': 'Hardcover', 'isbn': '1578569508', 'isbn10': '1578569508'}}