{'book': {'publisher': 'University Press of Mississippi', 'synopsis': "British filmmaker Michael Powell (1905-1990) began his career assisting director Rex Ingram in the waning years of silent film. Given a boost by Alfred Hitchcock, Powell spent much of the 1930s directing what were known as “quota quickies,” low-budget B movies.<br/><br/>Later he created some of the most daring, interesting, and literate films ever made, including The Edge of the World (1937), Peeping Tom (1960), and his work with Hungarian-born filmmaker Emeric Pressburger, with whom producer/director Alexander Korda paired him.<br/><br/>Powell's conversations disclose the same intellectual and artistic range that make his films so rewarding. This collection of interviews manifests how he imagined himself simultaneously as a classic English gentleman and as a citizen of the world, making films with social conscience about life both in England and abroad.<br/><br/>His expressions are charged with brilliance, wit, and jauntiness as he discusses his work on Thief of Baghdad, One of Our Aircraft Is Missing, The Red Shoes, The Tales of Hoffman, and Black Narcissus, as well as the politics of the British film industry.<br/><br/>He is candid about the controversy surrounding his thriller Peeping Tom (1960). Now regarded as a classic, it was so derided upon its original release that Powell could not direct in the United Kingdom for a decade.<br/><br/>This collection reveals the mind and the tactics of a master filmmaker who is woefully under-known, even as his films are widely celebrated throughout the world. Martin Scorsese, whom Powell befriended in his later years, considers him a towering genius of cinema.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/49/84/9781578064984.jpg', 'title_long': 'Michael Powell: Interviews (Conversations with Filmmakers Series)', 'dimensions': 'Height: 9 Inches, Length: 6.25 Inches, Weight: 0.82 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.25}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.82}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 186, 'date_published': '2003-03-03', 'subjects': ['Arts & Photography', 'Performing Arts', 'Biographies & Memoirs', 'Arts & Literature', 'Actors & Entertainers', 'Movie Directors', 'Humor & Entertainment', 'Movies', 'Direction & Production', 'Video'], 'authors': [], 'title': 'Michael Powell: Interviews (Conversations with Filmmakers Series)', 'isbn13': '9781578064984', 'msrp': 22, 'binding': 'Paperback', 'isbn': '1578064988', 'isbn10': '1578064988'}}