{'book': {'publisher': 'Rodale Books', 'synopsis': "Discover the #1 New York Times bestselling phenomenon that has helped millions reach their goal weight by focusing on cutting carbs and choosing healthy fats<br/><br/>For years, cardiologist Arthur Agatston, M.D., urged his patients to lose weight for the sake of their hearts, but every diet was too hard to follow or its restrictions were too harsh. Some were downright dangerous. Nobody seemed to be able to stick with low-fat regimens for any length of time. And a diet is useless if you can't stick with it.<br/><br/>So Dr. Agatston developed his own. The South Beach Diet isn't complicated, and it doesn't require that you go hungry. You'll enjoy normal-size helpings of meat, poultry, and fish. You'll also eat eggs, cheese, nuts, and vegetables. Snacks are required. You'll learn to avoid the bad carbs, like white flour, white sugar, and baked potatoes. Best of all, as you lose weight, you'll lose that stubborn belly fat first!<br/><br/>Dr. Agatston's diet has produced consistently dramatic results (8 to 13 pounds lost in the first 2 weeks!) and has become a media sensation. Now, you too can join the ranks of the fit and fabulous with The South Beach Diet", 'language': 'en', 'image': 'https://images.isbndb.com/covers/64/65/9781579546465.jpg', 'title_long': 'The South Beach Diet: The Delicious, Doctor-designed, Foolproof Plan for Fast and Healthy Weight Loss (The South Beach Diet)', 'edition': 'First Edition', 'dimensions': 'Height: 7 Inches, Length: 10 Inches, Weight: 1.23 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 10}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.23}, 'height': {'unit': 'inches', 'value': 7}}, 'pages': 320, 'date_published': '2003', 'subjects': ['Health, Fitness & Dieting', 'Diets & Weight Loss', 'South Beach Diet'], 'authors': ['Arthur Agatston'], 'title': 'The South Beach Diet: The Delicious, Doctor-designed, Foolproof Plan for Fast and Healthy Weight Loss (The South Beach Diet)', 'isbn13': '9781579546465', 'msrp': 24.95, 'binding': 'Hardcover', 'related': {'ePub': '1605292842'}, 'isbn': '1579546463', 'isbn10': '1579546463', 'other_isbns': [{'isbn': '9781605292847', 'binding': 'printisbn'}]}}