{'book': {'publisher': 'Material World', 'synopsis': 'On the banks of Mali\'s Niger River, Soumana Natomo and his family gather for a communal dinner of millet porridge with tamarind juice. In the USA, the Ronayne-Caven family enjoys corndogs-on-a-stick with a tossed green salad. This age-old practice of sitting down to a family meal is undergoing unprecedented change as rising world affluence and trade, along with the spread of global food conglomerates, transform diets worldwide. In HUNGRY PLANET, the creative team behind the best-selling Material World, Women in the Material World, and MAN EATING BUGS presents a photographic study of families from around the world, revealing what people eat during the course of one week. Each family\'s profile includes a detailed description.<br/><br/><br/><br/><br/><br/>Awards<br/><br/>2006 James Beard Cookbook of the Year The Splendid Table Book of the Year<br/><br/>2005 Harry Chapin Media Award<br/><br/>finalist for the 2006 IACP Cookbook Award Reviews<br/><br/>"Arresting, beautiful, enlightening and infinitely human, this is a collection of full-page photos of families around the world surrounded by what they eat in a single week -- from Bhutan to San Antonio. Read the illuminating statistics and the essays. This is a book for the family and for the classroom. You won\'t see the same old "aren\'t we better than them" attitude, nor will you be shamed. This book reminds us that what we eat is the simplest, yet most profound, thread that ties us together."—Lynne Rossetto Kasper, Host of American Public Media\'s Public Radio Program, The Splendid Table“the politics of food at its most poignant and provocative. A coffee table book that will certainly make coffee interesting.”—Washington Post“While the photos are extraordinary--fine enough for a stand-alone volume--it\'s the questions these photos ask that make this volume so gripping. This is a beautiful, quietly provocative volume.”—Publishers Weekly, *Starred Review*“This book of portraits reveals a planet of joyful individuality, dispiriting sameness, and heart-breaking disparity. It\'s a perfect gift for the budding anti-globalists on your list”—Bon Appetit “[A] unique photographic study of global nutrition” —USA Today “Grabs your attention for the startlingly varied stories it tells about how people feed themselves around the world. Its contents are based on detailed research, beautifully photographed, presented with often disturbing clarity.” —Associated Press "The world\'s kitchens open to Peter Menzel and Faith D\'Aluisio, the intrepid couple who created the series of books called Material World.... As always with this couple\'s terse, lively travelogues, politics and the world economy are never far from view." —New York Times Book Review “illuminating, thought-provoking, and gloriously colorful” —Saveur Magazine “Richly colored and quietly composed photographs....Hungry Planet is not a book about obesity or corporate villains; it\'s something much grander. Its premise is simple to the point of obvious and powerful to the point of art.” —Salon.com “A fascinating nutritional and gustatory tour.” —San Jose Mercury News<br/><br/>“A grand culinary voyage through our modern world...a lushly illustrated anthropological study.” —San Francisco Bay Guardian<br/><br/>“The talked-about book of the season...the stories are fascinating.” —Detroit Free Press<br/><br/>“Unique and engaging” —Delta Airlines Sky magazine', 'language': 'en', 'image': 'https://images.isbndb.com/covers/68/13/9781580086813.jpg', 'title_long': 'Hungry Planet: What the World Eats', 'edition': 'First edition, Fourth printing', 'dimensions': 'Height: 9.29 Inches, Length: 12.5 Inches, Weight: 3.62439958728 Pounds, Width: 1.01 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 12.5}, 'width': {'unit': 'inches', 'value': 1.01}, 'weight': {'unit': 'pounds', 'value': 3.62439958728}, 'height': {'unit': 'inches', 'value': 9.29}}, 'pages': 288, 'date_published': '2005-10-01', 'subjects': ['Arts & Photography', 'Photography & Video', 'Equipment, Techniques & Reference', 'Travel', 'Photojournalism & Essays', 'Cookbooks, Food & Wine', 'Regional & International', 'International', 'Science & Math', 'Evolution', 'Politics & Social Sciences', 'Anthropology', 'Cultural', 'Self Service', 'Custom Stores'], 'authors': ['Peter Menzel', "Faith D'Aluisio"], 'title': 'Hungry Planet: What the World Eats', 'isbn13': '9781580086813', 'msrp': 40, 'binding': 'Hardcover', 'isbn': '1580086810', 'isbn10': '1580086810'}}