{'book': {'publisher': 'The Monacelli Press', 'synopsis': 'Touted by Publisher\'s Weekly as "an unprecedented record," the new book in the New York series, New York 2000, is indeed an exceptional survey of this great city\'s architectural heritage. As the world\'s financial and cultural capital, New York demands the best in architectural design and balances the constant pressure to build with the need to preserve its historic fabric.<br/>Author Robert A. M. Stern and his colleagues trace the rise and fall of the real estate market, the impact of the designation of historic districts and new zoning on development, and the emergence of new commercial and residential centers.<br/>The survey is organized geographically, moving north from Lower Manhattan and covering the Bronx, Queens, Brooklyn, and Staten Island as well. New York 2000 documents milestones in the city\'s architectural history over the past forty years - the development of Battery Park City, the rebirth of Harlem and Times Square, the creation of the cultural precinct around the new MoMA, and the reclaiming of the waterfront along the East and Hudson Rivers as recreational parkland - and celebrates the achievements of internationally recognized architects such as Sir Norman Foster, Cesar Pelli, Richard Meier, and Renzo Piano.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/17/79/9781580931779.jpg', 'title_long': 'New York 2000: Architecture and Urbanism Between the Bicentennial and the Millennium', 'edition': 'First Edition', 'dimensions': 'Height: 11.25 Inches, Length: 9.875 Inches, Weight: 10.00016820432 Pounds, Width: 1.125 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 9.875}, 'width': {'unit': 'inches', 'value': 1.125}, 'weight': {'unit': 'pounds', 'value': 10.00016820432}, 'height': {'unit': 'inches', 'value': 11.25}}, 'pages': 1520, 'date_published': '2006-11-01', 'subjects': ['Arts & Photography', 'Photography & Video', 'Architectural', 'Architecture', 'Buildings', 'History', 'Urban & Land Use Planning', 'Man-Made Objects'], 'authors': ['Robert A.M. Stern', 'David Fishman', 'Jacob Tilove'], 'title': 'New York 2000: Architecture and Urbanism Between the Bicentennial and the Millennium', 'isbn13': '9781580931779', 'msrp': 100, 'binding': 'Hardcover', 'isbn': '1580931774', 'isbn10': '1580931774'}}