{'book': {'publisher': 'Crossway Books', 'synopsis': 'Bunyan. Cowper. Brainerd.<br/>We read their stories and wonder how they endured. How does one survive twelve years in a dank prison cell? How does one survive month after month of a depression so debilitating that death seems the only hope? How does one endure tuberculosis? Or cancer, or emptiness, or death, or loneliness, or divorce? Whatever the trial may be, how does one endure without the soul shriveling up and blowing away with the breeze?<br/>In the lives of John Bunyan, William Cowper, and David Brainerd, we find the strength of soul that not only endures hardship, but honors God in the midst of it. The Giver and Sustainer of life enabled them to worship through all their suffering. That\'s why their affliction bore so much fruit. The story of their suffering, their perseverance, and their passion is one that can inspire the same hunger for the supremacy of God in your life.<br/>John Piper invites you to read their stories, consider their lives, and be encouraged that no labor and no suffering in the path of Christian obedience is ever in vain. Even the bleak hill of Golgotha was a skull with a frown of affliction on its face. But "behind a frowning providence, He hides a smiling face."<br/>Just as Bunyan\'s, Cowper\'s, and Brainerd\'s suffering produced the worship and humility that is essential to Christian living, we too can look to God for great privileges to come from our own pain. And we too can remember, "The bud may have a bitter taste, but sweet will be the flower."', 'language': 'en', 'image': 'https://images.isbndb.com/covers/24/75/9781581342475.jpg', 'title_long': 'The Hidden Smile of God: The Fruit of Affliction in the Lives of John Bunyan, William Cowper, and David Brainerd (The Swans Are Not Silent)', 'dimensions': 'Height: 9.25 Inches, Length: 6 Inches, Weight: 0.9 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.9}, 'height': {'unit': 'inches', 'value': 9.25}}, 'pages': 176, 'date_published': '2001-01-15', 'subjects': ['Christian Books & Bibles', 'Ministry & Evangelism', 'Discipleship', 'Religion & Spirituality'], 'authors': ['John Piper'], 'title': 'The Hidden Smile of God: The Fruit of Affliction in the Lives of John Bunyan, William Cowper, and David Brainerd (The Swans Are Not Silent)', 'isbn13': '9781581342475', 'msrp': 4.35, 'binding': 'Hardcover', 'isbn': '1581342470', 'isbn10': '1581342470'}}