{'book': {'publisher': 'Counterpoint', 'synopsis': 'In this stunning coming-of-age novel, award-winner Miriam Toews balances grief and hope in the voice of a witty, beleaguered teenager whose family is shattered by fundamentalist Christianity<br/>"Half of our family, the better-looking half, is missing," Nomi Nickel tells us at the beginning of A Complicated Kindness. Left alone with her sad, peculiar father, her days are spent piecing together why her mother and sister have disappeared and contemplating her inevitable career at Happy Family Farms, a chicken slaughterhouse on the outskirts of East Village. Not the East Village in New York City where Nomi would prefer to live, but an oppressive town founded by Mennonites on the cold, flat plains of Manitoba, Canada.<br/>This darkly funny novel is the world according to the unforgettable Nomi, a bewildered and wry sixteen-year-old trapped in a town governed by fundamentalist religion and in the shattered remains of a family it destroyed. In Nomi\'s droll, refreshing voice, we\'re told the story of an eccentric, loving family that falls apart as each member lands on a collision course with the only community any of them have ever known. A work of fierce humor and tragedy by a writer who has taken the American market by storm, this searing, tender, comic testament to family love will break your heart.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/32/26/9781582433226.jpg', 'title_long': 'A Complicated Kindness: A Novel', 'dimensions': 'Height: 7.75 Inches, Length: 5.25 Inches, Weight: 0.625 Pounds, Width: 0.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 0.75}, 'weight': {'unit': 'pounds', 'value': 0.625}, 'height': {'unit': 'inches', 'value': 7.75}}, 'pages': 264, 'date_published': '2005-08-17', 'subjects': ['Literature & Fiction', 'United States', 'Literary'], 'authors': ['Miriam Toews'], 'title': 'A Complicated Kindness: A Novel', 'isbn13': '9781582433226', 'msrp': 11.99, 'binding': 'Paperback', 'related': {'eBook': '1582438897'}, 'isbn': '1582433224', 'isbn10': '1582433224', 'other_isbns': [{'isbn': '9781582438894', 'binding': 'print'}]}}