{'book': {'publisher': 'Bloomsbury USA', 'synopsis': "Schott's Original Miscellany makes few claims to be exhaustive or even practical. It does, however, claim to be essential. It will afford you great wisdom in the morning, several conversational bons mots for the afternoon, and many an enlightened smile after dark.<br/>Where else can you find, packed onto one page, the thirteen principles of witchcraft, the structure of military hierarchy, all of the clothing-care symbols, a list of the countries where you drive on the left, and a nursery rhyme about sneezing?<br/>Where else but Schott's Original Miscellany will you stumble across the name of John Lennon's cat, the supplier of bagpipes to the Queen, and the brutal methods of murder encountered by Miss Marple?<br/>An encyclopedia? A dictionary? An anthology? An almanac? An amphigouri? A treasury? A commonplace book? Well... yes. Schott's Original Miscellany is all these and, of course, more. A book like no other, Schott's Original Miscellany is entertaining, informative, unpredictible, and utterly addictive.<br/>Ben Schott is a photographer, designer, and trivia collector. He is twenty-eight (although he believes you might prefer to picture him as a white-haired librarian) and lives in Highgate, London.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/34/95/9781582343495.jpg', 'title_long': "Schott's Original Miscellany", 'edition': 'First U.S. Edition', 'dimensions': 'Height: 7.68 Inches, Length: 4.96 Inches, Weight: 0.54 Pounds, Width: 0.7799197 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.96}, 'width': {'unit': 'inches', 'value': 0.7799197}, 'weight': {'unit': 'pounds', 'value': 0.54}, 'height': {'unit': 'inches', 'value': 7.68}}, 'pages': 160, 'date_published': '2003-08-04', 'subjects': ['Humor & Entertainment', 'Puzzles & Games', 'Quizzes', 'Trivia', 'Reference', 'Almanacs & Yearbooks'], 'authors': ['Ben Schott'], 'title': "Schott's Original Miscellany", 'isbn13': '9781582343495', 'msrp': 18, 'binding': 'Hardcover', 'isbn': '1582343497', 'isbn10': '1582343497'}}