{'book': {'publisher': 'Bloomsbury USA', 'synopsis': 'Investigative reporter Gus Russo returns with his most explosive book yet, the remarkable story of the "Supermob"―a cadre of men who, over the course of decades, secretly influenced nearly every aspect of American society. Presenting startling, never-before-seen revelations about such famous members as Jules Stein, Joe Glaser, Ronald Reagan, Lew Wasserman, David Bazelon, and John Jacob Factor―as well as infamous, scrupulously low-profile members―Russo pulls the lid off of a half-century of criminal infiltration into American business, politics, and society. At the heart of it all is Sidney "The Fixer" Korshak, who from the 1940\'s until his death in the 1990s, was not only the most powerful lawyer in the world, according to the FBI, but the enigmatic player behind countless 20th century power mergers, political deals, and organized crime chicaneries. As the underworld\'s primary link to the corporate upperworld, Korshak\'s backroom dominance and talent for anonymity will likely never be equaled. And as Supermob proves, neither will his story…', 'language': 'en', 'image': 'https://images.isbndb.com/covers/38/91/9781582343891.jpg', 'title_long': "Supermob: How Sidney Korshak and His Criminal Associates Became America's Hidden Power Brokers", 'edition': 'First Edition', 'dimensions': 'Height: 9.5299022 Inches, Length: 6.3999872 Inches, Weight: 2.35 Pounds, Width: 1.9299174 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.3999872}, 'width': {'unit': 'inches', 'value': 1.9299174}, 'weight': {'unit': 'pounds', 'value': 2.35}, 'height': {'unit': 'inches', 'value': 9.5299022}}, 'pages': 592, 'date_published': '2006-09-05', 'subjects': ['Biographies & Memoirs', 'True Crime', 'Crime & Criminal Biographies', 'Organized Crime', 'History', 'Americas', 'United States'], 'authors': ['Gus Russo'], 'title': "Supermob: How Sidney Korshak and His Criminal Associates Became America's Hidden Power Brokers", 'isbn13': '9781582343891', 'msrp': '0.00', 'binding': 'Hardcover', 'isbn': '1582343896', 'isbn10': '1582343896'}}