{'book': {'publisher': "Teacher's Pet Publications", 'synopsis': 'Essentially a complete teacher\'s manual for the book, this LitPlan Teacher Pack includes lesson plans and reproducible resource materials for Stargirl. It includes: 18 Daily Lessons, Short answer study questions, Multiple choice quiz questions, Vocabulary worksheets for each reading assignment, 3 detailed writing assignments, Individual and group activities, Critical thinking discussion questions, 5 unit tests (2 short answer, 2 multiple choice, 1 advanced short answer), Evaluation forms, Review puzzles & games, Bulletin board ideas, Reproducible student materials, And more! A Note About A Few Of The Many Different ssignments Included: There are three writing assignments in this unit, each with the purpose of informing, persuading, or expressing personal opinions. The detailed writing assignment sheets guide students through the assignments. In the first assignment, students write to inform. They write a "filler" for the newspaper. In the second assignment, students write to persuade Leo to accept Stargirl OR persuade Stargirl to find a better way to fit in with the group OR persuade you that Leo and Stargirl acted appropriately in the book and wouldn\'t need to be persuaded to do anything differently. The third writing assignment gives students the opportunity to do some creative writing by writing the plot summary for a sequel to the novel Stargirl. Students are assigned to do a project with this unit. Students are members of the Sunflower Club, a club of students who pledges to do something nice each day for someone other than themselves. Students will try to keep this pledge and keep a list of what they did each day. After about two weeks, students will share their experiences with the class.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/29/20/9781583372920.jpg', 'title_long': 'Stargirl LitPlan - A Novel Unit Teacher Guide With Daily Lesson Plans (LitPlans on CD)', 'pages': 210, 'date_published': '2005-09-15', 'subjects': ['Literature & Fiction', 'History & Criticism'], 'authors': ['Mary B. Collins'], 'title': 'Stargirl LitPlan - A Novel Unit Teacher Guide With Daily Lesson Plans (LitPlans on CD)', 'isbn13': '9781583372920', 'msrp': 19.95, 'binding': 'CD-ROM', 'isbn': '158337292X', 'isbn10': '158337292X'}}