{'book': {'publisher': 'Avery', 'synopsis': 'A modern girl’s guide to the secrets of eating for health, beauty, and peace of mind.<br/>"Part Joan Rivers, part Mahatma Gandhi, Jessica Porter makes macrobiotics meaningful, hilarious, and totally life-changing."<br/>Simon Doonan, creative director, Barneys New York and author of Wacky Chicks<br/>Heralded by New York magazine as one of the city’s most popular diets, macrobiotics has become the latest trend in dieting, thanks to high-profile supporters like Madonna and Gwyneth Paltrow.<br/>Speaking to the generation of young women looking to extend their healthy lifestyles beyond yoga and Pilates, macrobiotic chef and instructor Jessica Porter offers fresh, contemporary, and accessible insight into one of the world’s most popular diets that is based on century’s old principles. She explains that through the right balance of food, women can find balance in every aspect of their lives—improved health, weight loss, or fulfilling relationships.<br/>The effects of eating a macrobiotic diet can extend beyond basic health to weight loss, beauty, better sex, and peace of mind. Cooking tips and recipes are combined with Jessica’s no-nonsense philosophy and witty anecdotes to create a lifestyle book that will inspire women to hit the kitchen with an understanding of how to strengthen their mind and body through food.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/20/54/9781583332054.jpg', 'title_long': "The Hip Chick's Guide to Macrobiotics: A Philosophy for achieving a Radiant Mind and a Fabulous Body", 'edition': 'First Edition', 'dimensions': 'Height: 9.18 Inches, Length: 7.45 Inches, Weight: 0.00220462262 Pounds, Width: 0.82 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.45}, 'width': {'unit': 'inches', 'value': 0.82}, 'weight': {'unit': 'pounds', 'value': 0.00220462262}, 'height': {'unit': 'inches', 'value': 9.18}}, 'pages': 304, 'date_published': '2004-09-09', 'subjects': ['Cookbooks, Food & Wine', 'Cooking Methods', 'Special Diet', 'Whole Foods', 'Health, Fitness & Dieting', 'Diets & Weight Loss', 'Other Diets', 'Detoxes & Cleanses', 'Exercise & Fitness', 'Hip & Thigh Workouts', 'Nutrition', 'Macrobiotics', "Women's Health", 'General', 'Crafts, Hobbies & Home', 'Home Improvement & Design', 'How-to & Home Improvements'], 'authors': ['Jessica Porter'], 'title': "The Hip Chick's Guide to Macrobiotics: A Philosophy for achieving a Radiant Mind and a Fabulous Body", 'isbn13': '9781583332054', 'msrp': 22, 'binding': 'Paperback', 'related': {'Kindle Edition': '1101218509', 'ePub': '1101218509'}, 'isbn': '1583332057', 'isbn10': '1583332057', 'other_isbns': [{'isbn': '9781101218501', 'binding': 'print'}]}}