{'book': {'publisher': 'Abrams Press', 'synopsis': 'From the Publisher<br/><br/>The Week-End Book was first published by the Nonesuch Press in June 1924. With various editions and altercations, it was reprinted in England nineteen times. In criticism of its commercial success, Virginia Woolf once commented, "The Hogart Press may not make any money but at least we did not publish The Week-End Book."<br/>From how to forecast the weather, make a campfire, or make your own paper cups, to suggestions for games to play in the country and the potential damages (legal and medical) that might result, The Week-End Book offers essential advice for anyone on making the most of their precious leisure time. In addition, The Week-End Book contains a thoughtful selection of poetry that can be fully enjoyed in the peace of the countryside. Portable and practical, The Week-End Book is the perfect recipe for successful weekend living.<br/><br/>Product Description<br/><br/>About the Author<br/><br/>The Nonesuch Press was founded in 1922 by Francis Meynell, his wife Vera, and David Garnett. In addition to The Week-End Book, it published many editions of classic literature\x97including the complete works of Charles Dickens, the complete works of William Blake, and the Bible\x97that are landmarks in fine bookmaking to this day.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/81/36/9781585678136.jpg', 'title_long': 'The Week-End Book', 'dimensions': 'Height: 7.7999844 Inches, Length: 4.6999906 Inches, Weight: 0.91 Pounds, Width: 1.2999974 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.6999906}, 'width': {'unit': 'inches', 'value': 1.2999974}, 'weight': {'unit': 'pounds', 'value': 0.91}, 'height': {'unit': 'inches', 'value': 7.7999844}}, 'pages': 368, 'date_published': '2006-05-04', 'subjects': ['Humor & Entertainment', 'Trivia & Fun Facts', 'Reference'], 'authors': [], 'title': 'The Week-End Book', 'isbn13': '9781585678136', 'msrp': 17.95, 'binding': 'Hardcover', 'isbn': '1585678139', 'isbn10': '1585678139'}}