{'book': {'publisher': 'AuthorHouse', 'synopsis': 'Electronic Distribution Date: February 2007 Printed & Bound Distribution Date: February 2007 This updated version of Childhood Shadows, a book first published in 1999, adds new details to a compelling account of the Black Dahlia murder-one of Hollywood\'s most infamous unsolved crimes. Combining personal experience as a close friend of the victim, Elizabeth Short, with in-depth research, Childhood Shadows brings a unique perspective and opens up an intriguing new area of speculation about who the killer may be. Author Mary Pacios sets the stage by recreating the neighborhood she shared with Elizabeth "Bette" Short during the years of the Great Depression and World War II. The war ends, but instead of peace, the horrendous murder of the young and beautiful Elizabeth Short send shock waves through the nation. Years later, haunted by the unsolved murder of her childhood friend, Pacios sets out to discover the true circumstances surrounding her friend\'s brutal death. Because of her personal relationship with the victim, Pacios gains access to officials close to the case who discuss with her unpublicized details of the murxder and their own privately held theories of who killed the woman known as the Black Dahlia. The research Pacios expects to last only a few months turns into a strange twenty-year odyssey that explodes many of the myths surrounding the victim and her murder.Appendices include photographs, official documents, synopses of the various suspects and an extensive annotated bibliography. .', 'language': 'en', 'image': 'https://images.isbndb.com/covers/48/43/9781585004843.jpg', 'title_long': 'Childhood Shadows: The Hidden Story of the Black Dahlia Murder', 'edition': 'Illustrated', 'dimensions': 'Height: 8 inches, Length: 5 Inches, Weight: 1.01192178258 Pounds, Width: 0.96 inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5}, 'width': {'unit': 'inches', 'value': 0.96}, 'weight': {'unit': 'pounds', 'value': 1.01192178258}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 410, 'date_published': '2007-02-01', 'subjects': ['Biographies & Memoirs', 'True Crime', 'Murder & Mayhem', 'Politics & Social Sciences', 'Social Sciences', 'Criminology'], 'authors': ['Mary Pacios'], 'title': 'Childhood Shadows: The Hidden Story of the Black Dahlia Murder', 'isbn13': '9781585004843', 'msrp': 20.75, 'binding': 'Paperback', 'isbn': '1585004847', 'isbn10': '1585004847'}}