{'book': {'publisher': 'TarcherPerigee', 'synopsis': "The bestselling success book of all time—now revised and updated for the 21st century.<br/><br/>Think and Grow Rich has been called the “Granddaddy of All Motivational Literature.” It was the first book to boldly ask, “What makes a winner?” The man who asked and listened for the answer, Napoleon Hill, is now counted in the top ranks of the world's winners himself. The most famous of all teachers of success spent “a fortune and the better part of a lifetime of effort” to produce the “Law of Success” philosophy that forms the basis of his books and that is so powerfully summarized in this one.<br/><br/>In the original Think and Grow Rich, published in 1937, Hill draws on stories of Andrew Carnegie, Thomas Edison, Henry Ford, and other millionaires of his generation to illustrate his principles. In the updated version, Arthur R. Pell, Ph.D., a nationally known author, lecturer, and consultant in human resources management and an expert in applying Hill's thought, deftly interweaves anecdotes of how contemporary millionaires and billionaires, such as Bill Gates, Mary Kay Ash, Dave Thomas, and Sir John Templeton, achieved their wealth. Outmoded or arcane terminology and examples are faithfully refreshed to preclude any stumbling blocks to a new generation of readers.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/43/37/9781585424337.jpg', 'title_long': 'Think and Grow Rich (Think and Grow Rich Series)', 'edition': 'Revised & enlarged', 'dimensions': 'Height: 7.09 Inches, Length: 4.96 Inches, Weight: 0.6 Pounds, Width: 0.83 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.96}, 'width': {'unit': 'inches', 'value': 0.83}, 'weight': {'unit': 'pounds', 'value': 0.6}, 'height': {'unit': 'inches', 'value': 7.09}}, 'pages': 322, 'date_published': '2005-08-18', 'subjects': ['Self-Help', 'Motivational', 'Personal Transformation', 'Success', 'Business & Money', 'Personal Finance', 'Budgeting & Money Management', 'Religion & Spirituality', 'Kindle Store', 'Categories', 'Kindle eBooks', 'Self Service', 'Custom Stores'], 'authors': ['Napoleon Hill', 'Arthur Pell'], 'title': 'Think and Grow Rich (Think and Grow Rich Series)', 'isbn13': '9781585424337', 'msrp': 6, 'binding': 'Kindle Edition', 'related': {'Kindle Edition': '1440628238'}, 'isbn': '1585424331', 'isbn10': '1585424331', 'other_isbns': [{'isbn': '9781440628238', 'binding': 'print'}]}}