{'book': {'publisher': 'Steerforth', 'synopsis': 'When Jenny was published in 1911, Undset found herself called immoral — “this is a side of the free, artistic life that the vast majority of citizens would rather not know.” The novel tells the story of Jenny Winge, a talented Norwegian painter who goes to Rome to seek artistic inspiration but ultimately betrays her own ambitions and ideals. After falling into an affair with the married father of a would-be suitor, Jenny has a baby out-of- wedlock and decides to raise the child on her own. Undset’ s portrayal of a woman struggling toward independence and fulfillment is written with an unflinching, clear-eyed honesty that renders her story as compelling today as it was nearly a century ago.<br/><br/>This new translation by Tiina Nunnally captures the fresh, vivid style of Undset’s writing and restores passages omitted from the only previous edition to appear in English, which was published in 1921. Most famous for her later, historical fiction set in Catholic, medieval Scandinavia, Undset stands revealed with Jenny, her first major novel, as an unsparing, compassionate, magnificent realist, the creator of works that are at once thoroughly modern and of enduring interest.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/05/05/9781586420505.jpg', 'title_long': 'Jenny', 'edition': 'First Paperback Edition', 'dimensions': 'Height: 8.27 Inches, Length: 5.51 Inches, Weight: 0.84 Pounds, Width: 0.86 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.51}, 'width': {'unit': 'inches', 'value': 0.86}, 'weight': {'unit': 'pounds', 'value': 0.84}, 'height': {'unit': 'inches', 'value': 8.27}}, 'pages': 330, 'date_published': '1998-06-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Coming of Age', 'Psychological', 'United States', 'Literary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Psychological Thrillers'], 'authors': ['Sigrid Undset'], 'title': 'Jenny', 'isbn13': '9781586420505', 'msrp': '0.00', 'binding': 'Paperback', 'isbn': '158642050X', 'isbn10': '158642050X'}}