{'book': {'publisher': 'PublicAffairs', 'synopsis': 'The inspirational story of how Nobel Prize winner Muhammad Yunus invented microcredit, founded the Grameen Bank, and transformed the fortunes of millions of poor people around the world.<br/><br/>Muhammad Yunus was a professor of economics in Bangladesh, who realized that the most impoverished members of his community were systematically neglected by the banking system -- no one would loan them any money. Yunus conceived of a new form of banking -- microcredit -- that would offer very small loans to the poorest people without collateral, and teach them how to manage and use their loans to create successful small businesses. He founded Grameen Bank based on the belief that credit is a basic human right, not the privilege of a fortunate few, and it now provides $24 billion of micro-loans to more than nine million families. Ninety-seven percent of its clients are women, and repayment rates are over 90 percent. Outside of Bangladesh, micro-lending programs inspired by Grameen have blossomed, and serve hundreds of millions of people around the world.<br/><br/>The definitive history of micro-credit direct from the man that conceived of it, Banker to the Poor is the moving story of someone who dreamed of changing the world -- and did.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/19/88/9781586481988.jpg', 'title_long': 'Banker To The Poor: Micro-Lending and the Battle Against World Poverty', 'edition': 'Later Printing', 'dimensions': 'Height: 8.375 Inches, Length: 5.5 Inches, Weight: 0.70988848364 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.70988848364}, 'height': {'unit': 'inches', 'value': 8.375}}, 'pages': 273, 'date_published': '2008-01-08', 'subjects': ['Biographies & Memoirs', 'Professionals & Academics', 'Business', 'Business & Money', 'Economics', 'Development & Growth', 'Banks & Banking', 'Politics & Social Sciences', 'Politics & Government', 'Specific Topics', 'Self Service', 'Custom Stores'], 'authors': ['Muhammad Yunus'], 'title': 'Banker To The Poor: Micro-Lending and the Battle Against World Poverty', 'isbn13': '9781586481988', 'msrp': 9.75, 'binding': 'Paperback', 'isbn': '1586481983', 'isbn10': '1586481983'}}