{'book': {'publisher': 'Ann Arbor Media', 'synopsis': "Product Description      <br/>Why buy our paperbacks?<br/><br/><br/>Standard Font size of 10 for all books<br/><br/>High Quality Paper<br/><br/>Fulfilled by Amazon<br/><br/>Expedited shipping<br/><br/>30 Days Money Back Guarantee<br/><br/> <br/> <br/>BEWARE of Low-quality sellers<br/>Don't buy cheap paperbacks just to save a few dollars. Most of them use low-quality papers & binding. Their pages fall off easily. Some of them even use very small font size of 6 or less to increase their profit margin. It makes their books completely unreadable. <br/> <br/> <br/>How is this book unique?<br/><br/><br/>Unabridged (100% Original content)<br/><br/>Font adjustments & biography included<br/><br/>Illustrated<br/><br/> <br/>About The Scarlet Letter by Nathaniel Hawthorne<br/>The Scarlet Letter: A Romance is an 1850 work of fiction in a historical setting, written by Nathaniel Hawthorne, and is considered to be his best work. Set in 17th-century Puritan Boston, Massachusetts, during the years 1642 to 1649, it tells the story of Hester Prynne, who conceives a daughter through an affair and struggles to create a new life of repentance and dignity. Throughout the book, Hawthorne explores themes of legalism, sin, and guilt.<br/>      From the Back Cover      <br/>Set in 17th-century Puritan New England, this story of illicit passion, guilt and punishment revolves around the beautiful and mysterious Hester Prynne. She is condemned to wear a scarlet letter as a sign of her adultery, and it has a strange and disturbing effect upon those around her - neighbours, husband, lover and child. The student will find a helpful introduction and a full section of resource notes encouraging active and imaginative study methods.<br/>      From School Library Journal      <br/>Grade 9-Up Nathaniel Hawthorne's classic novel of Puritanism giving rise to twisted gender politics, hypocrisy, and strength of character in the face of public scorn is well realized in this reading by Annie Wauters. She gives individual tone and rhythm to each of the main characters, while keeping the passages of narrative relatively uninflected. While this suits the author's own sometimes dry writing, it means that listeners must get to the second hour before the story truly gets underway. Since this lengthy forepart fits almost entirely onto the first disk, and each chapter is clearly marked as to track number on the packaging, it is possible to simply skip ahead rather than give up what becomes a delightfully lively listening experience once the romance gets going. Because the reading adheres so entirely to the print in spirit as well as in word, this is an excellent choice for students who cannot access print or who would like to accomplish college prep reading while undertaking other activities. Sturdy packaging makes this a shelf ready purchase.<br/><br/>Francisca Goldsmith, Berkeley Public Library, CA <br/>Copyright 2002 Reed Business Information, Inc.<br/>      Excerpt. © Reprinted by permission. All rights reserved.      <br/>Chapter 1The Prison-DoorA throng of bearded men, in sad-colored garments, and gray, steeple-crowned hats, intermixed with women, some wearing hoods and others bareheaded, was assembled in front of a wooden edifice, the door of which was heavily timbered with oak, and studded with iron spikes.<br/><br/>The founders of a new colony, whatever Utopia of human virtue and happiness they might originally project, have invariably recognized it among their earliest practical necessities to allot a portion of the virgin soil as a cemetery, and another portion as the site of a prison. In accordance with this rule, it may safely be assumed that the forefathers of Boston had built the first prison-house somewhere in the vicinity of Cornhill, almost as seasonably as they marked out the first burial-ground, on Isaac Johnson's lot, and round about his grave, which subsequently became the nucleus of all the congregated sepulchres in the old churchyard of King's Chapel. Certain it is, that, some fifteen or twenty years after the settlement of the town, the wooden jail was already marked with weather-stains and other indications of age, w", 'language': 'en', 'image': 'https://images.isbndb.com/covers/38/35/9781587263835.jpg', 'title_long': 'The Scarlet Letter', 'dimensions': 'Weight: 0.9 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 0.9}}, 'pages': 224, 'date_published': '2006-07-14', 'subjects': ['Literature & Fiction', 'Classics'], 'authors': ['Nathaniel Hawthorne'], 'title': 'The Scarlet Letter', 'isbn13': '9781587263835', 'msrp': '0.00', 'binding': 'Hardcover', 'isbn': '1587263831', 'isbn10': '1587263831'}}