{'book': {'publisher': 'Brilliance Audio', 'synopsis': "Product Description “As the ultimate outsider, Reacher brings a fresh, if cynical, perspective to a world that he never made — and can’t wait to escape.” — The New York Times “[The] plot is ingenious…This is a superior series.” — The Washington Post Book World “Relentlessly paced…and absolutely mesmerizing.” — Milwaukee Journal Sentinel Skilled, cautious, and anonymous, Jack Reacher is perfect for the job: to assassinate the vice president of the United States. Theoretically, of course. A female Secret Service agent wants Reacher to find the holes in her system, and fast — because a covert group already has the vice president in their sights. They’ve planned well. There’s just one thing they didn’t plan on: Reacher. “Irresistible.” — The Globe and Mail “Everything falls into place like a well-assembled time bomb.” — The Boston Globe “A stunner…the suspense becomes nearly unbearable.” - Booklist About the Author Lee Child is a #1 bestselling author worldwide. His debut novel, Killing Floor, won two awards for best first mystery and was nominated for two more. Foreign rights in the Jack Reacher series have been sold in ninety-five countries. The movie franchise stars Tom Cruise as Jack Reacher. Child, a native of England, is a former television director. He lives in New York City, where he is at work on his next Jack Reacher thriller. From AudioFile Characters never sound middle-of-the-road in Dick Hill's narration. They're brimming with personality, distinctive and vivid. All of that is especially true of Child's protagonist in this gripping, incisive thriller about an attempt to kill the vice president. Jack Reacher, a former military investigator, is cocksure and whip-smart, and Hill gives him swagger, wit, and passion. Reacher is brought in by the Secret Service, first to see if an assassin could get to the vice president and then to stop real assassins from doing just that. The book is a joyride for listeners, full of false leads, dead ends, concussive bursts of action, and characters who are fully realized and individual. This is as much fun as an audiobook performance can be. M.O. Winner of AudioFile Earphones Award © AudioFile 2002, Portland, Maine-- Copyright © AudioFile, Portland, Maine", 'language': 'en', 'image': 'https://images.isbndb.com/covers/06/25/9781590860625.jpg', 'title_long': 'Without Fail (Jack Reacher, No. 6)', 'edition': 'Unabridged', 'dimensions': 'Height: 7 Inches, Length: 4.25 Inches, Weight: 0.8 Pounds, Width: 2.75 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.25}, 'width': {'unit': 'inches', 'value': 2.75}, 'weight': {'unit': 'pounds', 'value': 0.8}, 'height': {'unit': 'inches', 'value': 7}}, 'date_published': '2002-05-17', 'subjects': ['Literature & Fiction', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense'], 'authors': ['Lee Child'], 'title': 'Without Fail (Jack Reacher, No. 6)', 'isbn13': '9781590860625', 'msrp': '0.00', 'binding': 'Audio Cassette', 'isbn': '1590860624', 'isbn10': '1590860624'}}