{'book': {'publisher': 'Shambhala', 'synopsis': 'A comprehensive collection of the most essential versions of The Art of War, the classic Chinese military treatise considered by many as the ultimate strategy guide<br/><br/>Sun Tzu’s Art of War, compiled more than two thousand years ago, is a study of the anatomy of organizations in conflict. It is perhaps the most prestigious and influential book of strategy in the world today. Now, this unique volume brings together the essential versions of Sun Tzu’s text, along with illuminating commentaries and auxiliary texts written by distinguished strategists. The translations, by the renowned translator Thomas Cleary, have all been published previously in book form, except for The Silver Sparrow Art of War, which is available here for the first time. This collection contains:<br/><br/>The Art of War: This edition of Sun Tzu’s text includes the classic collection of commentaries by eleven interpreters.<br/><br/>Mastering the Art of War: Consisting of essays by two prominent statesmen-generals of Han dynasty China, Zhuge Liang and Liu Ji, this book develops the strategies of Sun Tzu’s classic into a complete handbook of organization and leadership. It draws on episodes from Chinese history to show in concrete terms the proper use of Sun Tzu’s principles.<br/><br/>The Silver Sparrow Art of War: A version of Sun Tzu’s Art of War based on a manuscript of the classic text discovered at a Chinese archeological site in China’s Shandong Province in 1972, which contains previously unknown fragments.<br/><br/>Note: The electronic edition of this book does not contain The Lost Art of War, as seen in the paperback edition.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/22/55/9781590302255.jpg', 'title_long': 'The Art of War', 'edition': 'Reprint', 'dimensions': 'Weight: 1 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 1}}, 'pages': 224, 'date_published': '2005', 'subjects': ['Business & Money', 'Personal Finance', 'History', 'Military', 'Intelligence & Espionage', 'Strategy', 'Engineering & Transportation', 'Engineering', 'Religion & Spirituality', 'Politics & Social Sciences', 'Philosophy', 'Eastern'], 'authors': ['Sun Tzu', 'Thomas Cleary (translator)'], 'title': 'The Art of War', 'isbn13': '9781590302255', 'msrp': 7.99, 'binding': 'Paperback', 'related': {'ePub': '0834827301'}, 'isbn': '1590302257', 'isbn10': '1590302257', 'other_isbns': [{'isbn': '9780834827301', 'binding': 'printisbn'}]}}