{'book': {'publisher': 'Multnomah', 'synopsis': "Surrounded by no good options, much less safe ones, Desiree Jacobs knows that no matter what she must protect her father's reputation and his legacy.<br/><br/>If Desiree Jacobs knows anything, it’s art. Her father, whose security company is internationally renowned, taught her everything he knew. Most of all, he taught her about honor. Integrity. Faith. So surely God will forgive her for despising the one man--Special Agent Tony Lucano, who's determined to destroy her father’s good name?<br/><br/>Agent Lucano knows that Hiram Jacobs is an art thief. But what he can’t figure out is Desiree. Is she an innocent victim…or a clever accomplice?<br/><br/>When Hiram is murdered, along with his company, he leaves Desiree a hidden container full of stolen paintings. But she can’t believe that her father was a thief! If it were true, it would destroy their business, cost people their jobs, and embarrass international museums that have been displaying clever forgeries. No, she must figure out why her honest father would turn criminal herself. Even if it means facing down a ring of cutthroat art thieves…or accepting help from the man she most distrusts. With danger at every turn, can Desiree trust God to guide her down the right path?", 'language': 'en', 'image': 'https://images.isbndb.com/covers/68/66/9781590526866.jpg', 'title_long': 'Reluctant Burglar (To Catch a Thief Series #1)', 'edition': 'First Edition', 'dimensions': 'Height: 8.22 Inches, Length: 5.23 Inches, Weight: 0.65477291814 Pounds, Width: 0.96 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.23}, 'width': {'unit': 'inches', 'value': 0.96}, 'weight': {'unit': 'pounds', 'value': 0.65477291814}, 'height': {'unit': 'inches', 'value': 8.22}}, 'pages': 352, 'date_published': '2006-08-15', 'subjects': ['Christian Books & Bibles', 'Literature & Fiction', 'Romance', 'United States', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense', 'Religion & Spirituality', 'Mystery', 'Contemporary', 'Romantic Suspense'], 'authors': ['Jill Elizabeth Nelson'], 'title': 'Reluctant Burglar (To Catch a Thief Series #1)', 'isbn13': '9781590526866', 'msrp': 9.99, 'binding': 'Paperback', 'related': {'ePub': '0307562352'}, 'isbn': '1590526864', 'isbn10': '1590526864', 'other_isbns': [{'isbn': '9780307562357', 'binding': 'printisbn'}]}}