{'book': {'publisher': 'Shambhala', 'synopsis': "According to Zen teacher Cheri Huber, we are conditioned to think that if we were only a little better in some way, we would be happy: “Life isn't the way it should be and it's my fault!” But, Huber says, no amount of self-punishment will ever make us happy or bring us control over life’s problems.<br/><br/>The help we are looking for is really found in self-acceptance and kindness toward ourselves. By simply allowing ourselves to be guided by our innate intelligence and generosity, which are our authentic nature, we are able to be compassionately present to what’s happening now. Compassionate self-discipline—the will to take positive steps in life—is found through nothing other than being present. When we are present and aware, we are not engaged in distracting, addictive behaviors. If we simply cultivate our ability to pay attention and focus on what is here in this moment, our experience can be authentic, awake, honest, and joyful.<br/><br/>The book includes a guided thirty-day program of daily meditation, contemplation, and journaling.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/20/88/9781590302088.jpg', 'title_long': 'Making a Change for Good: A Guide to Compassionate Self-Discipline', 'edition': '58370th', 'dimensions': 'Height: 8.45 Inches, Length: 5.5 Inches, Weight: 0.41005980732 Pounds, Width: 0.4 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.4}, 'weight': {'unit': 'pounds', 'value': 0.41005980732}, 'height': {'unit': 'inches', 'value': 8.45}}, 'pages': 144, 'date_published': '2007-03-13', 'subjects': ['Self-Help', 'Self-Esteem', 'Spiritual', 'Health, Fitness & Dieting', 'Psychology & Counseling', 'Religion & Spirituality', 'Politics & Social Sciences', 'Philosophy', 'Ethics & Morality'], 'authors': ['Cheri Huber'], 'title': 'Making a Change for Good: A Guide to Compassionate Self-Discipline', 'isbn13': '9781590302088', 'msrp': 14.95, 'binding': 'Paperback', 'related': {'ePub': '0834822563'}, 'isbn': '1590302087', 'isbn10': '1590302087', 'other_isbns': [{'isbn': '9780834822566', 'binding': 'printisbn'}]}}