{'book': {'publisher': 'VIZ Media LLC', 'synopsis': "An epic fantasy tale written and illustrated by the legendary director Hayao Miyazaki!<br/><br/>In a long-ago war, humankind set off a devastating ecological disaster. Thriving indistrial societies disappeared. The earth is slowly submerging beneath the expanding Sea of Corruption, an enormous toxic forest that creates mutant insects and releases a miasma of poisonous spores into the air.At the periphery of the sea, tiny kingdoms are scattered on tiny parcels of land. Here lies the Valley of the Wind, a kingdom of barely 500 citizens; a nation given fragile protection from the decaying sea's poisons by the ocean breezes; and home to Nausicaä.<br/><br/>Now, Princess Nausicaä and the God Warrior, a biotechnological abomination of the war known as the Seven Days of Fire, embark on a journey to the Crypt of Shuwa to seal away the terrible weaponry hidden within. But everyone seems to be conspiring to prevent Nausicaä from carrying out her mission, even the guardian of the crypt himself!", 'language': 'en', 'image': 'https://images.isbndb.com/covers/35/58/9781591163558.jpg', 'title_long': 'Nausicaa of the Valley of the Wind, Vol. 7 (Nausicaä of the Valley of the Wind)', 'edition': '2nd', 'dimensions': 'Height: 10.125 Inches, Length: 7.125 Inches, Weight: 0.77602716224 Pounds, Width: 0.6 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.125}, 'width': {'unit': 'inches', 'value': 0.6}, 'weight': {'unit': 'pounds', 'value': 0.77602716224}, 'height': {'unit': 'inches', 'value': 10.125}}, 'pages': 232, 'date_published': '2004-09-07', 'subjects': ['Comics & Graphic Novels', 'Comic Strips', 'Manga', 'Fantasy', 'Action & Adventure', 'Media Tie-In', 'Teen & Young Adult', 'Literature & Fiction'], 'authors': ['Hayao Miyazaki'], 'title': 'Nausicaa of the Valley of the Wind, Vol. 7 (Nausicaä of the Valley of the Wind)', 'isbn13': '9781591163558', 'msrp': 12.99, 'binding': 'Paperback', 'isbn': '1591163552', 'isbn10': '1591163552'}}