{'book': {'publisher': 'Sentient Publications', 'synopsis': 'In this book, renowned philosopher and scholar of religion Huston Smith, takes a serious look at the use of psychedelic drugs as a means to achieve mystical union with the divine. In a unique blend of direct experience and academic depth, Smith examines this controversial subject and describes the historic and turbulent academic experiments of the sixties in which he was both a subject and an observer. Smith begins by telling the story of his own initiation into the world of psychedelic drugs in the company of Timothy Leary—a meeting arranged by Aldous Huxley—and the profound effect it had on his understanding of reality. In wrestling with the question—Do drugs have religious import?—he draws on history, theology, philosophy, psychology, and anthropology.<br/><br/>He tells of fascinating experiments that attempted to shed light on this question, such as the one in which he participated as a guide, where twenty volunteers—mostly seminary students—were given psilocybin before they attended a traditional Good Friday church service. He discusses as well the use of peyote in Native American sacred rituals and the hallucinogenic plant soma in ancient India. Throughout, he does not approach the question of drugs and religion from any fixed standpoint. Instead, he mines his own experiences and his relationships to pioneers in this field to come up with insights on this intriguing subject that are not available in any other book written for the general public.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/00/87/9781591810087.jpg', 'title_long': 'Cleansing the Doors of Perception: The Religious Significance of Entheogenic Plants and Chemical', 'edition': '3', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.71 Pounds, Width: 0.49 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.49}, 'weight': {'unit': 'pounds', 'value': 0.71}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 173, 'date_published': '2003-09-12', 'subjects': ['Health, Fitness & Dieting', 'Alternative Medicine', 'Meditation', 'History', 'Historical Study & Educational Resources', 'Religion & Spirituality', 'New Age & Spirituality', 'Mysticism', 'Spiritualism', 'Occult & Paranormal', 'Parapsychology', 'Religious Studies', 'Sociology'], 'authors': ['Huston Smith'], 'title': 'Cleansing the Doors of Perception: The Religious Significance of Entheogenic Plants and Chemical', 'isbn13': '9781591810087', 'msrp': 9.97, 'binding': 'Paperback', 'isbn': '1591810086', 'isbn10': '1591810086'}}