{'book': {'publisher': 'Macmillan Audio', 'synopsis': "The thrilling fourth volume in the bestselling Covert-One series<br/><br/>On the dark waterside docks of Shanghai, a photographer is recording cargo being secretly loaded when he's brutally killed and his camera destroyed. Two weeks later, on the dangerous high seas, the U.S. Navy covertly tracks a Chinese cargo ship rumored to carry tons of chemicals for Saddam Hussein to create new biological weapons. The president cannot let the ship reach Iraq. At the same time, he doesn't want the navy to attack and board it either, because decades of negotiations with China have at long last yielded a landmark human rights agreement that China is willing to sign. Fighting to keep the agreement on track, the president orders the head of Covert-One to find proof of what the Chinese ship is ferrying. Under cover of a medical conference, operative Col. Jon Smith is sent to Taiwan to rendezvous with another agent who has acquired the ship's true manifest. But the second agent is murdered, the proof is destroyed, and Smith is left only with a verbal message--the president's biological father is still alive, held prisoner by the Chinese for fifty years. Racing against the clock, Smith uncovers the truth about the ship, a truth that probes the deepest secrets of the Chinese ruling party and reveals a terrifying cabal whose diabolical plan thrusts the world to the very brink of war.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/88/60/9781593978860.jpg', 'title_long': "Robert Ludlum's The Altman Code: A Covert-One Novel (Covert-One, 4)", 'edition': 'Abridged', 'dimensions': 'Height: 5.77 Inches, Length: 5.24 Inches, Weight: 0.36 Pounds, Width: 0.8098409 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.24}, 'width': {'unit': 'inches', 'value': 0.8098409}, 'weight': {'unit': 'pounds', 'value': 0.36}, 'height': {'unit': 'inches', 'value': 5.77}}, 'date_published': '2005-09-30', 'subjects': ['Literature & Fiction', 'Contemporary', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Spies & Politics', 'Suspense', 'Self Service', 'Custom Stores'], 'authors': ['Robert Ludlum', 'Gayle Lynds'], 'title': "Robert Ludlum's The Altman Code: A Covert-One Novel (Covert-One, 4)", 'isbn13': '9781593978860', 'msrp': 14.95, 'binding': 'Audio CD', 'isbn': '1593978863', 'isbn10': '1593978863'}}