{'book': {'publisher': 'Macmillan Audio', 'synopsis': 'Two classic audio programs from one of the world’s most influential contemporary spiritual teachers, now available in one volume on cd<br/><br/>In Part One: Finding and Exploring your Spiritual Path, Ram Dass speaks from the heart with wisdom gained from a lifetime spent on the path to enlightenment about the often rocky yet profoundly transforming road to living the spiritual life. With personal anecdotes and commentary, he illuminates a wide variety of ancient and contemporary philosophies, drawing from such sources as the Buddha, Russian philosopher Gurdjieff, Mahatma Ghandi, and many others. Here is down-to-earth advice for those on the path to spiritual fulfillment, the pleasures and pitfalls you will encounter en route, the value and potential dangers of teachers and gurus, and the importance of following your intuitive heart.In Part Two: Journey of Awakening, Ram Dass focuses on the moments crucial to the serious seeker of the spiritual path. Meditation is an essential part of that practice. Why meditate? To live in the moment. To dwell in the harmony of things. To awaken. Those moments in your life when there is an openness, a spacious quality to your existence —those are the moments that truly make life remarkable.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/67/29/9781593976729.jpg', 'title_long': 'A Spiritual Journey', 'edition': 'Unabridged', 'dimensions': 'Height: 5.15 Inches, Length: 5.69 Inches, Weight: 0.25 Pounds, Width: 0.54 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.69}, 'width': {'unit': 'inches', 'value': 0.54}, 'weight': {'unit': 'pounds', 'value': 0.25}, 'height': {'unit': 'inches', 'value': 5.15}}, 'date_published': '2005-08-01', 'subjects': ['Self-Help', 'Personal Transformation', 'Health, Fitness & Dieting', 'Alternative Medicine', 'Meditation', 'Religion & Spirituality', 'Politics & Social Sciences'], 'authors': ['Ram Dass'], 'title': 'A Spiritual Journey', 'isbn13': '9781593976729', 'msrp': 19.95, 'binding': 'Audio CD', 'isbn': '1593976720', 'isbn10': '1593976720'}}