{'book': {'publisher': 'Barnes & Noble Classics', 'synopsis': '&&LDIV&&R&&LI&&REssential Dialogues of Plato&&L/I&&R, by &&LB&&RPlato&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&R New introductions commissioned from todays top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the readers viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriate All editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences―biographical, historical, and literary―to enrich each readers understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&LP&&RPlato is one of those world-famed individuals, his philosophy one of those world-renowned creations, whose influence, as regards the culture and development of the mind, has from its commencement down to the present time been all-important.&&LBR&&R― &&LSTRONG&&RG. W. F. Hegel&&L/B&&R&&L/P&&R&&LP&&RWestern philosophy starts with Socrates and his student &&LSTRONG&&RPlato&&L/B&&R. By way of the dialectic that evolved between master and student, Plato invented the philosophical method of inquiry and analysis, and became the first to use a logical framework to ask―and try to answer―the eternal questions about ethics, politics, art, and life that still haunt humanity: What is virtue? What is justice? What is the ideal form of government? What is the individual’s relationship to the state? Do artists have a responsibility to society, or only to their own creative impulse? Plato explores these issues through a series of dialogues, records of supposed conversations between Socrates and other Greek aristocrats. Although Socrates is nominally the main speaker in all of them, only the earlier dialogues document his thoughts, while the latter ones present Plato’s own ideas.&&L/P&&R&&LP&&RWhat is often ignored in commentaries on Plato’s work is its unique literary form. The dialogues are neither dramas, nor stories, yet they are skillfully fashioned by means of characters, narrative events, dramatic moments, and perhaps most surprising, a great deal of humor. Along with such exemplars of Plato’s thought as Symposium, Apology, and Phaedrus, this volume includes the first three books of Plato’s Laws.&&L/P&&R&&LDIV&&R&&LDIV&&R&&LSTRONG&&RPedro De Blas&&L/B&&R holds degrees in Law and Classics. He has worked as counsel for several international organizations, including the United Nations and the World Bank, and he is currently a Ph.D. candidate in Classics at Columbia University. He has taught classical languages and literature at Columbia, the CUNY Latin and Greek Institute, and New York University’s Gallatin School.&&L/DIV&&R&&L/DIV&&R', 'language': 'en', 'image': 'https://images.isbndb.com/covers/26/97/9781593082697.jpg', 'title_long': 'Essential Dialogues of Plato (Barnes & Noble Classics)', 'edition': 'Special Value', 'dimensions': 'Height: 8 Inches, Length: 5.1875 Inches, Weight: 1.12 Pounds, Width: 1.56 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.1875}, 'width': {'unit': 'inches', 'value': 1.56}, 'weight': {'unit': 'pounds', 'value': 1.12}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 624, 'date_published': '2005-10-05', 'subjects': ['Literature & Fiction', 'Classics', 'Politics & Social Sciences', 'Philosophy'], 'authors': ['Plato'], 'title': 'Essential Dialogues of Plato (Barnes & Noble Classics)', 'isbn13': '9781593082697', 'msrp': 9.95, 'binding': 'Paperback', 'isbn': '159308269X', 'isbn10': '159308269X', 'other_isbns': [{'isbn': '9781411432130', 'binding': 'printisbncanonical'}]}}