{'book': {'publisher': 'Barnes & Noble Classics', 'synopsis': '&&LDIV&&R&&LDIV&&R&&LI&&RThe Good Soldier&&L/I&&R by &&LB&&RFord Maddox Ford&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&R New introductions commissioned from today\'s top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader\'s viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriate All editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences―biographical, historical, and literary―to enrich each reader\'s understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&LP style="MARGIN: 0in 0in 0pt"&&R &&L/P&&R&&LP style="MARGIN: 0in 0in 0pt"&&RHandsome, wealthy, and a veteran of service in India, Captain Edward Ashburnham appears to be the ideal “good soldier” and the embodiment of English upper-class virtues. But for his creator, &&LB&&RFord Madox Ford&&L/B&&R, he also represents the corruption at society’s core. Beneath Ashburnham’s charming, polished exterior lurks a soul well-versed in the arts of deception, hypocrisy, and betrayal. Throughout the nine years of his friendship with an equally privileged American, John Dowell, Ashburnham has been having an affair with Dowell’s wife, Florence. Unlike Dowell, Ashburnham’s own wife, Leonora, is well aware of it. &&LBR&&R&&LBR&&RWhen &&LI&&RThe Good Soldier&&L/I&&R was first published in 1915, its pitiless portrait of an amoral society dedicated to its own pleasure and convinced of its own superiority outraged many readers. Stylistically daring, &&LI&&RThe Good Soldier&&L/I&&R is narrated, unreliably, by the naïve Dowell, through whom Ford provides a level of bitter irony. Dowell’s disjointed, stumbling storytelling not only subverts linear temporality to satisfying effect, it also reflects his struggle to accept a world without honor, order, or permanence. Called the best French novel in the English language, &&LI&&RThe Good Soldier&&L/I&&R is both tragic and darkly comic, and it established Ford as an important contributor to the development of literary modernism.&&LBR&&R&&L/P&&R&&LP style="MARGIN: 0in 0in 0pt"&&R&&LSTRONG&&RFrank Kermode&&L/B&&R has taught at Manchester, London, and Cambridge Universities as well as at Harvard, Yale, and Columbia. Among his many books the most recent are &&LI&&RShakespeare’s Language, Pieces of My Mind,&&L/I&&R and &&LI&&RThe Age of Shakespeare.&&L/I&&R&&L/P&&R&&L/DIV&&R', 'language': 'en', 'image': 'https://images.isbndb.com/covers/26/80/9781593082680.jpg', 'title_long': 'The Good Soldier (Barnes & Noble Classics Series)', 'edition': 'Illustrated', 'dimensions': 'Height: 7.999984 Inches, Length: 5.1873912 Inches, Weight: 0.48 Pounds, Width: 0.63999872 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.1873912}, 'width': {'unit': 'inches', 'value': 0.63999872}, 'weight': {'unit': 'pounds', 'value': 0.48}, 'height': {'unit': 'inches', 'value': 7.999984}}, 'pages': 256, 'date_published': '2005-03-28', 'subjects': ['Literature & Fiction', 'Classics', 'Genre Fiction', 'War'], 'authors': ['Ford Madox Ford'], 'title': 'The Good Soldier (Barnes & Noble Classics Series)', 'isbn13': '9781593082680', 'msrp': 6.95, 'binding': 'Paperback', 'isbn': '1593082681', 'isbn10': '1593082681', 'other_isbns': [{'isbn': '9781411432246', 'binding': 'printisbncanonical'}]}}