{'book': {'publisher': 'Cold Spring Press', 'synopsis': 'Turgon (co-author of The People\'s Guide to J.R.R. Tolkien) and one of the founding members and main contributors of the Internet\'s most popular Tolkien fan website - theoneing.net - presents modern prose renderings of some of the essential works of medieval literature that were inspirations to Tolkien. These prose versions introduce to Tolkien\'s wide readership the works of medieval literature that were his greatest professional interests. For those daunted by the alliterative verse-form of Sir Gawain and the Green Knight, even in Tolkien\'s own translation, here is the essential narrative of the poem to be read in readable, updated prose. It can thus be used as stepping stone in approaching Tolkien\'s excellent translation, where the artistry of the verse will be more quickly appreciated when the story is already familiar. Other major works included are Beowulf, the Edda of Snorri Sturleson, and the Saga of the Volsungs from the Kalevala. These versions should not be seen as scholarly translations, but as popular renderings to enrich any Tolkien fan\'s appreciation of Middle-earth, and as an accessible entry into the fascinating world of medieval literature. "This volume serves a very useful purpose for Tolkien\'s devoted readers: collecting together in one place readable versions of the essential medieval works that shaped Tolkien\'s literary interests and in turn influenced significantly the creation of his invented world of Middle-earth."', 'language': 'en', 'image': 'https://images.isbndb.com/covers/01/12/9781593600112.jpg', 'title_long': "The Tolkien Fan's Medieval Reader: Versions in Modern Prose (Cold Spring Press Fantasy)", 'edition': '1', 'dimensions': 'Height: 8.25 Inches, Length: 5.25 Inches, Weight: 1 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 416, 'date_published': '2004-04-06', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Movements & Periods', 'Genres & Styles', 'Science Fiction & Fantasy', 'Science Fiction'], 'authors': ['Turgon', 'Verlyn Flieger (Foreword)'], 'title': "The Tolkien Fan's Medieval Reader: Versions in Modern Prose (Cold Spring Press Fantasy)", 'isbn13': '9781593600112', 'msrp': 14.95, 'binding': 'Paperback', 'isbn': '1593600119', 'isbn10': '1593600119'}}