{'book': {'publisher': 'Barnes & Noble Classics', 'synopsis': '&&LDIV&&R&&LP&&R&&LI&&RSense and Sensibility&&L/I&&R, by &&LSTRONG&&RJane Austen&&L/B&&R, is part of the &&LI&&R&&LI&&RBarnes & Noble Classics&&L/I&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&L/P&&R&&LDIV&&R New introductions commissioned from todays top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the readers viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriate All editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences―biographical, historical, and literary―to enrich each readers understanding of these enduring works.&&L/DIV&&R&&LP&&R&&LB&&RJane Austen&&L/B&&R’s first published novel, &&LI&&RSense and Sensibility&&L/I&&R is a wonderfully entertaining tale of flirtation and folly that revolves around two starkly different sisters, Elinor and Marianne Dashwood. While Elinor is thoughtful, considerate, and calm, her younger sister is emotional and wildly romantic. Both are looking for a husband, but neither Elinor’s reason nor Marianne’s passion can lead them to perfect happiness―as Marianne falls for an unscrupulous rascal and Elinor becomes attached to a man who’s already engaged. &&L/P&&R&&LP class=MsoNormal&&RStartling secrets, unexpected twists, and heartless betrayals interrupt the marriage games that follow. Filled with satiric wit and subtle characterizations, &&LI&&RSense and Sensibility&&L/I&&R teaches that true love requires a balance of reason and emotion.&&L/P&&R&&LP style="MARGIN: 0in 0in 0pt"&&R&&LSTRONG&&RLaura Engel&&L/B&&R received her BA from Bryn Mawr College and her MA and PhD from Columbia University. She has taught in independent schools in New York city and is now a visiting assistant professor of English at Macalester College. Her previous publications include essays on the novelists A. S. Byatt and Edna O’Brien. Her forthcoming book is a biography of three eighteenth-century British actresses.&&L/P&&R&&L/DIV&&R&&L/B&&R&&L/B&&R', 'language': 'en', 'image': 'https://images.isbndb.com/covers/12/56/9781593081256.jpg', 'title_long': 'Sense and Sensibility (Barnes & Noble Classics)', 'edition': 'Illustrated', 'dimensions': 'Height: 8 Inches, Length: 5.1875 Inches, Weight: 0.66 Pounds, Width: 0.88 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.1875}, 'width': {'unit': 'inches', 'value': 0.88}, 'weight': {'unit': 'pounds', 'value': 0.66}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 352, 'date_published': '2004-07-25', 'subjects': ['Literature & Fiction', 'Classics', 'Literary', 'Romance', 'Historical', 'Regency'], 'authors': ['Jane Austen'], 'title': 'Sense and Sensibility (Barnes & Noble Classics)', 'isbn13': '9781593081256', 'msrp': 5.95, 'binding': 'Paperback', 'isbn': '1593081251', 'isbn10': '1593081251', 'other_isbns': [{'isbn': '9781411433144', 'binding': 'printisbncanonical'}]}}