{'book': {'publisher': 'Sterling Publishing', 'synopsis': "&&LDIV&&R&&LDIV&&R&&LI&&RRobinson Crusoe&&L/I&&R, by &&LB&&RDaniel Defoe&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&R New introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriate All editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences―biographical, historical, and literary―to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&L/DIV&&R&&LDIV&&R &&L/DIV&&R&&LDIV&&RWidely regarded as the first English novel, &&LB&&RDaniel Defoe’s&&L/B&&R &&LI&&RRobinson Crusoe&&L/I&&R is one of the most popular and influential adventure stories of all time. This classic tale of shipwreck and survival on an uninhabited island was an instant success when first published in 1719 and has inspired countless imitations. &&LP&&RIn his own words, Robinson Crusoe tells of the terrible storm that drowned all his shipmates and left him marooned on a deserted island. Forced to overcome despair, doubt, and self-pity, he struggles to create a life for himself in the wilderness. From practically nothing, Crusoe painstakingly learns how to make pottery, grow crops, domesticate livestock, and build a house. His many adventures are recounted in vivid detail, including a fierce battle with cannibals and his rescue of Friday, the man who becomes his trusted companion. &&LP&&RFull of enchanting detail and daring heroics, &&LI&&RRobinson Crusoe&&L/I&&R is a celebration of courage, patience, ingenuity, and hard work.&&L/P&&R&&LP&&R&&LB&&RL. J. Swingle&&L/B&&R is Professor Emeritus of English Literature at the University of Kentucky, where his primary field of study is the intellectual contexts of British Romanticism as reflected in the works of eighteenth- and nineteenth-century poets and novelists.&&L/P&&R&&L/DIV&&R", 'language': 'en', 'image': 'https://images.isbndb.com/covers/01/12/9781593080112.jpg', 'title_long': 'Robinson Crusoe (Barnes & Noble Classics Series) (B&N Classics)', 'edition': 'Illustrated', 'dimensions': 'Height: 6.7499865 Inches, Length: 4.1251886 Inches, Weight: 0.45 Pounds, Width: 0.87999824 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.1251886}, 'width': {'unit': 'inches', 'value': 0.87999824}, 'weight': {'unit': 'pounds', 'value': 0.45}, 'height': {'unit': 'inches', 'value': 6.7499865}}, 'pages': 352, 'date_published': '2003-04-01', 'subjects': ['Literature & Fiction', 'Classics', 'History & Criticism', 'Regional & Cultural', 'Teen & Young Adult', 'Action & Adventure'], 'authors': ['Daniel Defoe'], 'title': 'Robinson Crusoe (Barnes & Noble Classics Series) (B&N Classics)', 'isbn13': '9781593080112', 'msrp': 5.95, 'binding': 'Mass Market Paperback', 'isbn': '1593080115', 'isbn10': '1593080115'}}