{'book': {'publisher': 'Barnes & Noble Classics', 'synopsis': '&&LDIV&&R&&LDIV&&R&&LI&&RWard No. 6 and Other Stories&&L/I&&R, by &&LSTRONG&&RAnton Chekhov&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&R New introductions commissioned from today\'s top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader\'s viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriate All editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences―biographical, historical, and literary―to enrich each reader\'s understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&L/DIV&&R&&LDIV&&R&&LSTRONG&&R&&L/B&&R &&L/DIV&&R&&LDIV&&R&&LSTRONG&&RAnton Chekhov&&L/B&&R invented the modern short story. With writing that is concise, realistic, and evocative, he became a sort of photographer in words, less interested in plot than in the subtleties of mood and atmosphere, and the telling detail. His characters, always vividly drawn, come from all walks of life and often seem to be caught up in a world they don’t quite understand. &&L/DIV&&R&&LP&&REarly in his brief literary career, Chekhov outlined in a letter to his brother his idea of the ingredients of a good short story. Arguing against moral judgments and political, economic, or social commentary, he wrote, “To describe . . . you need . . . to free yourself from the personal expression. . . . Subjectivity is a terrible thing.” Instead, he favored objectivity, truthfulness, originality, compassion, and brevity. Although his writing developed and matured, he remained largely faithful to these principles. &&L/P&&R&&LP&&RThis new selection of twenty-three stories explores the entire range of Chekhov’s short fiction, from early sketches, such as “The Cook’s Wedding” (1885) and “On the Road” (1886) to late works, such as “In the Ravine” (1900) and “The Bishop" (1902). &&LI&&RWard No. 6 and Other Stories&&L/I&&R includes some of his most popular tales, such as the title story and “The Lady with the Dog” (1899), as well as several lesser-known works, no less masterful in their composition. &&L/P&&R&&LP&&R&&LB&&RDavid Plante&&L/B&&R is a Professor of Writing at Columbia University. He is the author of many novels, including &&LI&&RThe Ghost of Henry James, The Family&&L/I&&R (nominated for the National Book Award), and &&LI&&RThe Woods&&L/I&&R. He has been a contributor to &&LI&&RThe New Yorker, Esquir&&L/I&&Re, and &&LI&&RVogue&&L/I&&R, and a reviewer and features writer for the &&LI&&RNew York Times Book Review&&L/I&&R. &&L/P&&R', 'language': 'en', 'image': 'https://images.isbndb.com/covers/00/37/9781593080037.jpg', 'title_long': 'Ward No. 6 and Other Stories (Barnes & Noble Classics Series)', 'edition': 'Special Value', 'dimensions': 'Height: 7.999984 Inches, Length: 5.1873912 Inches, Weight: 0.74 Pounds, Width: 0.999998 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.1873912}, 'width': {'unit': 'inches', 'value': 0.999998}, 'weight': {'unit': 'pounds', 'value': 0.74}, 'height': {'unit': 'inches', 'value': 7.999984}}, 'pages': 400, 'date_published': '2003-07-01', 'subjects': ['Literature & Fiction', 'Classics', 'Short Stories & Anthologies', 'Anthologies', 'Short Stories', 'Contemporary'], 'authors': ['Anton Chekhov'], 'title': 'Ward No. 6 and Other Stories (Barnes & Noble Classics Series)', 'isbn13': '9781593080037', 'msrp': 7.95, 'binding': 'Paperback', 'isbn': '1593080034', 'isbn10': '1593080034'}}