{'book': {'publisher': 'Barnes & Noble Classics', 'synopsis': "Main Street, by Sinclair Lewis, is part of the Barnes & Noble Classicsseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics: New introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriate All editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works. “This is America—a town of a few thousand, in a region of wheat and corn and dairies and little groves.” So Sinclair Lewis—recipient of the Nobel Prize and rejecter of the Pulitzer—prefaces his novel Main Street. Lewis is brutal in his depictions of the self-satisfied inhabitants of small-town America, a place which proves to be merely an assemblage of pretty surfaces, strung together and ultimately empty.<br/>Brooke Allen holds a Ph.D. in English literature from Columbia University. She is a book critic whose work has appeared in numerous publications including The Atlantic Monthly, The New Criterion, The New York Times Book Review, The Wall Street Journal, The Hudson Review, and The New Leader. A collection of her essays, Twentieth Century Attitudes, will be published in 2003.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/03/65/9781593080365.jpg', 'title_long': 'Main Street (Barnes & Noble Classics Series) (B&N Classics)', 'edition': 'Special Value', 'dimensions': 'Height: 6.75 Inches, Length: 4.13 Inches, Weight: 0.7 Pounds, Width: 1.4 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.13}, 'width': {'unit': 'inches', 'value': 1.4}, 'weight': {'unit': 'pounds', 'value': 0.7}, 'height': {'unit': 'inches', 'value': 6.75}}, 'pages': 560, 'date_published': '2003-08-01', 'subjects': ['Literature & Fiction', 'Classics'], 'authors': ['Sinclair Lewis'], 'title': 'Main Street (Barnes & Noble Classics Series) (B&N Classics)', 'isbn13': '9781593080365', 'msrp': 5.95, 'binding': 'Mass Market Paperback', 'isbn': '1593080360', 'isbn10': '1593080360', 'other_isbns': [{'isbn': '9781411432628', 'binding': 'printisbncanonical'}]}}