{'book': {'publisher': 'Sterling Publishing', 'synopsis': '&&LDIV&&R&&LDIV&&R&&LI&&RThe Idiot&&L/I&&R, by &&LB&&RFyodor Dostoevsky&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&R New introductions commissioned from todays top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the readers viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriate All editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences―biographical, historical, and literary―to enrich each readers understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&L/DIV&&R&&LDIV&&R &&L/DIV&&R&&LDIV&&RJust two years after completing &&LI&&RCrime and Punishment,&&L/I&&R which explored the mind of a murderer, &&LB&&RDostoevsky&&L/B&&R produced another masterpiece, &&LI&&RThe Idiot.&&L/I&&R This time the author portrays a truly beautiful soul―a character he found difficult to bring to life because, as he wrote, “beauty is the ideal, and neither my country, nor civilized Europe, know what that ideal of beauty is.” The result was one of Dostoevsky’s greatest characters―Prince Myshkin, a saintly, Christ-like, yet deeply human figure.&&LBR&&R&&LBR&&RThe story begins when Myshkin arrives on Russian soil after a stay in a Swiss sanatorium. Scorned by St. Petersburg society as an idiot for his generosity and innocence, the prince finds himself at the center of a struggle between a rich, kept woman and a beautiful, virtuous girl, who both hope to win his affection. Unfortunately, Myshkin’s very goodness seems to bring disaster to everyone he meets. The shocking denouement tragically reveals how, in a world obsessed with money, power, and sexual conquest, a sanatorium is the only place for a saint.&&L/DIV&&R&&LDIV&&R &&L/DIV&&R&&LDIV&&R&&LP style="MARGIN: 0in 0in 0pt"&&R&&LSTRONG&&RJoseph Frank&&L/B&&R &&L/B&&Ris Professor Emeritus of Comparative Literature at Princeton University and Professor Emeritus of Comparative Literature and Slavic Languages and Literature at Stanford University. He is the author of a five-volume study of Dostoevsky’s life and work. The first four volumes received the National Book Critics Circle Award for Biography, two Christian Gauss Awards, two James Russell Lowell Awards of the Modern Language Association, a Los Angeles Times Book Prize, and other honors. Frank is also the author of &&LI&&RThrough the Russian Prism: Essays on Literature and Culture, The Widening Gyre,&&L/I&&R and &&LI&&RThe Idea of Spatial Form.&&L/I&&R He also wrote the introduction to the Barnes & Noble Classics edition of Dostoevsky’s &&LI&&RThe House of the Dead and Poor Folk.&&L/I&&R&&L/P&&R&&L/DIV&&R', 'language': 'en', 'image': 'https://images.isbndb.com/covers/05/87/9781593080587.jpg', 'title_long': 'The Idiot (Barnes & Noble Classics Series)', 'edition': 'Special Value', 'dimensions': 'Height: 7.999984 Inches, Length: 5.1873912 Inches, Weight: 1.11 Pounds, Width: 1.51999696 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.1873912}, 'width': {'unit': 'inches', 'value': 1.51999696}, 'weight': {'unit': 'pounds', 'value': 1.11}, 'height': {'unit': 'inches', 'value': 7.999984}}, 'pages': 608, 'date_published': '2004-01-16', 'subjects': ['Literature & Fiction', 'Classics'], 'authors': ['Fyodor Dostoevsky'], 'title': 'The Idiot (Barnes & Noble Classics Series)', 'isbn13': '9781593080587', 'msrp': 10.95, 'binding': 'Paperback', 'isbn': '1593080581', 'isbn10': '1593080581', 'other_isbns': [{'isbn': '9781411432369', 'binding': 'printisbncanonical'}]}}