{'book': {'publisher': 'Westholme Publishing', 'synopsis': 'The First Illustrated Story of the Legendary Thoroughbred Who Captured the Heart of a Nation<br/>Originally published in 1940 when Seabiscuit and all the major characters were alive, and written by someone who knew them, Seabiscuit: The Saga of a Great Champion gives readers an opportunity to experience the thrill of Seabiscuit’s life as it actually happened. Presented in its original oversize trim and featuring period photographs and specially commissioned artwork by Howard Brodie, Seabiscuit: The Saga of a Great Champion follows the thoroughbred’s illustrious career from his humble birth in Kentucky to his remarkable string of races across the country from 1936 to 1940, and culminating in his stunning come-back victory at Santa Anita—a moment that confirmed Seabiscuit as one of the greatest racehorses of all time. In researching her best-selling Seabiscuit: An American Legend, Laura Hillenbrand drew on B. K. Beckwith’s book, a rare contemporary account that preserves insights, anecdotes, and quotes found no where else. As Grantland Rice said at the time, “Here you get the true story of the most dramatic thoroughbred racing has ever known.”', 'language': 'en', 'image': 'https://images.isbndb.com/covers/00/04/9781594160004.jpg', 'title_long': 'Seabiscuit: The Saga of a Great Champion', 'dimensions': 'Height: 9 Inches, Length: 12 Inches, Weight: 0.26014546916 Pounds, Width: 0.2 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 12}, 'width': {'unit': 'inches', 'value': 0.2}, 'weight': {'unit': 'pounds', 'value': 0.26014546916}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 66, 'date_published': '2004-08-01', 'subjects': ['Biographies & Memoirs', 'Crafts, Hobbies & Home', 'Pets & Animal Care', 'Horses', 'Sports & Outdoors', 'Biographies', 'Individual Sports', 'Miscellaneous', 'History of Sports'], 'authors': ['B. K. Beckwith', 'Howard Brodie', 'Grantland Rice'], 'title': 'Seabiscuit: The Saga of a Great Champion', 'isbn13': '9781594160004', 'msrp': 19.95, 'binding': 'Paperback', 'isbn': '1594160007', 'isbn10': '1594160007'}}