{'book': {'publisher': 'Public Square Books', 'synopsis': 'Review      ". . .hilarante, esta plagado de divertidas notas a pie y de excentricos personajes. Tambien es humano, inteligente e intrigante. . . " -- Locus"El Apocalipsis nunca habia sido tan divertido." -- -Clive Barker"Hilarante y picaro. . .encantara a los seguidores de Douglas Adams." -- Kirkus Reviews."Perversamente divertido" -- Time Out"Seria una pelicula celestial. O infernal, tu mismo." -- Washington Post      Product Description      The world is going to end next Saturday, just before dinner, but it turns out there are a few problems--the Antichrist has been misplaced, the Four Horseman of the Apocalypse ride motorcycles, and the representatives from heaven and hell decide that they like the human race.      From the Publisher      Good Omens spent 17 consecutive weeks on the Sunday Times best-sellers list in 1990, sold over 250,000 copies in the UK alone, and has gone on to become an international bestseller. Good Omens is under movie option to the Samuelson Brothers (Wilde; Carrington) and Renaissance Films. Terry Gilliam (12 Monkeys; The Fisher King;, Brazil) and Tony Grisoni wrote the script.      About the Author      Durante los veinte anyos de su carrera, Neil Gaiman ha sido uno de los mejores guionistas de comics modernos y un novelista de best-seller. Como guionista de la serie de fantasia The Sandman gano todos los premios del campo y, ademas, el World Fantasy Award a la mejor historia corta, en 1991, lo que convirtio a The Sandman n19 en el primer comic en ganar un premio literario en la historia. La serie The Sandman fue ilustrada por varios dibujantes, como Dave McKean, Mark Hempel, Jill Thompson y John J. Muth. Gaiman saco a la venta una antologia de historias cortas llamada Humo y espejos y escribio el guion en ingles de la pelicula de animacion japonesa La Princesa Mononoke. Ha escrito tambien muchos libros infantiles como El Dia que Cambie a Mi Padre por Dos Peces de Colores, Coraline y The Wolves in the Wall, todos ellos ilustrados por Dave McKean. Over his twenty-year career, the versatile and prolific Gaiman has been one of the leading writers in modern comics, and has also penned numerous best-selling novels and children\x92s books. His books have been translated into more than twenty different languages, and nearly all of his works are under film option. He is named in the Dictionary of Literary Biography as one of the top ten living post-modern writers. Terry Pratchett (28 de abril, 1948) es un escritor britanico de fantasia. Es el autor vivo de ficcion mas vendido de los anyos 1990 en el Reino Unido con mas de diez millones de libros, traducido a mas de 27 lenguas distintas y con unas ventas anuales de mas de un millon de ejemplares. En 1983 Pratchett escribio su primera novela sobre el Mundodisco: El color de la magia (1983). El filon del Mundodisco (Discworld), una saga de fantasia ambientada en un mundo hilarante que parodia el nuestro es el conjunto de novelas que le ha dado fama internacional. Autor prolifico, Pratchett escribio 25 novelas sobre el Mundodisco en tiempo record. En 1998 fue nombrado Oficial de la Orden del Imperio Britanico en el cumpleanos de la Reina como reconocimiento a los servicios prestados a la literatura (aunque en principio penso que se trataba de una broma) y al anyo siguiente recibio el titulo de Doctor Honoris Causa en Literatura por la Universidad de Warwick. Como curiosidad se puede comentar que el mismo hizo Doctores de la Universidad Invisible a Ian Stewart y Jack Cohen, quienes escribieron conjuntamente la novela The Science of Discworld. Sus lectores califican su obra de sorprendente, fresca, original, imaginativa y altamente divertida. Terry Pratchett published his first story when he was thirteen and had his first commercial sale four years later. His first novel, a humorous fantasy entitled The Carpet People, appeared in 1971 from the publisher Colin Smythe. Before turning to literary writing full-time, he worked for many years as a journalist and press', 'language': 'en', 'image': 'https://images.isbndb.com/covers/09/86/9781594970986.jpg', 'title_long': 'Buenos Presagios/ Good Omens: Las Buenas Y Ajustadas Profecías De Agnes La Chalada/ The Nice & Accurate Prophecies Of Agnes Nutter, Witch (Spanish Edition)', 'dimensions': 'Height: 8 Inches, Length: 5.75 Inches, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 1.25}, 'height': {'unit': 'inches', 'value': 8}}, 'pages': 318, 'date_published': '2005', 'subjects': ['Comics & Graphic Novels', 'Graphic Novels', 'Fantasy', 'Literature & Fiction', 'Humor & Satire', 'Humorous', 'Science Fiction & Fantasy', 'Teen & Young Adult', 'Science Fiction'], 'authors': ['Neil Gaiman', 'Terry Pratchett', 'Maria Ferrer'], 'title': 'Buenos Presagios/ Good Omens: Las Buenas Y Ajustadas Profecías De Agnes La Chalada/ The Nice & Accurate Prophecies Of Agnes Nutter, Witch (Spanish Edition)', 'isbn13': '9781594970986', 'msrp': 19.95, 'binding': 'Paperback', 'isbn': '159497098X', 'isbn10': '159497098X'}}