{'book': {'publisher': 'Hovel Audio', 'synopsis': "About the Author      Fyodor Mikhaylovich Dostoyevsky (November 11, 1821 February 9, 1881) was a Russian writer of novels, short stories and essays. He is best known for his novels Crime and Punishment, The Idiot and The Brothers Karamazov. Dostoyevsky's literary works explore human psychology in the troubled political, social and spiritual context of 19th-century Russian society. With the embittered voice of the anonymous underground man, Dostoyevsky wrote Notes from Underground (1864), which has been called the best overture for existentialism ever written by Walter Kaufmann. He is often acknowledged by critics as one of the greatest and most prominent psychologists in world literature.      Product Description      Fyodor Dostoevsky's crowning life work, The Brothers Karamazov, stands among the greatest novels in world literature. His exploration of faith, doubt, morality, and the place of suffering in life are equaled in no other work of literature, save the Bible. // The book explores the possible role of four brothers in the unresolved murder of their father, Fyodor Karamazov. At the same, it carefully explores the personalities and inclinations of the brothers themselves. Their psyches together represent the full spectrum of human nature, and continuum of faith and doubt. Ultimately this novel seeks to understand the real meaning of existence and includes much beneficial philosophical and spiritual discussion that moves the reader towards faith. // This new abridgment done exclusively for Hovel Audio by Russian Studies scholar Thomas Beyer keeps the important religious themes of the novel intact. It is an excellent way for the admirer of Dostoevsky to refresh himself, or to introduce Dostoevsky to a friend who has yet to experience the joy of reading his works. // Fyodor Dostoevsky (1821-1881) writes with a passion and keen insight of biblical grace like no other modern novelist. His works Crime and Punishment and The Idiot testify to his great skill. The Brothers Karamazov has been hailed by readers for over a century as one of the finest achievements in all of western literature. // Thomas R. Beyer is Professor of Russion at Middlebury College in Vermont. He holds three degrees in Slavic Literature including a Ph.D. from the University of Kansas. In his decades of teaching, Tom Beyer has read The Brothers Karamazov dozens of times. His abridgment of the novel for Hovel Audio shows his thorough knowledge of his subject.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/07/84/9781596440784.jpg', 'title_long': 'The Brothers Karamazov (Christian Themes in Classic Literature)', 'edition': 'Abridged', 'dimensions': 'Height: 7.5999848 Inches, Length: 5.3999892 Inches, Width: 0.5499989 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.3999892}, 'width': {'unit': 'inches', 'value': 0.5499989}, 'height': {'unit': 'inches', 'value': 7.5999848}}, 'pages': 16, 'date_published': '2005', 'subjects': ['Literature & Fiction', 'Classics', 'Genre Fiction', 'Psychological', 'Religion & Spirituality', 'Romance', 'Historical'], 'authors': ['Fyodor Dostoevsky'], 'title': 'The Brothers Karamazov (Christian Themes in Classic Literature)', 'isbn13': '9781596440784', 'msrp': 29.98, 'binding': 'MP3 CD', 'isbn': '1596440783', 'isbn10': '1596440783'}}