{'book': {'publisher': 'Cosimo Classics', 'synopsis': "A sweeping investigation of how knowledge is obtained by means of absolute truth, including how the spirit reveals itself as absolute reality, The Phenomenology of Mind is an intellectual tour-de-force and represents a great philosophical works for the ages. Originally published in English in 1910, Hegel proffers his unique viewpoint that knowledge is not separated from, nor outside of, absolute reality - but that knowledge is itself reality, and posits that reality is mental and spiritual. Volume II includes: . [The Nature of] Free Concrete Mind: Spirit . Religion in General . Absolute Knowledge Also Available from Cosimo Classics: Hegel's The Phenomenology of Mind: Volume I German philosopher GEORG WILHELM FRIEDRICH HEGEL (1770-1831) was born in Stuttgart and studied at Tübingen, where his contemporaries included Schelling and the poet Hölderlin. As a philosophical disciple of Kant, Hegel was of the Idealist School of philosophers and remained an unparalleled influence on German philosophy throughout the 19th-century. Additional works by Hegel's include: The Objective Logic (1812-13), The Subjective Logic (1816), Encyclopedia of the Philosophical Sciencies in Outline (1817), and Philosophy of Right (1821).", 'language': 'en', 'image': 'https://images.isbndb.com/covers/77/39/9781596057739.jpg', 'title_long': 'The Phenomenology of Mind: Volume II', 'dimensions': 'Height: 8.5 Inches, Length: 5.5 Inches, Weight: 1.34041055296 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.34041055296}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 372, 'date_published': '2006-02-01', 'subjects': ['Religion & Spirituality', 'Politics & Social Sciences', 'Philosophy', 'Modern'], 'authors': ['G. W. F. Hegel'], 'title': 'The Phenomenology of Mind: Volume II', 'isbn13': '9781596057739', 'msrp': 34.99, 'binding': 'Hardcover', 'isbn': '1596057734', 'isbn10': '1596057734'}}