{'book': {'publisher': 'Night Shade', 'synopsis': "“Banks is a phenomenon…Wildly successful, fearlessly creative.”—William Gibson, author of Neuromancer, winner of the Hugo, Nebula, and Philip K. Dick Awards<br/><br/>It is 4034 AD. Humanity has made it to the stars. Fassin Taak, a Slow Seer at the Court of the Nasqueron Dwellers, will be fortunate if he makes it to the end of the year.<br/><br/>The Nasqueron Dwellers inhabit a gas giant on the outskirts of the galaxy, in a system awaiting its wormhole connection to the rest of civilization. In the meantime, they are dismissed as decadents living in a state of highly developed barbarism, hoarding data without order, hunting their own young and fighting pointless formal wars.<br/><br/>Seconded to a military-religious order he's barely heard of — part of the baroque hierarchy of the Mercatoria, the latest galactic hegemony — Fassin Taak has to travel again amongst the Dwellers. He is in search of a secret hidden for half a billion years. But with each day that passes a war draws closer — a war that threatens to overwhelm everything and everyone he's ever known.<br/><br/>Skyhorse Publishing, under our Night Shade and Talos imprints, is proud to publish a broad range of titles for readers interested in science fiction (space opera, time travel, hard SF, alien invasion, near-future dystopia), fantasy (grimdark, sword and sorcery, contemporary urban fantasy, steampunk, alternative history), and horror (zombies, vampires, and the occult and supernatural), and much more. While not every title we publish becomes a New York Times bestseller, a national bestseller, or a Hugo or Nebula award-winner, we are committed to publishing quality books from a diverse group of authors.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/04/40/9781597800440.jpg', 'title_long': 'The Algebraist', 'edition': 'First Ed', 'dimensions': 'Height: 8.75 Inches, Length: 5.75 Inches, Weight: 1.2 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.75}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.2}, 'height': {'unit': 'inches', 'value': 8.75}}, 'pages': 434, 'date_published': '2006-06-01', 'subjects': ['Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Suspense', 'Technothrillers', 'Science Fiction & Fantasy', 'Science Fiction', 'Adventure', 'Space Opera', 'Military', 'Alien Invasion', 'First Contact'], 'authors': ['Iain M. Banks'], 'title': 'The Algebraist', 'isbn13': '9781597800440', 'msrp': 14.95, 'binding': 'Paperback', 'isbn': '1597800449', 'isbn10': '1597800449'}}