{'book': {'publisher': 'Library of America', 'synopsis': 'Known in his lifetime primarily to readers of science fiction, Philip K. Dick is now seen as a uniquely visionary figure, a writer who, in editor Jonathan Lethem’s words, “wielded a sardonic yet heartbroken acuity about the plight of being alive in the twentieth century, one that makes him a lonely hero to the readers who cherish him.”<br/><br/>This Library of America volume brings together four of Dick’s most original novels. The Man in the High Castle (1962), which won the Hugo Award, describes an alternate world in which Japan and Germany have won World War II and America is divided into separate occupation zones. The dizzying The Three Stigmata of Palmer Eldritch (1965) posits a future in which competing hallucinogens proffer different brands of virtual reality, and an interplanetary drug tycoon can transform himself into a godlike figure transcending even physical death.<br/><br/>Do Androids Dream of Electric Sheep? (1968), about a bounty hunter in search of escaped androids in a postapocalyptic society where status is measured by the possession of live animals and religious life is focused on a television personality, was the basis for the movie Blade Runner. Ubik (1969), with its future world of psychic espionage agents and cryonically frozen patients inhabiting an illusory “half-life,” pursues Dick’s theme of simulated realities and false perceptions to ever more disturbing conclusions, as time collapses on itself and characters stranded in past eras search desperately for the elusive, constantly shape-shifting panacea Ubik. As with most of Dick’s novels, no plot summary can suggest the mesmerizing and constantly surprising texture of these astonishing books.<br/><br/>Posing the questions “What is human?” and “What is real?” in a multitude of fascinating ways, Dick produced works—fantastic and weird, yet developed with precise logic, marked by wild humor and soaring flights of religious speculation—that are startlingly prescient imaginative anticipations of twenty-first-century quandaries.<br/><br/>LIBRARY OF AMERICA is an independent nonprofit cultural organization founded in 1979 to preserve our nation’s literary heritage by publishing, and keeping permanently in print, America’s best and most significant writing. The Library of America series includes more than 300 volumes to date, authoritative editions that average 1,000 pages in length, feature cloth covers, sewn bindings, and ribbon markers, and are printed on premium acid-free paper that will last for centuries.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/00/94/9781598530094.jpg', 'title_long': 'Philip K. Dick: Four Novels of the 1960s', 'dimensions': 'Height: 8.17 Inches, Length: 5.09 Inches, Weight: 1.22 Pounds, Width: 1.05 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.09}, 'width': {'unit': 'inches', 'value': 1.05}, 'weight': {'unit': 'pounds', 'value': 1.22}, 'height': {'unit': 'inches', 'value': 8.17}}, 'pages': 900, 'date_published': '2007-05-10', 'subjects': ['Literature & Fiction', 'Short Stories & Anthologies', 'Anthologies', 'United States', 'Contemporary', 'Reference', 'Science Fiction & Fantasy', 'Science Fiction', 'Alternate History', 'Short Stories', 'Post-Apocalyptic'], 'authors': ['Philip K. Dick'], 'title': 'Philip K. Dick: Four Novels of the 1960s', 'isbn13': '9781598530094', 'msrp': 33.77, 'binding': 'Hardcover', 'isbn': '1598530097', 'isbn10': '1598530097'}}