{'book': {'publisher': 'Samhain Publishing', 'synopsis': "By night, he becomes a mysterious stranger devoted only to her pleasureand discovers shes hiding a naughty little secret. After divorcing her never-home husband, Lauren Southall plucked up her courage, dusted off her power suits, and returned to corporate life. Two years later, there's just one six-foot three, testosterone-packed problem: her ex-husband's good friend and her current boss, Noah Reeves. Lauren aches for him. No other man will do. But she cant possibly measure up to the silicone-packed professional cheerleaders he dates. So she hides her desire behind a professional persona and fantasizes. For ten years, Noah Reeves has waited to make Lauren his. Once her divorce was final, he tracked down and hired the brilliant, dedicated woman. But when he's with her, it isn't spreadsheets and profit margins on his brain. Problem is, she's never seen him as anything but her ex-husbands pal. Now that she's finally a free woman and with him 40+ hours a week, well... he'd love to persuade her to throw in her nights and weekends. Noah decides to romance her by day. By night, he becomes a mysterious stranger devoted only to her pleasureand discovers shes hiding a naughty little secret of her own. Warning, this title contains the following: explicit sex, graphic language", 'language': 'en', 'image': 'https://images.isbndb.com/covers/29/39/9781599982939.jpg', 'title_long': 'Naughty Little Secret', 'dimensions': 'Height: 8.52 Inches, Length: 5.52 Inches, Weight: 0.6283174467 Pounds, Width: 0.59 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.52}, 'width': {'unit': 'inches', 'value': 0.59}, 'weight': {'unit': 'pounds', 'value': 0.6283174467}, 'height': {'unit': 'inches', 'value': 8.52}}, 'pages': 212, 'date_published': '2006-08-01', 'subjects': ['Literature & Fiction', 'Erotica', 'Romantic'], 'authors': ['Shelley Bradley'], 'title': 'Naughty Little Secret', 'isbn13': '9781599982939', 'msrp': '0.00', 'binding': 'Paperback', 'isbn': '1599982935', 'isbn10': '1599982935'}}