{'book': {'publisher': 'Wordsworth Editions Ltd', 'synopsis': "Jane Eyre ranks as one of the greatest and most popular works of English fiction. Although Charlotte Brontë's heroine is outwardly plain, she possesses an indomitable spirit, and great courage. Forced to battle against the exigencies of a cruel guardian, a harsh employer and a rigid social order which circumscribes her life when she becomes governess to the daughter of the mysterious, sardonic Mr Rochester.<br/>Villette is based on Charlotte Brontë's personal experience as a teacher in Brussels. It is a moving tale of repressed feelings and cruel circumstances borne with heroic fortitude. Rising above the confinement of a rigid social order, it is also a story of a woman's right to love and be loved.<br/>Wuthering Heights is Emily Brontë's wild, passionate tale of the intense and almost demonic love between Catherine Earnshaw and Heathcliff, a foundling adopted by Catherine's father. After Mr Earnshaw's death, Heathcliff is bullied and humiliated by Catherine's brother Hindley and, wrongly believing that his love for Catherine is not reciprocated, he leaves Wuthering heights. When he returns years later as a wealthy man, he proceeds to exact a terrible revenge for his former miseries.<br/>Agnes Grey, Ann Brontë's deeply personal novel, is a trenchant expose of the frequently isolated, intellectually stagnant and emotionally starved conditions under which many governesses worked in the mid-nineteenth century.<br/>The Tenant of Wildfell Hall shows Ann Brontë's bold, naturalistic and passionate style. It is a powerful and sometimes violent novel of expectation, love, oppression, sin and betrayal. It portrays the disintegration of the marriage of Helen Huntingdon, the mysterious 'tenant' of the title, and her dissolute, alcoholic husband.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/06/05/9781840220605.jpg', 'title_long': 'Selected Works of the Bronte Sisters (Wordsworth Special Editions)', 'edition': 'Revised', 'dimensions': 'Height: 9.13384 Inches, Length: 5.9055 Inches, Weight: 2.67200261544 Pounds, Width: 2.04724 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.9055}, 'width': {'unit': 'inches', 'value': 2.04724}, 'weight': {'unit': 'pounds', 'value': 2.67200261544}, 'height': {'unit': 'inches', 'value': 9.13384}}, 'pages': 1376, 'date_published': '2005-08-05', 'subjects': ['Literature & Fiction', 'Contemporary'], 'authors': ['Charlotte Bronte', 'Emily Bronte', 'Anne Bronte'], 'title': 'Selected Works of the Bronte Sisters (Wordsworth Special Editions)', 'isbn13': '9781840220605', 'msrp': 14.99, 'binding': 'Paperback', 'isbn': '1840220600', 'isbn10': '1840220600'}}