{'book': {'publisher': 'Mainstream Pub Co Ltd', 'synopsis': "A step-brother's revealing memoirs of life with Elvis: from his childhood at Graceland and his later career as the singer's personal bodyguard to his immersion in Elvis' spiraling world of sex, drugs, and deception. Featuring 35 photos. David Stanley was four years-old when his mother married Elvis Presley's widowed father. Suddenly, life changed forever. The King of Rock and Roll had become his big brother, and for the next 17 years Elvis Presley was his family, his friend, and later his employer. David Stanley was part of the Presley phenomenon from the first moments of glory to the tragic end. Raised on Rock is his account of growing up--at Graceland, on the back lots of movie sets, and in recording studios--as well as his tumultuous career as Elvis' personal bodyguard. He also recounts the bizarre, circus-like atmosphere surrounding Elvis and the sex, drugs, and manipulation that fueled it. Raised on Rock is a unique portrait of life with a legend. It is also the story of David Stanley's struggle to come to terms with his brother's legacy of addiction and deception. 192 pp 6 x 9 35 b/w photos", 'language': 'en', 'image': 'https://images.isbndb.com/covers/85/27/9781851588527.jpg', 'title_long': 'Raised on Rock: Growing Up at Graceland', 'dimensions': 'Height: 9.75 Inches, Length: 6.75 Inches, Weight: 1.10672055524 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.75}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 1.10672055524}, 'height': {'unit': 'inches', 'value': 9.75}}, 'pages': 189, 'date_published': '1997', 'subjects': ['Arts & Photography', 'Music', 'Biographies & Memoirs', 'Arts & Literature', 'Composers & Musicians', 'Television Performers', 'Humor & Entertainment'], 'authors': ['David Stanley', 'Mark Bego', 'David E. Stanley'], 'title': 'Raised on Rock: Growing Up at Graceland', 'isbn13': '9781851588527', 'msrp': 29.95, 'binding': 'Hardcover', 'isbn': '1851588523', 'isbn10': '1851588523'}}