{'book': {'publisher': 'Bristol Classical Press', 'synopsis': "By common consent, the Argentinian Jorge Luis Borges (1890-1986) is one of the greatest writers to have emerged from Latin America. His finest work is Ficciones (1944), a collection of brilliantly-crafted, essay-like short stories.<br/>Writers responsible for the modern upsurge in Latin American narrative, like Gabriel García Márquez (Columbia, a Nobel Prize winner), Julio Cortázar (Argentina) and Carlos Fuentes (Mexico), concur in identifying Borges as an honoured predecessor. In turn, Borges' work has been a major influence for writers in English and other languages, as well as film makers among them Peter Carey, Nadine gordimer, Salman Rushdie, Umberto Eco, Italo Calvino, Michel Foucault, Jean Luc Godard, Peter Greenaway, and Bernardo Bertolucci.<br/><br/>This edition by Gordon Brotherston and Peter Hulme, updated from the original 1976 edition by the same authors, offers a comprehensive selection of stories from the work in the original language with an English introduction, detailed notes, a generous vocabulary, bibliography, as well as chronological and other tables.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/59/03/9781853995903.jpg', 'title_long': 'Borges: Ficciones (Spanish Texts)', 'edition': '2', 'dimensions': 'Height: 8.5 Inches, Length: 5.5 Inches, Weight: 0.73 Pounds, Width: 0.4838573 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.5}, 'width': {'unit': 'inches', 'value': 0.4838573}, 'weight': {'unit': 'pounds', 'value': 0.73}, 'height': {'unit': 'inches', 'value': 8.5}}, 'pages': 232, 'date_published': '1999-12-09', 'subjects': ['Literature & Fiction', 'Short Stories & Anthologies', 'Short Stories', 'Reference', 'Foreign Language Study & Reference', 'Instruction'], 'authors': ['Jorge Luis Borges'], 'title': 'Borges: Ficciones (Spanish Texts)', 'isbn13': '9781853995903', 'msrp': 22.95, 'binding': 'Paperback', 'isbn': '1853995908', 'isbn10': '1853995908'}}