{'book': {'publisher': 'Verso', 'synopsis': '‘Clintonism’ is not an idea, or a program; still less is it a principle. It represents what might be termed-were it not for its murk-the distilled essence of consensus politics. Unremarkable in its constituent elements, which are a mixture of opportunist statecraft, crony capitalism, ‘divide and rule’ identity politics, and populist manipulation, Clintonism has nonetheless raised these ordinary practices to the level of theory. It has succeeded, argues the author, because of a stealthy appeal to the waning and insecure forces of an American liberalism gone bad. Christopher Hitchens followed Governor Clinton through New Hampshire in 1992, and has remained an assiduous student of his methods ever since.<br/><br/>In No One Left to Lie To, he profiles the rise and decline of some prominent Clintonoids, from George Stephanopoulos to the First Lady. He scrutinizes the debased new language in which the discourse of Clintonism has been couched, and proposes that, if successful, the Clinton machine will become the model of pseudo-democracy for the coming century.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/28/43/9781859842843.jpg', 'title_long': 'No One Left To Lie To: The Values of the Worst Family', 'dimensions': 'Height: 0.7499985 Inches, Length: 0.5401564 Inches, Weight: 0.50044933474 Pounds, Width: 0.0499999 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 0.5401564}, 'width': {'unit': 'inches', 'value': 0.0499999}, 'weight': {'unit': 'pounds', 'value': 0.50044933474}, 'height': {'unit': 'inches', 'value': 0.7499985}}, 'pages': 150, 'date_published': '2000-07', 'subjects': ['History', 'Americas', 'United States', 'Politics & Social Sciences', 'Politics & Government', 'Self Service', 'Custom Stores'], 'authors': ['Christopher Hitchens'], 'title': 'No One Left To Lie To: The Values of the Worst Family', 'isbn13': '9781859842843', 'msrp': 12, 'binding': 'Paperback', 'isbn': '1859842844', 'isbn10': '1859842844'}}