{'book': {'publisher': 'Tauris Parke Paperbacks', 'synopsis': 'Mary Stuart, Queen of Scots, was one of history’s romantically tragic figures. Devious, naïve, often highly principled, beautiful, and sexually voracious, this was a woman who secured the Scottish throne and bolstered the position of the Catholic Church in Scotland. Her endless plotting, including a likely involvement in the murder of her husband Lord Darnley, eventually led to her flight from Scotland and imprisonment by her equally ambitions cousin and fellow queen, Elizabeth of England. And yet when Elizabeth ordered her unpredictable rival and kinswoman to be beheaded in 1587 she did so in resigned frustration rather than as act of political wrath.Was the beheading of a cousin truly necessary? Did Mary, though churlish, petulant, and often disloyal, really deserve to forfeit the compassion of her cousin, a woman who from childhood had been her friend and playmate? Mary’s fate was to be born to supreme power, but she was totally lacking in the political ability to deal with its responsibilities. This was the tragedy that turned her life into a study in failure. The extraordinary story of Mary, which has inspired the great poets, playwrights, and operatic composers of the 19th and 20th centuries, is one of the most colorful and emotionally searing tales of western history, and is here told by a leading specialist of the 16th century.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/58/84/9781860645884.jpg', 'title_long': 'Mary, Queen of Scots: Pride, Passion and a Kingdom Lost', 'edition': 'Revised', 'dimensions': 'Height: 7.74 Inches, Length: 4.97 Inches, Weight: 0.44974301448 Pounds, Width: 0.65 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.97}, 'width': {'unit': 'inches', 'value': 0.65}, 'weight': {'unit': 'pounds', 'value': 0.44974301448}, 'height': {'unit': 'inches', 'value': 7.74}}, 'pages': 224, 'date_published': '2001-05-04', 'subjects': ['Biographies & Memoirs', 'Community & Culture', 'Women', 'Historical', 'Europe', 'Leaders & Notable People', 'Military', 'Royalty', 'History', 'Great Britain', 'World', 'Women in History'], 'authors': ['Jenny Wormald'], 'title': 'Mary, Queen of Scots: Pride, Passion and a Kingdom Lost', 'isbn13': '9781860645884', 'msrp': 3.83, 'binding': 'Paperback', 'isbn': '1860645887', 'isbn10': '1860645887'}}