{'book': {'publisher': 'Library of America', 'synopsis': 'America’s greatest nature writer and a political thinker of international renown, Henry David Thoreau crafted essays that reflect his speculative and probing cast of mind. In his poems, he gave voice to his private sentiments and spiritual aspirations in the plain style of New England speech. The Library of America now brings together these indispensable works in one authoritative volume.<br/><br/>Spanning his entire career, the twenty-seven essays gathered here chart the range of Thoreau’s interests and the evolution of his thinking, particularly on nature and politics. They vary in style from the ambling rhythm of “Natural History of Massachusetts” and “A Winter Walk” to the concentrated moral outrage of “Slavery in Massachusetts” and “A Plea for Captain John Brown.” Included are “Civil Disobedience,” Thoreau’s great exploration of the conflict between individual conscience and state power that continues to influence political thinkers and activists; “Walking,” a meditation on “wildness” and civilization; and “Life Without Principle,” a passionate critique of American materialism and conformity. Also here are literary essays, including pieces on Homer, Chaucer, and Carlyle; the travel essay “A Yankee in Canada”; speeches in defense of John Brown; and works on natural history written during the last years of Thoreau’s life, such as “The Succession of Forest Trees,” “Wild Apples,” and “Huckleberries.”<br/><br/>Many of the poems are presented here in versions based on Thoreau’s journal and manuscripts. Poems he excerpted for A Week on the Concord and Merrimack Rivers and Walden appear in their entirety. Included are “Sic Vita,” with Thoreau’s searching characterization of himself as “a parcel of vain strivings,” and the visionary “Inspiration.”<br/><br/>LIBRARY OF AMERICA is an independent nonprofit cultural organization founded in 1979 to preserve our nation’s literary heritage by publishing, and keeping permanently in print, America’s best and most significant writing. The Library of America series includes more than 300 volumes to date, authoritative editions that average 1,000 pages in length, feature cloth covers, sewn bindings, and ribbon markers, and are printed on premium acid-free paper that will last for centuries.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/19/56/9781883011956.jpg', 'title_long': 'Henry David Thoreau : Collected Essays and Poems (Library of America)', 'dimensions': 'Height: 8.11 Inches, Length: 5.14 Inches, Weight: 1.34922904344 Pounds, Width: 1.23 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.14}, 'width': {'unit': 'inches', 'value': 1.23}, 'weight': {'unit': 'pounds', 'value': 1.34922904344}, 'height': {'unit': 'inches', 'value': 8.11}}, 'pages': 703, 'date_published': '2001-04-23', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Criticism & Theory', 'Poetry', 'Regional & Cultural', 'United States', 'Anthologies', 'Science & Math', 'Nature & Ecology', 'Nature Writing & Essays', 'Politics & Social Sciences', 'Politics & Government', 'Specific Topics'], 'authors': ['Henry David Thoreau'], 'title': 'Henry David Thoreau : Collected Essays and Poems (Library of America)', 'isbn13': '9781883011956', 'msrp': 23.07, 'binding': 'Hardcover', 'isbn': '1883011957', 'isbn10': '1883011957'}}