{'book': {'publisher': 'Library of America', 'synopsis': 'This Library of America volume is one of five that make available for the first time in new, complete, and authoritative editions the astonishing abundance of invention and unwavering intensity of the aesthetic vision of Henry James as displayed in more than one hundred world-famous stories ranging from brief anecdotes to richly developed novellas.<br/><br/>Equally adept at ironic comedy, muted tragedy, and supernatural fantasy, at lively social satire and nuanced portraiture, James in his shorter works explores a staggering variety of situations and emotions. Here are courtships and legacies; the worlds of literature, theater, and the popular press; the paradoxes of temperament and the constraints of custom; the clash of conscience and desire. Stylistically, the stories allowed James to experiment with tones and devices quite different from his novels—dramatic plot twists and surprise endings, swift pacing and ebullient humor. The brilliance of his technical command allowed him to transform the tiniest of suggestions—a fleetingly observed gesture, an anecdote dropped at a dinner party—into fiction remarkable for its lambent surfaces and intricate psychological counterpoint.<br/><br/>The twenty-one stories in this volume represent James at the peak of his storytelling powers. Among them are “The Turn of the Screw,” one of his most popular works, and a terrifying exercise in psychological horror centering on the corruption of childhood innocence; “The Real Thing,” a playful consideration of the illusion of art and the paradoxes of authenticity; “The Figure in the Carpet,” “The Death of the Lion,” and “The Middle Years,” three very different expositions of the mysteries of authorship, embodying some of James’s most profound insights into the nature of his own art; “The Altar of the Dead,” a somber, ultimately wrenching meditation on the relation of the living to the dead; and “In the Cage,” an extended evocation of the inner life of a young woman trapped in a dehumanizing job at a postal-and-telegraph office.<br/><br/>LIBRARY OF AMERICA is an independent nonprofit cultural organization founded in 1979 to preserve our nation’s literary heritage by publishing, and keeping permanently in print, America’s best and most significant writing. The Library of America series includes more than 300 volumes to date, authoritative editions that average 1,000 pages in length, feature cloth covers, sewn bindings, and ribbon markers, and are printed on premium acid-free paper that will last for centuries.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/10/93/9781883011093.jpg', 'title_long': 'Henry James: Complete Stories, 1892-1898 (Library of America)', 'edition': 'First Edition', 'dimensions': 'Height: 8.13 inches, Length: 5.09 inches, Weight: 1.36025215654 Pounds, Width: 1.17 inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.09}, 'width': {'unit': 'inches', 'value': 1.17}, 'weight': {'unit': 'pounds', 'value': 1.36025215654}, 'height': {'unit': 'inches', 'value': 8.13}}, 'pages': 948, 'date_published': '1996-01-01', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Psychological', 'Short Stories & Anthologies', 'Anthologies', 'Short Stories', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors': ['Henry James', 'John Hollander'], 'title': 'Henry James: Complete Stories, 1892-1898 (Library of America)', 'isbn13': '9781883011093', 'msrp': 35, 'binding': 'Hardcover', 'isbn': '1883011094', 'isbn10': '1883011094'}}