{'book': {'publisher': 'Gauntlet Pr', 'synopsis': 'Here we have VOLUME TWO of our Edge Books imprint publication of RICHARD MATHESON: COLLECTED STORIES. Again, it is an expanded tradepaperback version of the 1989 Dream/Press hardcover limited edition. We are publishing it in 3 volumes (click here to view RICHARD MATHESON: COLLECTED STORIES, VOLUME ONE).<br/>This three volume edition of RICHARD MATHESON: COLLECTED STORIES is the gathering together of 86 Richard Matheson short stories, beginning with Born of Man and Woman from 1950 and ending with Duel from 1971. The stories were arranged by Matheson himself roughly in chronological order of original publication. There are also several tributes to Richard Matheson throughout the volumes from admirers such as Stephen King, Ray Bradbury, Robert Bloch, William F. Nolan, and others. Finally, Matheson wrote a deeply revealing Introduction for the collection. As Matheson himself states in this Introduction, "A twenty-year period of creativity reduced to the psychological background of my output of fantasy and science-fiction stories. If this were a thesis, that would be my premise".<br/>As with Volume One, for Volume Two editor Stanley Wiater has included a "bibliophile" at the end of each story containing Matheson\'s very own commentary on the behind-the-scenes details of each story. Each story is also listed with it\'s original publication date and place of publication.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/87/97/9781887368797.jpg', 'title_long': 'Richard Matheson: Collected Stories, Vol. 2', 'edition': 'Illustrated', 'dimensions': 'Height: 8.25 Inches, Length: 5.25 Inches, Weight: 0.7495716908 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 0.7495716908}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 453, 'date_published': '2005', 'subjects': ['Literature & Fiction', 'Erotica'], 'authors': ['Richard Matheson'], 'title': 'Richard Matheson: Collected Stories, Vol. 2', 'isbn13': '9781887368797', 'msrp': 13.69, 'binding': 'Paperback', 'isbn': '1887368795', 'isbn10': '1887368795'}}