{'book': {'publisher': 'Russell Enterprises, Inc.', 'synopsis': '\x93Mikhail Tal\x92s splendid account of his world championship match victory is one of the masterpieces of the golden age of annotation \x96 before insights and feelings and flashes of genius were reduced to mere moves and Informant symbols. This is simply the best book written about a world championship match by a contestant. That shouldn\x92t be a surprise because Tal was the finest writer to become world champion.\x94<br/>\x96 International Grandmaster and popular chess columnist Andy Soltis.<br/>In 1960 Mikhail Botvinnik was the pillar of \x93scientific\x94 chess and the iron-willed champion of the world. The young attacking genius Mikhail Tal, the \x93Wizard of Riga,\x94 put the magic back into the game by defeating Botvinnik with spectacular tactics in one of the most dramatic and celebrated world championship matches of all time.<br/>This is Tal\x92s own classic work on the contest. In it he sets the stage and explains every one of the 21 games, telling both the on- and off-the-board story of this titanic clash of styles and thought.<br/><br/>Excerpts, including the Table of Contents and the Foreword, of most Russell Enterprises books are available at http://russell-enterprises.com/excerptsdownloads.html.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/00/88/9781888690088.jpg', 'title_long': 'Tal-Botvinnik, 1960', 'edition': '5th ed.', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.8377565956 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.8377565956}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 192, 'date_published': '2001-07-03', 'subjects': ['Humor & Entertainment', 'Puzzles & Games', 'Chess'], 'authors': ['Mikhail Tal'], 'title': 'Tal-Botvinnik, 1960', 'isbn13': '9781888690088', 'msrp': 19.95, 'binding': 'Paperback', 'isbn': '1888690089', 'isbn10': '1888690089'}}