{'book': {'publisher': 'University of Alaska Press', 'synopsis': 'Now in a full-color second edition, Not Just a Pretty Face is an engaging exploration of the role of dolls and doll making in Alaska Native cultures. From ancient ivory carvings to the thriving tourist market, dolls and human figurines have played integral parts in the ritual, economic, and social lives of Native Alaskans. Dolls served as children’s playthings, represented absent community members at ceremonies, and predicted the movements of game animals for shamans. Not Just a Pretty Face surveys these and other uses of dolls and figurines, illustrating in beautiful color photographs the diversity of the doll-making tradition in Eskimo, Athabaskan, and Northwest Coast Native communities.<br/>Authors explore the ethnographic literature, twentieth-century oral histories, and photographic documentation of dolls and the doll-making process. Contemporary doll makers explain, in their own words, how they learned to make dolls and what doll making means to them. The second edition features a photo essay on Rosalie Paniyak of Chevak, one of the most influential doll makers in Alaska today.<br/>Not Just a Pretty Face provides a panoramic view of an ancient tradition and situates the art of doll making within a contemporary context. Scholarly, yet accessible, Not Just a Pretty Face is a lively contribution to the literature on dolls, anthropology, and Native studies.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/38/53/9781889963853.jpg', 'title_long': 'Not Just a Pretty Face: Dolls and Human Figurines in Alaska Native Cultures', 'edition': '1', 'dimensions': 'Height: 11 Inches, Length: 8.5 Inches, Weight: 0.80027801106 Pounds, Width: 0.3 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.5}, 'width': {'unit': 'inches', 'value': 0.3}, 'weight': {'unit': 'pounds', 'value': 0.80027801106}, 'height': {'unit': 'inches', 'value': 11}}, 'pages': 80, 'date_published': '2006-03-01', 'subjects': ['History', 'Americas', 'United States', 'Crafts, Hobbies & Home', 'Antiques & Collectibles', 'Dolls, Toys & Figurines', 'Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies'], 'authors': ['Molly Lee'], 'title': 'Not Just a Pretty Face: Dolls and Human Figurines in Alaska Native Cultures', 'isbn13': '9781889963853', 'msrp': 28.26, 'binding': 'Paperback', 'isbn': '1889963852', 'isbn10': '1889963852'}}