{'book': {'publisher': 'ACME Novelty Library', 'synopsis': 'Undaunted by lukewarm Internet and blogospheric opinion ("flat," "slow," and "always dreary") of his meretricious return last year to the tradition of the American comic book with the sixteenth issue of his ACME Novelty Library, cartoonist and professional sentimentalist Chris Ware returns with the seventeenth issue of this same title, and it is almost certain not to change general public opinion. Continuing with the second half of the introduction to his shamelessly meandering graphic novel Rusty Brown (which began last issue at a private school in the 1970s Midwest), the six-sided crystal suggested by the exegesis of the first installment is slowly turned and examined in midmorning winter sunlight sometime between the bell of first period and the conclusion of lunch for the first through the fourth grades. Also included are more thorough examinations of many of the main characters\' cloudy motivations, personal habits, and favorite restaurants, to say nothing of the small dust mote around which they have coalesced and the complications in its life due to the acquisition of superpowers sometime the night before. Like the irritating distant family member you only have to see once a year, the ACME Novelty Library #17 will, as was its predecessor, be published by the author in a single, limited edition only, never to be reprinted until the entire library is collected as a single volume, though it may be promptly remaindered and/or discarded.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/90/29/9781897299029.jpg', 'title_long': 'Acme Novelty Library #17', 'edition': 'First Edition', 'dimensions': 'Height: 7.25 Inches, Length: 9.3747844 Inches, Weight: 0.94 Pounds, Width: 0.499999 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 9.3747844}, 'width': {'unit': 'inches', 'value': 0.499999}, 'weight': {'unit': 'pounds', 'value': 0.94}, 'height': {'unit': 'inches', 'value': 7.25}}, 'pages': 64, 'date_published': '2006-11-28', 'subjects': ['Comics & Graphic Novels', 'Comic Strips', 'Graphic Novels', 'Literary'], 'authors': ['Chris Ware'], 'title': 'Acme Novelty Library #17', 'isbn13': '9781897299029', 'msrp': 60, 'binding': 'Hardcover', 'isbn': '1897299028', 'isbn10': '1897299028'}}