{'book': {'publisher': 'AK Press', 'synopsis': 'We all know what Noam Chomsky is against. His scathing analysis of everything that’s wrong with our society reaches more and more people every day. His brilliant critiques of—among other things—capitalism, imperialism, domestic repression and government propaganda have become mini-publishing industries unto themselves. But, in this flood of publishing and republishing, very little ever gets said about what exactly Chomsky stands for, his own personal politics, his vision of the future.<br/>Not, that is, until Chomsky on Anarchism, a groundbreaking new book that shows a different side of this best-selling author: the anarchist principles that have guided him since he was a teenager. This collection of Chomsky’s essays and inter-views includes numerous pieces that have never been published before, as well as rare material that first saw the light of day in hard-to-find pamphlets and anarchist periodicals. Taken together, they paint a fresh picture of Chomsky, showing his lifelong involvement with the anarchist community, his constant commitment to nonhierarchical models of political organization and his hopes for a future world without rulers.<br/>For anyone who’s been touched by Chomsky’s trenchant analysis of our current situation, as well as anyone looking for an intelligent and coherent discussion of anarchism itself, look no further than Chomsky on Anarchism.<br/>Noam Chomsky is one of the world’s leading intellectuals, the father of modern linguistics, an outspoken media and foreign policy critic and tireless activist. He lives in Boston, Massachusetts.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/92/08/9781904859208.jpg', 'title_long': 'Chomsky on Anarchism', 'edition': 'First PB Edition, First Printing', 'dimensions': 'Height: 9 Inches, Length: 6 Inches, Weight: 0.88405367062 Pounds, Width: 1 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 1}, 'weight': {'unit': 'pounds', 'value': 0.88405367062}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 256, 'date_published': '2005-05-01', 'subjects': ['Politics & Social Sciences', 'Politics & Government', 'Ideologies & Doctrines', 'International & World Politics', 'United States', 'Specific Topics'], 'authors': ['Noam Chomsky'], 'title': 'Chomsky on Anarchism', 'isbn13': '9781904859208', 'msrp': 11.47, 'binding': 'Paperback', 'isbn': '1904859208', 'isbn10': '1904859208'}}