{'book': {'publisher': 'Redleaf Press', 'synopsis': 'How do you help young children learn more about Native Americans than the cultural stereotypes found in children\'s books and in the media?<br/><br/>Lessons from Turtle Island is the first complete guide to exploring Native American issues with children. The authors\x97one Native, one white, both educators\x97show ways to incorporate authentic learning experiences about Native Americans into your curriculum. This book is organized around five cross-cultural themes\x97Children, Home, Families, Community, and the Environment. The authors present activities, from children\'s books they recommend, to develop skills in reading and writing, science, math, make-believe, art, and more. The book provides helpful guidelines and resource lists for selecting appropriate toys, children\'s books, music, and art, and also includes a family heritage project.<br/><br/>"[A] marvelous tool that should be in every American school."\x97Joseph Bruchac, author of Heart of a Chief and The Winter People<br/>Guy W. Jones, Hunkpapa Lakota, is a full-blood member of the Standing Rock Sioux Nation. He is a co-founder of the Miami Valley Council for Native Americans in Dayton, Ohio.<br/>Sally Moomaw teaches at the University of Cincinnati. She is the co-author of the More Than . . . curriculum series published by Redleaf Press.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/02/59/9781929610259.jpg', 'title_long': 'Lessons from Turtle Island: Native Curriculum in Early Childhood Classrooms', 'edition': 'Illustrated', 'dimensions': 'Height: 10.6 Inches, Length: 8.1 Inches, Weight: 0.99 Pounds, Width: 0.6 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 8.1}, 'width': {'unit': 'inches', 'value': 0.6}, 'weight': {'unit': 'pounds', 'value': 0.99}, 'height': {'unit': 'inches', 'value': 10.6}}, 'pages': 208, 'date_published': '2002-09-01', 'subjects': ['Politics & Social Sciences', 'Social Sciences', 'Ethnic Studies', 'Education & Teaching', 'Schools & Teaching', 'Education Theory', 'Instruction Methods', 'Early Childhood Education'], 'authors': ['Guy W. Jones', 'Sally Moomaw'], 'title': 'Lessons from Turtle Island: Native Curriculum in Early Childhood Classrooms', 'isbn13': '9781929610259', 'msrp': 29.95, 'binding': 'Paperback', 'related': {'ePub': '1605543489'}, 'isbn': '1929610254', 'isbn10': '1929610254', 'other_isbns': [{'isbn': '9781605543482', 'binding': 'print'}]}}