{'book': {'publisher': 'Library of America', 'synopsis': 'In the stories and novellas he wrote for Black Mask and other pulp magazines in the 1920s and 1930s, Dashiell Hammett took the detective story and turned it into a medium for capturing the jarring textures and revved-up cadences of modern American life. In this volume, The Library of America collects the finest of these stories: twenty-four in all, along with some revealing essays and an earlier version of his novel The Thin Man.<br/><br/>Mixing melodramatic panache and poker-faced comedy, a sensitivity to place and a perceptive grasp of social conflict, Hammett’s stories are hard-edged entertainments for an era of headlong change and extravagant violence. For the heroic sagas of earlier eras Hammett substituted the up-tempo, devious, sometimes nearly nihilistic exploits of con men and blackmailers, fake spiritualists and thieving politicians, slumming socialites and deadpan assassins.<br/><br/>As a guide through this underworld he created the Continental Op, the nameless, laconic detective, world-weary and unblinking, who serves as protagonist of most of these stories. The deliberately unheroic Op is separated only by his code of professionalism from the brutality and corruption that run rampant in stories such as “Zigzags of Treachery,” “Dead Yellow Women,” “Fly Paper,” and “$106,000 Blood Money.”<br/><br/>Hammett’s years of experience as a Pinkerton detective give even his most outlandishly plotted mysteries a gritty credibility, and his intimate knowledge of San Francisco made him the perfect chronicler of that city’s waterfronts, back alleys, police stations, and luxury hotels. By connecting crime fiction to the realities of American streets and American speech, his Black Mask stories opened up new vistas for generations of writers and readers.<br/><br/>LIBRARY OF AMERICA is an independent nonprofit cultural organization founded in 1979 to preserve our nation’s literary heritage by publishing, and keeping permanently in print, America’s best and most significant writing. The Library of America series includes more than 300 volumes to date, authoritative editions that average 1,000 pages in length, feature cloth covers, sewn bindings, and ribbon markers, and are printed on premium acid-free paper that will last for centuries.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/20/06/9781931082006.jpg', 'title_long': 'Dashiell Hammett: Crime Stories and Other Writings (Library of America)', 'edition': 'First Edition', 'dimensions': 'Height: 8.1 Inches, Length: 5.2 Inches, Weight: 1.37 Pounds, Width: 1.25 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.2}, 'width': {'unit': 'inches', 'value': 1.25}, 'weight': {'unit': 'pounds', 'value': 1.37}, 'height': {'unit': 'inches', 'value': 8.1}}, 'pages': 934, 'date_published': '2001-09-10', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Short Stories & Anthologies', 'Anthologies', 'United States', 'Mystery, Thriller & Suspense', 'Mystery', 'Hard-Boiled', 'Thrillers & Suspense', 'Crime', 'Self Service', 'Custom Stores'], 'authors': ['Dashiell Hammett'], 'title': 'Dashiell Hammett: Crime Stories and Other Writings (Library of America)', 'isbn13': '9781931082006', 'msrp': 40, 'binding': 'Hardcover', 'isbn': '1931082006', 'isbn10': '1931082006'}}