{'book': {'publisher': 'Library of America', 'synopsis': '“The Library of America has made it easier for readers to enjoy Bowles’s exotic literary harvest.” — The Columbus Dispatch<br/><br/>Paul Bowles was a composer, writer, and an American expatriate who spent most of the last five decades of his life in Tangier. According The Boston Globe, he was “one of the literary class acts of the twentieth century.” This Library of America volume, containing his stories and travel writings, is one of two volumes in the first annotated edition of Paul Bowles’s work and is a “treasure trove for readers who haven’t explored beyond The Sheltering Sky” (The Seattle Times).<br/><br/>“All the tales are a variety of detective story,” wrote Bowles of his first collection, The Delicate Prey and Other Stories (1950), “in which the reader is the detective; the mystery is the motivation for the characters’ behavior.” In such stories as “A Distant Episode” and “How Many Midnights,” Bowles pushes human character beyond socially defined limits and maps a transformed (often horribly transformed) reality.<br/><br/>A master of gothic terror and an acute and at times diabolically funny observer of manners and motives both American and Moroccan, Bowles confirmed his mastery of the short story in such volumes as A Hundred Camels in the Courtyard (1962), The Time of Friendship (1967), Things Gone and Things Still Here (1977), and Midnight Mass (1981), all included here along with a selection of his final stories.<br/><br/>This volume also contains Up Above the World (1966), a frightening novella set in Latin America in which a trusting American couple are lured into an annihilating trap, and the informed and fascinating travel book Their Heads Are Green and Their Hands Are Blue (1963).<br/><br/>LIBRARY OF AMERICA is an independent nonprofit cultural organization founded in 1979 to preserve our nation’s literary heritage by publishing, and keeping permanently in print, America’s best and most significant writing. The Library of America series includes more than 300 volumes to date, authoritative editions that average 1,000 pages in length, feature cloth covers, sewn bindings, and ribbon markers, and are printed on premium acid-free paper that will last for centuries.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/22/04/9781931082204.jpg', 'title_long': 'Paul Bowles: Collected Stories & Later Writings (LOA #135): Delicate Prey / Hundred Camels in Courtyard / Time of Friendship / Things Gone & Things ... Blu (Library of America Paul Bowles Edition)', 'edition': 'New Edition', 'dimensions': 'Height: 8.25 Inches, Length: 5.3 Inches, Weight: 1.49 Pounds, Width: 1.5 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.3}, 'width': {'unit': 'inches', 'value': 1.5}, 'weight': {'unit': 'pounds', 'value': 1.49}, 'height': {'unit': 'inches', 'value': 8.25}}, 'pages': 1050, 'date_published': '2002-08-26', 'subjects': ['Literature & Fiction', 'Classics', 'Genre Fiction', 'History & Criticism', 'Criticism & Theory', 'Short Stories & Anthologies', 'Anthologies', 'Short Stories', 'United States', 'Contemporary', 'Literary', 'Travel', 'Africa', 'General', 'Self Service', 'Custom Stores'], 'authors': ['Paul Bowles'], 'title': 'Paul Bowles: Collected Stories & Later Writings (LOA #135): Delicate Prey / Hundred Camels in Courtyard / Time of Friendship / Things Gone & Things ... Blu (Library of America Paul Bowles Edition)', 'isbn13': '9781931082204', 'msrp': 40, 'binding': 'Hardcover', 'isbn': '1931082200', 'isbn10': '1931082200'}}