{'book': {'publisher': 'Library of America', 'synopsis': 'Paul Bowles had already established himself as an important American composer when, at the age of thirty-eight, he published The Sheltering Sky and became widely recognized as one of the most powerful writers of the postwar period. By the time of his death in 1999 he had become a unique and legendary figure in modern literary culture. From his base in Tangier he produced novels, stories, and travel writings in which exquisite surfaces and violent undercurrents mingle.<br/><br/>This Library of America volume, containing his first three novels, with its companion Collected Stories and Later Writings, is the first annotated edition of Bowles’s work, offering the full range of his literary achievement: the portrait of an outsider who was one of the essential American writers of the last half century.<br/><br/>The Sheltering Sky (1949), which remains Bowles’s most celebrated work, describes the unraveling of a young, sophisticated, and adventuresome married couple as they make their way into the Sahara. In a prose style of meticulous calm and stunning visual precision, Bowles tracks Port and Kit Moresby on a journey through the desert that culminates in death and madness.<br/><br/>In Let It Come Down (1952), Bowles plots the doomed trajectory of Nelson Dyar, a New York bank teller who comes to Tangier in search of a different life and ends up giving in to his darkest impulses. Rich in descriptions of the corruption and decadence of the International Zone in the last days before Moroccan independence, Bowles’s second novel is an alternately comic and horrific account of a descent into nihilism.<br/><br/>The Spider’s House (1955), the longest and most complex of Bowles’s novels, is set against the end of French rule in Morocco. Its characters—ranging from a Moroccan boy gifted with spiritual healing power to an American writer who regrets the passing of traditional ways—are caught up in the clash between colonial and nationalist factions, and are forced to confront cultural gulfs widened by political violence.<br/><br/>Bowles—who once told an interviewer, “I’ve always wanted to get as far as possible from the place where I was born”—charts the collisions between “civilized” exiles and unfamiliar societies that they can never really grasp. In fiction of slowly gathering menace, he achieves effects of horror and dislocation with an elegantly spare style and understated wit.<br/><br/>LIBRARY OF AMERICA is an independent nonprofit cultural organization founded in 1979 to preserve our nation’s literary heritage by publishing, and keeping permanently in print, America’s best and most significant writing. The Library of America series includes more than 300 volumes to date, authoritative editions that average 1,000 pages in length, feature cloth covers, sewn bindings, and ribbon markers, and are printed on premium acid-free paper that will last for centuries.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/21/98/9781931082198.jpg', 'title_long': "Paul Bowles: The Sheltering Sky, Let It Come Down, The Spider's House (LOA #134) (Library of America Paul Bowles Edition)", 'dimensions': 'Height: 8.3 Inches, Length: 5.25 Inches, Weight: 1.25 Pounds, Width: 1.29 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.25}, 'width': {'unit': 'inches', 'value': 1.29}, 'weight': {'unit': 'pounds', 'value': 1.25}, 'height': {'unit': 'inches', 'value': 8.3}}, 'pages': 940, 'date_published': '2002-08-26', 'subjects': ['Literature & Fiction', 'Classics', 'Genre Fiction', 'Historical', 'Psychological', 'United States', 'Literary', 'Self Service', 'Custom Stores'], 'authors': ['Paul Bowles'], 'title': "Paul Bowles: The Sheltering Sky, Let It Come Down, The Spider's House (LOA #134) (Library of America Paul Bowles Edition)", 'isbn13': '9781931082198', 'msrp': '0.00', 'binding': 'Hardcover', 'isbn': '1931082197', 'isbn10': '1931082197'}}