{'book': {'publisher': 'Library of America', 'synopsis': '“Miller takes his rightful place in The Library of America with this volume.” —Library Journal (starred review)<br/><br/>In the inaugural volume of its collected edition of Miller’s plays, The Library of America gathers the works from the 1940s and 1950s that electrified theatergoers and established Miller as one of the indispensable voices of the postwar era. Among the plays included are All My Sons, the story of an industrialist confronted with his moral lapses during World War II; Death of a Salesman, the wrenching tragedy of Willy Loman’s demise; The Crucible, at once a riveting reconstruction of the Salem witch trials and a parable of McCarthyism; and A View from the Bridge, Miller’s tale of betrayal among Italian immigrants in Brooklyn, presented here in both the original one-act and revised two-act versions.<br/><br/>This volume also contains the intriguing early drama The Man Who Had All the Luck, the first of Miller’s plays to be produced on Broadway, along with his adaptation of Ibsen’s An Enemy of the People, the autobiographical one-act A Memory of Two Mondays, and Miller’s novella The Misfits, based on the screenplay he wrote for Marilyn Monroe.<br/><br/>LIBRARY OF AMERICA is an independent nonprofit cultural organization founded in 1979 to preserve our nation’s literary heritage by publishing, and keeping permanently in print, America’s best and most significant writing. The Library of America series includes more than 300 volumes to date, authoritative editions that average 1,000 pages in length, feature cloth covers, sewn bindings, and ribbon markers, and are printed on premium acid-free paper that will last for centuries.', 'language': 'en', 'image': 'https://images.isbndb.com/covers/29/14/9781931082914.jpg', 'title_long': 'Arthur Miller: Collected Plays Vol. 1 1944-1961 (LOA #163) (Library of America Arthur Miller Edition)', 'edition': 'First Edition', 'dimensions': 'Height: 8.11 Inches, Length: 5.12 Inches, Weight: 1.1 Pounds, Width: 1.02 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.12}, 'width': {'unit': 'inches', 'value': 1.02}, 'weight': {'unit': 'pounds', 'value': 1.1}, 'height': {'unit': 'inches', 'value': 8.11}}, 'pages': 774, 'date_published': '2006-02-02', 'subjects': ['Arts & Photography', 'Performing Arts', 'Theater', 'Literature & Fiction', 'Dramas & Plays', 'United States', 'Short Stories & Anthologies', 'Anthologies', 'Reference', 'Writing, Research & Publishing Guides', 'Writing', 'Self Service', 'Custom Stores'], 'authors': ['Arthur Miller'], 'title': 'Arthur Miller: Collected Plays Vol. 1 1944-1961 (LOA #163) (Library of America Arthur Miller Edition)', 'isbn13': '9781931082914', 'msrp': '0.00', 'binding': 'Hardcover', 'isbn': '193108291X', 'isbn10': '193108291X'}}