{'book': {'publisher': 'Advantage World Press', 'synopsis': "PUBLISHER'S NOTE: A NEW UPDATED 3RD EDITION IS AVAILABLE. SEARCH FOR ISBN: 193245070X From the Author: I know what it s like to have excessive credit card debt. In fact, I know the stresses of having $100,000 in debt. That s the main reason I wrote Zero Debt -- to give people in debt a message of hope: You can conquer your debt! And in many cases, you can do it much faster than you think. If you re drowning in debt, I urge you to pick up a copy of Zero Debt to learn how to quickly eliminate that debt and get on the road to financial freedom. Don t delay: start dumping your debt today! Book Description: Would you like to be free from financial worries, rest at night knowing your bills are paid, and have peace of mind when it comes to money matters? Then you need Zero Debt. In Zero Debt, you ll discover: * How to get annoying creditors off your back * Insider secrets to reduce interest rates or eliminate credit card late fees * Your legal rights and what bill collectors can and can not do under the law * The best strategies to clean up your credit report or fix errors in your credit file * How to make lifestyle changes that will save you money for decades to come! If you want to be debt-free and achieve financial freedom, you need an action plan to guide you. This book is your step-by-step plan. It s simple. It s easy to understand. And it works.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/07/50/9781932450750.jpg', 'title_long': 'Zero Debt: The Ultimate Guide to Financial Freedom (Zero Debt)', 'edition': 'First Edition', 'dimensions': 'Height: 9.01573 Inches, Length: 5.98424 Inches, Weight: 0.65 Pounds, Width: 0.4440936 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.98424}, 'width': {'unit': 'inches', 'value': 0.4440936}, 'weight': {'unit': 'pounds', 'value': 0.65}, 'height': {'unit': 'inches', 'value': 9.01573}}, 'pages': 204, 'date_published': '2004-08-01', 'subjects': ['Business & Money', 'Personal Finance', 'Credit Ratings & Repair'], 'authors': ['Lynnette Khalfani'], 'title': 'Zero Debt: The Ultimate Guide to Financial Freedom (Zero Debt)', 'isbn13': '9781932450750', 'msrp': 14.95, 'binding': 'Paperback', 'isbn': '1932450750', 'isbn10': '1932450750'}}