{'book': {'publisher': 'Smart Pop', 'synopsis': "In the fall of 2000, Gilmore Girls premiered on the WB and viewers were introduced to the quirky world of Stars Hollow and the Gilmores who had made it their home, mother-daughter best friends Lorelai and Rory Gilmore. With the show in its seventh season on the fledgling CW, Coffee at Luke's is the perfect look at what has made the show such a clever, beloved part of the television landscape for so long.<br/><br/>What are the risks of having your mother be your best friend? How is Gilmore Girls anti-family, at least in the traditional sense? What's a male viewer to do when he finds both mother and daughter attractive? And how is creator Amy Sherman-Palladino like Emily Gilmore? From the show's class consciousness to the way the characters are shaped by the books they read, the music they listen to and the movies they watch, Coffee at Luke's looks at the sometimes hilarious, sometimes heartbreaking underpinnings of smart viewer's Tuesday night television staple, and takes them further into Stars Hollow than they've ever been before.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/11/75/9781933771175.jpg', 'title_long': "Coffee at Luke's: An Unauthorized Gilmore Girls Gabfest (Smart Pop)", 'dimensions': 'Height: 9 inches, Length: 6 inches, Weight: 0.67461452172 Pounds, Width: 0.45 inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6}, 'width': {'unit': 'inches', 'value': 0.45}, 'weight': {'unit': 'pounds', 'value': 0.67461452172}, 'height': {'unit': 'inches', 'value': 9}}, 'pages': 197, 'date_published': '2007-04-10', 'subjects': ['Arts & Photography', 'Performing Arts', 'Humor & Entertainment', 'Radio', 'General Broadcasting', 'Television', 'History & Criticism', 'Literature & Fiction', 'Dramas & Plays', 'Comedy', 'Reference', 'Writing, Research & Publishing Guides', 'Writing'], 'authors': [], 'title': "Coffee at Luke's: An Unauthorized Gilmore Girls Gabfest (Smart Pop)", 'isbn13': '9781933771175', 'msrp': 17.95, 'binding': 'Paperback', 'related': {'ePub': '1935251155'}, 'isbn': '1933771178', 'isbn10': '1933771178', 'other_isbns': [{'isbn': '9781935251156', 'binding': 'print'}]}}