{'book': {'publisher': 'Livre de Poche', 'synopsis': "Product Description<br/><br/>« Alors, en début de soirée, ce 3 août 1962, vint la Mort, index sur la sonnette du 12305 Fifth Helena Drive. La Mort qui essuyait la sueur de son front avec sa casquette de base-ball. La Mort qui mastiquait vite, impatiente, un chewing-gum. Pas un bruit à l'intérieur. La Mort ne peut pas le laisser sur le pas de la porte, ce foutu paquet, il lui faut une signature. Elle n'entend que les vibrations ronronnantes de l'air conditionné. Ou bien... est-ce qu'elle entend une radio là ? La maison est de type espagnol, c'est une « hacienda » de plain-pied; murs en fausses briques, toiture en tuiles orange luisantes, fenètres aux stores tirés. On la croirait presque recouverte d'une poussière grise. Compacte et miniature comme une maison de poupée, rien de grandiose pour Brentwood. La Mort sonna à deux reprises, appuya fort la seconde. Cette fois, on ouvrit la porte.<br/>De la main de la Mort, j'acceptais ce cadeau. Je savais ce que c'était, je crois. Et de la part de qui c'était. En voyant le nom et l'adresse, j'ai ri et j'ai signé sans hésiter. »<br/><br/>About the Author<br/><br/>Née en 1938 à New York, auteur d'une cinquantaine de romans qui l'ont placée au premier rang des écrivains contemporains, Joyce Carol Oates enseigne la littérature à l'université de Princeton.", 'language': 'fr', 'image': 'https://images.isbndb.com/covers/28/59/9782253152859.jpg', 'title_long': 'Blonde (Ldp Litterature) (French Edition)', 'dimensions': 'Height: 7.00786 Inches, Length: 4.3307 Inches, Weight: 1.2 Pounds, Width: 1.77165 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.3307}, 'width': {'unit': 'inches', 'value': 1.77165}, 'weight': {'unit': 'pounds', 'value': 1.2}, 'height': {'unit': 'inches', 'value': 7.00786}}, 'pages': 1115, 'date_published': '2002-05-02', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Literary'], 'authors': ['Professor of Humanities Joyce Carol Oates'], 'title': 'Blonde (Ldp Litterature) (French Edition)', 'isbn13': '9782253152859', 'msrp': 31.95, 'binding': 'Pocket Book', 'isbn': '2253152854', 'isbn10': '2253152854'}}