{'book': {'publisher': 'Livre de Poche', 'synopsis': 'Product Description      Dès l’instant précis de sa conception, une nuit de 1951, la petite Ruby Lennox a commencé à voir, à comprendre, à sentir. En particulier, elle sait qu’on se serait bien passé d’elle…Et la voilà qui entreprend de nous raconter, avec une lucidité et un humour dévastateurs, son histoire, celle de ses parents, George et Bunty, petits boutiquiers d’York, de ses sœurs, de toute une famille anglaise moyenne – mais assurément pas ordinaire.Mieux encore : Ruby remonte dans le passé. Si bien qu’à l’Angleterre des années 1950 et 1960 se mêlent les images de tout le xxe siècle.Dès sa parution en Angleterre, ce premier roman de Kate Atkinson a été salué comme un chef-d’œuvre, pour la subtilité de sa construction et la verve irrésistible de son écriture. En France, la rédaction de Lire l’a élu meilleur livre de l’année.      About the Author      Dans les coulisses du musée, le premier roman de Kate Atkinson, avait été couronné du prix Whitbread (devenu aujourd’hui Costa Book of the Year). Ses quatre fameux romans autour du personnage de Jackson Brodie, l’ancien policier reconverti en détective, ont donné lieu à la série intitulée Case Histories diffusée sur la BBC, avec Jason Isaacs dans le rôle principal. Son roman Une vie après l’autre a été numéro un des ventes des deux côtés de l’Atlantique, et a remporté le Costa Novel Award et le South Bank Sky Art Literature Prize. Depuis 2011, Kate Atkinson est membre de l’Ordre de l’Empire britannique.\xa0', 'language': 'fr', 'image': 'https://images.isbndb.com/covers/49/08/9782253144908.jpg', 'title_long': 'Dans Les Coulisses Du Musee (Ldp Litterature) (French Edition)', 'dimensions': 'height: 178 mm, length: 110 mm, width: 17 mm, weight: 225 g', 'dimensions_structured': {'length': {'unit': 'mm', 'value': 110}, 'width': {'unit': 'mm', 'value': 17}, 'weight': {'unit': 'g', 'value': 225}, 'height': {'unit': 'mm', 'value': 178}}, 'pages': 416, 'date_published': '1998-09-01', 'subjects': ['Literature & Fiction', 'Contemporary', 'Genre Fiction'], 'authors': ['K Atkinson'], 'title': 'Dans Les Coulisses Du Musee (Ldp Litterature) (French Edition)', 'isbn13': '9782253144908', 'msrp': 20.95, 'binding': 'Pocket Book', 'isbn': '2253144908', 'isbn10': '2253144908'}}