{'book': {'publisher': 'Pygmalion', 'synopsis': 'Arriving one year after the Haitian-American\'s first novel (Breath, Eyes, Memory) alerted critics to her compelling voice, these 10 stories, some of which have appeared in small literary journals, confirm Danticat\'s reputation as a remarkably gifted writer. Examining the lives of ordinary Haitians, particularly those struggling to survive under the brutal Duvalier regime, Danticat illuminates the distance between people\'s desires and the stifling reality of their lives. A profound mix of Catholicism and voodoo spirituality informs the tales, bestowing a mythic importance on people described in the opening story, "Children of the Sea," as those "in this world whose names don\'t matter to anyone but themselves." The ceaseless grip of dictatorship often leads men to emotionally abandon their families, like the husband in "A Wall of Fire Rising," who dreams of escaping in a neighbor\'s hot-air balloon. The women exhibit more resilience, largely because of their insistence on finding meaning and solidarity through storytelling; but Danticat portrays these bonds with an honesty that shows that sisterhood, too, has its power plays. In the book\'s final piece, "Epilogue: Women Like Us," she writes: "Are there women who both cook and write? Kitchen poets, they call them. They slip phrases into their stew and wrap meaning around their pork before frying it. They make narrative dumplings and stuff their daughter\'s mouths so they say nothing more." The stories inform and enrich one another, as the female characters reveal a common ancestry and ties to the fictional Ville Rose. In addition to the power of Danticat\'s themes, the book is enhanced by an element of suspense (we\'re never certain, for example, if a rickety boat packed with refugees introduced in the first tale will reach the Florida coast). Spare, elegant and moving, these stories cohere into a superb collection', 'language': 'fr', 'image': 'https://images.isbndb.com/covers/48/26/9782857044826.jpg', 'title_long': 'Krik? Krak! (LITTERATURE) (French Edition)', 'edition': 'Advance Copy', 'dimensions': 'Height: 0.84645669205 Inches, Length: 0.5118110231 Inches, Weight: 1 Pounds, Width: 0.06692913379 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 0.5118110231}, 'width': {'unit': 'inches', 'value': 0.06692913379}, 'weight': {'unit': 'pounds', 'value': 1}, 'height': {'unit': 'inches', 'value': 0.84645669205}}, 'pages': 252, 'date_published': '1997', 'subjects': ['Subjects'], 'authors': ['Edwidge Danticat'], 'title': 'Krik? Krak! (LITTERATURE) (French Edition)', 'isbn13': '9782857044826', 'msrp': '0.00', 'binding': 'Paperback', 'isbn': '2857044828', 'isbn10': '2857044828'}}