{'book': {'publisher': 'Kodansha USA', 'synopsis': "Setting down his thoughts on swordplay, on winning, and on spirituality, legendary swordsman Miyamoto Musashi intended this modest work as a guide for his immediate disciples and future generations of samurai. He had little idea he was penning a masterpiece that would be eagerly devoured by people in all walks of life centuries after his death.<br/><br/>Along with The Art of War by Sun Tzu, The Book of Five Rings has long been regarded as an invaluable treatise on the strategy of winning. Musashi's timeless advice on defeating an adversary, throwing an opponent off-guard, creating confusion, and other techniques for overpowering an assailant was addressed to the readers of earlier times on the battlefield, and now serves the modern reader in the battle of life.<br/><br/>In this new rendering by the translator of Hagakure and The Unfettered Mind, William Scott Wilson adheres rigorously to the seventeenth-century Japanese text and clarifies points of ambiguity in earlier translations. In addition, he offers an extensive introduction and a translation of Musashi's rarely published The Way of Walking Alone. This gift-book edition also features original art by Musashi himself as well as new calligraphy by Japanese artist Shiro Tsujimura.", 'language': 'en', 'image': 'https://images.isbndb.com/covers/80/13/9784770028013.jpg', 'title_long': 'The Book of Five Rings (The Way of the Warrior Series)', 'edition': 'First Edition', 'dimensions': 'Height: 5.5 Inches, Length: 7.5 Inches, Weight: 0.70106999316 Pounds, Width: 0.8 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 7.5}, 'width': {'unit': 'inches', 'value': 0.8}, 'weight': {'unit': 'pounds', 'value': 0.70106999316}, 'height': {'unit': 'inches', 'value': 5.5}}, 'pages': 160, 'date_published': '2002-03-01', 'subjects': ['Engineering & Transportation', 'Engineering', 'Reference', 'Sports & Outdoors', 'Individual Sports', 'Martial Arts', 'Politics & Social Sciences', 'Philosophy', 'Eastern'], 'authors': ['Miyamoto Musashi'], 'title': 'The Book of Five Rings (The Way of the Warrior Series)', 'isbn13': '9784770028013', 'msrp': 19, 'binding': 'Hardcover', 'isbn': '4770028016', 'isbn10': '4770028016'}}