{'book': {'publisher': 'ALFAGUARA', 'synopsis': 'Los artículos más combativos de uno de nuestros autores capitales.<br/>«Escribo con tanta libertad que me sorprende que me dejen.»<br/>Este libro recoge los artículos publicados por Arturo Pérez-Reverte en la revista El Semanal desde finales del año 2001 hasta el 2005.<br/>«... Esta página no puede escribirse con bisturí. Carezco de talento para eso. Los ajustes de cuentas se hacen empalmando la chaira y acuchillando en corto, a lo que salga. En poco más de un folio, y con este panorama, uno pelea y apenas tiene tiempo de mirar a cuántos se la endiña. Sigue adelante, y que el diablo reconozca a los suyos. La justificación es que nadie me obliga, ni vivo de esto. Que podría firmar un libro cada dos años y observar la vida desde el escaparate de una librería. Pero ya ven. Unos domingos me divierto horrores, otros me desahogo, y otros digo en voz alta, o lo intento, lo que algunos no tienen medios para decir. Sin embargo, no es posible quedar bien con todos. Aquí no caben florituras ni sutilezas, si vas a lo que vas. Y menos en esta triste España, donde la gente sólo se da por aludida cuando le pateas los cojones. Pero mochar parejo trae daños colaterales. Víctimas inocentes. La justificación es que uno da la cara y se la juega sin red, sin Dios ni amo, en vez de llevárselo muerto por poner la foto y marear la perdiz, o por hacerle a los demagogos y mangantes que cortan el bacalao -o a quienes pretenden cortarlo- un francés con todas sus letras...»<br/>Arturo Pérez-Reverte', 'language': 'es', 'image': 'https://images.isbndb.com/covers/94/30/9788420469430.jpg', 'title_long': 'No me cogeréis vivo (2001-2005) (Spanish Edition)', 'edition': '005', 'dimensions': 'Height: 9.29132 Inches, Length: 6.02361 Inches, Weight: 1.8077905484 Pounds, Width: 1.37795 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 6.02361}, 'width': {'unit': 'inches', 'value': 1.37795}, 'weight': {'unit': 'pounds', 'value': 1.8077905484}, 'height': {'unit': 'inches', 'value': 9.29132}}, 'pages': 544, 'date_published': '2005-11-03', 'subjects': ['Literature & Fiction', 'History & Criticism', 'Movements & Periods', 'Regional & Cultural'], 'authors': ['Arturo Pérez-Reverte'], 'title': 'No me cogeréis vivo (2001-2005) (Spanish Edition)', 'isbn13': '9788420469430', 'msrp': 21.16, 'binding': 'Paperback', 'isbn': '8420469432', 'isbn10': '8420469432'}}