{'book': {'publisher': 'Ediciones Destino', 'synopsis': 'Product Description      Yann Martel, ganador del premio Booker con Vida de Pi, nos entrega esta novela sobre la amistad y la imaginación. Paul es un joven al que se le diagnostica la enfermedad del sida en estado terminal, su amigo y mentor en la universidad decide mantenerlo enganchado a la vida a través de la ficción. Cada día le contarán a Paul un capítulo de la familia Roccamatio de Helsinki en una suerte de novela en marcha en la que irán sucediéndose los acontecimientos más importantes del siglo XX. Un libro que apela a los sentimientos y al poder paliativo de la imaginación.      Book Description      Un libro emotivo e impactante, una defensa del poder de la imaginación. Por el autor de Vida de Pi.      About the Author      Yann Martel (1963) es canadiense pero, hijo de diplomáticos, nació en España y su infancia ha transcurrido en lugares como Francia, México o Alaska. Estudió filosofía en la Universidad de Trent y ha vivido en Irán, Turquía y la India. Su primera novela, Vida de Pi, fue galardonada con el prestigioso Booker Prize y recompensada por el favor de la crítica y de cientos de miles de lectores en todo el mundo. En la colección Áncora y Delfín de Destino ha aparecido también su novela breve La historia de la familia Roccamatio de Helsinki.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/86/65/9788423338665.jpg', 'title_long': 'La historia de la familia Roccamatio de Helsinki (Spanish Edition)', 'edition': 'Translation', 'dimensions': 'Height: 8.93699 Inches, Length: 5.70865 Inches, Weight: 0.62611282408 Pounds, Width: 0.5118110231 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.70865}, 'width': {'unit': 'inches', 'value': 0.5118110231}, 'weight': {'unit': 'pounds', 'value': 0.62611282408}, 'height': {'unit': 'inches', 'value': 8.93699}}, 'pages': 96, 'date_published': '2006-10-05', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Short Stories & Anthologies', 'Short Stories', 'Reference', 'Foreign Language Study & Reference'], 'authors': ['Yann Martel'], 'title': 'La historia de la familia Roccamatio de Helsinki (Spanish Edition)', 'isbn13': '9788423338665', 'msrp': 23.95, 'binding': 'Hardcover', 'isbn': '8423338665', 'isbn10': '8423338665'}}