{'book': {'publisher': 'LUMEN', 'synopsis': 'Product Description<br/><br/>Oskar Schell es un niño de nueve años muy especial, dotado de una aguda sensibilidad y de un talento versátil, que, tras perder a su padre aquel 11 de septiembre de 2001, encuentra entre los enseres del difunto un sobre con la palabra «Black» escrita en el dorso y una llave en su interior. Inmediatamente el pequeño decide que esa llave resolverá el misterio del último día de su padre, explicará por qué estaba en las torres, cuál fue el motivo de su muerte. Empieza así la peculiar e insólita odisea de Oskar por la herida ciudad de Nueva York en busca de todas las personas, lugares u objetos relacionados con el misterioso sobre. Al tiempo que el fantasma de su padre se dibuja en la telaraña de Manhattan, se iluminan también los orígenes de Oskar y la historia de sus abuelos, huidos de Dresde durante la Segunda Guerra Mundial.<br/><br/>En Tan fuerte, tan cerca Jonathan Safran Foer consigue convertir la tragedia en misterio, y al contar los secretos de un hombre cuenta la historia del siglo XX.<br/><br/>«La segunda novela de Jonathan Safran Foer es todo lo que uno esperaba que fuera: ambiciosa, pirotécnica, intrigante y extraordinariamente conmovedora. Un logro excepcional.»<br/>SALMAN RUSHDIE<br/><br/>La opinión del editor:<br/>Tras la celebrada Todo está iluminado, Jonathan Safran Foer lleva a cabo en su segunda novela la primera recreación literaria del atentado de las torres gemelas y supera incluso la hondura y la originalidad de su opera prima.<br/><br/>About the Author<br/><br/>Jonathan Safran Foer nació en 1977 en Washington. Actualmente vive en Nueva York. Ha publicado algunos cuentos en revistas y mereció el premio Zoetrope de relatos. Todo está iluminado fue su primera novela y en España vendimos alrededor de 12000 ejemplares.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/51/65/9788426415165.jpg', 'title_long': 'Tan fuerte, tan cerca (Spanish Edition)', 'edition': '001', 'dimensions': 'Height: 8.2677 Inches, Length: 5.70865 Inches, Weight: 1.56087281496 Pounds, Width: 1.22047 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.70865}, 'width': {'unit': 'inches', 'value': 1.22047}, 'weight': {'unit': 'pounds', 'value': 1.56087281496}, 'height': {'unit': 'inches', 'value': 8.2677}}, 'pages': 472, 'date_published': '2005-09-23', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Psychological', 'World Literature', 'United States', 'Mystery, Thriller & Suspense', 'Thrillers & Suspense', 'Psychological Thrillers'], 'authors': ['SAFRAN FOER,JONATHAN'], 'title': 'Tan fuerte, tan cerca (Spanish Edition)', 'isbn13': '9788426415165', 'msrp': 28.95, 'binding': 'Hardcover', 'isbn': '8426415164', 'isbn10': '8426415164'}}