{'book': {'publisher': 'Ediciones Sm', 'synopsis': 'Bicentenario del nacimiento de Lincoln.<br/>En una manana del frio invierno de 1861, Abraham Lincoln, presidente electo de unos Estados Unidos al borde de la desintegracion, baja del tren en Washington flanqueado por dos policias vestidos de civil y oculto el mismo bajo un disfraz, pues los rumores acerca de un complot para asesinarle no hacen mas que crecer. En los cuatro anos siguientes el hombre que ha prometido unir a una nacion dividida por la cuestion de la esclavitud sera victima de varios atentados contra su vida. Y mientras el general Lee lucha a las puertas de la capital, Lincoln vive aislado en la Casa Blanca, presidiendo un gobierno dividido, y tratado incluso por los correligionarios republicanos con desprecio.<br/>Gore Vidal nos muestra a Lincoln a traves de los ojos de sus amigos, sus enemigos, sus futuros asesinos, y el resultado es un retrato que es a la vez intimo y monumental, una novela que se ha convertido en todo un simbolo de los valores mas arraigados de la democracia y en un clasico de la novela historica moderna.<br/>El inicio de 2009 se abre con la toma de posesion de Obama y con los actos de conmemoracion del bicentenario de Lincoln, el artifice de las enmiendas de la Constitucion que conllevaron la abolicion de la esclavitud. Una lectura muy indicada para el momento en que vivimos.', 'language': 'es', 'image': 'https://images.isbndb.com/covers/69/91/9788448306991.jpg', 'title_long': 'Lincoln (Spanish Edition)', 'dimensions': 'Weight: 1.35 Pounds', 'dimensions_structured': {'weight': {'unit': 'pounds', 'value': 1.35}}, 'pages': 354, 'date_published': '2006', 'subjects': ['Biographies & Memoirs', 'Historical', 'United States', 'Leaders & Notable People', 'Military', 'Presidents & Heads of State', 'History', 'Americas', 'Europe', 'Politics & Social Sciences'], 'authors': ['Gore Vidal'], 'title': 'Lincoln (Spanish Edition)', 'isbn13': '9788448306991', 'msrp': 58.95, 'binding': 'Hardcover', 'isbn': '8448306996', 'isbn10': '8448306996'}}