{'book': {'publisher': 'Edicions Xerais de Galicia', 'synopsis': 'Product Description      <br/>O río da vida e da morte. Unha moza lavandeira que le nas marcas da auga a historia da súa xente. Despois da auga que fecunda a memoria, axiña aparecerá un fogo destrutor, as labaradas do odio... Así comeza Os libros arden mal, a agardada novela de Manuel Rivas que se desenvolve nun período que vai do 1881 deica os nosos días, entre o falecemento de George Borrow e o dun vello anarquista galego chamado Polca. Esta obra, como moitos dos personaxes que a habitan, podería levar tatuada na pel aquel sobre aviso que Luís Vives transmitiu a Erasmo: "Non se pode falar nin calar sen perigo". A protagonista principal é a linguaxe, as verbas que forman parte do corpo, a igual que os ósos, os ollos e os dedos. A loita entre as palabras feitas para dominar, e as palabras eivadas. Entre a linguaxe do poder autoritario e a linguaxe que sobrevive na penumbra. A linguaxe bélica e o latexo dionisíaco da fala popular. A linguaxe dogmática da relixión e a fala carnal e erótica do entroido. Unha obra que intenta pescudar, por un camiño interior, de intersticios, con sutileza e sen dogma, no inexplicábel histórico. A estrutura desta novela semella o dunha esfera armilar, composta por moi diferentes órbitas nas que os astros, ademais das vidas humanas, son os libros, as pertenzas, os animais, as plantas, e as palabras, elas mesmas a moverse como seres vivos. Unha esfera armilar tamén no entrelazar de xéneros, cunha órbita maior, a ficción narrativa a xeito de thriller, no que o caso central é a historia dramática da cultura, que contén en círculos concéntricos a poesía, o ensaio histórico, a crónica xornalística, formas de literatura popular como as novelas do Oeste. Unha esfera tamén que entrelaza multitude de voces, nunha escrita encarnizada, sempre en vilo, que vai e vén entre os territorios da dor e o gozo erótico.<br/>      About the Author      <br/>Manuel Rivas (A Coruña, 1957), escritor e xornalista. A súa obra, escrita en galego, está traducida a máis de trinta linguas e publicada polas máis prestixiosas editoras literarias do mundo. Como narrador ten publicado: Todo ben (1985); «Un millón de vacas» (1989), Premio da Crítica Española; «Os comedores de patacas» (1991); «En salvaxe compaña» (1994), Premio da Crítica Galicia; «Que me queres, amor?» (1996), Premio Torrente Ballester e Premio Nacional de Narrativa; «Bala perdida» (1996); «O lapis do carpinteiro» (1998), Premio da Crítica Española, Premio da Asociación de Escritores en Lingua Galega, Premio Arcebispo Xoán de San Clemente, Premio 50 aniversario da sección belga de Amnistía Internacional (2001); «Ela, maldita alma» (1999); «A man dos paíños» (2000); «As chamadas perdidas» (2002); «Contos de Nadal» (2003); «Os libros arden mal» (2006), novela, Premio Ánxel Casal ao Libro do Ano, Premio Irmandade do Libro ao Mellor Libro Galego do Ano, Premio da Crítica, Premio Mellor Libro do Ano Libreiros de Madrid, Premio da Crítica Galicia, Premio Losada Diéguez, Premio da Asociación de Escritores en Lingua Galega; «Todo é silencio» (2010), «As voces baixas» (2012), «O último día de Terranova» (2015) e «Vivir sen permiso e outras historias de Oeste» (2018). Tamén é autor dunha extensa obra xornalística e poética en lingua galega. É codirector da revista «Luzes».', 'language': 'gl', 'image': 'https://images.isbndb.com/covers/46/13/9788497824613.jpg', 'title_long': 'Os Libros Arden Mal (Edicion Literaria)', 'edition': 'Galician language (original)', 'dimensions': 'Height: 8.6614 Inches, Length: 5.9055 Inches, Weight: 2.37878780698 Pounds, Width: 2.16535 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 5.9055}, 'width': {'unit': 'inches', 'value': 2.16535}, 'weight': {'unit': 'pounds', 'value': 2.37878780698}, 'height': {'unit': 'inches', 'value': 8.6614}}, 'pages': 752, 'date_published': '2006-06-30', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Contemporary', 'Literary'], 'authors': ['Manuel Rivas'], 'title': 'Os Libros Arden Mal (Edicion Literaria)', 'isbn13': '9788497824613', 'msrp': '0.00', 'binding': 'Paperback', 'isbn': '849782461X', 'isbn10': '849782461X'}}