{'book': {'publisher': 'DEBOLSILLO', 'synopsis': 'Siempre hay tres versiones en cualquier historia: la propia, la del otro... y la verdad.<br/>Jojo Harvey es una agente literaria atractiva, triunfante y muy ambiciosa, en lo más alto de su carrera, enamorada de su trabajo... y de su jefe, con el que, por desgracia, se acaba de acostar. Un hombre excelente, con el único defecto de estar casado.<br/>Lily, la autora superventas de Jojo, ha tenido un éxito enorme con su primera novela. Con el adelanto de su segundo libro, Anton, su novio, y ella, compran la casa de sus sueños y tienen un bebé, pero entonces sucede lo impensable: la creatividad de Lily se seca. No puede escribir ni una palabra más. Y se acerca la fecha de entrega de su segunda novela.<br/>Gemma solía ser la mejor amiga de Lily, al menos hasta que esta le robó a Anton y su oportunidad de ser feliz. O eso piensa ella. Y para colmo, se encuentra de pronto en un hogar roto cuando sus padres se separan. La única forma que encuentra de desahogarse es escribir su propia historia y soñar con publicarla de la mano de Jojo.<br/>Pronto, las fortunas de estas tres mujeres se enredarán horriblemente, y cada una descubrirá que hay más de una versión en cada historia. Porque la vida y el amor son imprevisibles...<br/>«Una historia que te hará llorar... de risa». Daily Telegraph', 'language': 'es', 'image': 'https://images.isbndb.com/covers/67/36/9788497936736.jpg', 'title_long': '¿Quién te lo ha contado? (Spanish Edition)', 'edition': '001', 'dimensions': 'Height: 7.4803 Inches, Length: 4.92125 Inches, Weight: 0.992080179 Pounds, Width: 1.45669 Inches', 'dimensions_structured': {'length': {'unit': 'inches', 'value': 4.92125}, 'width': {'unit': 'inches', 'value': 1.45669}, 'weight': {'unit': 'pounds', 'value': 0.992080179}, 'height': {'unit': 'inches', 'value': 7.4803}}, 'pages': 656, 'date_published': '2005-06-10', 'subjects': ['Literature & Fiction', 'Genre Fiction', 'Urban Life', 'Family Life', 'Feel-Good', 'Mystery, Thriller & Suspense', 'Mystery', 'Romance', 'Contemporary', 'Romantic Suspense', 'Romantic Comedy'], 'authors': ['Marian Keyes'], 'title': '¿Quién te lo ha contado? (Spanish Edition)', 'isbn13': '9788497936736', 'msrp': 12.95, 'binding': 'Mass Market Paperback', 'isbn': '8497936736', 'isbn10': '8497936736'}}